{"name": "1-800-Therapist",
 "permalink": "1-800-therapist-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/1-800-therapist-llc",
 "homepage_url": "http://www.1800Therapist.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "1800Therapist",
 "category_code": "mobile",
 "number_of_employees": 20,
 "founded_year": 1979,
 "founded_month": 1,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ehealth, mental-health, affinity-800-number, tele-therapy, tele-adherence, find-a-doctor, find-a-therapist",
 "alias_list": null,
 "email_address": "don@1800Therapist.com",
 "phone_number": "5126274121",
 "description": "Mental Health Services",
 "created_at": "Tue Oct 27 16:26:04 UTC 2009",
 "updated_at": "Fri May 11 23:03:09 UTC 2012",
 "overview": "\u003Cp\u003ESince 1994, 1-800-Therapist has connected over one million prospective patients with behavioral health providers. 1-800-Therapist enables patients to easily find and speak with board-certified psychiatrists, psychologists and behavioral health therapists in their area.\u003C/p\u003E\n\n\u003Cp\u003E1-800-Therapist is a Member-only network that connects behavioral health care professionals with prospective patients ready to begin treatment, empowering providers to effectively convert phone calls into new patients.\n1-800-Therapist\u0026#8217;s Pay-Per-Conversation Advantage\u003C/p\u003E\n\n\u003Cp\u003E1-800-Therapist makes its Network Member’s telephone ring. Our Pay-Per-Conversation (PPC) advertising service is a ROI-centric solution enabling providers to speak with prospective patients seeking to schedule an appointment.\u003C/p\u003E\n\n\u003Cp\u003EWith our Pay-Per-Conversation service, 1-800-Therapist Network Members are able to speak with potential patients …before… being charged an advertising fee.\u003C/p\u003E\n\n\u003Cp\u003E1-800-Therapist’s PPC service is a cost-effective solution that produces measurable results, offering more control over advertising budgets.\nJoin the 1-800-Therapist Member Network\u003C/p\u003E\n\n\u003Cp\u003EBecome a Member of our growing Network of behavioral health providers and expand your practice today. To learn more about joining the 1-800-Therapist Member Network, please contact us at: membership@1800Therapist.com.\nMental Health Market\u003C/p\u003E\n\n\u003Cp\u003EA new national report from The Substance Abuse and Mental Health Services Administration (SAMHSA) reveals that 45.9 million American adults, or 1 in 5 people aged 18 or older, experienced mental illness in the past year. 11.4 million adults, or 5 percent of the adult population, and more than 5 million children and adolescents suffered from serious mental illness in the past year, making mental disorders overall more common than cancer, diabetes or heart disease.\u003C/p\u003E\n\n\u003Cp\u003EMajor depression, bipolar disorder, schizophrenia, and obsessive-compulsive disorder are among the 10 leading causes of disability in the US. Mental disorders account for nearly 25 million annual office visits to doctors and cost the United States nearly $150 billion each year in mental health services and lost productivity due to death or disability.\u003C/p\u003E\n\n\u003Cp\u003E1-800-Therapist is owned and operated by Patient Conversation Media, Inc. (PCMi)\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[128,
       128],
      "assets/images/resized/0008/5865/85865v6-max-150x150.jpg"],
     [[128,
       128],
      "assets/images/resized/0008/5865/85865v6-max-250x250.jpg"],
     [[128,
       128],
      "assets/images/resized/0008/5865/85865v6-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "43 Rainey Street",
    "address2": "3001",
    "zip_code": "78701",
    "city": "Austin",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}