{"name": "1800 PRINTING",
 "permalink": "1800-printing-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/1800-printing-inc",
 "homepage_url": "http://www.1800printingny.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "1800printingNY",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "printing",
 "alias_list": null,
 "email_address": "info@1800printingny.com",
 "phone_number": "212-945-8711",
 "description": "Commercial Printing ",
 "created_at": "Tue Aug 30 04:14:50 UTC 2011",
 "updated_at": "Fri Aug 17 06:16:50 UTC 2012",
 "overview": "\u003Cp\u003EALL YOU NEED TO KNOW ABOUT US AND MORE\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EWe are a wholesale online printing company located in New York. We offer quality, fast, affordable color printing products and services, including large format, offset and digital printing.\u003C/p\u003E\n\n\u003Cp\u003EWe can deliver printing services for club flyers, brochures, envelopes, CD covers, menu, booklet, invoices, NCR forms, catalogue, newspapers, tickets, door hangers, postcards, posters, presentation folders, rack cards, stickers, rounded corner business cards, color brochures, booklets, business cards, calendars, catalogs, door hangers, envelopes, flyers, greeting cards, letterheads, newsletters,t-shirt, labels, CD labels, and more.You can always check our products and services page for more details and pricing.\u003C/p\u003E\n\n\u003Cp\u003EWe also offer other related printing services such as large format printing; eg. vinyl banners, bunting, silkscreen printing, label, sticker, die cutting, embossing, foil stamping, graphic design support, and mailing services.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to consistently provide a superior printing experience to every customer. Our goal is to provide the best possible service, support, and quality printing of every job.\u003C/p\u003E\n\n\u003Cp\u003EWe are always happy to quote you our fantastic wholesale prices, so you can see how cost effective it can be to purchase from us.\u003C/p\u003E\n\n\u003Cp\u003EWe post our price lists on our web site, so you can quickly calculate how much you can save through our efficient processes. When you assign us for printing job, you can obtain both high quality and lower costs as well as leave your worries behind. Our high quality work and great service have earned us many satisfied repeat customers.\u003C/p\u003E\n\n\u003Cp\u003EIn the mean time, while you save with our fantastic wholesale prices, and receiving the highest quality printing works, you will also receiving the attention and timely responses that you deserve as our valued customer. I am sure you will enjoy our web site and information available. Please feel free to contact us if you need any further information or assistance.\u003C/p\u003E\n\n\u003Cp\u003EAdd this site to your favorites, so you can come back again for the latest update and promotion. More products are coming up for your greater saving.\u003C/p\u003E\n\n\u003Cp\u003ERushflyerprinting.com offers shipping in all 48 continental us states including Alabama, Alaska, Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Idaho State, Illinois, Indiana, Iowa, Kansas, Kentucky , Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Wyoming.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       140],
      "assets/images/resized/0018/5085/185085v2-max-150x150.png"],
     [[250,
       234],
      "assets/images/resized/0018/5085/185085v2-max-250x250.png"],
     [[450,
       422],
      "assets/images/resized/0018/5085/185085v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}