{"name": "1Lotus Marketing Research Services",
 "permalink": "1lotus-marketing-research-services",
 "crunchbase_url": "http://www.crunchbase.com/company/1lotus-marketing-research-services",
 "homepage_url": "http://www.1lotusresearch.com",
 "blog_url": "http://1lotusmarketresearch.blogspot.in/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "market-research-company, healthcare-research-company, technology-research-company",
 "alias_list": null,
 "email_address": "1lotusresearch@gmail.com",
 "phone_number": "+919833279397",
 "description": "Market Research Company",
 "created_at": "Fri Jun 01 14:14:32 UTC 2012",
 "updated_at": "Sat Jun 09 15:13:07 UTC 2012",
 "overview": "\u003Cp\u003E1Lotus Market Research is an independent market research fieldwork agency assisting Fieldwork partners and Clients with headquarters in Mumbai, India.\u003C/p\u003E\n\n\u003Cp\u003EOur Primary market research includes assignments which are ad hoc, tracking, syndicated work on any retail, consumer products, concepts, pharmaceutical products, biologics, medical devices and diagnostics (available with or without prescriptions across Asia pacific \u0026amp; Middle East Regions).\u003C/p\u003E\n\n\u003Cp\u003EIn numerous studies, we have tapped stakeholders responsible for strategic decision making with enterprises for their technology infrastructures, typically to state those were Technology decision makers, Information technology makers and managers of small, medium and large enterprises.\u003C/p\u003E\n\n\u003Cp\u003E1Lotus Research carries out research into healthcare, pharmaceutical and medical markets covering various segments, areas and target audiences. We conduct healthcare research fieldwork amongst patients, patient caretakers, physicians and other healthcare professionals, pharmacists, purchase decision makes (large, mid and small hospital, hospital/clinics ), managers and key opinion leaders(KOL). In order to provide high quality services in the field of healthcare research, we liaise and cooperate with medical professionals, advisors and apply strict ethical rules and data protection policies in fieldwork. \u003C/p\u003E\n\n\u003Cp\u003EFor software applications, web and proto types development companies, we blend the primary, secondary, usability, quantitative and qualitative research studies to leverage data collected in any particular project\u003C/p\u003E\n\n\u003Cp\u003E1Lotus research offers outbound and inbound CATI interviewing from India to English, Urdu, Arabic, China, Japan, French, German, Russian, and Spanish speaking markets.   The in-house CATI (computer aided telephone interview) team is enabled and staffed by experienced recruiters and interviewers who have worked in the industry for many years. Our strategic fieldwork attitude assists us in recruitments, fieldworks and for training of the bilingual agents. Constant training programs, briefing on the study topic, accuracy of the open end responses collected, ethical approaches, methods and strict quality controls, etc are the part of ongoing processes in CATI center.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0019/3457/193457v2-max-150x150.jpg"],
     [[189,
       85],
      "assets/images/resized/0019/3457/193457v2-max-250x250.jpg"],
     [[189,
       85],
      "assets/images/resized/0019/3457/193457v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Managing Director",
    "person":
     {"first_name": "Arvind",
      "last_name": "Pandit",
      "permalink": "arvind-pandit",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "1Lotus Research",
    "address1": "Flat No. 3, Anusaya Niwas, First Floor,",
    "address2": "P.P. Road, Andheri (East)",
    "zip_code": "400069",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}