{"name": "1StopESolution",
 "permalink": "1stopesolution",
 "crunchbase_url": "http://www.crunchbase.com/company/1stopesolution",
 "homepage_url": "http://www.1stopesolution.com",
 "blog_url": "http://www.1stopesolution.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "1stopesolution",
 "category_code": "software",
 "number_of_employees": 100,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "technical-support, pc-optimization",
 "alias_list": null,
 "email_address": "customersupport@1stopesolution.com",
 "phone_number": "18884589001",
 "description": "technical solutions, pc optimization",
 "created_at": "Mon Aug 27 06:39:59 UTC 2012",
 "updated_at": "Thu Aug 30 20:02:01 UTC 2012",
 "overview": "\u003Cp\u003E1Stopesolution is the name to remember for complete PC troubleshooting and optimization services through remote access facility. A group of Microsoft certified IT experts are at your service. We provide technical support and solution over phone/chat and email just 24 hours a day and throughout the year. Our hosts of services include data backup, operating system support, internet support, virus and malware removal support and everything related to PC trouble fixing. We have special affordable packages for home users and small business owners.\u003C/p\u003E\n\n\u003Cp\u003EPeople love to work with the PCs. It is really a great joy to work fast. But does this experience remain same always? No, just when there is a dire need of fast service from the PCs, those betray with snail pace! What is the solution then?\u003C/p\u003E\n\n\u003Cp\u003ESimple - 1Stopesolution is here to help people in such situation. The qualified engineers and technicians in tech support team are ever ready to resolve these issues with quick solutions. The PC tune up service would immediately be in effect to boost the speed of slow PCs.  The fast performance would make you forget what the situation was before!\u003C/p\u003E\n\n\u003Cp\u003ESometimes People forget that PCs can give them great worries if those are made ultimate source of data storage without proper security and backups! It is proven that internet or the World Wide Web is a great source of information and threats alike. Thousands of virus and malware are waiting to penetrate into computers if there is a little breach of security. And unfortunately it happens to PCs anytime. Without the knowledge of the users, the virus and spyware enter into the computers. Just after few days the user realizes that the stored information is under threat of being hacked! Here is 1Stopesolution to rescue people from these situations. Highly experienced engineers have sufficient knowledge to identify the threat issues and provide virus/malware/spyware removal service. They would even provide the customers with suggestions on future security measures to be taken care of.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0020/8261/208261v2-max-150x150.jpg"],
     [[245,
       43],
      "assets/images/resized/0020/8261/208261v2-max-250x250.jpg"],
     [[245,
       43],
      "assets/images/resized/0020/8261/208261v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "USA Office Address",
    "address1": "616 Corporate Way",
    "address2": "",
    "zip_code": "10989",
    "city": "Valley Cottage",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}