{"name": "22 Days Nutrition",
 "permalink": "22days-nutrition",
 "crunchbase_url": "http://www.crunchbase.com/company/22days-nutrition",
 "homepage_url": "http://www.22daysnutrition.com",
 "blog_url": "http://www.22daysnutrition.com/blog",
 "blog_feed_url": "",
 "twitter_username": "22daysnutrition",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 1990,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "22days-nutrition-bar",
 "alias_list": null,
 "email_address": "info@22daysnutrition.com",
 "phone_number": "1.800.822.9080",
 "description": "online fitness program",
 "created_at": "Tue Nov 23 11:35:24 UTC 2010",
 "updated_at": "Sat Dec 18 00:47:11 UTC 2010",
 "overview": "\u003Cp\u003EHow it Started\u003C/p\u003E\n\n\u003Cp\u003EAs a vegan, world -renowned exercise physiologist Marco Borges was always in search of the perfect nutrition for optimum wellness. He found that the options were limited to provide his clients with the types of foods they needed to perform at their best. Unwilling to settle for what was available on the market, Marco sought out Greens Plus to work with him to formulate nutrition-packed vegan options for people who are trying to transform their lives, bodies and habits.\u003C/p\u003E\n\n\u003Cp\u003ECreating the Optimum Nutrition\u003C/p\u003E\n\n\u003Cp\u003EAs part of an overall healthy diet, The 22 Days family of vegan and vegetarian products are low in sugar, and lightly sweetened with organic syrups and juices. Additionally, everything we create is free of trans fats, cholesterol, gluten, and soy. All are packed with organic, raw superfoods including hemp and rice protein to provide exceptional health benefits.\u003C/p\u003E\n\n\u003Cp\u003EInspiring Lasting Change\u003C/p\u003E\n\n\u003Cp\u003EPsychologists have discovered that it takes 21 days to make or break a habit. We applied this principal to helping people live a healthier, more energetic and productive life and created the 22Days Challenge. Our goal is to help everyone get to the 22nd Day- and achieve a major breakthrough. At 22Days, we are committed to providing the nutrition and the tools to help make a positive and healthy difference everyday- replacing hunger with a healthy habit.\u003C/p\u003E\n\n\u003Cp\u003EAccomplishing with Conscience\u003C/p\u003E\n\n\u003Cp\u003E22 Days nutritional products inspire through taste, attitude, and a global conscience. The belief is that foods made of the best ingredients should satisfy not only the body, but also the spirit. We believe that the right attitude and approach to healthy living can positively affect the world on a large scale.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "22Days Nutirition",
    "address1": "4552 SW 71 Ave Miami",
    "address2": "",
    "zip_code": "33155",
    "city": "Miami",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}