{"name": "249website.com",
 "permalink": "249website-com",
 "crunchbase_url": "http://www.crunchbase.com/company/249website-com",
 "homepage_url": "http://www.249website.com",
 "blog_url": "http://www.249website.com",
 "blog_feed_url": "http://www.249website.com",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 5,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "249website, 249website-com",
 "alias_list": null,
 "email_address": "info@249website.com",
 "phone_number": "3232106893",
 "description": "We  are an team of highly trained web de",
 "created_at": "Thu Aug 23 00:07:46 UTC 2012",
 "updated_at": "Thu Aug 23 18:31:48 UTC 2012",
 "overview": "\u003Cp\u003EWe  are an team of highly trained web designers and developers with over 10 years of professional experience in all areas of internet technology. At 249, we provide the proper \u0026#8220;look and function\u0026#8221; to your site that will help you get to the next level and beyond in your effort to conquer your chosen market. \u003C/p\u003E\n\n\u003Cp\u003EAll businesses, from pizza parlors to multi-national corporations have benefited from our very affordable and efficient approach. Our expertise enables them to navigate this highly technical landscape.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to provide you with a marketing tool that is not only attractive but also one that will keep pace with the ever changing demands of the \u0026#8220;search engine\u0026#8221; society. Should you require it, we will include at a very nominal fee, domain registration, hosting, branding, marketing and search engine optimization (SEO). Extra services such as these would normally cost additional hundreds and thousands from other vendors. \u003C/p\u003E\n\n\u003Cp\u003EOn this website you can see a portfolio of work we have done for our clients. Review our portfolio. We have extensive experience with a diverse and demanding client base, including eCommerce, flash, Joomla, Wordpress, Drupal websites etc. for various small and large businesses like law firms, entertainment companies, retailers, healthcare providers, food service companies, not for profit organizations, photographers, financial institutions, just to name a few. A range of work depicted in our portfolio includes work from our earlier years to our most recent successful projects.\u003C/p\u003E\n\n\u003Cp\u003EAs a well-established website design firm we are very excited to work on your website. 249website consists of a team of highly trained web masters with over 10 years of professional experience in almost all areas of website design; including project management and website development. Our services exceed that of all web design company in the industry and we aim to provide a huge range of website solutions to meet your website requirements.\u003C/p\u003E\n\n\u003Cp\u003E249website have been in operation since early 2001, and have continued to provide high-quality websites to hundreds of customers over the last 10 years.\u003C/p\u003E\n\n\u003Cp\u003EYour decision to visit our website was a good one.\u003C/p\u003E\n\n\u003Cp\u003EYour decision to take the next step and give us a try, will be great one for us both.\u003C/p\u003E\n\n\u003Cp\u003EWe are so confident about our web design skills that we offer to design your home page absolutely free without any advance payments. Design of homepage provided will be a custom design depending on the answers provided to our questionnaire. \u003C/p\u003E\n\n\u003Cp\u003EOnce you like this homepage design than only you have to pay us the deposit so we can work further. If you would like any changes done to the design, we will alter it accordingly until you have exactly what you are looking for. After you are happy we can then discuss finalizing the project and preparing your live website.\u003C/p\u003E\n\n\u003Cp\u003EOur years of experience has allowed us to keep up with the ever changing technologies of search engines so we can ensure that all of our websites are completely search engine friendly from day one. Our aim is not to simply provide an attractive website for your potential clients but also we aim to build websites that are going to benefit you. To make sure we are providing you with the best website design service around, we even include domain registration, hosting, branding, marketing and search engine optimization - extra services that could cost you thousands from external vendors.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}