{"name": "48 Hour Masters",
 "permalink": "48-hour-masters",
 "crunchbase_url": "http://www.crunchbase.com/company/48-hour-masters",
 "homepage_url": "http://48hourmasters.com",
 "blog_url": "http://48hourmasters.com/blog/",
 "blog_feed_url": "http://48hourmasters.com/blog/feed",
 "twitter_username": "48hourmasters",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 5,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cd-mastering-service, audio-mastering-service, online-mastering-service, cd-mastering, audio-mastering",
 "alias_list": null,
 "email_address": "48hourmasters@gmail.com",
 "phone_number": "",
 "description": "Professional CD Mastering",
 "created_at": "Mon Jan 24 18:19:03 UTC 2011",
 "updated_at": "Wed Feb 02 22:36:21 UTC 2011",
 "overview": "\u003Cp\u003E48 Hour Masters is an Online Mastering Studio For Independent Artists On A Budget.\u003C/p\u003E\n\n\u003Cp\u003EWhat is CD Mastering?\nMastering is the final step in the recording, mixing process.  It is where all the music files are checked for errors and the album is prepared for distribution. CD mastering preparation can include a number of things, but usually involves some sort of additional processing (or adding sweet spots) in order to produce  music to have more sparkle and clarity. \u003C/p\u003E\n\n\u003Cp\u003EThere are several personal tricks used by various audio mastering engineers which in part contributes to some of the mystery surrounding mastering. Processing is almost always done on the final mixes, not individual tracks. An example of said processing would be running a song through a powerful and transparent equalizer in order to properly balance the track. Audio Engineers often times, do additional compression and limiting to the final mixes in order to give them a more \u0026#8220;commercial\u0026#8221; sound. \u003C/p\u003E\n\n\u003Cp\u003EIn addition to this, more mundane tasks such as properly sequencing the album orders, crossfade editing, adding ISRC code and PQ coding takes place.\u003C/p\u003E\n\n\u003Cp\u003EThis is what 48 Hour Masters does in a nutshell.\u003C/p\u003E\n\n\u003Cp\u003EAs well 48HM has priced itself so all start up independent artists can afford to have their music mastered. For their own use to give to friends and family, or to distribute online and or radio play. \u003C/p\u003E\n\n\u003Cp\u003EHow Do I Get a Song Mastered?\u003C/p\u003E\n\n\u003Cp\u003E48HM has made the process simple. Simply choose the mastering service you need. Either one song or a 10 song album. Make payment by Paypal or credit card.\u003C/p\u003E\n\n\u003Cp\u003EYou are then redirected to a dropbox that you upload the final mixed files you want mastered. The dropbox is free to use. \u003C/p\u003E\n\n\u003Cp\u003E48HM then masters the file and send them back to you via  a download link or a CD sent in the mail. Whichever you prefer.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       74],
      "assets/images/resized/0011/8778/118778v2-max-150x150.jpg"],
     [[250,
       123],
      "assets/images/resized/0011/8778/118778v2-max-250x250.jpg"],
     [[450,
       221],
      "assets/images/resized/0011/8778/118778v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}