{"name": "5rooms.com",
 "permalink": "5rooms-com",
 "crunchbase_url": "http://www.crunchbase.com/company/5rooms-com",
 "homepage_url": "http://www.5rooms.com/",
 "blog_url": "http://theroommate.5rooms.com/",
 "blog_feed_url": "",
 "twitter_username": "5roomsdotcom",
 "category_code": "ecommerce",
 "number_of_employees": 35,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "living, furniture, homeware, accessories, appliances, decor, online-store, free-delivery, brands, office, garden",
 "alias_list": null,
 "email_address": "care@5rooms.com",
 "phone_number": "021 200 7621",
 "description": "Online home \u0026 living store",
 "created_at": "Fri Apr 20 14:33:00 UTC 2012",
 "updated_at": "Mon Jun 17 04:07:57 UTC 2013",
 "overview": "\u003Cp\u003EMeet the 5rooms.com founders: Sean Weldon – a local furniture maven; Emilian Popa – a global entrepreneur who co-founded Groupon South Africa back in 2010; Nireshni Naidoo – a South African e-commerce veteran; and Tiffany Hopkins – a business intelligence expert.\u003C/p\u003E\n\n\u003Cp\u003EThese passionate home and living aficionados saw a gap in the market, envisioning a way for local suppliers to expand their footprint and for international players to explore one of Africa’s fastest growing markets, while bringing South Africans safe, easy and affordable shopping for everything from office furniture to home décor.\u003C/p\u003E\n\n\u003Cp\u003E5rooms.com strives to provide a world-class online shopping experience when buying homeware and furniture online. They offer their customers 24 hour access to an ever-increasing range of popular designs and hard to get brands; a huge array of products including furniture, homeware, lighting, accessories, appliances and home décor for house, garden and kids, as well as office furniture; full product listings with all the information needed to make informed buying decisions (each item includes high-quality photographs and detailed descriptions); professional and personal customer service; secure payment facilities; and free delivery to anywhere in the country; plus flexible return and exchange options. 5rooms provide B2B (business to business) and B2C (Business to customer) sales with an inventory and also controlled market models. Products are either stored locally in the warehouse or sourced from suppliers.\u003C/p\u003E\n\n\u003Cp\u003E5rooms.com is part of a network comprising more than ten home and living sites, including Home24.de, Zanui.com.au and Mebelrama.ru. It aims to have the most complete offering in South Africa, while ensuring the cutting edge in design and prices friendly to any budget. Even though 5rooms.com only went live last month, the site is already seeing an overwhelmingly positive response from suppliers and shoppers alike. This encouraging feedback has set the team on fire – the company plans to grow from their current collection of 1,300 products to 10,000 by spring! There are 48 brands on board to date, representing the entire spectrum from major international manufacturers to independent local design houses, with more signups daily.\u003C/p\u003E\n\n\u003Cp\u003EThe South African market doesn’t promise to be easy, but 5rooms.com is confident in providing the world-class online shopping experience it stands for.\u003C/p\u003E\n\n\u003Cp\u003EAfter a management buyout in August 2012, Africa Internet Accelerator was founded in partnership with Naspers / MIH in November 2012\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0018/5214/185214v4-max-150x150.png"],
     [[174,
       57],
      "assets/images/resized/0018/5214/185214v4-max-250x250.png"],
     [[174,
       57],
      "assets/images/resized/0018/5214/185214v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Online Marketing",
    "person":
     {"first_name": "Alvaro",
      "last_name": "Burgos",
      "permalink": "alvaro-burgos",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "263 Victoria Rd, Rex Trueform Office Park, Salt River",
    "address2": "",
    "zip_code": "7925",
    "city": "Cape Town",
    "state_code": null,
    "country_code": "ZAF",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}