{"name": "A:kdia, Inc",
 "permalink": "a-kdia-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/a-kdia-inc",
 "homepage_url": "http://akdia.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "",
 "phone_number": "801.787.5765",
 "description": "",
 "created_at": "Wed Jul 11 19:12:10 UTC 2012",
 "updated_at": "Fri Jun 14 06:55:52 UTC 2013",
 "overview": "\u003Cp\u003EA:kdia takes an inside out approach to branding and marketing. We don’t just try to push a product or service we push the company by creating internet strategies that help your current customers and grow your consumer base. Your company has a lot of individual hairs and when those hairs are tangled with the other hairs all you get is one giant hair ball. Our job, goal and focus is to orbit that hair ball (your company) and avoid getting tangled in it so we can see what your company really needs.\u003C/p\u003E\n\n\u003Cp\u003ENow, we are creative and we wished that we could take credit for the concept of, Orbiting the Giant Hair Ball but we can’t. This is a phenomenal book written by MacKenzie Gordon. We strongly recommend you read this book, absolutely fascinating and will help you when doing your marketing.\u003C/p\u003E\n\n\u003Cp\u003EThis book is a must read and will influence the rest of your life, if you follow it. This book will help prevent you from making some serious mistakes.\u003C/p\u003E\n\n\u003Cp\u003EOrbiting the giant hair ball is extremely important so that you can influence and make sure that the hair ball (company) continues to grow but in an organized fashion. We know this is a serious oxymoron, hair ball and organization, but it’s true. We want to work with you and provide direction and purpose.\u003C/p\u003E\n\n\u003Cp\u003EWe have simplified what is seriously a complex issue down to five step\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Brand Interrogator",
    "person":
     {"first_name": "Tony",
      "last_name": "R.",
      "permalink": "tony-r",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}