{"name": "A \u0026 L Plumbing",
 "permalink": "a-l-plumbing",
 "crunchbase_url": "http://www.crunchbase.com/company/a-l-plumbing",
 "homepage_url": "http://www.alplomberie.com/default_en.aspx",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "alplomberie",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "plumbing-company, urgence-plomberie, urgence-plombier, dbouchage-got, plomberie, plomberie-montral, plomberie-laval, rnovation-plomberie",
 "alias_list": null,
 "email_address": "n.beauchamp@alplomberie.com",
 "phone_number": "450-663-7403 or 450-663-7407",
 "description": "24/7 Emergency Service Plumbing Company",
 "created_at": "Fri Dec 07 16:50:52 UTC 2012",
 "updated_at": "Wed Apr 10 16:39:59 UTC 2013",
 "overview": "\u003Cp\u003EA \u0026amp; L Plumbing Inc, a plumbing company that provides emergency service and offers customers plumbing service for new construction and plumbing renovation services, in both Montreal and Laval. How likely does this sound? Well it is true! \u003C/p\u003E\n\n\u003Cp\u003EA \u0026amp; L Plumbing Inc. is a family plumbing company at your service, working in residential, commercial and industrial plumbing for over 30 years. \u003C/p\u003E\n\n\u003Cp\u003EDo you have a plumbing project in Laval? Our plumbing company has offices located there. Do you have a need for plumbing renovations in your Montreal home or business? We will go there too. Whatever and wherever your plumbing needs are in greater Montreal or Laval, our plumbing company can help. \u003C/p\u003E\n\n\u003Cp\u003EWould you like to start renovating your bathroom or maybe you plan to replace and upgrade the plumbing in your house? Whether it is a plumbing renovation project in Laval, a big or small plumbing job in Montreal, our team will be there to assist you. If something unexpected should happen to your plumbing, we have an emergency service 24 hours 7 days a week. \u003C/p\u003E\n\n\u003Cp\u003ERegardless of the type of plumbing project, the size of the project or your location we provide complete plumbing services in Laval and throughout Montreal. Feel free to contact us for more information about our services. Our plumbing company offers a wide variety of services from unblocking drains to dealing with frozen pipes. A \u0026amp; L Plumbing is a plumbing company with services that are sure to meet or exceed your expectations in both Laval and Montel.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main office",
    "address1": "1887 Lavoie ",
    "address2": "",
    "zip_code": "H7M 2N4",
    "city": "Laval, Quebec",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}