{"name": "A-One Innovation Technologies Pvt. Ltd.",
 "permalink": "a-one-innovation-technologies-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/a-one-innovation-technologies-pvt-ltd",
 "homepage_url": "http://aoneinnovation.com",
 "blog_url": "http://www.aoneinnovation.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2004,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "info@aoneinnovation.com",
 "phone_number": "91-141-5170277",
 "description": "",
 "created_at": "Wed Sep 05 10:48:15 UTC 2012",
 "updated_at": "Fri Jun 14 04:46:23 UTC 2013",
 "overview": "\u003Cp\u003EA-One Innovation Technologies is a web development company. Please allow us to enumerate the reasons why you should choose our company for your web development needs:\u003C/p\u003E\n\n\u003Cp\u003EFirst, A-One Innovation Technologies started out small and expanded as the years went by. The company was founded in 2004 by Mr. Akshay Agarwal. He is the fountain of information and the reason why the company has proven to be such a success. He has almost five years of total experience in web development, graphic design and search engine marketing services and activities.\u003C/p\u003E\n\n\u003Cp\u003ESecond, the company itself is dedicated to business success by establishing long-term relationships with our staff, as well as our clients. For our staff, what we do as a company is train them on the basic foundation of web development principles which they already have. Then, we all learn together through our brainstorming sessions so that we will learn what works and what does not. We also employ the latest that web development technology has to offer. This way, we can make sure that we are only providing the best people to develop our clients\u0026#8217; websites for AITPL. For our clients, we do not want them to think of their relationship with AITPL as a one-time deal. Over the years, our clients can attest to the fact that we are a dynamic, service oriented company focused on one thing only: to provide the best web development services that any company can offer. Find out what our clients have to say in our Testimonials page. From there, you will see that AITPL clients have learned to adapt a \u0026#8220;setting and forgetting\u0026#8221; attitude. Here, all that they have to do is give us the requirements, tell us what they need and when they need it, and after that – they can forget about the project and let us work on the background. With deadlines met and client satisfaction rates soaring, there is no better company to trust your web development services with than A-One Innovation Technologies.\u003C/p\u003E\n\n\u003Cp\u003EA-One Innovation Technologies use a wide range of software-based web development solutions, as well as technology based web development solutions. Whether you are a finance, advertising, accounts, manufacturing, warehouse management, travel and leisure, corporate or stocks company – we have the best web development solutions that will best suit your needs as a company. From the planning stage, to the analyzing, website design, design implementation, up to the results analysis and improvement stage – we are with you in every step of the way. Aside from the expertise that you will benefit from, we also help out with the tasks before, during and after the website is launched. As you can see, these are all the reasons why we have a long-term working relationship with all of our clients – professionalism, quality of work and polite and friendly staff who are experts in the field.\u003C/p\u003E\n\n\u003Cp\u003ECurrently, there are over forty employees working on our turf, and we are still in the process of growing and establishing our roots as the premier web development services company in India. Come and see why A-One Innovation Technologies is different. Experience for yourself why AITPL is the smart entrepreneur\u0026#8217;s choice. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0027/5077/275077v1-max-150x150.png"],
     [[245,
       77],
      "assets/images/resized/0027/5077/275077v1-max-250x250.png"],
     [[245,
       77],
      "assets/images/resized/0027/5077/275077v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "SEO \u0026 Web development company",
    "person":
     {"first_name": "Ms. Bhavna",
      "last_name": "Benival",
      "permalink": "ms-bhavna-benival",
      "image":
       {"available_sizes":
         [[[150,
            47],
           "assets/images/resized/0020/9776/209776v2-max-150x150.jpg"],
          [[248,
            79],
           "assets/images/resized/0020/9776/209776v2-max-250x250.jpg"],
          [[248,
            79],
           "assets/images/resized/0020/9776/209776v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Web Design Company",
    "address1": "B 92 Nehru Nagar Near Jain Temple",
    "address2": "",
    "zip_code": "302016",
    "city": "jaipur",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null},
   {"description": "Web Design Company",
    "address1": "B 92 Nehru Nagar Near Jain Temple",
    "address2": "",
    "zip_code": "302016",
    "city": "jaipur",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        113],
       "assets/images/resized/0027/5078/275078v1-max-150x150.png"],
      [[250,
        188],
       "assets/images/resized/0027/5078/275078v1-max-250x250.png"],
      [[450,
        340],
       "assets/images/resized/0027/5078/275078v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}