{"name": "A V Weldtech",
 "permalink": "a-v-weldtech",
 "crunchbase_url": "http://www.crunchbase.com/company/a-v-weldtech",
 "homepage_url": "http://www.indiamart.com/avweldtech/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "saw-flux, agglomerated-saw-flux, agglomerated-flux",
 "alias_list": null,
 "email_address": "avweldtech@tradepassport.org",
 "phone_number": "9422808983",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 09:42:12 UTC 2013",
 "updated_at": "Fri Apr 05 09:42:16 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2011, at Nagpur, Maharashtra, India, we, “A V Weldtech Pvt Ltd,” are engaged in manufacturing and supplying a wide range of Submerged Arc Welding Flux and Submerged Arc Welding Wire.\u003C/p\u003E\n\n\u003Cp\u003EOur Products :\n In this range we offer Saw Flux, Agglomerated Saw Flux, Agglomerated Flux, Agglomerated Submerged Arc Welding Flux, Saw Wire and Copper Coated Saw Wire.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a team of capable and experienced professionals associated with our organization, which makes sure of providing to our valuable customers, a wide range of supreme-quality Industrial Mineral. This team is headed by the mentors of our organization.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nOur organization is instrumental in maintaining the best quality standards in the range of Industrial Mineral being offered to our esteemed patrons. The company targets to achieve a sustainable position and reputation in providing to our clients, the best-in-class minerals manufactured from the finest of the components procured from some of the well-known vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have an advanced infrastructure over a vast area comprising of a fully integrated manufacturing unit. Latest technology is employed for the manufacturing the best-in-class products in order to serve our clientele in the most satisfactory manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Customers:\nTo attain maximum level of customer satisfaction, we are instrumental in providing an exclusive range of Submerged Arc Welding Flux and Submerged Arc Welding Wire to them. Our efficient team of professionals is highly aware of our customers needs and demands. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       102],
      "assets/images/resized/0024/8496/248496v2-max-150x150.jpg"],
     [[250,
       171],
      "assets/images/resized/0024/8496/248496v2-max-250x250.jpg"],
     [[350,
       240],
      "assets/images/resized/0024/8496/248496v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}