{"name": "A1 Corporation",
 "permalink": "a1-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/a1-corporation",
 "homepage_url": "http://www.indiamart.com/a1-corporation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "binding-machines, id-card-machines--paper-cutting-machines-",
 "alias_list": null,
 "email_address": "a1-corporation@tradepassport.org",
 "phone_number": "9916195959",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 05:32:22 UTC 2013",
 "updated_at": "Fri Apr 05 05:32:24 UTC 2013",
 "overview": "\u003Cp\u003EA 1 Corporation was established in 1989 on partnership basis at Bengaluru in Karnataka (India). Our company has become one of the prominent names among the leading companies in field of trading, supplying, importing and distributing of Lamination Machines, Binding Machines, ID Card Machines \u0026amp; Paper Cutting Machines. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\ntrading, supplying, importing and distributing of Lamination Machines, Binding Machines, ID Card Machines \u0026amp; Paper Cutting Machines. \u003C/p\u003E\n\n\u003Cp\u003Eendor Base:\nWe have associated with noted vendors who are reliable and hold good reputation in the market. They provide us the best quality products with excellent features at industrial leading prices. Our company has developed such cordial relationships with our vendors that we work as a team without giving any opportunity of complaint to each other. \u003C/p\u003E\n\n\u003Cp\u003EOur Team;\nOur company is working efficiently owing to our highly dedicated and diligent team of technicians and professionals. We take utmost care to select team members, making sure to select only qualified, experienced, efficient and dedicated ones. To carry out various business activities smoothly and efficiently, we have developed cordial relation among team members.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe procure best quality material from reliable resources to develop our range of products. Best quality maintenance is the forte of our company. We follow various advanced techniques in order to test the quality of products offered. A team of experienced and skillful experts has been appointed for quality analysis of all products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nFor company’s fast growth and success, we keep client-satisfaction on our priority list. We offer a wide range of products with quality assurance, prompt delivery along with easy modes of payment. We have carved a special niche among our clients due to superior quality products at industrial leading prices. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8263/248263v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8263/248263v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8263/248263v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}