{"name": "Aaron Bouren",
 "permalink": "aaron-bouren",
 "crunchbase_url": "http://www.crunchbase.com/company/aaron-bouren",
 "homepage_url": "http://www.aaronbouren.com/",
 "blog_url": "http://aaronbouren.blog.com/",
 "blog_feed_url": "",
 "twitter_username": "Aaronbouren",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 10,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "aaron-bouren",
 "alias_list": null,
 "email_address": "aaron_bouren@yahoo.com",
 "phone_number": "5122936350",
 "description": "",
 "created_at": "Thu Nov 08 06:28:38 UTC 2012",
 "updated_at": "Thu Nov 08 22:39:15 UTC 2012",
 "overview": "\u003Cp\u003EThe First Hour of the Day: What Do Successful People Do?\u003C/p\u003E\n\n\u003Cp\u003EThe first hour of each day is very important. There are a lot of people who are not aware of how much the first hour means. This one hour can be exactly what you need to complete a task or give your undivided attention to something. Aaron Bouren thinks this one hour is the time that you look at work from a human perspective instead of task list or to-do list.\u003C/p\u003E\n\n\u003Cp\u003EA lot of people remember home room in high school when they had a chance to get themselves together and plan their day.  During this little bit of time, you were able to catch up with your friends, finish homework and think about the remainder of the day.  Many people still have a “home room” setting in their schedule where they take the time to get ready for the day, and it’s not such a bad idea. Read on Aaron Bouren’s review and you will discover below what these famous people do as their daily tasks list’s first items.\nNO Email Check\nA lot of successful people are busy and can’t find enough time in a day to get everything done.  The founder of Tumblr, David Karp believes that you should try hard to keep from checking your email.  He also believes that if there is something that is truly urgent, you will receive a call or even a text.\nSince everyone in the work field is not able to report to work when they are ready, things can be a little different.  For the people who are not on-call every minute of the day, they are able to trade emails and several other things. Never check email in the morning at you first working hour. Many people believe that it’s an awesome strategy that can be used on a daily basis.\nIf you happen to be waiting on a particular message from someone, you can use a program called AwayFind.  This program will be able to monitor your inbox and notify you when the mail has arrived.  This is a great program to use to train your co-workers and others to help them understand that your off-hours are your time.\nBe Aware\nA lot of people are wondering what successful people do to get their day started.  Aaron Bouren, a self-help guru had the answer to this question long before we slept with our computers right by our side.  There are quite a few 1-hour rituals that he suggests that people should try.\nIn this instance, there are three rituals that you can begin with.  These rituals include the “Hour of Power”, “30 Minutes to Thrive”, and “15 Minutes to Fulfillment.”  As you may have guessed, there is a little bit of exercise involved, but it’s nothing major.  Another part of this method is being grateful for all of the things that you have, such as friends, family, your career, and yourself.\nComplete the Major Tasks First\nIf you have a major task that needs to be completed, get it done and out of the way.  This is one great way to get the big task completed and off of your mind.  Brian Tracy has a time-management book that’s entitled: Eat That Frog.  This title was derived from Mark Twain saying that stated, once you eat the frog, you have the rest of the day ahead of you and things don’t seem too bad.\nChoosing Your Frog\nWhen you choose your frog, choose it wisely.  Aaron Bouren recommends that once you have chosen your frog, make sure that you write it down on a sticky note and place it somewhere you will be able to see it, when you return to your office in the morning, you will be able to get a good start and pick up where you left off.\nThe best thing about getting the biggest task completed is that the weight will be lifted from your shoulders and that will be one more tasks that you have completed under your belt.  When you complete the biggest task, you will be motivated to complete other tasks and you will be able to conquer smaller tasks quicker.\nWhat Do You Want to Do?\nA lot of people realize that they have made a mistake in their career field.  This is better realized sooner than later, but things don’t always turn out this way.  Some people don’t realize their mistake until several years later when they have been in the field for a while.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       72],
      "assets/images/resized/0021/9351/219351v2-max-150x150.jpg"],
     [[250,
       120],
      "assets/images/resized/0021/9351/219351v2-max-250x250.jpg"],
     [[450,
       216],
      "assets/images/resized/0021/9351/219351v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}