{"name": "Abhay Products",
 "permalink": "abhay-products",
 "crunchbase_url": "http://www.crunchbase.com/company/abhay-products",
 "homepage_url": "http://www.indiamart.com/abhayproducts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "storage-rack, display-board, industrial-conveyor, industrial-trolley, furniture-chair--",
 "alias_list": null,
 "email_address": "abhayproducts@tradepassport.org",
 "phone_number": "9822018332",
 "description": "Manufacturing and supplying Trolley, ",
 "created_at": "Thu Apr 04 15:27:50 UTC 2013",
 "updated_at": "Thu Apr 04 15:27:52 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1991, we, “Abhay Products”, are widely recognized as one of the prestigious organizations engaged in manufacturing and supplying a comprehensive array of Work Table, Industrial Tray, Storage Rack, Display Board, Industrial Conveyor, Industrial Trolley, Furniture Chair and many more. Under the offered array, we provide Work Table, Assembly Work Table, Industrial Work Table, Inspection Work Table, Overhead Shelf Work Table and many more. In addition to this, we provide Material Handling Tray, Wire Basket Tray, Tray, Hole Tray, Wire Tray, Table Tray, Enclosed Storage Rack, FIFO Storage Rack, Display Storage Rack, to name a few. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nA competent team is a driving force for any organization, backed by such efficient team, we are able to develop our range of Work Table, Industrial Tray, Storage Rack, Display Board, Industrial Conveyor, Industrial Trolley, Furniture Chair and many more in a smooth manner. Team plays an important role in the success of an organization so, we have selected our team through strict procedures like selection tests and interviews.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur utmost priority is to offer qualitative range of Work Table, Industrial Tray, Storage Rack, Display Board, Industrial Conveyor, Industrial Trolley, Furniture Chair and many more to our esteemed clients. To offer the same, we utilize optimum-grade raw material and other allied components in the production process that are sourced from reliable vendors of the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have developed a sound infrastructure, supported by which we are able to cater to the varied demands of patrons in a hassle free manner. Our infrastructure is spacious and is internally divided into varied units, owing to which we are able to carry out all the processes with a systematic approach under one roof. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSatisfying our clients is the utmost priority of our organization. In order to achieve the same, we are committed to offer a qualitative range of Work Table, Industrial Tray, Storage Rack, Display Board, Industrial Conveyor, Industrial Trolley, Furniture Chair and many more to our clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nMaterial Handling Tray, Wire Basket Tray, Tray, Hole Tray, Wire Tray, Table Tray, Enclosed Storage Rack, FIFO Storage Rack, Display Storage Rack,\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8029/248029v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/8029/248029v2-max-250x250.jpg"],
     [[450,
       265],
      "assets/images/resized/0024/8029/248029v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}