{"name": "Abingerdale",
 "permalink": "abingerdale",
 "crunchbase_url": "http://www.crunchbase.com/company/abingerdale",
 "homepage_url": "http://www.abingerdale.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 71,
 "founded_year": 2006,
 "founded_month": 5,
 "founded_day": 31,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "global-audience, monetizing, multimedia, mobile-apps, global-network",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Serving the Global Online Audience",
 "created_at": "Thu Mar 24 11:23:40 UTC 2011",
 "updated_at": "Thu Mar 31 22:08:16 UTC 2011",
 "overview": "\u003Cp\u003EIncorporated in 2006, our management team of young executives has more than 50 years of joint experience in internet and online business. Our vision on both the evolution of the Internet and on the keys to success in the online business, helps us delivering the most on online solutions towards a profitable and global business. With more than 40 (and growing) targeted and segmented web and mobile brands, we aim at serving loyal consumer audiences as well as at offering the most from online interactivity. Partnering with leading digital content publishers and application developers, Abingerdale can deliver cutting-edge web services, payment integration, as well as cross-brand advertising. From the leading position of our network of web and wap sites in Europe, we are actively investing so as to take our successful brands really global, while creating locally relevant consumer offerings. Abingerdale works to build, scale and, above all, monetize web and mobile services. This is why, apart from bringing relevant entertainment, local and social media content to millions of web and mobile visitors and a growing number of subscribers, we focus on integrating a full range of local and global web and mobile payment solutions. All this leads to another area of basic expertise : having developed strong expertise in Local Lead Generation, Cost Per Click and Search. Through an innovative approach to the online community, Abingerdale allows advertisers to connect to a broad online audience of targeted consumers around the world.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       77],
      "assets/images/resized/0012/7607/127607v2-max-150x150.jpg"],
     [[250,
       128],
      "assets/images/resized/0012/7607/127607v2-max-250x250.jpg"],
     [[450,
       231],
      "assets/images/resized/0012/7607/127607v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}