{"name": "Academia-Research",
 "permalink": "academia-research",
 "crunchbase_url": "http://www.crunchbase.com/company/academia-research",
 "homepage_url": "http://www.academia-research.com/",
 "blog_url": "http://www.academia-research.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "1-646-558-5908",
 "description": "",
 "created_at": "Mon Sep 03 14:05:48 UTC 2012",
 "updated_at": "Sat Sep 08 02:19:54 UTC 2012",
 "overview": "\u003Cp\u003EAbout us\nWe are a client-orientated company, which provides services of academic writing for students, who experience problems with their assignments. Our works are our visit cards so that the quality of each of them really matters. In order to satisfy our costumers we hire only the best writers who really love their job. \u003C/p\u003E\n\n\u003Cp\u003EOur mission\nOur main aim is to make our customers happy by providing the works, which meet their requirements and exceed expectations. In order to create such academic papers we always do our best. Our writers hold PHD and MA degrees and are native speakers. Now, we are looking for some more professionals of that kind. If you feel that you have a chance to pass our complicated tests and really want to become a writer of the top company – don’t hesitate to contact us.\u003C/p\u003E\n\n\u003Cp\u003EDescription \nAt our company, we value each writer and care about him/her. We set the most comfort conditions possible and always try to motivate our staff. We are not the one of those scam agencies, who hire everyone, promises ultra-high salaries and don’t pay at all. No, at Academia-research.com the situation is as follows: we want to see you as a member of our team of professionals only if you are a really awesome writer, who knows everything about writing styles, techniques and features of different types of academic papers. If you will prove that you meet those requirements at our tests, then we will gladly welcome you to our family. So…apply if you dare, of course.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       31],
      "assets/images/resized/0020/9465/209465v2-max-150x150.png"],
     [[250,
       52],
      "assets/images/resized/0020/9465/209465v2-max-250x250.png"],
     [[450,
       94],
      "assets/images/resized/0020/9465/209465v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}