{"name": "ACB2B",
 "permalink": "acb2b",
 "crunchbase_url": "http://www.crunchbase.com/company/acb2b",
 "homepage_url": "http://www.acb2b.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "b2b, acb2b, chinese-company-credential-investigation",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "B2B online platform between US and China",
 "created_at": "Sun Sep 13 22:02:02 UTC 2009",
 "updated_at": "Mon Sep 14 12:38:57 UTC 2009",
 "overview": "\u003Cp\u003EAmeriChinaB2B builds a win-win bridge between China and the US for medium and small sized businesses. We provide a broad spectrum of services to our customers who are interested in selling products and services to China, recruiting sales agents in China and doing business in China. \u003C/p\u003E\n\n\u003Cp\u003EThrough our dedicated efforts, AmeriChinaB2B has built a dynamic partnerships with various industries platforms, market research firms and media. This leverages AmeriChinaB2B into a distinctive position by taking advantage of our experience, low cost and familiarity with the Chinese market and culture. Our services include Sales and Trading Lead Information Providers, Recruiting Help, Online and Offline Marketing Promotion, Market Research, Documentation Translation, Website China Hosting, Trade Show, Business Credential Investigation, Business Partnership Consultation, Chinese Business Information and Legal Assistance. Since the inception of AmeriChinaB2B, we have always been striving to build a strong collaboration team by joining rich experienced teams in China and the US to help US companies grow their businesses in China. \u003C/p\u003E\n\n\u003Cp\u003EWith branch offices and partners strategically located in Silicon Valley, Beijing, Boston, our services are within your reach both geographically and financially. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}