{"name": "Acclaim Shopfitters",
 "permalink": "acclaim-shopfitters",
 "crunchbase_url": "http://www.crunchbase.com/company/acclaim-shopfitters",
 "homepage_url": "http://www.acclaimshopfitters.co.uk/default.html",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "acclaimshop",
 "category_code": "enterprise",
 "number_of_employees": 12,
 "founded_year": 2002,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "shop-fitting, gondola, warehouse, amx, modular, glass-shelf, tegometall, shelving, shop-shelving, retail-display, supermarket, equipment, amx35, acclaim-shopfitters, wall-bays, retail, center-unit, shopfitters, gondola-shelving, fitter, shop-fitters, gene",
 "alias_list": null,
 "email_address": "sales@acclaimshopfitters.co.uk",
 "phone_number": "0121 709 4099",
 "description": "shop shelving, shop counters, display ca",
 "created_at": "Fri Sep 07 23:42:34 UTC 2012",
 "updated_at": "Sun Sep 09 19:57:42 UTC 2012",
 "overview": "\u003Cp\u003ESuppliers of quality shop fittings including shop shelving, shop counters, display cabinets \u0026amp; much more. We truly believe that we offer the best value new shop shelving \u0026amp; Shop Fitting in the UK and Ireland contact sales for  helpful advise on all things retail, Express Next Day Delivery on all shop shelving orders with top brands like Tegometall and AMX35 in stock.\u003C/p\u003E\n\n\u003Cp\u003EAt Acclaim Shopfitters we believe that when it comes to ordering your retail shop shelving, shop counters and shop fitting work, the 4 key factors affecting your buying decision are\nPrice - We Guarantee to beat any genuine Tegometall \u0026amp; Amx35 quotes on a like for like basics. \nQuality- We beat the rest, please call to arrange free shelving samples.\nService - We Promise to go that extra mile, If you have a problem we truly want to help\nLead Time - Nationwide next day delivery and 1000’s of shelving bays and gondola units in stock.\u003C/p\u003E\n\n\u003Cp\u003ESince we were first established in 2002 we have gained a much respected reputation throughout the UK due to our dedication to providing quality workmanship with all our projects. Our strong focus on customer service when Shopfitting has also helped establish our strong reputation. We only use quality assured manufacturers and fully certified plumbers and electricians on our projects so you can be guaranteed of quality workmanship and professionalism every time. We provide our shop fitting services to all types of clients both big and small throughout the UK.\u003C/p\u003E\n\n\u003Cp\u003EAcclaim Retail Services can guide you through your project whether that is a single bay of racking or a complete branch refit. With 10 years of trading and FREE CAD \u0026amp; store layout advice - why pay for expensive consultants when Acclaim will do the job for free?\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       71],
      "assets/images/resized/0021/0375/210375v2-max-150x150.png"],
     [[250,
       118],
      "assets/images/resized/0021/0375/210375v2-max-250x250.png"],
     [[400,
       190],
      "assets/images/resized/0021/0375/210375v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.squidoo.com/retail-store-design-shopfitting",
    "title": "Retail Store Design \u0026 Shopfitting"}]}