{"name": "Accredited Transcription Corp",
 "permalink": "accredited-transcription-corp",
 "crunchbase_url": "http://www.crunchbase.com/company/accredited-transcription-corp",
 "homepage_url": "http://www.accreditedtranscription.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "non-practicing-entity, patents",
 "alias_list": "",
 "email_address": "atc@accreditedbiz.com",
 "phone_number": "1-267-864-7737",
 "description": "Non-Practicing Entity",
 "created_at": "Wed Oct 03 13:04:02 UTC 2012",
 "updated_at": "Wed Oct 03 13:05:07 UTC 2012",
 "overview": "\u003Cp\u003EAccredited Transcription Corp. is a Pennsylvania corporation formed in 2011 to assist enterprises needing to turn voice communications into data.\u003C/p\u003E\n\n\u003Cp\u003EIn March 2012, ATC acquired a 66.6% interest in United States Patent 6,298,328.  In October 2012, ATC announced it acquired the remaining 33.4% of the patent.\u003C/p\u003E\n\n\u003Cp\u003EThe patent covers an invention that changed the course of transcription services for the modern era. Specifically, rather than transcribing voice live, ATC\u0026#8217;s patent uses telecommunications equipment so professionals could transmit their voice to a central data center while the transcription service returned it in text format.  \u003C/p\u003E\n\n\u003Cp\u003ESince the invention in 1999, the technological idea is believed to have been copied by various companies including Samsung, through its S-Voice platform, Apple\u0026#8217;s Siri system for its iPhone and iPads, along with software provided for mobile phones from companies such as VLink, Inc. Other companies may have also infringed on the technology by using similar systems and programs to provide voicemail to text services which are being used by Vonage and other telecommunications providers. Even certain McDonalds restaurants have implemented the technology for their drive in windows.\u003C/p\u003E\n\n\u003Cp\u003ETeaming together with Pennsylvania Patent Prosecution Corporation and management consultants from Accredited Business Consolidators Corp., ATC will vigorously pursue the royalties that it believes are owed to it. ATC is in the process of notifying infringers of its patent and the royalties they may owe.  Enterprises using the technology without agreeing to pay royalties may be subject to litigation and a request for an injunction.\u003C/p\u003E\n\n\u003Cp\u003EATC is owned by a consortium of enterprises including Dave\u0026#8217;s Holding Company, Pennsylvania Patent Prosecution Corp., Accredited Business Consolidators Corp., Uno Dos Tres, Inc., and others.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "196 West Ashland",
    "address2": "",
    "zip_code": "18901",
    "city": "Doylestown",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}