{"name": "Ace Aqua Technologies",
 "permalink": "ace-aqua-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/ace-aqua-technologies",
 "homepage_url": "http://www.indiamart.com/aceaqua/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 40,
 "founded_year": 2003,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "industrial-filters, micron-filters, reverse-osmosis-plants",
 "alias_list": null,
 "email_address": "aceaqua@tradepassport.org",
 "phone_number": "9884610241",
 "description": "suppliers of a wide range of Micron Filt",
 "created_at": "Thu Apr 04 07:37:24 UTC 2013",
 "updated_at": "Fri May 31 10:52:50 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nAce Aqua Technologies is a partnership based business organization, which was established in the year 2003 at Chennai, Tamil Nadu. We are one of the most reputed manufacturers, suppliers and exporters of an excellent range of Industrial Filters, Micron Filters, Reverse Osmosis Plants, Water Softeners, Demineralization Plants and Water Treatment Systems.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nIn order to maintain high quality standards in our manufactured product range and offered services, we adopt stringent quality control program in our business related processes. We use quality tested materials in our manufacturing process, which are sourced from the reliable and trustworthy vendors of the market. Our quality controllers examine each developed product on well defined parameters prior to the final dispatch to the clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Projects;\nSince incorporation, we have conceptualized and commissioned various big budgeted projects for our clients. We provide highly reliable and efficient water purification services for Mineral Water Projects and Swimming Pools. Our vast experienced engineers and technocrats possess expertise in their respective fields, which help them render best services to the clients that meet their actual needs.\u003C/p\u003E\n\n\u003Cp\u003EIndustries we Serve:\nOver the years, we are able to muster a large clientele across the globe by providing immaculate products and services to the clients that meet their actual needs and demands. Our products are demanded and admired by various leading business ventures of domestic as well as international market for their high reliability and cost-effectiveness. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0024/7639/247639v3-max-150x150.png"],
     [[250,
       78],
      "assets/images/resized/0024/7639/247639v3-max-250x250.png"],
     [[421,
       133],
      "assets/images/resized/0024/7639/247639v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}