{"name": "Achha Metals",
 "permalink": "achha-metals",
 "crunchbase_url": "http://www.crunchbase.com/company/achha-metals",
 "homepage_url": "http://www.indiamart.com/achhametals/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "achhametals@tradepassport.org",
 "phone_number": "09953357392",
 "description": "manufacturer and supplier",
 "created_at": "Thu Apr 04 11:16:45 UTC 2013",
 "updated_at": "Thu Apr 04 11:16:48 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2006, we “Achha Metals” have been engaged in manufacturing and supplying a premium quality range of Hard Anodized Cookware, Non Stick Induction Base Cookware and Aluminium Finish Cookware.\u003C/p\u003E\n\n\u003Cp\u003EOur Professionals:\nWe are well aware of the growing demands of cookware in the country and thus, have employed skilled professionals in our team in order to meet the same in an effective manner. All our professionals are offered proper training at regular intervals so as to keep them abreast of the changing market trends.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe have been able to attain the trust of our esteemed clients with our quality products and ethical business practices. Our quality controllers are skilled enough and ensure that all our business activities are carried out in compliance with the industry standards.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Facilities:\nWe have a state-of-the-art infrastructure at our premise that spreads across a sprawling area of 7200 square feet. The infrastructure has facilities for designing, manufacturing, quality testing, research and storage \u0026amp; packaging of our range. We have installed sophisticated machines \u0026amp; equipment in our range in order to manufacture quality assured range of cookware.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince our inception, we have been client-centric in nature and ensure ethical practices are followed by us in order to maximize the satisfaction levels of our clients. As per this, we ensure that only quality assured products are delivered to the clients within the stipulated time period. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nDue to the various policies laid down by our organization, we have been able to accomplish all consignments with integrity. Owing to our experience , we have been able to serve our clients with an array of flawless products that are used for both commercial and domestic purposes. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7847/247847v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7847/247847v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7847/247847v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}