{"name": "Aciron Consulting",
 "permalink": "aciron",
 "crunchbase_url": "http://www.crunchbase.com/company/aciron",
 "homepage_url": "http://www.aciron.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "askaciron",
 "category_code": "consulting",
 "number_of_employees": 15,
 "founded_year": 2006,
 "founded_month": 4,
 "founded_day": 27,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-consulting, technology-consulting, it, consulting, it-consultants, technology-consultants, technology, management-consulting, sharepoint-consulting, sharepoint, custom-application-development, project-management, technology-consultancy, business",
 "alias_list": null,
 "email_address": "info@aciron.com",
 "phone_number": "+1.800.779.6765",
 "description": "Business and Technology Consulting",
 "created_at": "Thu Nov 05 18:18:52 UTC 2009",
 "updated_at": "Tue Mar 05 04:31:22 UTC 2013",
 "overview": "\u003Cp\u003EAciron Consulting, LLC is a business management and technology consulting firm dedicated to connecting the business and technology aspects of a company. We are committed to creating innovative, successful solutions for our customers. Our mission is to build strong client relationships and quality products to help clients achieve their full potential in business and technology while holding strong to our core values.\u003C/p\u003E\n\n\u003Cp\u003ESome of the services we provide include:\u003C/p\u003E\n\n\u003Cp\u003ECUSTOM APPLICATION DEVELOPMENT | Aciron designs, develops, and maintains custom web-based applications on a wide range of technologies that fit your unique requirements. Whether you need a custom application from scratch, custom development and integration in a third party application, or need to integrate or extend your current business applications, we can help you achieve your goals. \u003C/p\u003E\n\n\u003Cp\u003EMICROSOFT SHAREPOINT CONSULTING | At Aciron Consulting, we provide a full array of Microsoft SharePoint consulting services to assist clients in leveraging their SharePoint investments. Our SharePoint consulting expertise includes planning, implementation and configuration, \nmigration, customization and branding, development, training, and support. \u003C/p\u003E\n\n\u003Cp\u003EPROJECT MANAGEMENT | Effective project management practices are vital to the success of projects and to driving efficiency and productivity within your organization. Drawing on our proven project management methodology and vast experience, Aciron delivers project management support to ensure projects are carried out efficiently and successfully.\u003C/p\u003E\n\n\u003Cp\u003EREQUIREMENTS GATHERING AND DEFINITION | Aciron works collaboratively with clients to define, analyze, document, validate, and maintain clients’ requirements for client initiatives and systems. Leveraging our business and technical expertise, we interpret requirements in the \ncontext of each client‘s business and develop clear, high-quality documentation.\u003C/p\u003E\n\n\u003Cp\u003EWEBSITE DESIGN AND DEVELOPMENT | From simple websites, to complex, interactive websites, blogs, and e-commerce solutions, we assist a wide variety of clients with their unique online needs. We have worked extensively to cost-effectively develop, design, and maintain effective, user-friendly websites to help organizations meet their unique business and budgetary needs.\u003C/p\u003E\n\n\u003Cp\u003EIT AND BUSINESS STRATEGY CONSULTING | Aciron is committed to assisting you in achieving greater efficiencies in your business processes by aligning key business needs with strategic IT initiatives. We work with you to assess your specific needs and provide practical yet innovative solutions that support your organization\u0026#8217;s objectives and enable you to achieve sustainable success, while managing risk.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       59],
      "assets/images/resized/0006/5072/65072v2-max-150x150.png"],
     [[165,
       65],
      "assets/images/resized/0006/5072/65072v2-max-250x250.png"],
     [[165,
       65],
      "assets/images/resized/0006/5072/65072v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Office",
    "address1": "678 Massachusetts Avenue",
    "address2": "Suite 1002",
    "zip_code": "02139",
    "city": "Cambridge",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": 42.365516,
    "longitude": -71.104488}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}