{"name": "ACL WIreless",
 "permalink": "acl-wireless",
 "crunchbase_url": "http://www.crunchbase.com/company/acl-wireless",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Wed Jun 12 10:33:50 UTC 2013",
 "updated_at": "Fri Jun 14 12:06:37 UTC 2013",
 "overview": "\u003Cp\u003EACL Wireless Limited develops consumer and enterprise mobile value added services. It offers mobile community applications, such as SMS Chat, a SMS-based chat service that enables a text-based chatting among mobile users; Voice Chat, a voice based chat service, which enables mobile operators to create a voice-based community for mobile users to connect and interact with other users sharing common interests; and Mobile Social Networking, a mobile social networking and communications service for users to connect with friends, meet new people, and chat and share photos. The company also provides enterprise mobility solutions, which include BULK SMS Service, which enables enterprises to broadcast, track, and analyze bulk SMS to their subscribers; and Shortcodes, a service creation and management service for enterprises to create and manage SMS text based campaigns and initiatives through a Web based interface. In addition, it offers mobile content products, such as Mobile Radio, a music station for users to search songs, create personal albums, share their songs with friends, gift or dedicate a song, and download a song; Subscription Manager for service providers to launch subscription services for their subscribers; and Content Services for mobile operators to launch services and micro-portals for their subscribers. The company offers its mobile community applications for various mobile operators and enterprises in South Asia, the Middle East, Africa, Latin America, and South East Asia\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder and Seed Investor",
    "person":
     {"first_name": "Tom",
      "last_name": "Lasater",
      "permalink": "tom-lasater",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}