{"name": "Acme Çeviri ve Tercüme Bürosu",
 "permalink": "acme-eviri-ve-tercme-brosu",
 "crunchbase_url": "http://www.crunchbase.com/company/acme-eviri-ve-tercme-brosu",
 "homepage_url": "http://www.acmeceviri.com",
 "blog_url": "http://www.acmeceviri.com",
 "blog_feed_url": "http://www.acmeceviri.com/feed",
 "twitter_username": "acmeceviri",
 "category_code": "hardware",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "yeminli-tercme-brosu, eviri-brosu, tercme-brolar, ingilizce-tercme, almanca-tercme, rusa-tercme, arapa-tercme, franszca-tercme, ispanyolca-tercme, ince-tercme, polonyaca-tercme, hollandaca-tercme, felemenke-tercme, yunanca-tercme, rumca-tercme, hrvata-ter",
 "alias_list": null,
 "email_address": "acmeceviricom@gmail.com",
 "phone_number": "02125705448",
 "description": "Profesyonel tercüman hizmeti",
 "created_at": "Wed Jan 16 08:40:05 UTC 2013",
 "updated_at": "Thu Jan 17 08:06:28 UTC 2013",
 "overview": "\u003Cp\u003E2012 yılında genç ve dinamik bir tercüman ekibi tarafından kurulan şirketimiz, profesyonel tercüman ve çeviri kadromuzla hizmet vermekte ve siz değerli müşterilerimize güvenilir, kaliteli ve hızlı çeviri-tercüme hizmetlerini sunmaktadır.\u003C/p\u003E\n\n\u003Cp\u003EMisyon: Acmeceviri.com Ailesi olarak Türkiye ve yabancı çeviri piyasasında söz sahibi olmak, müşterilerimize kaliteyi uygun fiyata sunmak ve kadromuzdan aldığımız güç ile büyümektir.\u003C/p\u003E\n\n\u003Cp\u003EVizyon: Türk çeviri piyasasında ilk 5 tercüme bürosu arasında olabilmek, müşteri memnuniyetini daima ön planda tutmak ve kaliteye önem vermektir.\u003C/p\u003E\n\n\u003Cp\u003ETercüme süreci:Bize gönderilen belgeler öncelikler bilgisayar programına aktarılarak fiyatlandırma yapılır.Uyguladığımız fiyatın müşterimiz tarafından onaylanması.Yapılan işin bitirilerek ödeme ile teslimin yapılması.\u003C/p\u003E\n\n\u003Cp\u003ETeslim: Mail ve kargo yolu ile teslim uygulanmaktadır.\u003C/p\u003E\n\n\u003Cp\u003EFarkımız:Kullandığımız sistemle çevirmen ve müşteri ilişkisini sistemli bir şekilde koordine edip hızlı bir şekilde hizmet ulaştırmaktayız.Tıp, hukuk, akademik çeviri vb dallarında sektörden titizlikle seçilen çevirmenlerimizle en iyi hizmeti vermekteyiz.2012 yılında kurulan şirketimiz genç ve dinamik yapısıyla çok daha verimli ve çok daha hızlı bir şekilde sektörde atılım yapmakta.Adil fiyatlandırma ve Alanında uzman çevirmenlerimizle size uygun fiyat güvenilir hizmet sunmaktayız.Teknolojiyi ve günün imkanlarını en iyi şekilde kullanarak kaliteden ödün  vermeden hizmetinizdeyiz.\u003C/p\u003E\n\n\u003Cp\u003EHizmetlerimiz:Pasaport Tercümesi,Ticari Tercüme, Akademik Tercüme, Hukuk Tercümesi, Makale Tercümesi, Medikal Tercüme, Noter Tercümesi, Finansal Tercüme, Teknik Tercüme, Edebi ve Sanatsal Tercüme, Bilişim Tercümeleri, Tıbbi Tercüme, İthalat İhracat, Pazarlama Tercüme, Yabancı Dil Danışmanlığı\u003C/p\u003E\n\n\u003Cp\u003EÇeviri Yaptığımız Diller:ingilizce Tercüme, almanca Tercüme, rusça Tercüme, arapça Tercüme, fransızca Tercüme, ispanyolca Tercüme, çince Tercüme, polonyaca Tercüme, hollandaca Tercüme, felemenkçe Tercüme, yunanca Tercüme, rumca Tercüme, hırvatça Tercüme, iskandinav dilleri Tercüme, norveççe Tercüme, danimarkaca Tercüme, isveççe Tercüme, ukraynaca Tercüme, romence Tercüme, bulgarca Tercüme, boşnakça Tercüme, azerice Tercüme, türkmence Tercüme, kırgızca Tercüme, ibranice Tercüme, afrikaca Tercüme, moldovca Tercüme, lehçe Tercüme, korece Tercüme, tayca Tercüme, italyanca Tercüme, portekizce Tercüme, flamanca Tercüme, afganca Tercüme, farsça Tercüme, kürtçe Tercüme, slovakça Tercüme, estanyaca Tercüme, litvanyaca Tercüme\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       103],
      "assets/images/resized/0022/9963/229963v2-max-150x150.png"],
     [[157,
       108],
      "assets/images/resized/0022/9963/229963v2-max-250x250.png"],
     [[157,
       108],
      "assets/images/resized/0022/9963/229963v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}