{"name": "Acris Antibodies",
 "permalink": "acris-antibodies",
 "crunchbase_url": "http://www.crunchbase.com/company/acris-antibodies",
 "homepage_url": "http://us.acris-antibodies.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "US-info@acris-antibodies.com",
 "phone_number": "858-888-7900",
 "description": "Thousands of high quality antibodies",
 "created_at": "Thu Dec 13 20:04:49 UTC 2012",
 "updated_at": "Wed Dec 19 07:50:05 UTC 2012",
 "overview": "\u003Cp\u003EAcris GmbH was founded 1998 as a spinoff of DPC Biermann GmbH, the German subsidiary of Diagnostic Products Corp., Los Angeles. Acris took over responsibility for marketing the DPC Biermann research products. From 1999 to 2003 Acris GmbH focused more and more on the research antibodies.\u003C/p\u003E\n\n\u003Cp\u003EIn the beginning Acris GmbH served as a distributor for US and UK antibody manufacturers in the German market. In September 2003 Acris GmbH became a fully independent company and took over all research products and customers from DPC. Acris GmbH was renamed Acris Antibodies GmbH what should better reflect our business.\u003C/p\u003E\n\n\u003Cp\u003EFrom the very beginning it was Acris\u0026#8217; mission to serve the research community with high quality research products. The idea was to resolve a problem that many researchers are confronted with: “How can I find a product/antibody which will work optimal in my research application”. To help these scientists Acris developed a platform for thousands of high quality antibodies in one easy to search online database. Since 2010, Acris has been able to offer more than 170,000 primary antibodies and more than 50,000 proteins, lysates and kits.\u003C/p\u003E\n\n\u003Cp\u003EAcris Antibodies developed from a German distributor to a global player in the research product / antibody market. Distributors in Europe and Asia were added and in the beginning of 2011 we opened a branch office in San Diego, USA.\u003C/p\u003E\n\n\u003Cp\u003ESince November 2012, Acris Antibodies GmbH is DIN EN ISO 9001 certified. We have implemented and certified our Quality Management to show our dedication towards our goal: We aim to satisfy our customers with outstanding service and high quality products. Learn more about our quality policy here.\u003C/p\u003E\n\n\u003Cp\u003EIn the next couple of years Acris Antibodies will strengthen its international position and develop our database any further by adding new and innovative products like the Link-A-Light product line for quick and easy antibody or protein conjugation with dyes.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "CEO, Acris Antibodies, Inc.",
    "person":
     {"first_name": "John",
      "last_name": "Mountzouris",
      "permalink": "john-mountzouris",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "U.S. Office",
    "address1": "6815 Flanders Drive, Suite 140",
    "address2": "",
    "zip_code": "92121",
    "city": "San Diego",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}