{"name": "imotiva",
 "permalink": "activity-rewards-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/activity-rewards-ltd",
 "homepage_url": "http://www.imotiva.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "imotiva",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 3,
 "founded_day": 31,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "exercise, sport, rewards, incentives, motivation, retailer-loyalty, points, charity, volunteers",
 "alias_list": null,
 "email_address": "news@imotiva.com",
 "phone_number": "",
 "description": "rewards for active people",
 "created_at": "Mon Mar 19 02:39:31 UTC 2012",
 "updated_at": "Fri Sep 07 09:07:04 UTC 2012",
 "overview": "\u003Cp\u003Eimotiva.com is the club card for active people.  We reward people no matter where they choose to exercise and keep them coming back with challenges, competitions and tests.  The imotiva.com approach also allows clubs, organisations and venues to reward volunteers and drive their charitable goals.\u003C/p\u003E\n\n\u003Cp\u003EThe unique approach taken by imotiva allows an individuals to track their exercise and sport using their choice of fitness apps but also through their preferred clubs or venues like gyms, sports centres or at events.  This will be the first platform in the UK that provides such wide choice of how to collect points and what to spend them on.\u003C/p\u003E\n\n\u003Cp\u003EThere is also an enormous opportunity for local retailers such as shops, cafés and restaurants to get involved and use the imotiva platform to provide attractive incentives to imotiva members that not only motivate but allow the local retailer to build a loyal customer following and help bring customers through the door.\u003C/p\u003E\n\n\u003Cp\u003EEach activity gains the user points on imotiva.com which they can spend online or with local shops and retailers.  The website also motivates users through challenges such as 5x50.co.uk and competitions to encourage them to get fit and even compete against friends and teams.\u003C/p\u003E\n\n\u003Cp\u003EOne of the biggest challenges for people getting involved in sport and exercise is motivation.  Often people have a trade off as to how they spend their free time and our goal is to motivate them to use that time doing something healthy even if it’s going for a walk.\u003C/p\u003E\n\n\u003Cp\u003EWatching the stars at the London Olympics and Paralympics creates an enormous wave of enthusiasm but it will take sustained effort to keep this going.  Through imotiva we are able to provide detailed insights into the behaviour of people who are exercising and identify and support people as they might consider stopping or slowing down again.\u003C/p\u003E\n\n\u003Cp\u003Eimotiva is free for clubs, venues and organisations and most importantly, it’s free for individuals too.\u003C/p\u003E\n\n\u003Cp\u003EResearch into the effectiveness of financially based incentives to drive motivation has given us confidence that a unified reward platform like imotiva will deliver value – achieving between a 12% and 35% uplift in participation.\u003C/p\u003E\n\n\u003Cp\u003EFinancially based motivation in sport and health programs is not a new concept.  However, nearly all applications of it so far have been bespoke or small scale, making them hard to manage and less attractive.  imotiva allows all sorts of programs, clubs and venues with sport, health and activity at their core to benefit from the platform.\u003C/p\u003E\n\n\u003Cp\u003EInitial feedback from organisations using the imotiva platform has been very positive.  Imotiva is being used in a diverse number of locations already to encourage and motivate healthy activity.  The first UK user was the Allendale Centre in East Dorset which is using imotiva with their 5000 community members.\u003C/p\u003E\n\n\u003Cp\u003EThe Luke Adams Foundation, backed by the Australian Government in Western Australia, is using the platform to reach 5,000 sports clubs and encourage participation.  Organisations such as Oxford University and Glasgow University are rolling out the platform.  Social challenges like 5x50.co.uk are using imotiva to encourage participation. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       63],
      "assets/images/resized/0020/9872/209872v2-max-150x150.jpg"],
     [[250,
       105],
      "assets/images/resized/0020/9872/209872v2-max-250x250.jpg"],
     [[357,
       150],
      "assets/images/resized/0020/9872/209872v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "John",
      "last_name": "Stuart",
      "permalink": "john-stuart",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "ISIS Innovation",
    "address2": "Ewert House, Banbury Road",
    "zip_code": "OX2 7SG",
    "city": "Oxford",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        82],
       "assets/images/resized/0020/9874/209874v2-max-150x150.png"],
      [[250,
        137],
       "assets/images/resized/0020/9874/209874v2-max-250x250.png"],
      [[450,
        248],
       "assets/images/resized/0020/9874/209874v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        75],
       "assets/images/resized/0020/9875/209875v2-max-150x150.png"],
      [[250,
        125],
       "assets/images/resized/0020/9875/209875v2-max-250x250.png"],
      [[450,
        226],
       "assets/images/resized/0020/9875/209875v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}