{"name": "WebActionHero",
 "permalink": "actionhero",
 "crunchbase_url": "http://www.crunchbase.com/company/actionhero",
 "homepage_url": "http://www.webactionhero.com",
 "blog_url": "http://www.webactionhero.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "webactionhero",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "action, tracking, management, risk, assessment, change, collaboration, project, project-management, action-tracking, action-tracking-software, software, corrective-action, corrective-actions, corrective, project-controls, controls, hazop, document-control",
 "alias_list": null,
 "email_address": "charles@webactionhero.com",
 "phone_number": "1-888-502-8297",
 "description": "Action Tracking Software",
 "created_at": "Wed Jun 15 14:37:55 UTC 2011",
 "updated_at": "Wed Nov 28 02:36:54 UTC 2012",
 "overview": "\u003Cp\u003EWebActionHero is an Project management software tool and action tracking software developed as an easy to use solution to accurately track and manage critical project actions. Ours is a web based, low cost solution hosted in the cloud that, unlike our competition, allows for a variety of unique features such as an easy to use workflow wizard, spreadsheet upload of hundreds of actions while simultaneously generating workflows for each action, customization of product look and terminology, and an advanced user privilege tool just to name a few. To see more on WebActionHero please visit our features page.\u003C/p\u003E\n\n\u003Cp\u003EOur theory surrounding action tracking is that by focusing on the details of task workflows and their associated risks, a more accurate picture will surface of your organization\u0026#8217;s risk profile at all levels; corporate, project and activity. WebActionHero can be described as Action Tracking for Risk Management, or we like to call it, Action Management.\u003C/p\u003E\n\n\u003Cp\u003EMany companies still utilize ineffective and inefficient systems to manage risk issues and project changes, which is unacceptable given the consequences of poor execution and the recognized need for improved risk management.\u003C/p\u003E\n\n\u003Cp\u003EAction Tracking supplements technical projects that require you or your collegues to collect and manage technical issues generated from HAZID, HAZOP, 3D model review, vendor FAT, interface, audit, completion punchlist and many more. WebActionHero does all that and more by allowing clients, vendors and other key interface groups to be included in your approval workflows, with all using the same centralized register.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       38],
      "assets/images/resized/0013/9335/139335v8-max-150x150.png"],
     [[250,
       64],
      "assets/images/resized/0013/9335/139335v8-max-250x250.png"],
     [[351,
       90],
      "assets/images/resized/0013/9335/139335v8-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Halifax",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        89],
       "assets/images/resized/0021/6204/216204v2-max-150x150.jpg"],
      [[250,
        149],
       "assets/images/resized/0021/6204/216204v2-max-250x250.jpg"],
      [[450,
        269],
       "assets/images/resized/0021/6204/216204v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}