{"name": "Acute Instruments",
 "permalink": "acute-instruments",
 "crunchbase_url": "http://www.crunchbase.com/company/acute-instruments",
 "homepage_url": "http://www.indiamart.com/acuteinstruments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "acuteinstruments@tradepassport.org",
 "phone_number": "9324812986",
 "description": "Providing innovative high quality produc",
 "created_at": "Fri Apr 05 10:10:41 UTC 2013",
 "updated_at": "Fri Apr 05 10:10:44 UTC 2013",
 "overview": "\u003Cp\u003EYear of Establishment 2004, The main objective of the company was to cater the requirement of local industries. Offer them simple and reliable instruments. A team of highly experienced and dedicated professionals having experience of more than two decades and has under gone extensive training program at both National and International levels formed a strong stepping stone of the company.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team consists of expert professionals from different domain.They work in close collaboration with each other to show the desired result.Our team comprises the following professionals:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EChemical engineers\nQuality controllers\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a well-established infrastructural facility, which helps us fulfill the varied requirements of our valued clients in the most efficient manner. For operational ease, we have segregated our infrastructure into various specialized divisions that are managed by skilled professionals. These units are outfitted with latest machines for easy handling of various tasks.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are a quality-oriented organization focused towards consistently providing our customers with premium quality industrial chemicals. Total quality management policies are strictly followed in all our business operations. In order to ascertain the these policies are stringently followed, we have appointed a diligent team of quality controllers. These professionals supervise the entire business activities.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client-oriented organization known in the industry for our focus on attaining maximum customer satisfaction. By making quality industrial chemicals available to the patrons at reasonable prices, we have been able to become their most preferred choice. We make sure to maintain cordial relations with our clients. This helps us in getting an idea of clients\u0026#8217; specific demands and requirements. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8515/248515v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8515/248515v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8515/248515v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}