{"name": "AdBoxed",
 "permalink": "adboxed",
 "crunchbase_url": "http://www.crunchbase.com/company/adboxed",
 "homepage_url": "http://www.adboxed.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "AdBoxed",
 "category_code": "software",
 "number_of_employees": 4,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@adboxed.com",
 "phone_number": "",
 "description": "Online Advertising",
 "created_at": "Wed Dec 05 05:15:23 UTC 2012",
 "updated_at": "Thu Dec 06 05:53:04 UTC 2012",
 "overview": "\u003Cp\u003EWhat is AdBoxed?\nAdBoxed is a social advertising platform for you to collect and share advertisements, local to large commercial brands with your friends or people who share the same interests as you. AdBoxed gives companies the opportunity to partner with us to distribute their content on the website. The objective is to bring fun, enjoyable advertisements that people want to find. . The idea came to plan after learning about corporate marketing and the price per flyers that businesses pay. AdBoxed is eliminating the cost for companies to print out weekly flyers and the idea of finding these advertisements on AdBoxed is a greener and cheaper solution while still getting the content out to the public. AdBoxed is one big online flyer that is scrambled with advertisements in your city. Every advertisement on the website is uploaded through city and categories. Click on your city to find deals, announcements and sales from top companies near you! Join today and follow your friends on AdBoxed, send messages, comment on advertisements and collect advertisements on your bulletin board. All advertisements/content on adboxed.com is uploaded through administration team and everything is authenticated to be true ads. Users can upload their own advertisements but won’t be posted until further review and authentication from admin. On AdBoxed you can print out any advertisement to bring with you to the store, you can also share each advertisement on Twitter and Facebook. AdBoxed is partnering with some of the biggest retail, grocery and electronic corporations to help deliver you the best content! \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[128,
       128],
      "assets/images/resized/0022/3910/223910v2-max-150x150.png"],
     [[128,
       128],
      "assets/images/resized/0022/3910/223910v2-max-250x250.png"],
     [[128,
       128],
      "assets/images/resized/0022/3910/223910v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}