{"name": "Adfast Polymers",
 "permalink": "adfast-polymers",
 "crunchbase_url": "http://www.crunchbase.com/company/adfast-polymers",
 "homepage_url": "http://www.indiamart.com/adfastpolymers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "adfastpolymers@tradepassport.org",
 "phone_number": "9841026591",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 06:29:36 UTC 2013",
 "updated_at": "Fri Apr 05 06:29:40 UTC 2013",
 "overview": "\u003Cp\u003ECame into existence in the year 1994 at Chennai, Tamil Nadu in India, ADFAST POLYMERS has become one of the leaders in manufacturing and supplying finest quality Industrial Adhesives, Anaerobic Adhesives, Pipe Sealants, Industrial Sealants, Lubricating Grease and Bearing Retainers.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nThread Locking Adhesives, Wood Adhesives, Rubber Based Adhesives, General Purpose Sealants, Polyurethane Sealants, Vinyl Flooring Adhesives, Cyanoacrylate Adhesives, Epoxy Sealants, Sticker Adhesives, Teflon Pipe Sealants and more.\u003C/p\u003E\n\n\u003Cp\u003EMemberships / Affiliations:\nBeing revered as one of the prominent manufactures and suppliers of exclusive range of Pipe Sealants, Industrial Sealants, Silicon Grease, Industrial Adhesives and more, we have carved a strong foothold in the market. We manufacture our range as per set industrial trends utilizing modernized machines and finest quality raw material thereby getting ISO 9001: 2008 Certifications.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have with us fully constructed and well built infrastructural facility that spreads across extensive land area. To ensure smooth functioning and timed execution of all our business processes, we have properly divided our infrastructure into varied departments.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur company is supported by a pool of highly talented and competent professionals, who carry rich industrial experience in their domain. They work in close harmony and are led by our mentor, who has clear idea about the industrial trends and business procedures. They utilize modernized machines cutting-edge tools and equipment to manufacture finest grade product range in large volumes. Their support has enabled us to render complete client satisfaction.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nParamount importance is given to the quality-assured production. Strict quality control has been initiated by us that encircles around varied stages of production, packaging and dispatch The raw material used for production is sourced from reliable vendors after conducting thorough examination and research work. Product range developed by us is put across a series of quality checks to ensure flawlessness and its compliance with set industrial standards.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0024/8328/248328v2-max-150x150.jpg"],
     [[250,
       96],
      "assets/images/resized/0024/8328/248328v2-max-250x250.jpg"],
     [[260,
       100],
      "assets/images/resized/0024/8328/248328v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}