{"name": "Aditya Scientific",
 "permalink": "aditya-scientific",
 "crunchbase_url": "http://www.crunchbase.com/company/aditya-scientific",
 "homepage_url": "http://www.indiamart.com/adityascientific-hyderabad/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "adityascientific-hyderabad@tradepassport.org",
 "phone_number": "9866677503",
 "description": "manufacturer of Rotary Evaporator,",
 "created_at": "Fri Apr 05 05:04:37 UTC 2013",
 "updated_at": "Fri Apr 05 05:04:41 UTC 2013",
 "overview": "\u003Cp\u003EAditya Scientific started its business operations in the year 2008 at Hyderabad, Andhra Pradesh, India.  Since inception, we have emerged as one of the leading names involved in manufacturing and supplying widespread array of Diaphragm Vacuum Pump, Magnetic Stirrer, Recirculation Chiller, Rotary Evaporator and Parallel Block. Under the guidance and support of our Proprietor, Mr. Naresh Reddy, we have won over the trust of our clients by extending our product range. Our products are highly cherished across the market for their robust construction, superior quality, reliability, high performance, dimensional accuracy and durability.\u003C/p\u003E\n\n\u003Cp\u003EOur Warehouse:\nWe are supported by robust warehousing facilities that enable us to store large volumes of our products as well as the materials and components. It is kept free from dampness, rodent attack and chemicals. Besides, storage, our products are properly packaged using superior grade packaging material thereby ensuring safe and timed dispatch in the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOwing to the support of robust infrastructural facility, we are able to accomplish bulk demands with ease. Spreading across extensive area of land, our infrastructure is strategically sectioned into varied departments to ensure smooth functioning and timed execution. However sectioned, these units are interlinked and are manned with the team of experts. Latest of the machines and cutting-edge tools has been installed that enables us to accomplish large scale production with ease.   \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy / Process:\nQuality remains integral at all stages of product manufacturing as well as dispatch. High-degree quality control has been established that enables us to manufacture products as per set industrial standards. Finest of the components and materials are used to ensure quality-assured production and reliability. At the time of dispatch, entire range is put through a series of quality checks thereby ensuring its compliance with international quality standards. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us? / Our Strengths:\nBeing a professionally managed organization, we are into manufacturing and supplying exclusive range of products. Known for its superior quality, reliability and performance, our range is in high demand and has become the favoured choice of our clients. Owing to proper distribution, we are able to ensure safe and timed dispatch of our product.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8234/248234v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8234/248234v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8234/248234v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}