{"name": "AdOnion",
 "permalink": "adonion",
 "crunchbase_url": "http://www.crunchbase.com/company/adonion",
 "homepage_url": "http://www.adonion.com",
 "blog_url": "http://blog.adonion.com/",
 "blog_feed_url": "",
 "twitter_username": "adonion",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": 7,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "transparent-marketplace, advertisers, publishers, adgration, popunder, text-banner, graphical-banner, interstitial",
 "alias_list": null,
 "email_address": "info@adonion.com",
 "phone_number": "416.499.8009",
 "description": "Transparent Marketplace",
 "created_at": "Mon Feb 08 18:22:44 UTC 2010",
 "updated_at": "Wed Feb 10 19:02:36 UTC 2010",
 "overview": "\u003Cp\u003ESummary\nAdOnion is the new generation of transparent advertising marketplace to help all the clients both advertisers and publishers to make the most out of both worlds. With new features, we are bringing on a truly transparent marketplace attracting both advertisers and publishers.\u003C/p\u003E\n\n\u003Cp\u003EWe are able to help publishers by listing your site within our site directory, AdOnion will then act as a \u0026#8216;middleman\u0026#8217; and help you find advertisers to advertise on your site at the desired rates you wish to receive. As for advertisers, you are able to search our site directory to place your ads on websites you feel reaches your niche audiences. In addition, you can speak with your account manager to communicate your needs/wants and we will try to help you in the best way we can with all your advertising/publishing needs.\u003C/p\u003E\n\n\u003Cp\u003EAdOnion offers a few ad options that you can choose from, including CPC-based text ads and graphical ads, CPM-based graphical ads, CPV-based pop under ads and CPI-based interstitial ads.\u003C/p\u003E\n\n\u003Cp\u003EFeature\nAdOnion offers its publishers a lot of control over their advertisement spaces by allowing them to sell ads through their own site and to approve and reject offers, but it also offers an alternative to doing this. If publishers choose, they can also set a reserve price (based on CPC, CPM, CPV) for their AdOnion ad placements. If the ad served by AdOnion meets this reserve, it will be displayed. If it does not, the alternative code ?provided by the publisher ?will be displayed. This could be from Adsense, YPN, or any other ad network.\u003C/p\u003E\n\n\u003Cp\u003EControl\nAdOnion publishers are notified of new advertising offers for their site via email and also on the AdOnion homepage, which is also where they can log into their control panel to manage their account.\u003C/p\u003E\n\n\u003Cp\u003EPublishers can choose what kinds of ads they would like to run and what ads they would like to be shown if AdOnion cannot fill the space. They can also choose whether to allow advertising offers to be manually approved or auto-approved, and whether they will manually or automatically set the prices for the ad zones. Additionally, AdOnion lets its publishers customize their text advertisements, choosing the color of the title, ad, and background color so that the ads will be better integrated with the overall look of the site. The site owners can take total control of their inventory, fully manage default campaigns in the publisher member area.\u003C/p\u003E\n\n\u003Cp\u003EType of Format\nAdOnion offers text banner, graphical banner, pop under and interstitial ad. The text and banner ads are available in a 728 x 90 leaderboard, a 468 x 60 banner, a 160 x 600 wide skyscraper, a 120 x 600 skyscraper, a 300 x 250 medium rectangle, 125x125 button, 120x600 skyscraper, vertical banner 120x240, square box 250x250, large rectangle 336x280 and small rectangle 180x150.\u003C/p\u003E\n\n\u003Cp\u003EReporting\nReports are available through the control panel, which shows the publisher total earnings, daily earnings, ad views, clicks. Zone stats are also displayed showing each ad zone total and daily hits and clicks. Links from this page break the statistics down by individual ad campaign. Finally, the earnings tab documents the publisher payments and earnings, broken down by ad zone and type.\u003C/p\u003E\n\n\u003Cp\u003EPayment\nAdOnion gives its publishers 60% of the revenues generated from their ad spaces. Payments are made to publishers by Paypal and checks in U.S. dollars, and the minimum payment amount is $50. The publisher can request the payment through Bank Wire when the payment reaches $3,500. Earnings under the minimum amount roll over into the next month. AdOnion pays Net 15 to publishers.\u003C/p\u003E\n\n\u003Cp\u003ESupport\nAdOnion website has an extensive FAQ section with a lot of useful information and tools. The ad network also maintains a blog and runs a forum where its users can help each other and share tips.\u003C/p\u003E\n\n\u003Cp\u003ESupport is available by phone Monday-Friday 9 AM - 5 PM EST or by email at any time. Responses are sent out within 24 hours.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[133,
       62],
      "assets/images/resized/0007/6354/76354v2-max-150x150.png"],
     [[133,
       62],
      "assets/images/resized/0007/6354/76354v2-max-250x250.png"],
     [[133,
       62],
      "assets/images/resized/0007/6354/76354v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "565 Gordon Baker Road",
    "address2": "",
    "zip_code": "M2H 2W2",
    "city": "North York",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}