{"name": "Advisor Marketing ServicesGroup",
 "permalink": "advisor-marketing-servicesgroup",
 "crunchbase_url": "http://www.crunchbase.com/company/advisor-marketing-servicesgroup",
 "homepage_url": "http://www.amsgroupllc.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "other",
 "number_of_employees": 9,
 "founded_year": 2006,
 "founded_month": 8,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "whoover@amsgroupllc.com",
 "phone_number": "561-282-9001",
 "description": null,
 "created_at": "Sun Jul 27 14:15:17 UTC 2008",
 "updated_at": "Thu Jan 31 02:28:24 UTC 2013",
 "overview": "\u003Cp\u003EAMS Group LLC is a third party marketing organization formed to identify \u0026#8220;Best of Class\u0026#8221;\u009d asset managers and bring this select group to the National Investment Community.\u003C/p\u003E\n\n\u003Cp\u003EAMS is designed to provide marketing, sales \u0026amp; client services for a group of relatively unknown investment managers to support open architecture models of individually managed accounts for Broker Dealers, Investment Advisors, Trust Companies and Consultants.\u003C/p\u003E\n\n\u003Cp\u003EAMS\u0026#8217;s team of experience professionals are focused upon the selection \u0026amp; representation of undiscovered investment managers with a high level of integrity that have been outside the mainstream national marketplace. Our firm provides direct access for our manager clients to registered investor advisors, retail investment professionals and high net worth investors.    \u003C/p\u003E\n\n\u003Cp\u003EOur ideal investment management candidates focus upon what they do best \u0026#8230; money management versus marketing. AMS compliments our manager—clients with a broad prospect base, marketing expertise and process to deliver results. \u003C/p\u003E\n\n\u003Cp\u003ETraditionally, our managers undergo a rigorous due diligence review and must meet\u003Cbr/\u003E\nStrict criteria before we connect them to our client base of broker/dealers, investment advisors and varied investment channels. \u003C/p\u003E\n\n\u003Cp\u003EManagers Selection Criteria:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EHave been in business for more than three years\u003C/li\u003E\n\u003Cli\u003EHave five years experience and track record \u003C/li\u003E\n\u003Cli\u003EAre GIPS COMPLIANT? \u003C/li\u003E\n\u003Cli\u003EHistory of being in the top 50% of peer group 50% of time\u003C/li\u003E\n\u003Cli\u003EHave over $100 million in assets under management \u003C/li\u003E\n\u003Cli\u003ECommitted to support regional \u0026amp; national conferences \u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EAMS\u0026#8217;s competitive advantage lies in its team of experience professionals. Our three founding partners have more than 75 years experience in the investment business with specialties in the development, marketing and wholesaling of investment products for the national arena. Each team member has served on both the wholesale and retail side of the business. Our team\u0026#8217;s members experience extends from successful careers serving as retail investment advisor to senior executives of large investment firms. In other words, we understand the challenges each side faces in completing a sale for the benefit of the investor. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0002/2834/22834v1-max-150x150.png"],
     [[223,
       64],
      "assets/images/resized/0002/2834/22834v1-max-250x250.png"],
     [[223,
       64],
      "assets/images/resized/0002/2834/22834v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Austin Office",
    "address1": "13740 Reasearch Blvd",
    "address2": "",
    "zip_code": "7738",
    "city": "Austin",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": 30.458697,
    "longitude": -97.793606}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}