{"name": "Aegis Mobile",
 "permalink": "aegis-mobile",
 "crunchbase_url": "http://www.crunchbase.com/company/aegis-mobile",
 "homepage_url": "http://www.aegismobile.com",
 "blog_url": "http://www.aegismobile.com/blog",
 "blog_feed_url": "",
 "twitter_username": "aegismobile",
 "category_code": "mobile",
 "number_of_employees": 32,
 "founded_year": 2006,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobie-web, mobile-cms, mobile-web-applications",
 "alias_list": null,
 "email_address": "alewis@aegismobile.com",
 "phone_number": "",
 "description": "Mobile Web Apps",
 "created_at": "Thu Mar 04 15:41:17 UTC 2010",
 "updated_at": "Sat Dec 18 01:12:47 UTC 2010",
 "overview": "\u003Cp\u003EBasic Description:\u003C/p\u003E\n\n\u003Cp\u003EAegis Mobile provides cms controlled, lbs enabled mobile web applications that operate across carrier and platform to reach over 400 devices targeted by profile.\u003C/p\u003E\n\n\u003Cp\u003EExtended Description:\u003C/p\u003E\n\n\u003Cp\u003EAegis Mobilization - Problem solved and disruption caused\u003C/p\u003E\n\n\u003Cp\u003EBusinesses want to reach the consumers of the mobile web but they don\u0026#8217;t really know what the best way to do that is. By utilizing functionality through mobile browsers  using HTML5, Aegis Mobile is able to provide a user experience that exceeds that of client apps while providing a breadth of reach across over 400 devices across carriers. This is the problem that Aegis Mobile Mobilization solves and it disrupts the mobile community at large by exposing the inefficiencies of client app preponderance and presents a challenge to develop exceptional mobile web applications that function through the browser to provide a more scalable experience across all devices and carriers.\u003C/p\u003E\n\n\u003Cp\u003EMore on the Company and our Mobilization Efforts\u003C/p\u003E\n\n\u003Cp\u003EAegis Mobile\u0026#8217;s Mobilization allows companies of all sizes to take advantage of the diversity of smart phones and feature phones in order to capture business from the exploding number of customers using these devices. Specifically, the Aegis Mobile approach to mobilization brings together the multi-faceted development of mobile websites, mobile apps and mobile marketing campaigns layered together into a strategic mobile solution. While we believe this holistic approach is the most effective way to transition your business to the mobile web, this does not preclude us from performing services in any of these areas:\u003C/p\u003E\n\n\u003Cp\u003EMobile Websites \u003C/p\u003E\n\n\u003Cp\u003EMobilized websites offer the broadest customer reach yet, are built to be device-specific, and require no downloads, installation or altering of the main website address. For example, a franchise of the real estate firm ReMax displays unique design and functionality on a smartphone device versus a feature phone versus a PC, but the user enters the same .com address regardless of device. Examples of popular mobilized websites are YouTube and the Weather Channel. In addition, our development services include testing mobile websites against many different mobile handsets in our device lab.\u003C/p\u003E\n\n\u003Cp\u003EMobile Applications \u003C/p\u003E\n\n\u003Cp\u003ELayered on top of mobile websites are mobile applications. With the rapid and continual rise of the iPhone, Droid and other smartphones and their related app stores, mobile apps are now a critical element in any marketing strategy. Mobile apps enhance the user experience by taking advantage of device capabilities and evolving mobile technology to deliver relevant and timely information. Prime examples of mobile apps include location-based apps which help home buyers locate and learn about properties on the go, or m-commerce apps which enable customers to purchase products and services over their mobile phone.\u003C/p\u003E\n\n\u003Cp\u003EMobile Marketing\u003C/p\u003E\n\n\u003Cp\u003EThe third level of mobilizing your business is executing your mobile marketing plan so you can contact a single consumer with a single, targeted message at exactly the right time.  Although iPhone, Blackberry and Android are propelling the mobile market forward, 70% of mobile users still have basic feature phones, and our mobile marketing plans are designed to reach all these users. In addition, more targeted e-mail, SMS (texting) and location-based services (LBS) can help you provide even more relevant offerings to consumers \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Rich",
      "last_name": "LaPerch",
      "permalink": "rich-laperch",
      "image": null}},
   {"is_past": true,
    "title": "Product Manager",
    "person":
     {"first_name": "Kevin",
      "last_name": "Lenane",
      "permalink": "kevin-lenane",
      "image":
       {"available_sizes":
         [[[150,
            137],
           "assets/images/resized/0014/1745/141745v2-max-150x150.png"],
          [[177,
            162],
           "assets/images/resized/0014/1745/141745v2-max-250x250.png"],
          [[177,
            162],
           "assets/images/resized/0014/1745/141745v2-max-450x450.png"]],
        "attribution": ""}}}],
 "competitions":
  [{"competitor":
     {"name": "UNITY Mobile",
      "permalink": "unity-mobile",
      "image":
       {"available_sizes":
         [[[150,
            79],
           "assets/images/resized/0008/4065/84065v2-max-150x150.png"],
          [[170,
            90],
           "assets/images/resized/0008/4065/84065v2-max-250x250.png"],
          [[170,
            90],
           "assets/images/resized/0008/4065/84065v2-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "Socialize",
      "permalink": "socialize",
      "image":
       {"available_sizes":
         [[[150,
            46],
           "assets/images/resized/0004/2106/42106v7-max-150x150.png"],
          [[250,
            78],
           "assets/images/resized/0004/2106/42106v7-max-250x250.png"],
          [[250,
            78],
           "assets/images/resized/0004/2106/42106v7-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "DC Metro Office",
    "address1": "7070 Samuel Morris Drive",
    "address2": "Suite 200",
    "zip_code": "21046",
    "city": "Columbia",
    "state_code": "MD",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}