{"name": "AEi Systems, LLC",
 "permalink": "aei-systems-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/aei-systems-llc",
 "homepage_url": "http://www.aeisystems.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 11,
 "founded_year": 2002,
 "founded_month": 2,
 "founded_day": 14,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "lee@aeng.com",
 "phone_number": "310-216-1144",
 "description": "Analog Heavy Lifting",
 "created_at": "Mon Sep 06 19:04:22 UTC 2010",
 "updated_at": "Mon Oct 15 10:56:53 UTC 2012",
 "overview": "\u003Cp\u003EAEi Systems is a United States space and power electronics engineering firm based in Las Vegas, Nevada that also has a well-staffed analysis and testing facility in Los Angeles, California.\u003C/p\u003E\n\n\u003Cp\u003EAEi Systems is most well known for its analysis and design of space-bound and other industrial power supplies and power systems \u0026#8211; especially those that must operate reliably under extreme conditions (such as radiation, magnetic fields, heat, and the like) and yet also keep within size and weight limitations.\u003C/p\u003E\n\n\u003Cp\u003EAEi Systems is the world leader in Worst Case Circuit Analysis (WCCA) and failure and reliability analysis for space-bound DC-DC converters.\u003C/p\u003E\n\n\u003Cp\u003EThe company has more recently become known as a designer and supplier of highly specialized radiation-hardened power supplies and related power system circuitry.\u003C/p\u003E\n\n\u003Cp\u003EThe company\u0026#8217;s predecessor, Analytical Engineering, Inc., was founded in 1995. Since 2002, AEi Systems has continued its growth in Worst Case Circuit Analysis and failure and reliability analysis for space-bound DC-DC converters. In addition, the company has more recently become known as a designer and supplier of highly specialized radiation-hardened power supplies and related power system circuitry.\u003C/p\u003E\n\n\u003Cp\u003EThe company has four, inter-related business lines:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EAnalysis: Worst Case Circuit Analysis (WCCA) and failure and reliability analyses.\u003C/li\u003E\n\u003Cli\u003EDesign: Design and licensing or sale of space-bound and other industrial power supplies and related power system circuitry.\u003C/li\u003E\n\u003Cli\u003ESPICE Modeling: Modeling of complex ICs for major manufacturers and to support AEi Systems analysis and design work.\u003C/li\u003E\n\u003Cli\u003ESoftware: Sale of licensed copies of (i) the company\u0026#8217;s Power IC Model Library for PSpice, and (ii) certain WCCA templates and tables.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003ENoteworthy achievements and facts\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EMotorola University\u0026#8217;s \u0026#8220;six sigma class\u0026#8221; on worst case analysis was created by AEi Systems\u003C/li\u003E\n\u003Cli\u003EThe failing design of the LVPS power supply for the Atlas Experiment at the Large Hadron Collider (LHC) at CERN (the world\u0026#8217;s largest and most powerful particle accelerator) was revised and upgraded by AEi Systems\u003C/li\u003E\n\u003Cli\u003EMost SPICE models for Power ICs that electrical engineers find on the Internet were created by AEi Systems, including those found on the websites of ON Semiconductor and Texas Instruments and used via National Semiconductor\u0026#8217;s online Webench tool\u003C/li\u003E\n\u003Cli\u003EAEi Systems analyzed the power buss for the International Space Station\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EDefense and Aerospace Projects\u003C/p\u003E\n\n\u003Cp\u003EAEi Systems has been involved in the development and analysis of some of the most sophisticated and technically challenging power systems in the world, both in the space and defense arena and also with respect to commercial and industrial applications. The company has provided computer simulation models and worst case circuit analysis on most projects. Many projects are \u0026#8220;dark\u0026#8221; but among the company\u0026#8217;s publicly-known projects are:\u003C/p\u003E\n\n\u003Cp\u003EBSAT, CMIS, Globalstar, GMI, Goes, GPS, HS-702, Intellsat, Juno, MCI, Milstar, MSV, MUOS. NPOESS, Omegasat, P1196, P-81, SMMA, SMU, Spaceway, Tempo, Virgo, XPC\u003C/p\u003E\n\n\u003Cp\u003ECommercial and Scientific Projects \u003C/p\u003E\n\n\u003Cp\u003EAEi Systems\u0026#8217; power supply analysis and design expertise has also been sought for commercial and industrial projects not involving space or defense. For example, AEi Systems worked on the following projects (we can name):\u003C/p\u003E\n\n\u003Cp\u003EThe upgrading and revision of the failing design of the LVPS power supply for the Atlas Experiment at the Large Hadron Collider (LHC) at CERN (the world\u0026#8217;s largest and most powerful particle accelerator that \u0026#8220;uncovered\u0026#8221; the Higgs Boson)\u003C/p\u003E\n\n\u003Cp\u003EDarwin (Schilling Robotics), a 100kW Remotely Operated underwater Vehicle (ROV) that operates underneath the North Sea under 17 kPSI at over 6 kM; and \u003C/p\u003E\n\n\u003Cp\u003ECommercial projects for Bosch, DeLL and EMC.\u003C/p\u003E\n\n\u003Cp\u003ESPICE Modeling\u003C/p\u003E\n\n\u003Cp\u003EAEi Systems provides SPICE models to many major IC manufacturers, including Texas Instruments, ON Semiconductor and National Semiconductor. Many can be seen on (and downloaded from) their websites. \u003C/p\u003E\n\n\u003Cp\u003ESince 2005, this business unit has produced and distributed the Power IC Model Library for PSpice, which is distributed by Cadence\u0026#8217;s sole North American distributor (EMA-EDA) in the United States and Canada, and by other major distributors in Asia and Europe.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       114],
      "assets/images/resized/0010/1682/101682v2-max-150x150.jpg"],
     [[250,
       190],
      "assets/images/resized/0010/1682/101682v2-max-250x250.jpg"],
     [[450,
       342],
      "assets/images/resized/0010/1682/101682v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Power IC Model Library for PSpice",
    "permalink": "power-ic-model-library-for-pspice",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Chairman and Co-founder",
    "person":
     {"first_name": "Keith",
      "last_name": "G. Daubenspeck",
      "permalink": "keith-g-daubenspeck",
      "image": null}},
   {"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Charles",
      "last_name": "Hymowitz",
      "permalink": "charles-hymowitz",
      "image": null}},
   {"is_past": false,
    "title": "Managing Director",
    "person":
     {"first_name": "Lee",
      "last_name": "Weinberg",
      "permalink": "lee-weinberg",
      "image":
       {"available_sizes":
         [[[150,
            112],
           "assets/images/resized/0010/0729/100729v2-max-150x150.jpg"],
          [[250,
            187],
           "assets/images/resized/0010/0729/100729v2-max-250x250.jpg"],
          [[450,
            337],
           "assets/images/resized/0010/0729/100729v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003ELMW\u003C/p\u003E"}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "5933 W. Century Boulevard",
    "address2": "Suite 1100",
    "zip_code": "90045",
    "city": "Los Angeles",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://en.wikipedia.org/wiki/AEi_Systems",
    "title": "wikipedia link"},
   {"external_url": "http://www.businesswire.com/news/home/20110111006936/en/AEi-Systems-Completes-GPS-III-Worst-Case",
    "title": "AEi Systems on GPS III for PerkinElmer and Lockheed"},
   {"external_url": "http://www.militaryaerospace.com/index/display/wire-news-display/1504148280.html",
    "title": "Linear Technology Teams with AEi Systems"},
   {"external_url": "http://www.businesswire.com/news/home/20110920005711/en/Linear-Technology-Teams-AEi-Systems-Offer-WCCA",
    "title": "Linear Technology Teams with AEi Systems to Offer WCCA and SPICE Modeling"}]}