{"name": "agardenfloral",
 "permalink": "agardenfloral",
 "crunchbase_url": "http://www.crunchbase.com/company/agardenfloral",
 "homepage_url": "http://www.agardenfloral.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "agardeninc",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "flowers-las-vegas, las-vegas-florist, florist-las-vegas, las-vegas-flowers, las-vegas-florists, flower-shops-in-las-vegas, flower-delivery-las-vegas, las-vegas-flower-delivery, wedding-flowers-las-vegas, las-vegas-wedding-florist, wedding-bouquets-las-veg",
 "alias_list": null,
 "email_address": "marketing@agardenfloral.com",
 "phone_number": "702-419-7525",
 "description": "“A Garden Floral\"",
 "created_at": "Fri Feb 08 08:05:06 UTC 2013",
 "updated_at": "Thu Feb 14 06:19:29 UTC 2013",
 "overview": "\u003Cp\u003E“A Garden Floral” is a professional Las Vegas Florist, which is the choice destination of many when it comes to buying flowers in Las Vegas.\u003C/p\u003E\n\n\u003Cp\u003EThe company has a retail outlet inside the Tropicana Center that sports world-class flower arrangements, floral designs, flower gift baskets and bouquets. \u003C/p\u003E\n\n\u003Cp\u003E“A Garden Floral” was created by well-known Las Vegas florist Audra Danzak. Audra has more than thirty years in the industry as an expert of flowers in Las Vegas. She is a former executive of the MGM Corporation and worked in numerous projects including many outstanding properties on the Las Vegas Strip like the Bellagio and the CityCenter resorts.\u003C/p\u003E\n\n\u003Cp\u003EAudra knows the pulse of the hospitality industry extremely well and when it comes to ordering flowers in Las Vegas, those who know of her, reach for her number when it comes to flowers with style and meaning.\u003C/p\u003E\n\n\u003Cp\u003EThe gift gourmet baskets of A Garden Floral are a delight for connoisseurs, and they are always highly prized for innovativeness in choice of flowers and design of the arrangement.\u003C/p\u003E\n\n\u003Cp\u003EWhen it comes to flowers in Las Vegas, “A Garden Floral” is a professional and full service company that offers it services to special events, banquets, weddings, catering, conventions, and office décor. Whether it’s a small order or a large corporate account, “A Garden Floral” deals with the same professionalism and efficiency.\u003C/p\u003E\n\n\u003Cp\u003EAt the end of the day, as the company declares, delivering beauty with passion and innovativeness is important in the flower industry, and that is what it delivers for its clients \u003C/p\u003E\n\n\u003Cp\u003EThis corporate Las Vegas florist also takes its social responsibility seriously, and as a small business, continues to boost local employment in partnership with other southern Nevada small businesses. Being in the business of flowers in Las Vegas, A Garden Floral makes diversity inclusion and environment-friendliness core values of the organization.\u003C/p\u003E\n\n\u003Cp\u003EDue to Audra’s background in corporate service, “A Garden Floral” has connections in the floral industry, not only across the state and nation, but also across several continents of the world. The company maintains strict legal compliance with all regulations and ensures protection of natural flora and environment as one of its core concerns.\u003C/p\u003E\n\n\u003Cp\u003E“A Garden Floral” is situated in:\u003C/p\u003E\n\n\u003Cp\u003ETropicana Resort, 3801 Las Vegas Boulevard South\nPhone: 702 419 7525; Fax: 702 739 2326; E-mail: orders@agardenfloral.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.agardenfloral.com/",
    "title": "flowers las vegas"},
   {"external_url": "http://www.agardenfloral.com/",
    "title": "las vegas florist"},
   {"external_url": "http://www.agardenfloral.com/",
    "title": "florist las vegas"}]}