{"name": "AgentMatch",
 "permalink": "agentmatch",
 "crunchbase_url": "http://www.crunchbase.com/company/agentmatch",
 "homepage_url": "http://www.agentmatch.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": 2006,
 "founded_month": 6,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "bob@agentmatch.com",
 "phone_number": "",
 "description": "",
 "created_at": "Tue Sep 18 08:00:58 UTC 2007",
 "updated_at": "Wed Apr 13 00:25:27 UTC 2011",
 "overview": "\u003Cp\u003EAgentMatch is leading the way toward a new and vastly superior model of lead generation in the real estate industry.  Currently, the dominant lead generation model is mostly a lose-lose scenario for the consumer and real estate agent.  This model typically entails the consumer providing their contact info blindly, having no real idea what is being done with it.  Their info is then sold to one or more agents, and the agent pays up front for the lead.  The consumer is then contacted by these agents, all of which they know absolutely nothing about, except that they are probably in close proximity to them.  For the agent, payment is made prior to generating any revenue.  It\u0026#8217;s likely that the lead will not convert to a deal for the agent.  For the agent, it\u0026#8217;s a game of chance.  Buy enough leads and if one converts, it more than pays for the leads that didn\u0026#8217;t.  This model is extremely inefficient with respect to the needs/goals of both the consumer and the agent.  RealEstate.com is closing down their version of this model because it simply is not profitable.\u003C/p\u003E\n\n\u003Cp\u003EBy bringing transparency to the interaction between consumer and agent, AgentMatch aims to turn the existing lead generation paradigm on it\u0026#8217;s head, creating a win-win situation for the consumer and agent.  Consumers are able to thoroughly research agents in their area, using search criteria that includes commission, location, sales history, services offered, experience level, and the estimated value of the home they are selling or buying.  AgentMatch allows consumers to see meaningful data about an agent including number of years licensed, distance from the consumer, number of deals the agent has closed in the last 36 months, the agent\u0026#8217;s thirty-six month sales history plotted on a map, along with individual transaction details including address, date sold, and selling price, the agent\u0026#8217;s thirty-six month high, average, and low selling prices, services offered to sellers and buyers, respectively, and the agent\u0026#8217;s commission and estimated fee based on the consumer\u0026#8217;s property value.  Consumers decide when they want to talk with an agent by requesting that an agent contact them.\u003C/p\u003E\n\n\u003Cp\u003EConsumers pay nothing for the AgentMatch service, and an agent can only access the consumer\u0026#8217;s contact info if the consumer requests that the agent contact them.  Agent\u0026#8217;s pay an industry-standard referral fee of 20% to AgentMatch, only when they have closed a deal involving a lead from AgentMatch.\u003C/p\u003E\n\n\u003Cp\u003EAgentMatch is in the very early stages of it\u0026#8217;s Beta version, and is currently focusing on growing membership in California.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       23],
      "assets/images/resized/0000/0904/904v1-max-150x150.png"],
     [[250,
       38],
      "assets/images/resized/0000/0904/904v1-max-250x250.png"],
     [[292,
       45],
      "assets/images/resized/0000/0904/904v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": null,
    "title": "Co-Founder, President \u0026 CTO",
    "person":
     {"first_name": "Bob",
      "last_name": "Teplitsky",
      "permalink": "bob-teplitsky",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": null,
    "address1": "",
    "address2": null,
    "zip_code": "94110",
    "city": "",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}