{"name": "Agency Browser",
 "permalink": "agency-browser",
 "crunchbase_url": "http://www.crunchbase.com/company/agency-browser",
 "homepage_url": "http://www.agencybrowser.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "rwollnitz@agencybrowser.com",
 "phone_number": "61-2-46214368",
 "description": "Agency connection company",
 "created_at": "Wed May 20 00:30:52 UTC 2009",
 "updated_at": "Thu May 21 18:38:05 UTC 2009",
 "overview": "\u003Cp\u003EAgency Browser LTD. ABN # 12013202660712  www.agencybrowser.com is an Australian company based in Sydney. We have developed a unique way to increase Export possibilities for the Primary and Secondary Industries of the world through our website www.agencybrowser.com. The idea is to connect manufacturers with potential agents/distributors. Our website is fully operational; other independent modules that will give further depth to our services are being created offline. The concept has the ability to add Millions of $Dollars to the GDP of the world. The idea is new and does not cost a cent for interested companies to register and very little to implement by any government. \nOur world needs help; any solution to increase production and to help the marketing of   products should be appreciated considering the recession.\u003Cbr/\u003E\nThe G20 should encourage all applicable companies of the world to enter their details into the website. After completion of this input every country could have a poster in every of their embassies stating business opportunities. IT IS FREE! \nThis type of letter was sent to President Obama, Angela Merkel, Gordon Brown, Kevin Rudd, Governor Schwarzenegger and many more. Not one of them replied.\nWe know it does not solve the economic crisis, but it is one avenue to increase world production and the GDP of the world.\nIf you have any questions please do contact us. We suggest you visit our site and see the possibilities for yourself. www.agencybrowser.com.\u003C/p\u003E\n\n\u003Cp\u003EA few words in addition:\nCurrent Situation according to Agency Browser research:\nNearly all manufacturing companies working on 40-60% Capacity, because the market does not absorb any more products in the country. \nThe Capacity is there to increase production for additional Export.\u003C/p\u003E\n\n\u003Cp\u003EEvery 10th person in the world plays with the idea to work for himself during their lifetime, but does give up the idea because of insufficient offers of the local market. \u003C/p\u003E\n\n\u003Cp\u003EOfficial institutions like the Chamber of Commerce is just interested in paying Members and do not deliver any solutions. The same thing happens to the associations and societies.\nA constructive Information Centre through Agency Browser is the answer.\u003C/p\u003E\n\n\u003Cp\u003EGoing to the countries of interest is a very expensive sport. I went 4 times to the Middle East to find an agent for my Engineering company but without luck.\nAgency Browser LTD provides an immediate exposure to the countries a company wants to deal with. We do not discriminate between countries or any other issues presently ruling the earth and the effectiveness of the World Wide Web is a fact. Our website reaches from one corner of the world to the other and we cater for every industry.\u003C/p\u003E\n\n\u003Cp\u003EWhat help do we need from the Governments?\u003C/p\u003E\n\n\u003Cp\u003E1-   The Governments should contact all manufacturing and trading companies/individuals based in the country to register their products/interests with AgencyBrowser.com. A 1% tax incentive could be given to these members if they comply (just a suggestion) because we could then provide the government with an inventory of products/trade options Agency Browser Ltd. has listed. Keeping in mind we will not breach any Privacy or Terms \u0026amp; Conditions of common law and our site rules.\u003C/p\u003E\n\n\u003Cp\u003E2-    The Government could recommend www.agencybrowser.com on all ABN, ATO, ABR forms and approval letters.\u003C/p\u003E\n\n\u003Cp\u003E3-  Business Government Websites could have a link to Agency Browser Ltd.\u003C/p\u003E\n\n\u003Cp\u003E4-     Supply banners should be displayed in all Embassies overseas promoting business/trade possibilities thru AgencyBrowser.com\u003C/p\u003E\n\n\u003Cp\u003E5-     Overall we would like the support of the Governments behind our site.\u003C/p\u003E\n\n\u003Cp\u003EThat is the concept. \u003C/p\u003E\n\n\u003Cp\u003EYours faithfully,\nRolf Wollnitz\nDirector\nAgency Browser LTD\nrwollnitz@agencybrowser.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Agency Browser Ltd.",
    "address1": "16 Heritage Heights Circuit",
    "address2": "",
    "zip_code": "2560",
    "city": "St Helens Park",
    "state_code": null,
    "country_code": "AUS",
    "latitude": -34.103392,
    "longitude": 150.804956}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}