{"name": "Agencourt Biosciences",
 "permalink": "agencourt-biosciences",
 "crunchbase_url": "http://www.crunchbase.com/company/agencourt-biosciences",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Mon Jun 17 02:39:26 UTC 2013",
 "updated_at": "Mon Jun 17 04:21:23 UTC 2013",
 "overview": "\u003Cp\u003EAgencourt Bioscience Corporation provides nucleic acid purification products and genomic services for life science research in the United States and internationally. It offers DNA purification and RNA purification solutions. The company’s products include solid phase reversible immobilization (SPRI) reagents; a PCR1 purification system that delivers DNA; a dye-terminator removal process system; a paramagenetic bead-based plasmid purification system; and a genomic DNA isolation reagent kit. Its products also include Agencourt FormaPure system that provides a process for extracting nucleic acid from formalin-fixed and paraffin-embedded tissue samples; a tissue RNA extraction technology; accessories; and a suite of automation methods for SPRI paramagnetic bead-based reagents. In addition, the company offers DNA sequencing, resequencing and SNP discovery, library construction, bioinformatics, and sequencing pipeline services. It serves biotechnology, pharmaceutical, government, and academic research laboratories. Agencourt Bioscience Corporation has strategic alliances with Affymetrix Inc.; Amplicon Express, Inc.; Seradyn, Inc.; Invitrogen, Corp.; Integrated Genomics, Inc.; and Ambion, Inc. The company was founded in 2000 and is headquartered in Beverly, Massachusetts. It has offices in Australia, Canada, China, Eastern Europe, the Middle East, North Africa, France, Germany, Hong Kong, Italy, Japan, Mexico, the Netherlands, Singapore, South Africa, Sub-Saharan Africa, Spain, Sweden, Switzerland, Taiwan, Turkey, the United Kingdom, and the United States\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Marc",
      "last_name": "Rubenfield",
      "permalink": "marc-rubenfield",
      "image":
       {"available_sizes":
         [[[140,
            140],
           "assets/images/resized/0027/5828/275828v1-max-150x150.jpg"],
          [[140,
            140],
           "assets/images/resized/0027/5828/275828v1-max-250x250.jpg"],
          [[140,
            140],
           "assets/images/resized/0027/5828/275828v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}