{"name": "Ahaishopping",
 "permalink": "ahaishopping",
 "crunchbase_url": "http://www.crunchbase.com/company/ahaishopping",
 "homepage_url": "http://www.ahaishopping.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 200,
 "founded_year": 2008,
 "founded_month": 1,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dresses-for-women, wholesale-korean-clothing, cheap-clothes-online-shopping",
 "alias_list": null,
 "email_address": "Ahaishopping@gmail.com",
 "phone_number": "+8615922607024",
 "description": "womens fashion clothing",
 "created_at": "Mon Oct 22 03:33:02 UTC 2012",
 "updated_at": "Fri Oct 26 18:11:07 UTC 2012",
 "overview": "\u003Cp\u003EAhaIshopping.com was one of the web\u0026#8217;s first online stores and has been helping the fashion-conscious look fabulous since 2008. Based in Guangdong, AhaIshopping offers the lastest street style dresses,coats,boots\u0026amp;more.\u003C/p\u003E\n\n\u003Cp\u003EIf you\u0026#8217;re tired of going out and finding someone else with the exact same outfit,or if you’re looking for a new, fresh look that nobody else has then you’re at the right place. We offer the latest(Almost daily) in women’s fashion from the high-streets of London,paris,Tokyo,Shanghai\u0026amp;New York at a price you can afford.\u003C/p\u003E\n\n\u003Cp\u003EOur target audience is the fashion conscious 18-35 women\u0026#8217;s wear market. We aim to be exciting and innovative, offering our customers the fashions they want, when they want. To stay in touch with the ever changing trends within our market we have developed a dynamic and very responsive organisation.\u003C/p\u003E\n\n\u003Cp\u003EWe realise the most important part of our success is our customer. This is why we are focused on delivering an exciting shopping experience and making sure that our high standards of quality, value for money and service are always met.\u003C/p\u003E\n\n\u003Cp\u003EOur buying and design team develop our own styles and bring the latest street fashions from the high-streets of London,paris,Tokyo,Shanghai\u0026amp;New York quickly to the shop floor. This fast, flexible supply chain, together with the winning formula of style, quality, value and service has enabled AhaIshopping to grow rapidly into a super international retailer.\u003C/p\u003E\n\n\u003Cp\u003ELed by a team of highly dedicated and motivated group of individuals we are firmly focused on our customer\u0026#8217;s needs. We hope that with continuous developments and innovation we will continue to expand and bring our unique experience to shoppers throughout the world.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}