{"name": "Aidan Products, LLC",
 "permalink": "aidan-products-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/aidan-products-llc",
 "homepage_url": "http://www.stem-kine.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "stem-cell-therapies, stem-cell-nutrition, stem-cell-enhancer, stem-cell-supplement, stem-cells-treatments",
 "alias_list": null,
 "email_address": "aidan@aidanproducts.com",
 "phone_number": "480-756-8900",
 "description": "stem cell therapies",
 "created_at": "Thu Jan 06 06:58:03 UTC 2011",
 "updated_at": "Fri Jan 14 05:22:29 UTC 2011",
 "overview": "\u003Cp\u003EStem-Kine is not a drug. Rather it is a food supplement that increases the number of circulating stem cells. These stem cells, called \u0026#8220;circulating stem cells\u0026#8221;, are responsible for the regeneration and repair of damaged tissues.\u003C/p\u003E\n\n\u003Cp\u003ECompany Overview: \u003C/p\u003E\n\n\u003Cp\u003EAidan Products was founded in 2001 by Neil Riordan, PhD, a renowned research scientist with an interest in alternative medicine. Dr. Riordan has held leadership positions at leading research institutes, including a ten year tenure at the Center for the Improvement of Human Functioning and the Bio-Communications Research Institute in Wichita, Kansas, where he collaborated with his father, Hugh Riordan MD, a world renowned cancer researcher, and a group of other dedicated scientists to finding alternative therapies for cancer. In addition to his important cancer research surrounding the use of Vitamin C as a cancer therapy\u003C/p\u003E\n\n\u003Cp\u003EDr. Riordan founded the Institute for Cellular Medicine in Costa Rica, dedicated to the administration of stem cell therapies and treatments using safe, non-controversial adult stem cells on a fee-for-service basis and expanded these services in Panama in 2009. During this time, he has collaborated with some of the top stem cell scientists in the world.\u003C/p\u003E\n\n\u003Cp\u003EThrough his research, Dr. Riordan has discovered molecules that stimulate the mobilization of stem cells sourced from the bone marrow and the prolonged increase in the number of circulating stem cells for an extended period of time. These discoveries let to the development of Stem-Kine. While Stem-Kine is currently available on a limited basis, a full product launch is expected in early 2010.Stem cell supplement and stem cell nutrition has been developed to increase the circulation of stem cells for an extended period of time. It is a food Supplement which contains all natural ingredients and has no reported side effects.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0011/6349/116349v2-max-150x150.jpg"],
     [[250,
       65],
      "assets/images/resized/0011/6349/116349v2-max-250x250.jpg"],
     [[312,
       82],
      "assets/images/resized/0011/6349/116349v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.stem-kine.com",
    "title": "Stem Cell Enhancer, Supplement \u0026 Treatments"}]}