{"name": "Ain Corp",
 "permalink": "ain-corp",
 "crunchbase_url": "http://www.crunchbase.com/company/ain-corp",
 "homepage_url": "http://www.indiamart.com/ain-corp/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ain-corp@tradepassport.org",
 "phone_number": "9849053521",
 "description": "CCTV Cameras, Alarm Systems",
 "created_at": "Wed Apr 03 14:53:10 UTC 2013",
 "updated_at": "Wed Apr 03 19:00:51 UTC 2013",
 "overview": "\u003Cp\u003EAin Corp.(A pan India presence) is a partnership based business venture, which came into existence at Hyderabad, Andhra Pradesh in the year 1999. Our rich industrial experience and extensive expertise of the domain has enabled us to establish ourselves as a renowned manufacturer, wholesaler, supplier and exporter of a vast array of CCTV Cameras, Alarm Systems, Door Phones, Access Control \u0026amp; Time Reporters and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are backed by a robust infrastructure, which ensure streamlined execution of each business related process. Our manufacturing unit is operational with technologically advanced machines and equipment, which enables us to produce international range of products for the clients. Our capacious warehouse facility enables us to maintain proper stocks of manufactured products.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a team of talented and experienced professionals, who endeavor to provide best customized solutions to clients as per their specific needs. These professionals work with complete dedication to render complete satisfaction to clients in every aspect. Our production engineers and technicians are well aware of intricacies involved in manufacturing process, which enables them to develop immaculate products.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe strictly adhere to prescribed industrial guidelines in our manufacturing process to deliver highly reliable and durable products in the market. Our quality controllers maintain strict vigilance on the entire production process to ensure maximum benefits of the clients. We practice stringent quality control program throughout our business related processes right from the procurement process till the final stage of packaging.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric company, we focus to render maximum level of satisfaction to our valued patrons. Our manufactured products are quality tested and meet international quality standards. We ensure all the orders are timely processed are delivered to clients within the predetermined time frame. Our ethical business practices enable us to maintain a genial relationship with clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7385/247385v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7385/247385v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7385/247385v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.indiamart.com/ain-corp/",
    "title": ""}]}