{"name": "Airotek",
 "permalink": "airotek",
 "crunchbase_url": "http://www.crunchbase.com/company/airotek",
 "homepage_url": "http://www.indiamart.com/airotek-kolkata/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "airotek-kolkata@tradepassport.org",
 "phone_number": "9433409491",
 "description": " manufacturer and supplier",
 "created_at": "Fri Apr 05 11:08:38 UTC 2013",
 "updated_at": "Fri Apr 05 11:08:42 UTC 2013",
 "overview": "\u003Cp\u003EAirotek started operations in the year 2004 and with time has managed to establish itself as the leading manufacturer and supplier of The product range consists of Air Curtain, Strip Curtain and Insect Killer Machine. These products have helped us to create formidable position in the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are able to provide quality range of Air Curtain, Strip Curtain and Insect Killer Machine to our clients due to our sophisticated infrastructure. Our infrastructure is segregated into various units that enable hassle free manufacturing of Air Curtain, Strip Curtain and Insect Killer Machine. Equipped with latest machines and tools, our infrastructure is managed by a well experienced team of professionals. Our complete team is well versed in its respective departments that work in close coordination to offer world class range of products to our clients.   \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality is considered as one of the indicators of success of every organization. Having quality oriented approach, we have become a renowned manufacturer of Air Curtain, Strip Curtain and Insect Killer Machine. We are backed by a team of quality controllers, which keep its vigil eye over entire manufacturing process to ensure international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe highly skilled team of professionals comprises of Procuring agents, R\u0026amp;D experts etc. The market experience and industrial knowledge of these professionals has enabled us to target the consumers in right manner and to earn maximum profit. They keep a close vigil on even the minor changes taking place in industry and ensure that their plans are planned accordingly.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are classified as top most names involved in manufacturing and supplying of Air Curtains, Strip Curtains and many more. We supply high quality products at market competitive prices. This helps us to gain a large client base.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8556/248556v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8556/248556v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8556/248556v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}