{"name": "AIT Partnership Group",
 "permalink": "ait-partnership-group",
 "crunchbase_url": "http://www.crunchbase.com/company/ait-partnership-group",
 "homepage_url": "http://www.ait-pg.co.uk/",
 "blog_url": "http://www.csdigitalsignage.com/",
 "blog_feed_url": "http://www.aitdirect.co.uk/",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "data-centre, data-centre-infrastructure-management, data-centre-audit, wireless-networks, wireless-point-to-point, digital-signage",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Technical Services Company",
 "created_at": "Wed Jun 27 15:17:33 UTC 2012",
 "updated_at": "Wed Jun 27 21:44:37 UTC 2012",
 "overview": "\u003Cp\u003EFormed in 2002 by a dedicated team of industry experts, AIT Partnership Group Ltd is a leading provider of specialist technical knowledge and system integration services for data centre facilities, wireless \u0026amp; network infrastructures and digital signage. Services include; data centre design and auditing, and data centre infrastructure management (DCIM) software, network switching, wireless LAN, point-to-point laser and microwave links, real time location asset tagging and digital signage solutions.\u003C/p\u003E\n\n\u003Cp\u003ELocated in the UK, AIT continues to grow a successful business based on strong relationships with customers and suppliers. An independent trusted source of information to many of the largest UK businesses and multinationals, AIT constantly strives to provide both the highest quality of services and support and the keenest possible pricing.\nMission Statement\u003C/p\u003E\n\n\u003Cp\u003EAIT is committed to providing our customers with the best impartial advice, competitive pricing and expert technical support helping them control, connect and communicate efficiently.\u003C/p\u003E\n\n\u003Cp\u003EWe are dedicated to building a long-term business based on strong relationships with customers, suppliers and staff by continuously improving the quality of our services and support. \nOur Team\u003C/p\u003E\n\n\u003Cp\u003EAt AIT we are proud of our team.  The core of the team have been in the IT and networking industry for many, many years (probably too many!).  As well as general networking and infrastructure knowledge we have specialists in data centre design and audit, data centre power efficiency and cooling, wireless networking and AV/digital signage technologies.\u003C/p\u003E\n\n\u003Cp\u003EThe biggest department in our organisation is the engineering team, which tells you a lot about what’s important to AIT - superb technical services to ensure our customers always get the best, fully supported solution.\u003C/p\u003E\n\n\u003Cp\u003EGive AIT a call on 0845 017 7017 today and discover for yourself how our good honest advice and expertise can help your business run more efficiently and save you money.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       68],
      "assets/images/resized/0019/7677/197677v2-max-150x150.jpg"],
     [[250,
       113],
      "assets/images/resized/0019/7677/197677v2-max-250x250.jpg"],
     [[300,
       136],
      "assets/images/resized/0019/7677/197677v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Reading",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}