{"name": "AJ Consulting",
 "permalink": "aj-consulting",
 "crunchbase_url": "http://www.crunchbase.com/company/aj-consulting",
 "homepage_url": "http://www.ajconsultingcloud.com",
 "blog_url": "http://ajconsulting.tumblr.com/",
 "blog_feed_url": "",
 "twitter_username": "ajconsultingme",
 "category_code": "software",
 "number_of_employees": 12,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cloudtv, sociotactics, aj, social-media, gamification, monetization, cloud, mobility",
 "alias_list": null,
 "email_address": "info@ajmanagementconsulting.com",
 "phone_number": "9174754680",
 "description": "AJ Consulting",
 "created_at": "Sat Oct 20 04:58:47 UTC 2012",
 "updated_at": "Mon Oct 29 06:06:41 UTC 2012",
 "overview": "\u003Cp\u003ELet’s keep it simple. It’s just who we are.\nInnovation, creativity and simplicity are the lifeblood of AJ Consulting. Our team is composed of people who thrive on creative challenges and the opportunity to build original platforms, apps and gamified experiences that are truly innovative. \u003C/p\u003E\n\n\u003Cp\u003EWe like to keep things simple at AJ. And that’s why we just couldn’t resist the cloud. Technology is constantly evolving and small, dynamic companies like us are having a real impact on our clients’ businesses by delivering the best tech possible combined with loads of creative energy. Enabling our clients to unlock the potential of mobility and social networks by proposing cutting edge cloud-based solutions is what we at AJ Consulting do best. It’s a good thing too, because we love doing it. \u003C/p\u003E\n\n\u003Cp\u003EAnother thing we love to do is cut out the middle man. What use is a platform or product that can only be operated by programmers and IT departments? We put our creative geniuses and technology \u0026#8220;rock stars\u0026#8221; to work to build solutions that can be used directly by the individuals in your business. Call us crazy but it just seems simpler this way. \u003C/p\u003E\n\n\u003Cp\u003ENot one size fits all.\nEach industry is different and has its own set of challenges. It’s why we are actively creating solutions to match the varying needs of each.\u003C/p\u003E\n\n\u003Cp\u003E• CloudTV is our end-to-end platform that gives Media \u0026amp; TV companies the key to unlocking the potential of second screen viewers and social media\u003C/p\u003E\n\n\u003Cp\u003E• Cloud Lighthouse is a state-of-the-art cloud platform focused on the Destination Management Industry (DMCs) and its wider eco-system. \n• The SocioTactics platform enables brands to know and connect with their customer base online and turn those customers into online brand advocates.\n• Small and medium sized businesses are able to utilize our DukkanArabia.com solution to Replace 10+ systems with one that runs on the cloud! Have a sophisticated website integrated with CRM, sell products and services online, create their business process workflows, marketing campaigns, and much more all with just a few clicks.\nFurther customizations can be made to any part of our platforms to suit the specific wants and needs of each organization. On top of that our teams are just chomping at the bit to build fully customized, original apps and gamified experiences that will blow your customers away. In addition to our industry-specific platforms we like to develop apps and games that are sold directly to customers online. Pure creative fun. \nWe are not alone on our cloud.\u003Cbr/\u003E\nAJ Consulting has enjoyed working with a wide panel of clients over the years (see below for an impressive array of client logos). We are proud to have presented so many companies with the right solutions and platforms that have enabled them to drive business value using cloud technology. Our expertise, thirst for innovation, and track record have opened the doors to key partnerships with Salesforce.com, Adobe, Lucid and Dokkanokom.com. We are excited to be able to draw on such visionary partners to continually bring our clients and customers the very best technology on offer today and tomorrow. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[50,
       50],
      "assets/images/resized/0021/7528/217528v2-max-150x150.png"],
     [[50,
       50],
      "assets/images/resized/0021/7528/217528v2-max-250x250.png"],
     [[50,
       50],
      "assets/images/resized/0021/7528/217528v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Anas",
      "last_name": "Shanti",
      "permalink": "anas-shanti",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$100k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 100000.0,
    "raised_currency_code": "USD",
    "funded_year": 2010,
    "funded_month": 1,
    "funded_day": 1,
    "investments":
     [{"company": null,
       "financial_org": null,
       "person":
        {"first_name": "Jim",
         "last_name": "Hensley",
         "permalink": "jim-hensley",
         "image": null}}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "New York",
    "address1": "250 Park Avenue",
    "address2": "",
    "zip_code": "10177",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        74],
       "assets/images/resized/0021/6452/216452v2-max-150x150.jpg"],
      [[250,
        123],
       "assets/images/resized/0021/6452/216452v2-max-250x250.jpg"],
      [[450,
        222],
       "assets/images/resized/0021/6452/216452v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}