{"name": "Ajanta Tube",
 "permalink": "ajanta-tube",
 "crunchbase_url": "http://www.crunchbase.com/company/ajanta-tube",
 "homepage_url": "http://www.indiamart.com/ajantatubesalescorporation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ajantatubesalescorporation@tradepassport.org",
 "phone_number": "9967200973",
 "description": "Importers, Stockists and Dealers ",
 "created_at": "Thu Apr 04 15:37:41 UTC 2013",
 "updated_at": "Thu Apr 04 15:37:45 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in year 1980, we, “Ajanta Tube Sales Corporation”, are recognized as an eminent organization engaged in importing and stocking Pipes, Tubes, Round Bars and Metal Plates. The range of pipes and tubes offered by us includes Stainless Steel Square Pipe, M.S. Square Pipes, Square Pipes, Boiler Tubes, EN Series Bar, E N series Round and many more. All these products are procured from the authentic vendors of the market, who strictly follow the guidelines of the industry at every stage of production.\u003C/p\u003E\n\n\u003Cp\u003EAim / Vision / Mission:\nOur Mission is to efficiently and effectively provide our customers with complete satisfaction through quality products, services \u0026amp; technical support.\u003C/p\u003E\n\n\u003Cp\u003EOur Manpower;\nThe Team Consists of \u0026#8220;Mr. Sakib Sikander.H.Khan\u0026#8221; and his Team who has got the good experience of metal industry and metal products. We are supported by a team of experienced professionals at every level of trade activities. All these professionals are appointed after rigorous selection process, which is followed by a personal interview with the candidate. The professionals selected by us, posses vast experience and knowledge of the industry, which they use while completing the tasks assigned to them. \u003C/p\u003E\n\n\u003Cp\u003EWarehousing and Packaging:\nWe have a large and capacious warehousing unit that helps us in storing our wide range of products in a proper and safe manner. This unit is further segregated into various sections to keep the entire range of products as per its category. Our warehouse is looked after by a skilled team of warehousing professionals, who take every possible step to maintain the unit. This unit is also free from dust, connected with major transportation and have proper ventilation.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nBacked by the most reliable vendors of the market, we are instrumental in in importing and stocking Pipes, Tubes, Round Bars and Metal Plates. All our vendors strictly follow the the norms and standards of the industry while manufacturing these products.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nSince our foundation is laid, we are paying top most priority to the quality standard of Pipes, Tubes, Round Bars and Metal Plates, which we are offering. Offered pipes and tubes are procured from the authorized vendors of the market, who strictly follow the established norms and standards of the industry while manufacturing these products.http://www.indiamart.com/ajantatubesalescorporation/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8039/248039v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8039/248039v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8039/248039v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}