{"name": "AKIO",
 "permalink": "akio",
 "crunchbase_url": "http://www.crunchbase.com/company/akio",
 "homepage_url": "http://www.akio.com",
 "blog_url": "http://relationclientmulticanal.com",
 "blog_feed_url": "http://www.relation-client-multicanal.com/",
 "twitter_username": "Akio_Software",
 "category_code": "software",
 "number_of_employees": 50,
 "founded_year": 1999,
 "founded_month": 11,
 "founded_day": 30,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "customer-experience",
 "alias_list": null,
 "email_address": "ntiebaux@akio.fr",
 "phone_number": "+33153206380",
 "description": "Customer Experience Management Software",
 "created_at": "Wed Jul 25 00:20:43 UTC 2012",
 "updated_at": "Tue Sep 18 13:53:57 UTC 2012",
 "overview": "\u003Cp\u003ESince 2000, Akio has been the leader in customer interaction management  solutions in France with well over two hundred clients and several thousand end users.\u003C/p\u003E\n\n\u003Cp\u003EIn 1999 AKIO was born from the success of an inbound emails management solution especially developed for an industrial group and from a growing business interest in these solutions. Indeed, companies’ websites were facing an overload of emails, and a large number of them were looking to implement powerful and intelligent tools to better and faster respond to their customers.\u003C/p\u003E\n\n\u003Cp\u003EThrough a close cooperation with its customers and its partners, Akio effectively managed to evolve its leading product, Akio Mail Center (AMC), to offer existing and future clients a solution that perfectly answer their needs. After eight years of existence, AKIO now proposes a complete and multi-channel Web contacts management solution. Akio Interaction Center manages email, chat, web call-back, sms, fax, mail, web self-service and now VoIP and ToIP.\nCIM vision (Customer Interaction Management)\u003C/p\u003E\n\n\u003Cp\u003EThe Internet revolutionized Customer Relationships by bringing proximity and an all-in-oneness environment. Presently, an Internet user can buy goods and services anytime, anywhere in just a few seconds. The customer expects a level of reactivity compliant to the power of the Internet.\u003C/p\u003E\n\n\u003Cp\u003EThe first incoming emails management tools have resulted from this new need. Chat and Web SelfService channels have first developed as a natural extension from the Web, prior to SMS technologies linked to a new mobility age. More traditional channels such as mail, fax and telephone are now competing with these new channels but remain very popular, more than ever.\u003C/p\u003E\n\n\u003Cp\u003EA specific channel isn’t designed to replace another one but to supplement it. Each channel has its own objectives, which explains why today companies are more and more keen to provide their customers with a choice of channels according to their queries and needs when it comes to contacting customer services.\nThis is when we can move  from a Multichannel contacts Management concept  to an  integrated concept of Customer Interaction Management. This is a matter of centralizing into one single tool all the contact channels around a single knowledge base, in order to enable a more consistent message from a company and also to get a very accurate and panoramic view of customers (interactions history, customer file\u0026#8230;).\nOur proposal\u003C/p\u003E\n\n\u003Cp\u003EThanks to our in-depth knowledge about  incoming emails management and our extremely pragmatic approach of the market, developed by working closely with our clients and our innovating R\u0026amp;D department, we are able to offer you the following benefits:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EProvide you with the relevant tools to achieve an excellent quality of service along with a strong knowledge of your existing customers and business prospects\n\nManage all your communication channels and integrate them\n\nAnswer your specific activity needs linked to your contacts management by offering packs dedicated to your sector of activity\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EAs a result, you will achieve a maximum reactivity while enhancing your quality of service and you will be able to monitor your activity most efficiently.\u003C/p\u003E\n\n\u003Cp\u003EAKIO, beyong Customers expectations !\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       90],
      "assets/images/resized/0021/0680/210680v2-max-150x150.jpg"],
     [[205,
       123],
      "assets/images/resized/0021/0680/210680v2-max-250x250.jpg"],
     [[205,
       123],
      "assets/images/resized/0021/0680/210680v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Akio Unified Interaction Center",
    "permalink": "akio-unified-interaction-center",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Akio Software",
    "address1": "43 rue de Dunkerque",
    "address2": "",
    "zip_code": "75010",
    "city": "PARIS",
    "state_code": null,
    "country_code": "FRA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}