{"name": "Akriti Softwares",
 "permalink": "akriti-softwares",
 "crunchbase_url": "http://www.crunchbase.com/company/akriti-softwares",
 "homepage_url": "http://www.akritisoftwares.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "akritisoftwares",
 "category_code": "software",
 "number_of_employees": 70,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software, outsourcing, -net, application, php, development, web, company, india",
 "alias_list": null,
 "email_address": "info@akritisoftwares.com",
 "phone_number": "911204233835",
 "description": "PHP Development company India",
 "created_at": "Mon Jan 09 15:29:18 UTC 2012",
 "updated_at": "Fri Jan 13 00:42:13 UTC 2012",
 "overview": "\u003Cp\u003EAkriti Softwares have expertise in web application development, Mobile application development, custom software development, e-commerce application development,web designing, search engine optimization and SEO services.We are now recognized throughout the world as a cutting edge software outsourcing company. Our expertise in web development and SEO services has received exposure in leading media outlets including \nAkriti Softwares is one place where you go for all your visual design needs. Our designers possess many years of experience for clean, creative \u0026amp; organized content which gives a website intuitive navigation, and visual appeal. We look closely at how best to convey the essence of your business, the most appropriate layout of the site, ease of navigation, usage of and balance between graphics and text and even the quality and style of language and expression used.\u003C/p\u003E\n\n\u003Cp\u003EUsing advanced as well as standard web development tools, we craft your ideas into live web sites quickly and flawlessly in accordance with current web standards. In order to ensure your website\u0026#8217;s marketability, we always optimize each and every site for search engine performance. We have a dynamic team with extensive experience who deliver creative design and custom coding at very competitive prices. We have many satisfied customers and long term partners around the world. You can always rely on our advice and directions for the best implementation of your ideas online. We\u0026#8217;re not just web site developers - we\u0026#8217;re your consultant and assistant. Our technical support, Website Development service, up gradation services are recognized by our customers \u0026amp; our prompt responsiveness has earned us good name \u0026amp; trust among our customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       131],
      "assets/images/resized/0016/9375/169375v2-max-150x150.jpg"],
     [[171,
       150],
      "assets/images/resized/0016/9375/169375v2-max-250x250.jpg"],
     [[171,
       150],
      "assets/images/resized/0016/9375/169375v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Akriti Softwares",
    "address1": "C-262,Sector-63, Noida, New Delhi-59",
    "address2": "",
    "zip_code": "110059",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}