{"name": "Al-Amood Engineering",
 "permalink": "al-amood-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/al-amood-engineering",
 "homepage_url": "http://www.alamoodengineering.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "alamood",
 "category_code": "public_relations",
 "number_of_employees": 15,
 "founded_year": 2002,
 "founded_month": 7,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "telecommunicationsitengineeringiraq",
 "alias_list": null,
 "email_address": "info@alamoodengineering.com",
 "phone_number": "+964(0)790-315-5118",
 "description": "IT Services and Solutions",
 "created_at": "Sat Jun 06 11:43:02 UTC 2009",
 "updated_at": "Mon Jun 08 21:57:36 UTC 2009",
 "overview": "\u003Cp\u003EQ. Al-Amood Engineering offers extensive Information Technology services and solutions for Government Technical Department Public Works and Corporate customers.\nOur highly-skilled team of experienced and Personality-validated Engineers has helped us to become specialist in providing high level for many ministries and important department in the Government IT engineering solutions.\nFrom secure networks to mobile command systems, Q. Al-Amood Engineering understands the challenges and solutions required to provide high-secure and sensitive data networks.\nQ. Al-Amood Engineering maintains a staff of engineers in multiple IT disciplines, including several industry certifications.\u003C/p\u003E\n\n\u003Cp\u003EOur IT Services and Solutions team provides focused Information Technology Consulting and Operations and Maintenance of integrated network solutions such as operational data centers, national network infrastructure and turn-key network design and installation.\u003C/p\u003E\n\n\u003Cp\u003EDesign, installation and integration of network infrastructure, including structured cabling, is another area of concentration where we specialize in fiber optic design and installation.\u003C/p\u003E\n\n\u003Cp\u003EOur Systems Engineering team provides advanced solutions to Systems Automation, SCADA, telemetry and process automation through our partnerships with industry leaders such as Danfoss and Flowcon Our automation solutions range from advanced digital water treatment systems to flow control solutions and monitoring systems for Oil \u0026amp; Gas.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}