{"name": "Recruitment Agencies in Pakistan, Employment Agencies Pakistan",
 "permalink": "alahad-group-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/alahad-group-pvt-ltd",
 "homepage_url": "http://www.alahadrecruitmentgroup.com",
 "blog_url": "http://alahadgroup.wordpress.com",
 "blog_feed_url": "http://www.alahadgroup.com",
 "twitter_username": "ALAHAD",
 "category_code": "consulting",
 "number_of_employees": 480,
 "founded_year": 2005,
 "founded_month": 8,
 "founded_day": 14,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "recruitment-agencies-in-pakistan, employment-agencies-pakistan, manpower-agencies-pakistan, staffing-agencies-pakistan, manpower-recruitment-agencies, companies, consultants-in-pakistan, manpower-staffing-companies-pakistan, overseas-manpower-suppliers-in",
 "alias_list": null,
 "email_address": "Projects@alahadgroup.com",
 "phone_number": "+923218929090",
 "description": "Employment Agencies Pakistan",
 "created_at": "Tue Jan 19 12:16:22 UTC 2010",
 "updated_at": "Sat Mar 23 12:31:09 UTC 2013",
 "overview": "\u003Cp\u003EAlahad Group (Pvt) Ltd. Pakistan\u0026#8217;s #1 Manpower Recruitment Group is committed to excellence in the professional recruitment services, We work in close partnership with selected Recruitment Agencies from Pakistan, India, Sri Lanka, Nepal, Bangladesh, Philippines, Thailand, Taiwan, Malaysia, Indonesia and Vietnam who understand our business, culture, values and are therefore able to represent our Group to clients those meet our specific business needs. To ensure that this process is effectively managed we operate to a preferred supplier list of recruitment partners who can support our resourcing requirements either geographically or by specialist areas. \u003C/p\u003E\n\n\u003Cp\u003ERecruitment Agencies, Employment Agencies, Manpower Agencies, Staffing Agencies Pakistan\nWe strive to deliver the best recruiting experience to our clients from all over the world, Alahad Group is the largest source of the Recruitment Agencies including Accounting Auditing Recruitment Agencies, Administration Recruitment Agencies, Advertising Recruitment Agencies, Airlines Aviation Recruitment Agencies, Architecture Recruitment Agencies, Automotive Recruitment Agencies, Banking Recruitment Agencies, Business Support Recruitment Agencies, Construction Recruitment Agencies, and many more. Employer choices from some of the best professional services around, like Permanent Manpower Recruitment Services, Dedicated Offshore Recruitment Services, Elite Recruitment Services, Research Specialist Services, Passive Search Services and Headhunting Services. Using our site, employers enjoy a number of opportunities to find the best employees for the shortest period of time. Alahad Group services feature a high level of transparency, security, flexibility and scalability for both employers \u0026amp; employees. All infrastructure and personnel are at your dedicated service as long as you need them for a fixed fee. Alahad Group is a good choice if you need a team of highly qualified recruitment professionals that will exactly match your company needs.\u003C/p\u003E\n\n\u003Cp\u003EBenefits of working with Alahad Group?\nEvery day at Alahad Group, we stake our reputation on providing our clients with the most highly qualified professionals that fit the unique requirements of each position. We utilize our proprietary recruiting initiatives, the Internet, networking, campus outreach, job boards, professional organizations, advertising, headhunting services and career fairs. Our recruitment team works diligently to source professionals who can be successfully placed. Select from these categories: Accounting Auditing Recruitment Agencies, Administration Recruitment Agencies, Advertising Recruitment Agencies, Airlines Aviation Recruitment Agencies, Architecture Recruitment Agencies, Automotive Recruitment Agencies, Banking Recruitment Agencies, Business Support Recruitment Agencies and Construction Recruitment Agencies.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       25],
      "assets/images/resized/0007/3938/73938v8-max-150x150.jpg"],
     [[250,
       42],
      "assets/images/resized/0007/3938/73938v8-max-250x250.jpg"],
     [[267,
       45],
      "assets/images/resized/0007/3938/73938v8-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Abid",
      "last_name": "Sharif",
      "permalink": "abid-sharif",
      "image": null}},
   {"is_past": true,
    "title": "Chairman ",
    "person":
     {"first_name": "Ahad",
      "last_name": "Sharif",
      "permalink": "ahad-sharif",
      "image": null}},
   {"is_past": true,
    "title": "Group CEO",
    "person":
     {"first_name": "Muhammad",
      "last_name": "Sharif",
      "permalink": "muhammad-sharif",
      "image": null}},
   {"is_past": true,
    "title": "Executive Director",
    "person":
     {"first_name": "Dr.",
      "last_name": "Naseem Sharif",
      "permalink": "dr-naseem-sharif",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "DHA Phase II",
    "address2": "",
    "zip_code": "75300",
    "city": "Karachi",
    "state_code": null,
    "country_code": "PAK",
    "latitude": 24.8306132,
    "longitude": 67.0717529}],
 "milestones":
  [{"description": "We strive to deliver the best recruiting experience to our clients from all over the world, Alahad Group is the largest source of the Recruitment Agencies including Accounting Auditing Recruitment Agencies, Administration Recruitment Agencies, Advertising",
    "stoned_year": 2011,
    "stoned_month": 12,
    "stoned_day": 4,
    "source_url": "http://www.alahadrecruitmentgroup.com",
    "source_text": null,
    "source_description": "Recruitment Agencies in Pakistan, Manpower Agencies Pakistan",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Recruitment Agencies in Pakistan, Employment Agencies Pakistan",
      "permalink": "alahad-group-pvt-ltd"}}],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"420\" height=\"315\" src=\"http://www.youtube.com/embed/qNKLwdA1H7M\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003ERecruitment Agencies in Pakistan, Manpower Agencies Pakistan, Employment Agencies Pakistan\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.alahadgroup.com",
    "title": "Recruitment Agencies, Employment Agencies, Manpower Agencies, Staffing Agencies Pakistan"}]}