{"name": "Alamdaar Engineering Concern",
 "permalink": "alamdaar-engineering-concern",
 "crunchbase_url": "http://www.crunchbase.com/company/alamdaar-engineering-concern",
 "homepage_url": "http://www.indiamart.com/alamdaarengineeringconcern/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 24,
 "founded_year": 1997,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "industrial-clamps, forged-turn-buckles, shackles",
 "alias_list": null,
 "email_address": "alamdaarengineeringconcern@tradepassport.org",
 "phone_number": "9831046296",
 "description": "extensive range of Industrial Clamps",
 "created_at": "Thu Apr 04 07:42:06 UTC 2013",
 "updated_at": "Thu Apr 04 07:42:10 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\u003C/p\u003E\n\n\u003Cp\u003EAbout Us\u003C/p\u003E\n\n\u003Cp\u003EAlamdaar Engineering Concern was established in the year 1997 as a Sole Proprietorship business firm at Kolkata in West Bengal, India. We are enlisted amongst the renowned names in the industry engaged in manufacturing and supplying a comprehensive range of Lifting Equipment such as Industrial Clamps, Forged Turn Buckles, Shackles, Pulley Blocks, Rope Thimbles and various others.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe are supported by an advanced infrastructural facility, which is spread over a vast area of land. Our facility is segregated into different departments for facilitating the entire business operations smoothly. Our department is outfitted with advanced tools, instruments and machines that assists us to yield high production capacity as the set industrial standards. Owing to ultramodern facilities, we are able to place bulk orders in well-defined time frame.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur organization is working with talented and competent professionals, who have immense industrial knowledge in the respective domain. Our experts put their dedicated efforts in fabricating quality approved product range to our clients. They act the connectivity bridge between clients and company and resolve their queries in most efficient manner. We conduct regular training sessions and workshops to upgrade their skills as per the latest developments in the industry.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nQuality being the prime concern, we ensure to deliver flawless range of products to our clients. Our quality controllers keep a strict supervision on the different stages of manufacturing process. These products are tested on varied parameters thereby ensuring its optimum quality, flawless performance and easy maintenance. Our R \u0026amp; D experts conduct different research activities to offer innovative range of products to our discerning clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nWe are into manufacturing and supplying quality approved range of Lifting Equipment \u0026amp; Parts. Our technically advanced infrastructural facility assists us to fabricate entire product range as per the set industrial standards and policies. As our business policies are based on ethical grounds, we are able to muster vast clientele across the nation. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       93],
      "assets/images/resized/0024/7641/247641v2-max-150x150.jpg"],
     [[125,
       93],
      "assets/images/resized/0024/7641/247641v2-max-250x250.jpg"],
     [[125,
       93],
      "assets/images/resized/0024/7641/247641v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}