{"name": "Alfa Human",
 "permalink": "alfa-human",
 "crunchbase_url": "http://www.crunchbase.com/company/alfa-human",
 "homepage_url": "http://www.indiamart.com/alfahumanhair/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "alfahumanhair@tradepassport.org",
 "phone_number": "9003255592",
 "description": "",
 "created_at": "Fri Apr 05 09:25:26 UTC 2013",
 "updated_at": "Fri Apr 05 09:25:30 UTC 2013",
 "overview": "\u003Cp\u003EAlfa Human Hair came into existence as a sole proprietorship business venture in the year 2008 at Chennai, Tamil Nadu. We are one of the eminent manufacturer, supplier, exporter and wholesaler of the market engaged in offering a vast assortment of Human Hair and Hair Extensions. The products manufactured at our premises are highly acclaimed and demanded in the global market for their quality assured standards and natural appearance. \u003C/p\u003E\n\n\u003Cp\u003EManufacturing Facility:\nThe state-of-the-art infrastructure of our organization helps us produce immaculate products for the clients as per their specific needs and demands. Our manufacturing unit is operational with latest technology based machines and equipment. These machines are operated by our team of experts, who are well-versed with their usage and maintenance. This helps us achieve large production targets within the stipulated time frame. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe organization, Alfa Human Hair is supported by a team of assiduous and talented professionals. These professionals possess intense knowledge of their respective domains and work hard round the clock for the growth and betterment of the company. Our sales and marketing representatives help us understand the needs and demands of our clients to accordingly develop our range.\u003C/p\u003E\n\n\u003Cp\u003EQuality Policy / Processes:\nIndia is considered as the hub of human hair exports, so we give utmost importance to source natural and virgin hair directly from temples etc. Our experts conduct stringent tests and research activities on these procured hairs, in order to ensure maximum benefits to the clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are able to become first choice of millions of clients based across the world by providing them quality assured Human Hair and Hair Extensions at reasonable prices. Our modernized manufacturing plant helps us produce world-class products for the clients. The extensive experience of our professionals offer these products in both standardized and customized form.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       114],
      "assets/images/resized/0024/8479/248479v2-max-150x150.jpg"],
     [[235,
       180],
      "assets/images/resized/0024/8479/248479v2-max-250x250.jpg"],
     [[235,
       180],
      "assets/images/resized/0024/8479/248479v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}