{"name": "AlfaWeighing Solutions",
 "permalink": "alfaweighing-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/alfaweighing-solutions",
 "homepage_url": "http://www.indiamart.com/alfa-weighing-solutions/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "alfa-weighing-solutions-pvt--ltd-, has-become-a-coveted-manufacturer, supplier-and-exporter-of-weighing-machines",
 "alias_list": null,
 "email_address": "alfa-weighing-solutions@tradepassport.org",
 "phone_number": "9840194254",
 "description": "We are a leading manufacturer, supplier ",
 "created_at": "Thu Apr 04 08:10:38 UTC 2013",
 "updated_at": "Thu Apr 04 08:10:40 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2004 at Chennai, Alfa Weighing Solutions Pvt. Ltd., has become a coveted manufacturer, supplier and exporter of Weighing Machines, Billing Machines, Commercial Scales, Laboratory Scales, Jewellery Scales, Weighing \u0026amp; Billing Scales, Weighing \u0026amp; Packing Machines, Inspection \u0026amp; Detection Systems, Weighing Scale Indicators, Weighbridges and Torque Measuring Instruments. A range of quality driven products is offered by us that conforms to global quality standards. Weighing and Billing Machines are precisely designed to ensure easy installation and achieve accurate results. \u003C/p\u003E\n\n\u003Cp\u003EAim / Vision / Mission:\nOur mission is to provide to our customers cost effective, state of the art products and services, to enable them to implement straight-through processes, to better serve and retain their clients. We employ highly trained, specialized and motivated people to deliver outstanding consulting, implementation and training services.\u003C/p\u003E\n\n\u003Cp\u003ETeam \u0026amp; Manpower:\nOwing to the industrial expertise of our dexterous experts, we have successfully raised the bars of customer satisfaction. All business operations are diligently supervised by experienced quality professionals in order to maintain high quality standards in the premises. We regularly organize training sessions and seminars to further upgrade the skills of our professionals, keeping pace with ever changing market demands.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur sophisticated facility sprawls over a large area and is outfitted with the requisite tools driven by cutting-edge technology. We have modern production unit that allows us to facilitate the production of impeccable quality products that surpass customer’s expectations. An in-house quality testing unit allows us to diligently test the samples of raw materials used in the manufacturing process. Our facility comprises various departments like manufacturing unit, warehousing \u0026amp; packaging unit, sales \u0026amp; marketing department etc.\u003C/p\u003E\n\n\u003Cp\u003ETesting Facilities:\nOver the last two years, we have developed several applications that are all capable to be seamlessly interconnected to satisfy the particular needs of a specific customer. We also integrate and in some cases bundle our products with third party systems to satisfy the specific needs of individual customers.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nWeighing Machines, Billing Machines, Commercial Scales, Laboratory Scales, Jewellery Scales, Weighing \u0026amp; Billing Scales, Weighing \u0026amp; Packing Machines, Inspection \u0026amp; Detection Systems, Weighing Scale Indicators, Weighbridges and Torque Measuring Instruments.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0024/7662/247662v2-max-150x150.jpg"],
     [[250,
       96],
      "assets/images/resized/0024/7662/247662v2-max-250x250.jpg"],
     [[260,
       100],
      "assets/images/resized/0024/7662/247662v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}