{"name": "Alfa Enterprises",
 "permalink": "alfa-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/alfa-enterprises",
 "homepage_url": "http://www.edpills.co.in/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@edpills.co.in.com",
 "phone_number": "09953353041",
 "description": "manufacturing, supplying, exporting",
 "created_at": "Thu May 02 09:55:11 UTC 2013",
 "updated_at": "Mon May 06 05:34:19 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year, 2012 we Alfa-Enterprises, hold specialization in manufacturing, supplying, trading and exporting a significant gamut of Pharmaceutical Drugs. This offered product-range is developed by making use of premium quality requisite basic ingredients, procured from the established vendors of the industry. Furthermore, with due consideration, we develop this range in accordance with the defined parameters of the industry so as to meet expectations of the clients. Keeping in mind divergent demands of the clients we have made the offered products available in different weights.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur manufacturing processes are designed to be lean, fast and scalable in order to fulfill the mission of ensuring product availability of the highest quality on time and at a competitive price to our internal and external customers. We provide lifecycle support that includes clinical development, product launch, packaging, product optimization and formulation.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality has always been the most important aspect for us and we always try to meet expectations of the clients with qualitative product gamut of Pharmaceutical Drugs. This offered range is developed by making use of supreme quality required basic ingredients, procured from the accredited vendors of the industry.\u003C/p\u003E\n\n\u003Cp\u003EClients Satisfaction:\nOver the years, we have been able to satisfy our clients to the fullest owing to our product-gamut and ethical business practice. Product-range which we offer is duly developed using quality-approved required basic ingredients, in tandem with the defined parameters of the industry.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nIn order to offer our esteemed clients with quality products, we have built alliances with a vast and authentic vendor base. Our vendors are known to use quality ingredients and processing techniques while developing the range. We choose our vendors on the basis of their market position and credibility.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}