{"name": "Allen Matkins",
 "permalink": "allen-matkins",
 "crunchbase_url": "http://www.crunchbase.com/company/allen-matkins",
 "homepage_url": "http://www.allenmatkins.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "legal",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "california-securities-law, california-environmental-law, california-construction-attorney, california-real-estate-law, california-water-law, california-employment-attorney, california-proposition-65, los-angeles-real-estate-law, san-francisco-real-estate-",
 "alias_list": null,
 "email_address": "matkinslaw@gmail.com",
 "phone_number": "310-788-2400",
 "description": "Allen Matkins, California Law Firm.",
 "created_at": "Tue Mar 20 06:53:47 UTC 2012",
 "updated_at": "Sun Mar 25 22:00:17 UTC 2012",
 "overview": "\u003Cp\u003EAt Allen Matkins, we help clients capitalize on opportunity. Whether this opportunity comes from overcoming challenges or seeing and taking advantage of new technologies, business models, or global markets, we partner with clients to accomplish goals and drive success.We are a premier California-based law firm specializing in realestate, litigation, labor, tax, and business law, with more than 200 lawyers situated in five major business centers in California. From our base in California, we also serve the needs of our clients, whose interests are national and increasingly global. For more than 30 years, we’ve worked with clients drawn to us by our reputation for creative solutions, pragmatism, exemplary quality, and approachability, and our unparalleled network of contacts and connections in business and government. If we had to pride ourselves on just one thing, it would be our relationships with our clients who’ve entrusted us with their security, their livelihoods, and their aspirations. We look to honor them in everything we do.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}