{"name": "Alloy Spray",
 "permalink": "alloy-spray",
 "crunchbase_url": "http://www.crunchbase.com/company/alloy-spray",
 "homepage_url": "http://www.indiamart.com/alloysprayengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "alloysprayengineering@tradepassport.org",
 "phone_number": "9913401282",
 "description": "rendering the best-in-class Coating",
 "created_at": "Thu Apr 04 12:18:19 UTC 2013",
 "updated_at": "Thu Apr 04 12:18:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year of 2009, we, “Alloy Spray \u0026amp; Engineering”, have emerged as as a prominent organization engaged in rendering Coating Service, Thermal Spray Coating Service, Metallizing Service, Chemical Machinery Service, Tank \u0026amp; Vessel Coating Service and Heavy Fabrication Service. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a spacious state-of-the art-infrastructure and one of the largest manufacturing units in the country equipped with latest machinery and other equipments. We strive to take care of people health at global level. We have a team of experienced professionals engaged in manufacturing of this products.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIt is largely due to unwavering support of our team, we have been able to attain specialization in this discipline. Being an integral part of the organization, our team leave no stone unturned to render the best-in-class and reliable Coating Service, Thermal Spray Coating Service, Metallizing Service, Chemical Machinery Service, Tank \u0026amp; Vessel Coating Service and Heavy Fabrication Service. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nProviding reliable and effective Coating Service, Thermal Spray Coating Service, Metallizing Service, Chemical Machinery Service, Tank \u0026amp; Vessel Coating Service and Heavy Fabrication Service is one our core values. With the firm commitment towards quality, we ensure to render services as per the clients\u0026#8217; requirement.\u003C/p\u003E\n\n\u003Cp\u003EDomain Expertise:\nWe hold all the aces in rendering the best-in-class Coating Service, Thermal Spray Coating Service, Metallizing Service, Chemical Machinery Service, Tank \u0026amp; Vessel Coating Service and Heavy Fabrication Service. These services are being rendered by professional who hold expertise over their respective domain.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have made all our efforts dedicated towards acquiring utmost clients\u0026#8217; contentment. To meet expectations of the clients, we offer the most efficient Coating Service, Thermal Spray Coating Service, Metallizing Service, Chemical Machinery Service, Tank \u0026amp; Vessel Coating Service and Heavy Fabrication Service.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7884/247884v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7884/247884v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7884/247884v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}