{"name": "ALTAVIDA",
 "permalink": "altavida",
 "crunchbase_url": "http://www.crunchbase.com/company/altavida",
 "homepage_url": "http://www.procesosaltavida.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "liderazgo, talleres, autoestima, personalidad, trabajo-en-equipo, comunicacin, comunicacin-asertiva, compromiso, coaching, entrenamiento",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "ALTAVIDA - Coaching en Liderazgo",
 "created_at": "Mon Mar 04 13:27:07 UTC 2013",
 "updated_at": "Tue Mar 05 21:38:47 UTC 2013",
 "overview": "\u003Cp\u003ECoaching en Liderazgo en ALTAVIDA:\u003C/p\u003E\n\n\u003Cp\u003ELa empresa de Coaching en Liderazgo ALTAVIDA, ofrece un taller de Liderazgo Personal, el cual está dividido en 5 fases diferentes: la primera fase es la fase de Exploración. Según ALTAVISTDA, cada uno es el protagonista de su propia vida, por lo cual cada uno escribe su propio guion y no espera que otras personas lo hagan por él, la idea es dejar de ser el espectador de la película y transformarse en el director de ella. Solamente de esta forma podrá el coachée realizar sus anhelados sueños y alcanzar sus metas. \u003C/p\u003E\n\n\u003Cp\u003EEn esta fase el coachée o participante  explora y descubre su potencial, aprende cuáles son sus debilidades y cuáles son sus fortalezas.  Además, el coachée o participante  aprende a enfrentar sus miedos y no a escapar de ellos, lo cual lo ayuda a desarrollarse como persona y a internalizar la idea de que la diferencia entre la persona que fracasa y la persona que triunfa está en que la persona  que triunfa despertó y  tomo acción para poder triunfar. Esta persona tomo las riendas de su vida y se hizo cargo de ella.\u003C/p\u003E\n\n\u003Cp\u003EEn esta fase el participante explora dentro de su Ser las Formas de Ser que le funcionan y las que no le funcionan, y recibe herramientas para rediseñar aquellas que no le suman en su vida y para potenciar aquellas que sí le funcionan y que le van a permitir llegar a sus metas y alcanzar sus sueños más acariciados. Para lograr estos resultados, una serie de dinámicas y ejercicios individuales y en grupo que se realizan durante el Taller El coach apoya a cada participante a hacer una profunda observación de cómo es su comportamiento durante el taller y de cómo esto refleja su vida privada y profesional. \u003C/p\u003E\n\n\u003Cp\u003ELa segunda fase  es el proceso de Reconstrucción: en esta fase el coachée o participante trabaja directamente en su persona, rediseñando los paradigmas, creencias, actitudes y hábitos, con los que venimos operando  tanto en nuestras relaciones personales como profesionales. En esta fase el coachée o participante aprenderá a cambiar o rediseñar esas actitudes y comportamientos que no le funcionan y que lo anclan al pasado impidiéndole alcanzar sus sueños. El coachée o participante aprenderá  liderar su vida de forma coherente, a despertar para tomar acción, a tomar decisiones y  a elegir según su propia voluntad. Según ALTAVIDA, este profundo proceso te apoyará a sentirte vivo, ya que te has hecho cargo de tu propia vida, sin intermediarios.  Despertarás para vivir y para triunfar. \u003C/p\u003E\n\n\u003Cp\u003ELa tercera fase es la fase de Profundización. En esta fase el coachée o participante experimentará diferentes ejercicios vivenciales los cuales le permitirán tener evidencias de cómo y con qué formas de ser está operando, en esta etapa de crecimiento el coachée o participante recibirá valiosa información sobre si mismo lo que le permitirá diferenciar entre los las Formas de Ser que le están funcionando y las que no, desde aquí el mismo decidirá de qué modo operar en diferentes situaciones: con los miembros de su familia, con los colegas en el trabajo, con sus amistades, etc.\u003C/p\u003E\n\n\u003Cp\u003ELa cuarta fase es la fase de Nivelación: el coachée o participante tendrá evidencias  que nuestra vida nosotros operamos dentro de muchos equipos con los que nos interrelacionamos de una manera u otra día a día, tales como nuestra familia nuclear, nuestra familia extensiva, nuestros amigos, trabajo, estudio etc. y verá como él está operando en los diferentes equipos en su vida. El coachée o participante desarrollara junto a su nuevo equipo de Programa un legado para la sociedad y el bien común.\u003C/p\u003E\n\n\u003Cp\u003EEn la quinta y última fase, que es la fase de Reconocimiento, el coachée o participante  reconoce  un arduo trabajo en sí mismo, en sus relaciones personales y profesionales, en los logros de las metas y sueños y asume el compromiso de continuar una vez finalizado el Programa de Entrenamiento de Líderes,  el trabajo en su vida. En esta etapa se  resume todo lo que ha vivido y aprendido hasta este momento, su progreso y el  reconocimiento de que su vida será diferente de aquí en adelante tanto para él mismo como para las personas que lo rodean.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       44],
      "assets/images/resized/0023/9707/239707v2-max-150x150.png"],
     [[214,
       64],
      "assets/images/resized/0023/9707/239707v2-max-250x250.png"],
     [[214,
       64],
      "assets/images/resized/0023/9707/239707v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Coach Ontológico",
    "person":
     {"first_name": "Tatiana",
      "last_name": "Lucena",
      "permalink": "tatiana-lucena",
      "image": null}},
   {"is_past": false,
    "title": "Coach Directivo",
    "person":
     {"first_name": "Sandro",
      "last_name": "Pucci",
      "permalink": "sandro-pucci",
      "image": null}},
   {"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Alessandro",
      "last_name": "Pucci",
      "permalink": "alessandro-pucci",
      "image": null}},
   {"is_past": false,
    "title": "Psicoterapueta en Gestalt",
    "person":
     {"first_name": "Dra.",
      "last_name": "Libby Michel",
      "permalink": "dra-libby-michel",
      "image": null}},
   {"is_past": false,
    "title": "Coordinadora General",
    "person":
     {"first_name": "Claudia",
      "last_name": "Calderón",
      "permalink": "claudia-caldern",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Oficinas",
    "address1": "Ca. Venecia 275, 302",
    "address2": "San Borja, Lima 41",
    "zip_code": "",
    "city": "Lima",
    "state_code": null,
    "country_code": "PER",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.altavida.net",
    "title": "¿Qué es ALTAVIDA?"},
   {"external_url": "http://www.altavida.info",
    "title": "ALTAVIDA"},
   {"external_url": "http://www.procesos-altavida.com",
    "title": "ALTAVIDA - Coaching En Liderazgo"},
   {"external_url": "http://www.visualcv.com/altavida",
    "title": "ALTAVIDA - Visual CV"}]}