{"name": "Amazinghind",
 "permalink": "amazinghind",
 "crunchbase_url": "http://www.crunchbase.com/company/amazinghind",
 "homepage_url": "https://amazinghind.com/",
 "blog_url": "https://www.facebook.com/AmazingHind",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bowl-chinar, chinar-pyaala, dry-fruit-tray, gift-for-love-handmade-jewellery-box, heart-box, kanchi-daar-bowl-kanwajposh-walnut-wood, kashmir-kashmir-paper-mache, kashmiri-products-paper, mache-paper, mache-bowl-set-paper, mache-box-paper, mache-candle-st",
 "alias_list": null,
 "email_address": "contact@amazinghind.com",
 "phone_number": "8860288000",
 "description": "AmazingHind is a unique online store of ",
 "created_at": "Thu Mar 21 20:31:52 UTC 2013",
 "updated_at": "Sat Mar 23 17:48:49 UTC 2013",
 "overview": "\u003Cp\u003EKashmiri Walnut Wood Craft\u003C/p\u003E\n\n\u003Cp\u003EThe art of Kashmir reflects the rich culture and tradition of the region. The handicraft of skillfully made wooden artifacts is an expression of Kashmir’s history and goes back to third or fourth century in the architectural remains found in the region.\u003C/p\u003E\n\n\u003Cp\u003EThe Kashmiri Naqash or the master craftsman is a true magician and displays his art in the form of exquisite jewelry boxes, wall panels and screens, furniture, photo frames, cigar case and many more artifacts. The craftsmen rejoice in carving intricate and detailed designs based on natural forms and host of other motifs. You will be fascinated with their attention to detail.\nKashmiri Walnut Wood items @Amazinghind\u003C/p\u003E\n\n\u003Cp\u003EThe artisans were prompt to reply when we wondered how come Walnut wood is used. Kashmir is the only region in India where the Walnut tree grows. Known as Dunn in Kashmiri, Walnuts from the region are famous world over. Walnut tree’s color and grain is distinct and the intricate carving done is of finest quality. Walnut wood has an inherent sheen which comes into its own when polished with wax. The wood from the root of the tree is almost black and the branches have the lightest color. The cost of the wood differs from each part with the wood from the root being the most expensive.\u003C/p\u003E\n\n\u003Cp\u003EBeing the strongest variety of wood, it is suitable for carving and chipping. There are five main styles of Walnut wood carving.\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EDeep Carving known as Vaboraveth– Two or more inches deep with popular motifs as dragon or lotus flower\nShallow Carving known as Sadikaam- Half inch deep done all over the flat surface\nOpen or lattice work known as Jallidahr or Shabokdhar – See through screens, back of a chair etc with beautiful work. Usually depict the Chinar motifs\nSemi Carving known as Padri – Done on a thin panel along the rim of a surface with a center motif\nUndercut known as Khokerdar – Comprises multi-layers that can exceed upto seven (satnarey). Three-dimensional depiction of various complicated motifs. Edges tend to be rounded off.\n\u003C/code\u003E\u003C/pre\u003E",
 "image":
  {"available_sizes":
    [[[50,
       50],
      "assets/images/resized/0024/4995/244995v2-max-150x150.jpg"],
     [[50,
       50],
      "assets/images/resized/0024/4995/244995v2-max-250x250.jpg"],
     [[50,
       50],
      "assets/images/resized/0024/4995/244995v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://amazinghind.wordpress.com/",
    "title": ""}]}