{"name": "AME Info",
 "permalink": "ame-info",
 "crunchbase_url": "http://www.crunchbase.com/company/ame-info",
 "homepage_url": "http://ameinfo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "ameinfo",
 "category_code": "advertising",
 "number_of_employees": 20,
 "founded_year": 1996,
 "founded_month": 4,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "press@ameinfo.com",
 "phone_number": "+971(4)3902700",
 "description": "Middle East business and finance",
 "created_at": "Thu Nov 13 05:44:17 UTC 2008",
 "updated_at": "Thu Jan 26 22:45:08 UTC 2012",
 "overview": "\u003Cp\u003EAMEinfo.com was initially Arabian Modern Equipment Est., incorporated in Abu Dhabi, February 1993 by Saif Al-Suwaidi and Klaus Lovgreen. The first version of the AME Info CD-ROM database of 125,000 companies was developed and compiled late 1996 and sold some 10,000 copies.\u003C/p\u003E\n\n\u003Cp\u003EIn mid-1996, Lars B. Nielsen joined the company as a shareholder and head of sales.\u003C/p\u003E\n\n\u003Cp\u003EIn 1997, major sponsors including Royal Dutch Shell Middle East and UPS allowed the concept to expand, and the 1998 edition of AME Info reached a free circulation of more than 180,000 copies (20,000 were distributed in a branded version through Shell in the Middle East magazine).\u003C/p\u003E\n\n\u003Cp\u003EFollowing the 1998 edition, more branded versions were produced for Royal Dutch Shell Middle East, Batelco, Orbit Television and Radio Network and Intel. The circulation in 1999 topped out at some 250,000 free copies distributed through direct mail and magazines including Shell in the Middle East, Gulf Marketing review, The Middle East and Windows User Magazine.\u003C/p\u003E\n\n\u003Cp\u003EIn 1999 the company shifted from the CD-ROM platform to the Internet and added content such as company news and current events to the services. In the autumn of 2000 the company added a journalistic touch to the content portfolio and launched AME Info FN headed by Peter Cooper - concentrating on the financial markets and economics in the region. In November 2000 AME Info was awarded \u0026#8220;Best Commercial Services Site\u0026#8221; by Visa International and Arabian Business.\u003C/p\u003E\n\n\u003Cp\u003EA number of professional contributors across the region has since joined the site with a large variety of vertical content columns including topics such as e-business, environment, education, defence and currency commentary among others.\nIn May 2001 the company moved to Dubai Media City becoming AME Info FZ LLC and expanded its content into multimedia. Its current content includes video and audio features, as well as streaming internet radio and business tools such as a currency converter.\u003C/p\u003E\n\n\u003Cp\u003EIn March 2005, HSBC Private Equity Middle East Ltd acquired a significant equity stake in AME Info FZ LLC.\u003C/p\u003E\n\n\u003Cp\u003EAMEinfo.com was the first Middle East website to achieve certification from the Audit Bureau of Circulations (ABC ELECTRONIC).\u003C/p\u003E\n\n\u003Cp\u003EIn July 2006, London-based EMAP Emap plc (EMA.L) announced that Emap Communications, its business-to-business (B2B) division, has acquired AME Info.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder and CEO",
    "person":
     {"first_name": "Klaus",
      "last_name": "Lovgreen",
      "permalink": "klaus-lovgreen",
      "image":
       {"available_sizes":
         [[[150,
            137],
           "assets/images/resized/0002/8431/28431v2-max-150x150.jpg"],
          [[200,
            183],
           "assets/images/resized/0002/8431/28431v2-max-250x250.jpg"],
          [[200,
            183],
           "assets/images/resized/0002/8431/28431v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarter",
    "address1": "PO Box 502100",
    "address2": "Al Thuraya Tower 1, 20th Floor",
    "zip_code": "",
    "city": "Dubai",
    "state_code": null,
    "country_code": "ARE",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}