{"name": "The American University of Iraq, Sulaimani",
 "permalink": "american-university-of-iraq-sulaimani",
 "crunchbase_url": "http://www.crunchbase.com/company/american-university-of-iraq-sulaimani",
 "homepage_url": "http://auis.edu.iq/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "AUIraqSulaimani",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@auis.edu.iq",
 "phone_number": "+964 53 330 1011",
 "description": "A private, non-profit university",
 "created_at": "Wed Dec 19 16:40:22 UTC 2012",
 "updated_at": "Mon Feb 25 04:30:40 UTC 2013",
 "overview": "\u003Cp\u003EThe American University of Iraq, Sulaimani strives to establish an institution dedicated to offering a truly comprehensive, American-style education in Iraq.\u003C/p\u003E\n\n\u003Cp\u003EAUIS admits all qualified students regardless of social, ethnic, or religious background. Students are admitted based on a record of past academic performance and potential for success, including capacity to engage in self-directed learning and demonstrated high levels of critical thinking.\u003C/p\u003E\n\n\u003Cp\u003EThe university currently offers six academic programs that lead to a bachelor’s degree, as well as an Executive Master’s of Business Administration (MBA) and continuing education classes from its Professional Development Institute.\u003C/p\u003E\n\n\u003Cp\u003ERounding out the university experience is a robust campus life, with several university sports teams and more than a dozen student-sponsored clubs and other activities. AUIS offers competitive men’s and women’s basketball, volleyball, ping pong, and soccer, and a dozen other student activities, including an internationally competitive debate society, drama, business, hiking, photography, running, and radio clubs. Students have also participated in conferences and competitions outside of Iraq, including an international Model United Nations conference, Hult Global Case Challenge, and various Fulbright scholarships. Further, AUIS is home to the nation’s first and only independent student newspaper, the AUIS Voice, and houses student chapters of the U.S.-based Society of Professional Journalists and the Association for Computing Machinery. \u003C/p\u003E\n\n\u003Cp\u003EThe university grounds include an administrative building, gender-specific dormitories, and an academic building, which houses lecture halls and classrooms, conference rooms, and faculty offices. AUIS also has a cafeteria, two outdoor basketball courts and an outdoor soccer field. State-of-the-art science labs will be completed next year.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/7648/237648v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0023/7648/237648v2-max-250x250.jpg"],
     [[403,
       403],
      "assets/images/resized/0023/7648/237648v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}