{"name": "AmilalRamkishan Dass",
 "permalink": "amilalramkishan-dass",
 "crunchbase_url": "http://www.crunchbase.com/company/amilalramkishan-dass",
 "homepage_url": "http://www.instant-henna.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "henna-hair-color, herbal-henna, henna-cone, herbal-oil, henna-hair-colors, herbal-hair-shampoo",
 "alias_list": null,
 "email_address": "webmaster@instant-henna.com",
 "phone_number": "9810597355",
 "description": "Herbal HennaWe offer good quality herbal",
 "created_at": "Thu Apr 04 08:26:39 UTC 2013",
 "updated_at": "Thu Apr 04 08:26:41 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1966, we at Ami Lal Ramkishan Dass are engaged in processing a wide range of Mehandi Dulhan Shirngar and other Henna based products such as natural henna, henna hair color, herbal henna, henna cone, herbal oil, henna hair colors, herbal hair shampoo, herbal hair conditioner, rose water as well as spices. Our team is the innate force that has led us in achieving a reputable name in the overseas and Indian markets. It is due to their dedicated efforts and knowledge that we make use of the available resources in the best possible manner.\u003C/p\u003E\n\n\u003Cp\u003EProcessing Facilities:\nThe final products like henna hair conditioner henna herbal shampoo, herbal henna powder, natural henna and hair mehndi based hair colours are result of well defined processing techniques that involve selecting, cleaning, drying, crushing and grinding the raw henna leaves and making superior quality natural henna powder or henna paste.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe believe that “Quality never goes out of demand”. Thus, we follow stringent quality procedures while processing our range of products. Right from the time of procurement, our quality inspectors keep a check over the natural Henna and raw spices that are procured from our vendors.\u003C/p\u003E\n\n\u003Cp\u003EClient Assurance:\nThe ultimate goal of our entire business activities is to achieve highest level of client satisfaction. Thus, we have directed all our endeavors in following ethical business policies. Top most factor that leads us to achieve us our goal is the customization factor. We make use of latest machines and tools to offer customization in terms of processing and packaging our range of products.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nBacked by our very strong infrastructure base, we are able to meet the growing demand of our customers for mehndi products like henna hair conditioner, herbal henna powder, henna pouch, hair mehndi and many more. Our well built infrastructure set up is spread across a sprawling area of 5000 square feet. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[52,
       48],
      "assets/images/resized/0024/7686/247686v2-max-150x150.jpg"],
     [[52,
       48],
      "assets/images/resized/0024/7686/247686v2-max-250x250.jpg"],
     [[52,
       48],
      "assets/images/resized/0024/7686/247686v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}