{"name": "Amit Castings",
 "permalink": "amit-castings",
 "crunchbase_url": "http://www.crunchbase.com/company/amit-castings",
 "homepage_url": "http://www.indiamart.com/amitcastings/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "amitcastings@tradepassport.org",
 "phone_number": "08377807758",
 "description": "Manufacturer, supplier.",
 "created_at": "Sat Apr 06 04:42:48 UTC 2013",
 "updated_at": "Mon Apr 08 00:10:41 UTC 2013",
 "overview": "\u003Cp\u003EAmit Castings came into existence in the year 1984 as a Sole Proprietorship at Howrah, West Bengal (India). Our company is engaged in manufacturing and supplying a diversified range of casting products. We offer Peep Hole Covers, Propellers, Impellers and Pump Bodies.\u003C/p\u003E\n\n\u003Cp\u003EOur Products;\nmanufacturing and supplying a diversified range of casting products. We offer Peep Hole Covers, Propellers, Impellers and Pump Bodies. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nSuccess is the ultimate goal of an organization and quality is that tool, which when religiously conformed to makes goals achievable. The collective and meticulous efforts of our professionals have earned us reputation as a quality-oriented organization in the industry.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur state-of the-art infrastructural setup at Howrah, India empowers us to attain symmetry in our day to day business operations. We have developed a sophisticated manufacturing unit that is outfitted with advanced set of tools, machinery and equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe competitive currents of the industry are faced and navigated in an efficient manner by our outstanding team of professionals. We are backed by skilled workers, who execute the different tasks assigned to them in adherence with preset norms and guidelines. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur range of casting products conforms to international quality standards and is offered at industry leading prices. We have an extensive distribution network that helps us deliver products nationwide in a hassle-free way. All our dealings with the vendors and clients are completely transparent and ethical.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/9020/249020v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/9020/249020v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/9020/249020v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}