{"name": "amnpathway.com",
 "permalink": "amnpathway-com",
 "crunchbase_url": "http://www.crunchbase.com/company/amnpathway-com",
 "homepage_url": "http://www.amnpathway.com",
 "blog_url": "http://makemoneyonlinewitharmandmorin.com",
 "blog_feed_url": "",
 "twitter_username": "amnpathway",
 "category_code": "ecommerce",
 "number_of_employees": 1,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "build-a-membership-site-online-income-online-business",
 "alias_list": null,
 "email_address": "amnpathway@gmail.com",
 "phone_number": "9195381735",
 "description": "membership site how to",
 "created_at": "Mon Jun 04 21:33:32 UTC 2012",
 "updated_at": "Sat Jun 09 16:54:08 UTC 2012",
 "overview": "\u003Cp\u003EAMN PATHWAY Has a Great Webinar\u003C/p\u003E\n\n\u003Cp\u003ESUMMARY: The webinar produced by AMN PATHWAY is going to last for a total of 35 minutes. \u003C/p\u003E\n\n\u003Cp\u003EFor those individuals who would like to learn secrets to generating 100k from the comfort of their own homes, AMN Pathway is offering a webinar. The webinar is only going to last for 35 minutes and during those 35 minutes, individuals watching it will learn a great deal of information.\u003C/p\u003E\n\n\u003Cp\u003EThe webinar is going to teach individuals how they can set up their own membership site. After they learn how to set up their own membership site, they are going to learn how to drive traffic to it. In this webinar, individuals will have access to a great deal of free information. At the end, individuals will have a chance to purchase a 100k membership program that will teach them exactly how to set up the site and generate traffic.\u003C/p\u003E\n\n\u003Cp\u003EAMN Pathway is offering a 30-day refund policy for this product. For those individuals that purchase the product only to find they do not like it, they will be able to get their money back. This product, however, has been guaranteed to work as long as the user follows the instructions.\u003C/p\u003E\n\n\u003Cp\u003EThis is a free webinar that individuals will be able to take advantage of. Simply visit the site and sign up to receive the webinar. Individuals will be asked to choose the date and time from the selection menu that works best for them.\u003C/p\u003E\n\n\u003Cp\u003EABOUT AMN Pathway Webinar\nAMN Pathway helps individuals uncover the secrets to making money in the comfort of their own home. They have a great deal of information that will make each individual successful. They are offering a 100% free webinar that individuals can watch on their own schedule. The webinar is packed full of information on a simple system that will help generate a large amount of money. \u003C/p\u003E\n\n\u003Cp\u003EFor those individuals that are interested in the webinar being offered by AMN pathway, visit their website - http://www.amnpathway.com. Contact email  amnpathway@gmail.com \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}