{"name": "Amore Classic",
 "permalink": "amore-classic-2",
 "crunchbase_url": "http://www.crunchbase.com/company/amore-classic-2",
 "homepage_url": "http://www.amoreclassic.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "AmoreClassic",
 "category_code": "other",
 "number_of_employees": 30,
 "founded_year": 2008,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "amore-classic, hairstyling-tools",
 "alias_list": null,
 "email_address": "amoreclassic@yahoo.com",
 "phone_number": "",
 "description": "Amore Classic Hair Straightener",
 "created_at": "Sun May 26 07:24:21 UTC 2013",
 "updated_at": "Mon May 27 16:31:20 UTC 2013",
 "overview": "\u003Cp\u003EThe Taming of the Curl\u003C/p\u003E\n\n\u003Cp\u003EThrough the ages, women have been finding new ways in which to help them look and feel at their very best. Whether this involves curling hair or straightening hair is a matter of personal choice and very often, women prefer the complete opposite to what was bestowed on them by nature. For at least two centuries, women with curly or wavy hair have been on a quest to discover and perfect tools that make taming their locks easier. Heated rods were first used, often inflicting injuries and damaging hair when used regularly. Later, heated comb-like inventions caused further damage by pulling on hair as well as causing harm to hair and follicles by the application of regular and excessive heat. It has been said that beauty is pain and in this regard it was quite literally so. Fortunately, this process and the apparatus involved has drastically improved through the years at the hands of companies like Amore Classic. \u003C/p\u003E\n\n\u003Cp\u003ESmooth, Sleek and Shiny Hair With Amore Classic\u003C/p\u003E\n\n\u003Cp\u003EIn the year of 1912 the first patented invention of a hair straightener that comprised of two heated plates that were hinged together surfaced. In later years this was the particular model that continued to be improved upon. Designers and manufacturers have advanced the initial model by creating smaller, lighter and better designed tools like the Amore Classic Hair Straightener. This solid ceramic plated hair straightener comes with added extras to prevent injury like an iron holder and adjustable temperature controls. The ergonomic way in which the Amore Classic Hair Straightener is designed makes it more comfortable to use and it is available in a range of fashionable colors. The constant heat of hair straightening tools in earlier years caused damage to the hair follicles and resulted in broken, lackluster and unhealthy hair when used too often. This is no longer the case and products fabricated by companies like Amore Classic make full use of modern day innovation to combat this issue.\u003C/p\u003E\n\n\u003Cp\u003EWhat Makes the Amore Classic Hair Straightener Different?   \u003C/p\u003E\n\n\u003Cp\u003EWhen using the Amore Classic Hair Straightener, the advanced technology used in manufacturing the product creates double the standard amount of negative ions released into the hair with usage. This large quantity of negative ions softens the hair, makes it super shiny and sleek and eliminates frizz. Constructed by using light-weight composite materials frequently used in the aerospace sector, the Amore Classic Hair Straightener is durable, effortless to use and easy to store. The straightener is designed in a way that is shaped to suit the natural contours of the hand and can thus be used with a high level of comfort. The solid ceramic plates heat up evenly and consistently and has temperature controls that suits a variety of hair types and styles. The evenly dispersed heat enables faster styling and further avoids damage by reducing the amount of times that the straightener is used over the same section of hair. The Amore Classic Hair Straightener heats up to the desired temperature in under 25 seconds, further ensuring time-effective styling while the ceramic plates ensure a long-lasting effect. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0026/7103/267103v2-max-150x150.jpg"],
     [[250,
       214],
      "assets/images/resized/0026/7103/267103v2-max-250x250.jpg"],
     [[450,
       385],
      "assets/images/resized/0026/7103/267103v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Northridge",
    "address2": "",
    "zip_code": "91324",
    "city": "Northridge",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 34.2413938,
    "longitude": -118.5506158}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.amoreclassic.net",
    "title": "Amore Classic hair care products"},
   {"external_url": "http://www.linkedin.com/in/amoreclassic",
    "title": "Amore Classic on LinkedIn"}]}