{"name": "Amsca Boat Rental Dubai",
 "permalink": "amsca-boat-rental-dubai",
 "crunchbase_url": "http://www.crunchbase.com/company/amsca-boat-rental-dubai",
 "homepage_url": "http://www.boatrentaldubai.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1991,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "yacht-charter-dubai, yacht-rental-dubai, yacht-hire-dubai, boat-charter-dubai, boat-hire-dubai",
 "alias_list": null,
 "email_address": "amscaboatrental@gmail.com",
 "phone_number": "",
 "description": "Cruising in Dubai",
 "created_at": "Fri Dec 07 11:03:56 UTC 2012",
 "updated_at": "Mon Dec 17 21:10:18 UTC 2012",
 "overview": "\u003Cp\u003EAMSCA boat rental Dubai offer luxurious cruising experience in Dubai suitable for all manner of client requirement and exceptions including fishing \u0026amp; water sport activities, parties, dinners, wedding receptions, birthdays, anniversaries and celebrations as well as cut-out corporate functions with capacity of up to 65 guests at any one time. We own a fleet of six up market yachts cruising the Dubai waterways and canals. Seven days a week all year round an experienced charter / rental specialist dedicated to serving you are available to answer every question, customize, plan, schedule and set into motion the yacht charter experience of a lifetime.\nAmsca boats is the UAE charter specialist, we provide crewed luxury yachts, meg¬¬¬a yachts, super yachts charter, sailing yachts and catamarans in the Arabian Gulf, Musandam Peninsula and the Gulf of Oman. The best charter boats in the Gulf, the most competitive prices and the finest service, Free independent and professional advice with personalized friendly service, Crewed luxury motor yachts, super yachts and mega yachts for an ultimate cruise, The best fishing boats available with the guaranteed catch you will only find in our services. The interiors reflect quality fitting and furnishing in keeping stride with five star venues. We also offer, as per request, a wide range of catering options ranging from the finest finger food to five-course banquets. All our charters include full insurance cover, on-board safety measures and precautions with complete fishing gear, complimentary soft drinks and mineral water with lots of ice.  The company philosophy is to provide cruising excellence at an affordable cost. It must be working as many of our clients return year after year.\nAmsca ha his six fleet yacht with his luxury services:\nAmsca 45ft: For up to 12 guests, comfortable accommodation can be enjoyed, with a spacious unsuited master bedroom and a further two guest cabins. When you charter the yacht, you also retain the services of an experienced skipper and steward to ensure a perfect yacht charter experience.\nAmsca 55ft: Your charter will include cruising or swimming in the blue waters of the coastline. Enjoy the company of your guests on the spacious fly bridge with ample seating for all. Bring your own CDs, tanning lotion, and don\u0026#8217;t forget your sunglasses!\nAmsca 62ft: For up to 18 guests an unforgettable experience it would be. If you are out to impress or just want the best, this yacht is the vessel.\nAmsca 78ft: Up to, 22 guests capacity, the yacht has 3 well-appointed cabins, with both master and VIP cabins being full beam and offering en-suite facilities and the latest entertainment systems. For those who enjoy taking things easy, life doesn\u0026#8217;t get any easier than this.\nAmsca 86ft: Up to 30 guests maximum, while an innovative accommodation arrangement ensures superior levels of comfort the décor of the main guest areas is subtle and clean rather than opulent, and its design is neither too modern nor too traditional, simply timeless, elegant and warm. For private charter or corporate events, the yacht provides for all that jazz. \nAmsca 90ft: Regardless of the occasion, you are guaranteed fine dining, plenty of dancing and incredible entertainment, a fully-equipped kitchen that boasts of fine china and meticulously hand-picked silverware, and a fully serviced washroom situated at aft deck, serving counter, open-air spaces as well as canopied shelter to drive your imagination wild. For up to 65 guests, the cruise would be one to remember.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "",
    "is_past": false,
    "provider":
     {"name": "Amsca Boat Rental Dubai",
      "permalink": "amsca-boat-rental-dubai",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Amsca Boat Rental Dubai",
    "address1": "Dubai, UAE",
    "address2": "Dubai, UAE",
    "zip_code": "126012",
    "city": "Dubai",
    "state_code": "UT",
    "country_code": "ARE",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.boatrentaldubai.com",
    "title": "yacht hire dubai"},
   {"external_url": "http://w.boatrentaldubai.com",
    "title": "yacht charter dubai"},
   {"external_url": "http://w.boatrentaldubai.com",
    "title": "yacht rental dubai"}]}