{"name": "Amura Marketing Technologies",
 "permalink": "amura-marketing-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/amura-marketing-technologies",
 "homepage_url": "http://www.amuratech.com",
 "blog_url": "http://blog.amuratech.com",
 "blog_feed_url": "http://blog.amuratech.com/feeds/posts/default",
 "twitter_username": "amuratech",
 "category_code": "software",
 "number_of_employees": 20,
 "founded_year": 2009,
 "founded_month": 5,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "marketing, seo, crm, automobile, real-estate, social-media",
 "alias_list": null,
 "email_address": "support@amuratech.com",
 "phone_number": "+91 20 2567 2975 ",
 "description": "The Marketing Company with strong Techno",
 "created_at": "Fri Jun 18 20:08:24 UTC 2010",
 "updated_at": "Fri Apr 13 00:58:57 UTC 2012",
 "overview": "\u003Cp\u003EThe Marketing Company with strong Technology Background \u003C/p\u003E\n\n\u003Cp\u003EAmura, with its principal office in the US, is a cutting edge marketing and technology company dedicated to delivering the most comprehensive Internet Marketing solutions to its clients. We offer multiple services that meet challenging online advertising demands and ensure that all our clients get maximum visibility online. Our complete Internet Marketing Solutions help clients stay ahead of their competition, expanding business far beyond expectations.\u003C/p\u003E\n\n\u003Cp\u003EThe way business is done has changed drastically in the last decade. With the web2.0 platform focus is now shifting to social interaction and online communication. In addition, frameworks like Google apps have changed the realm of application development as they provide an extensive communication platform across all channels which can be customized for verticals.\u003C/p\u003E\n\n\u003Cp\u003EThe Internet has seen a major shift - from being a medium to expose consumers to new applications, to engaging and communicating with the customer online. A predominant trend of merging various communication platforms is seen in today\u0026#8217;s e-age, a good example of which is the iphone.\u003C/p\u003E\n\n\u003Cp\u003EAmura has identified these opportunities and has been building technology platforms to align with this trend. Amura Technologies consists of specialists in technology, marketing and advertising all under one roof, which helps our clients, leverage the potential of the internet by creating platforms to engage customers online. We have developed a specialized platform for Internet marketing channels like search marketing, social marketing, adwords, adsense etc. to maximize the returns on marketing investments.\u003C/p\u003E\n\n\u003Cp\u003EWe also create value added tools for lead generation in verticals and leverage frameworks like Google apps, VoIP and social frameworks to create a comprehensive communication platform which helps keep the consumer engaged online. We constantly add new features to our proprietary platform so that our clients are always at the cutting edge of the web2.0.\u003C/p\u003E\n\n\u003Cp\u003EWith the internet dominating a consumer\u0026#8217;s timeshare compared to television or radio, it is critical for every organisation to have a strong presence on the Internet. To help our clients achieve these goals we have a talented team of creative artists working with our developers to create unique designs and integrate them with tools in a way that help our clients establish a strong brand on the Internet. Value added content is also critical to create the right brand. We therefore have a team of very talented creative writers helping clients propagate their message on the internet and expanding their reach. We also have a full-fledged in-house video and audio production team to make sure we leverage all possible channels on the internet for our clients. We help our clients get the most out of their Web Applications and Internet platform.\u003C/p\u003E\n\n\u003Cp\u003EFinally, we are a Marketing Technology company and our proprietary Marketing Analytics platform helps us identify user trends and leverage the same to our client\u0026#8217;s advantage. It helps us keep on top of the global marketing trends!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[73,
       73],
      "assets/images/resized/0009/1086/91086v2-max-150x150.png"],
     [[73,
       73],
      "assets/images/resized/0009/1086/91086v2-max-250x250.png"],
     [[73,
       73],
      "assets/images/resized/0009/1086/91086v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Vinayak",
      "last_name": "Katkar",
      "permalink": "vinayak-katkar",
      "image":
       {"available_sizes":
         [[[50,
            50],
           "assets/images/resized/0025/0993/250993v1-max-150x150.jpg"],
          [[50,
            50],
           "assets/images/resized/0025/0993/250993v1-max-250x250.jpg"],
          [[50,
            50],
           "assets/images/resized/0025/0993/250993v1-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "",
    "person":
     {"first_name": "pratik",
      "last_name": "rokade",
      "permalink": "pratik-rokade",
      "image":
       {"available_sizes":
         [[[92,
            150],
           "assets/images/resized/0010/6622/106622v2-max-150x150.jpg"],
          [[154,
            250],
           "assets/images/resized/0010/6622/106622v2-max-250x250.jpg"],
          [[200,
            323],
           "assets/images/resized/0010/6622/106622v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003EPratik Rokade\u003C/p\u003E"}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Amura Technologies",
    "address1": "127/7, Parijat, Erandwane",
    "address2": "",
    "zip_code": "411004",
    "city": "Pune",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}