{"name": "Analog Creative Inc",
 "permalink": "analog-creative-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/analog-creative-inc",
 "homepage_url": "http://www.analog.la",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "analogcreative",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 2,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design, print-design, california, entertainment, online-newsletters, cd-artwork, vinyl-artwork",
 "alias_list": null,
 "email_address": "info@analog.la",
 "phone_number": "",
 "description": "Web \u0026 Print Design",
 "created_at": "Tue Dec 13 16:01:36 UTC 2011",
 "updated_at": "Mon Dec 19 20:50:21 UTC 2011",
 "overview": "\u003Cp\u003EBloody marvelous web, social media \u0026amp; merch design for the Entertainment Industry. Analog infuses 25 years of combined experience to produce fantastical cocktails of delicious digital media.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Our customers hire us to elevate their web presence and cause sales to rocket through genius creativity dedicated to exuberant, extravagant, outlandish design, a service we deliver with a muchness of pleasure.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EAnalog’s jaw dropping solutions crack the whip, harness technology and push more boundaries than a rebellious teenager. They help to build brands that have a dramatic positive impact on the bottom line.\u003C/p\u003E\n\n\u003Cp\u003EThe founders hopped over the puddle from England to get up close and personal with clients and bask in the warmth of the LA sunshine. With mind boggling backgrounds from some of the worlds biggest and best advertising and interactive agencies, the crew are honored to have worked on projects for some of the most successful brands in entertainment including Snow Patrol, Arctic Monkeys, The Killers, Universal Music Group, MTV, Two Door Cinema Club, Warner Records, Noah \u0026amp; the Whale, Madonna and the Vatican Choir. \u003C/p\u003E\n\n\u003Cp\u003EWhether collaborating with a breaking Indie band or an established filmmaker, Analog are equally chuffed and offer the same inspirational approach, keeping simplicity and your budget front of mind.\u003C/p\u003E\n\n\u003Cp\u003EThe goal is to understand your business and properly look after you, so you\u0026#8217;re never tempted to call anyone else. \u003C/p\u003E\n\n\u003Cp\u003EIf you are after a big time Charlie bananas result look no further, you’re sorted mate!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       100],
      "assets/images/resized/0016/6249/166249v2-max-150x150.jpg"],
     [[250,
       167],
      "assets/images/resized/0016/6249/166249v2-max-250x250.jpg"],
     [[450,
       302],
      "assets/images/resized/0016/6249/166249v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}