{"name": "Angel City Jewelers",
 "permalink": "angel-city-jewelers",
 "crunchbase_url": "http://www.crunchbase.com/company/angel-city-jewelers",
 "homepage_url": "http://www.angelcityjewelers.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 4,
 "founded_year": 2001,
 "founded_month": 1,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "diamond-stud-earrings, diamond-stud-earring",
 "alias_list": null,
 "email_address": "info@angelcityjewelers.com",
 "phone_number": "800-337-0960 ",
 "description": "Angelcityjewelers offer the highest qual",
 "created_at": "Sun Oct 14 20:33:18 UTC 2012",
 "updated_at": "Mon Oct 22 19:48:59 UTC 2012",
 "overview": "\u003Cp\u003EAngel City Jewelers has been a family-owned company for over 28 years. Our retail and wholesale businesses are located in the historic Jewelry District in downtown Los Angeles, California. We purchase our diamonds directly from India, Belgium, Hong Kong and Israel, which allows us to cut out the middle man and pass on considerable savings to our customers. All diamonds are 100% natural and conflict free with no enhancements of any kind. Our diamonds are guaranteed to match the color and clarity advertised. All diamonds and Stud Earrings are professionally set by hand in beautiful, highly polished gold settings. The holidays are almost here, and we offer some outstanding jewelry buys for gift-givers.\u003C/p\u003E\n\n\u003Cp\u003EWe are Accredited Members of the Better Business Bureau with an A Rating: Company ID: 100115577  \u003C/p\u003E\n\n\u003Cp\u003EAngel City Jewelers Offers the Most Affordable Prices on the Internet\u003C/p\u003E\n\n\u003Cp\u003EFor more than a quarter of a century, Angel City Jewelers has been delivering the highest quality merchandise at the most affordable prices. We guarantee the lowest prices on all Diamond Stud Earrings and Solitaire Rings, or we will pay the difference.  We have many different  variety of Diamond Engagement Rings to choice from. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}