{"name": "Animated Media",
 "permalink": "animated-media",
 "crunchbase_url": "http://www.crunchbase.com/company/animated-media",
 "homepage_url": "http://www.animatedmedia.ca",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "animatedmedia",
 "category_code": "software",
 "number_of_employees": 7,
 "founded_year": 2008,
 "founded_month": 12,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software, development, mobile, smartphone, consumer-electronics, flash, flash-player, multimedia, video, 3d, applications, apps, ipad, iphone, android, apple-ios",
 "alias_list": null,
 "email_address": "info@animatedmedia.ca",
 "phone_number": "416-977-7187",
 "description": "Toronto-based software company ",
 "created_at": "Tue Apr 13 23:58:30 UTC 2010",
 "updated_at": "Tue Jul 19 19:43:15 UTC 2011",
 "overview": "\u003Cp\u003EAnimated Media is a software company specializing in designing and developing rich media applications for the broadcast, mobile and consumer markets.  We focus on 3D and 2D applications that run on smartphones, tablets, IPTV/STB/DTV systems, portable media players and other consumer devices.\u003C/p\u003E\n\n\u003Cp\u003EWe license our VGK Platform development suite, as well as use it internally and for development projects, to bring intuitive, compelling user interfaces (UI) to life quickly, with tools to implement communications with websites, computers, or cloud services over Wi-Fi.  We leverage the pluses of Adobe Flash to create compelling UIs that are scalable to display beautifully on any screen size with natively fast performance.  Our background in systems level and 3D graphics development, allows us to provide hardware-accelerated and optimized performance.   One of our latest innovations joins 3D with Flash, enabling animations to be used as a texture with acceleration by the underlying GPU. Extending UI and design options in 3D enhanced or virtual worlds \u0026#8211; bringing the WOW Factor to any application.\u003C/p\u003E\n\n\u003Cp\u003EThe VGK Platform enables integration of rich media content into existing applications and native applications.  We empower our customers with an agile and innovative development platform to manage multimedia content, including Flash UI, animations and video, sourced from any location, allowing 2D/3D rendering across multiple displays and devices, giving direct C/C++ command and control access to the native OS, and enabling independent control of multimedia content, Flash and ActionScript.  \u003C/p\u003E\n\n\u003Cp\u003EWe also have the building blocks to develop engaging mobile applications that enable video capture and playback, upload/download of multimedia content to/from a website, add photo and text annotations, save the content locally and selectively publish it to websites for sharing, as well as Wi-Fi support to connect consumer devices inside and outside the home.  We support 3D UIs incorporating video from a website/camera, audio, accelerometer and touchscreen while simultaneously communicating with network devices to exchange information.  Our focus is on implementing these features in a beautiful UI that is optimized for the different display sizes or for rotation on mobile devices.  \u003C/p\u003E\n\n\u003Cp\u003EOur background in systems level and graphics software development gives us a competitive advantage over other providers as we know how to develop software for practically any hardware and software system combination. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       44],
      "assets/images/resized/0008/3683/83683v2-max-150x150.jpg"],
     [[250,
       74],
      "assets/images/resized/0008/3683/83683v2-max-250x250.jpg"],
     [[450,
       134],
      "assets/images/resized/0008/3683/83683v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "VGK Platform development suite",
    "permalink": "vgk-platform-development-suite",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "CEO, President \u0026 Founder",
    "person":
     {"first_name": "Chris",
      "last_name": "Brady",
      "permalink": "chris-brady",
      "image": null}},
   {"is_past": true,
    "title": "VP, Sales",
    "person":
     {"first_name": "Bob",
      "last_name": "Starr",
      "permalink": "bob-starr",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "119 Spadina Avenue",
    "address2": "Suite 902",
    "zip_code": "M5V 2L1",
    "city": "Toronto",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.youtube.com/user/AnimatedMedia",
    "title": "Animated Media's YouTube Channel"}]}