{"name": "Ankit Metals",
 "permalink": "ankit-metals",
 "crunchbase_url": "http://www.crunchbase.com/company/ankit-metals",
 "homepage_url": "http://www.indiamart.com/ankitmetals/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ankitmetals@tradepassport.org",
 "phone_number": "9930700045",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 16:12:06 UTC 2013",
 "updated_at": "Fri Apr 05 16:12:10 UTC 2013",
 "overview": "\u003Cp\u003EWe are in the Business of Trading and Supplying of Winding Copper Wires and Insulation Material from more than 30 years, with our concerned firm VINAYAKA IMPEX. Our organization is Accredited Distributors for BIC (Bharat Insulation Company (India) Ltd.) which makes copper wires and strips. Along with this, we supply insulation Material like Varnish, Sleeves, Papers for Insulation, Tapes Products. Our products are used by various transformer manufacture, motor rewinding industry and many others.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team has been a core element of the organization and being so it endeavors in order to procure the best-in-class range of products. They communicate with the clients to comprehend their exact requirements and then endeavor to provide them appropriate solutions.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nBeing a quality-driven organization, we are deeply committed to offer the best range of products. We ensure to procure all the products from the distinguished names of the industry. All our vendors develop products by making use of high-grade required basic material and advanced technology at their sound production unit.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are into strong and long term bond with the eminent names of this discipline . Owing to their domain expertise, we have been able to present our esteemed clients with best and value for money range of Electrical, Insulation and Earthing Material.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nAnkit Metals is deeply committed to acquire total clients\u0026#8217; satisfaction with its business practice. To meet expectations of the clients, we offer commendable range of products. Made of high-grade basic material, our range conforms to the defined parameters of the industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8882/248882v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8882/248882v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8882/248882v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}