{"name": "ANTlabs (Advanced Network Technology Laboratories Pte. Ltd.)",
 "permalink": "antlabs",
 "crunchbase_url": "http://www.crunchbase.com/company/antlabs",
 "homepage_url": "http://www.antlabs.com",
 "blog_url": "http://www.antlabs.com/index.php/articles/blog",
 "blog_feed_url": "",
 "twitter_username": "antlabs",
 "category_code": "network_hosting",
 "number_of_employees": null,
 "founded_year": 1999,
 "founded_month": 10,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hotel-hsia, hospitality-hsia, corporate-vbn, campus-wifi-hotspot, 3g-offload, secure-wifi, telco, isp, secure-server-gateway, inngate",
 "alias_list": null,
 "email_address": "sales@antlabs.com",
 "phone_number": "+65 6858 6789",
 "description": "Telco, VBN, Hospitality HSIA, WiFi",
 "created_at": "Wed Oct 12 09:42:47 UTC 2011",
 "updated_at": "Wed Oct 17 03:22:45 UTC 2012",
 "overview": "\u003Cp\u003EANTlabs (Advanced Network Technology Laboratories Pte. Ltd.) is a proven technology solutions partner for service providers\u0026#8217; unique Internet business needs. \u003C/p\u003E\n\n\u003Cp\u003EEstablished in Oct 1999, ANTlabs, a privately held company, provides technology solutions with five main areas of focus: 3G Offload, IP Management/IPv6,  Hospitality, Municipal WiFi and BYOD.\u003C/p\u003E\n\n\u003Cp\u003EHeadquartered in Singapore, ANTlabs has established itself as a market leader over the years, commanding a strong regional presence with branch offices in Malaysia and China, and representative offices in Thailand, Indonesia and Taiwan.\u003C/p\u003E\n\n\u003Cp\u003EANTlabs provides networking solutions with 3 main areas of focus: Telco/ISP Infrastructure, Hospitality and Visitor-based Network (Guest WiFi).\u003C/p\u003E\n\n\u003Cp\u003EIn the Telco/ISP Infrastructure industry, ANTlabs\u0026#8217; Service Selection Gateways and Value-Added IP Service Management Platforms have enabled Telcos and ISPs to enter the competitive market with great speed and confidence. ANTlabs is the market leader for enabling WiFi hotspots in ASEAN, with a 100% market share in Singapore and more than 75% cumulative market share in Singapore, Malaysia and Indonesia - Frost \u0026amp; Sullivan Oct 2005.\u003C/p\u003E\n\n\u003Cp\u003EWithin the Hospitality space, ANTlabs\u0026#8217; Hospitality solutions are a key business enabler for service institutions such as hotels and airports deploying High Speed Internet Access (HSIA) services for its guests. ANTlabs has, since 2004, developed an extensive global sales channel covering US (Teledex - world market leader in hotel guestroom phones), Europe (Divine Internet - Best Western Hotels preferred suppl ier), China (Bittel - China market leader in hotel guestroom phones), Middle East, Australia and Asia.\u003C/p\u003E\n\n\u003Cp\u003EIn the Enterprise arena, ANTlabs is one of the leading network solutions providers for both visitor-based solutions and the growing enterprise security market which includes end-point security, threat mitigation and network quarantine. ANTlabs\u0026#8217; customers in this space include The National University of Singapore, the Ministry of Education (Malaysia) and Netmarks (Japan). \u003C/p\u003E\n\n\u003Cp\u003EANTlabs: Leadership Through Technology Innovation\u003C/p\u003E\n\n\u003Cp\u003EANTlabs\u0026#8217; market leadership is a product of its strong R\u0026amp;D background which is focused on transparent networking technologies that are vendor neutral and seamlessly integrates and reuses the customer\u0026#8217;s existing network. This allows ANTlabs\u0026#8217; solutions to offer a winning combination of cost-effectiveness, scalability and ease of deployment to its broad base of customers.\u003C/p\u003E\n\n\u003Cp\u003EANTlabs has three international patents, two of which has been granted, for the cutting-edge technologies found in its products. Technology leadership enables ANTlabs to compete in the big league and its technologies have been proven in large-scale LAN and MAN networks.\u003C/p\u003E\n\n\u003Cp\u003EAs a testament of the company\u0026#8217;s technological competitive advantage, established names in the region such as SingTel, StarHub, M1, Etisalat, TMNet, TrueCorp, Indosat, Telkom and CBN have long selected ANTlabs\u0026#8217; solutions for its advanced technologies that enable network zero-configuration, infrastructure wholesale, location-based network access control and centralized network policy management.\u003C/p\u003E\n\n\u003Cp\u003EIn Japan, ANTlabs\u0026#8217; software has been supported and distributed by Japan Panasonic since 2002, after Panasonic Software Corp conducted an extensive patent exercise to evaluate ANTlabs\u0026#8217; patents and related products. Customers include Netmarks (as a key compulsory component of Netmarks\u0026#8217; end-point security solution for large Japanese corporations).\u003C/p\u003E\n\n\u003Cp\u003EIn 2005, The National University of Singapore had selected ANTlabs\u0026#8217; access controller with concurrent Microsoft AD network SSO and web-based Radius authentication to support its campus-wide network of 1200 APs and thousands of wired Ethernet points.\u003C/p\u003E\n\n\u003Cp\u003EBe it in a service provider, guest and visitor-based or corporate environment, ANTlabs technology enables Internet businesses and services, and creates new revenue opportunities while securing best user experience.\u003C/p\u003E\n\n\u003Cp\u003EANTlabs is the maker of InnGate, SSG, Tru\u0026#8217;Auth, Tru\u0026#8217;IP and Tru\u0026#8217;OS. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0015/7794/157794v2-max-150x150.png"],
     [[185,
       59],
      "assets/images/resized/0015/7794/157794v2-max-250x250.png"],
     [[185,
       59],
      "assets/images/resized/0015/7794/157794v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "InnGate 3",
    "permalink": "inngate-3",
    "image": null},
   {"name": "Service Selection Gateway III",
    "permalink": "service-selection-gateway-iii",
    "image": null},
   {"name": "Tru'Auth",
    "permalink": "truauth",
    "image": null},
   {"name": "Tru'IP",
    "permalink": "truip",
    "image": null},
   {"name": "Tru'OS",
    "permalink": "truos",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "CEO - ANTServices",
    "person":
     {"first_name": "Aw",
      "last_name": "Peng Soon",
      "permalink": "aw-peng-soon",
      "image": null}},
   {"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Teo",
      "last_name": "Wee Tuck",
      "permalink": "teo-wee-tuck",
      "image": null}},
   {"is_past": false,
    "title": "Acting CTO",
    "person":
     {"first_name": "Toh",
      "last_name": "Teck Kang",
      "permalink": "toh-teck-kang",
      "image": null}},
   {"is_past": false,
    "title": "Product Marketing Executive",
    "person":
     {"first_name": "Grace",
      "last_name": "Naces Gabriel",
      "permalink": "grace-naces-gabriel",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "1 Syed Alwi Road",
    "address2": "#03-01 Song Lin Building",
    "zip_code": "207628",
    "city": "Singapore",
    "state_code": null,
    "country_code": "SGP",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}