{"name": "Anyway Engineering",
 "permalink": "anyway-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/anyway-engineering",
 "homepage_url": "http://www.indiamart.com/anywayengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rubber-pipe-winding-drum-and-wire-belts-",
 "alias_list": null,
 "email_address": "anywayengineering@tradepassport.org",
 "phone_number": "9821465799",
 "description": "supplier of a wide series of Conveyors, ",
 "created_at": "Thu Apr 04 15:31:47 UTC 2013",
 "updated_at": "Thu Apr 04 15:31:50 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2007, we, “Anyway Engineering”, are a well known manufacturer and supplier of a broad array of Material Handling Conveyor, Rubber Pipe Winding Drum and Wire Belt. The range we deal in is inclusive of Slide Conveyor, Chain And Sprocket Conveyor System, Belt Conveyor, Roller Conveyor, Slat Conveyor and Wire Mesh Belt Conveyor. Apart from these, we offer Accumulation Roller Conveyor, Drum Palleting Roller Conveyor, Rubber Pipe Winding Drum and Wire Belts. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nRubber Pipe Winding Drum\nWire Belt\nMaterial Handling Conveyor\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIn standing ahead of our industry counterparts, we are continually being assisted by a team of competent professionals. These experts have been recruited after thorough selection procedure after conducting which we ensure that the selected candidate is master in his/her respective field of specialization. Well-versed with handling abilities of different domains, these professionals ensure to complete all the assigned tasks with perfection.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWith a viewpoint of meeting clients specific demands in a hassle-free manner, we have developed a sprawling infrastructure premises. This setup is segregated into varying sections, including designing, manufacturing, quality checking, R\u0026amp;D and logistics units. As a result, this segregation assists us in ensuring trouble-free working of all the activities.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nEver since our foundation stone was laid, we are continually engaged in facilitating our respected clients with a wide gamut of Conveyors, Rubber Pipe Winding Drum and Wire Belts. Adhering to this quality conscious policy, we manufacture a best-in-class product-line, which is manufactured using excellent quality metals and other requisite components.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       99],
      "assets/images/resized/0024/8033/248033v2-max-150x150.jpg"],
     [[250,
       166],
      "assets/images/resized/0024/8033/248033v2-max-250x250.jpg"],
     [[250,
       166],
      "assets/images/resized/0024/8033/248033v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}