{"name": "Apollo Data Technologies",
 "permalink": "apollo-data-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/apollo-data-technologies",
 "homepage_url": "http://www.apollodatatech.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "info@apollodatatech.com",
 "phone_number": "312.787.7376",
 "description": "",
 "created_at": "Thu Jul 14 03:41:40 UTC 2011",
 "updated_at": "Thu Jul 14 03:41:39 UTC 2011",
 "overview": "\u003Cp\u003EApollo Data Technologies, LLC provides predictive analytics solutions. It offers solutions for various stages of data analysis, including setting data collection strategies, data warehousing, and text mining. The company also provides business to business services, such as campaign optimization, cross-sell/up-sell recommendation, inventory and replenishment forecasting, market optimization planning, market segmentation modeling, retention modeling, sales forecasting, shipping optimization, and warranty claim optimization; financial services, including customer segmentation modeling and next best offer prediction; and healthcare services comprising at-risk claims prediction, charge capture analytics, claim underpayment prediction, credit balance analytics, denial management, facility capacity optimization, medical error prediction, physician performance analytics, self-pay analytics, supply optimization, and supply use anomaly detection. In addition, it provides media services consisting of behavioral targeting, content personalization, market segmentation, price-point optimization, and subscriber acquisition and retention prediction; public services, such as anomaly detection, criminal network analysis, and link and text analysis; retail and consumer goods services, including call center analytics, customer acquisition and retention prediction, customer segmentation modeling, inventory and replenishment forecasting, market basket analysis, market optimization planning, sales forecasting, and shipping optimization; and telecommunications services comprising call center analytics and demand planning, as well as subscriber acquisition, plan optimization, retention, and usage planning. Apollo Data Technologies, LLC was founded in 2003 and is based in Chicago, Illinois with an additional office in Bellevue, Washington.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0014/4120/144120v1-max-150x150.jpg"],
     [[250,
       81],
      "assets/images/resized/0014/4120/144120v1-max-250x250.jpg"],
     [[278,
       91],
      "assets/images/resized/0014/4120/144120v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Jeff",
      "last_name": "Kaplan",
      "permalink": "jeff-kaplan",
      "image": null}},
   {"is_past": false,
    "title": "COO",
    "person":
     {"first_name": "Brad",
      "last_name": "Aaron",
      "permalink": "brad-aaron",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "325 W. Huron Street",
    "address2": "Suite 815",
    "zip_code": "60654",
    "city": "Chicago",
    "state_code": "IL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}