{"name": "Appetizer Mobile",
 "permalink": "appetizer-mobile",
 "crunchbase_url": "http://www.crunchbase.com/company/appetizer-mobile",
 "homepage_url": "http://www.appetizermobile.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "AppetizerMobile",
 "category_code": "mobile",
 "number_of_employees": 12,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "application-development, android-development, mobile-marketing, app-development, mobile-app-development, appetizer-mobile, android-app-development, app-developers, ipad-app-development, ipad-application-development, jordan-edelson",
 "alias_list": null,
 "email_address": "Contact@AppetizerMobile.com",
 "phone_number": "212-613-1600",
 "description": "Mobile development digital agency",
 "created_at": "Wed May 11 16:55:56 UTC 2011",
 "updated_at": "Fri Dec 30 07:39:55 UTC 2011",
 "overview": "\u003Cp\u003EAppetizer Mobile, a New York City-based leading full-service mobile development digital agency, has exploded onto the industry offering intuitive, engaging and entertaining app experiences that capture consumers\u0026#8217; attention and maximizes client ROI. Appetizer Mobile already boasts an impressive client roster - NBA, Kim Kardashian, and INTERSCOPE Records- and proudly develops products that have generated high profile status, with two apps featured on the latest iPad Commercials.  As more companies gravitate towards mobile solutions, businesses look to Appetizer Mobile to create an app experience that stands out in the already competitive mobile space.  \u003C/p\u003E\n\n\u003Cp\u003EAppetizer Mobile is the brainchild of Founder and CEO Jordan Edelson, a seasoned and dynamic entrepreneur. Edelson has a background in Game Broadcasting Live, a digital streaming video game broadcasting channel that premiered on Time Square\u0026#8217;s Jumbotron screens and eSportsTV, a portal for streaming live electronic sports and professional video gaming broadcasts. Edelson also served as Chief Technology Officer of H3 Enterprises Inc., the first publicly traded Hip-Hop company, which created technology infused Hip Hop themed restaurants.\u003C/p\u003E\n\n\u003Cp\u003EThe team prides itself in its capabilities to create and design engaging applications for just about any industry desiring a presence in the mobile space. Appetizer Mobile stays ahead of the trends and leverages their forwarding thinking approach so that they can incorporate the latest technology in their mobile application experiences. They offer clients a strategic advantage and positioning for a high yielding ROI in the competitive mobile app market. \u003C/p\u003E\n\n\u003Cp\u003EOffering a hands-on, out-of-the-box creative approach to today\u0026#8217;s explosive mobile boom is how Appetizer Mobile has earned a solid reputation among their impressive roster of clients, which includes: \nDel Friscos Restaurant Group: Appetizer Mobile designed and developed websites for Del Friscos (Delfriscos.com) and Sullivan\u0026#8217;s Steakhouse (Sullivansteakhouse.com) in HTML 5 making both compatible with mobile browsers. In addition, Appetizer Mobile optimized their social media, SEO/SEM and developed apps for each concept yet to be released.\u003Cbr/\u003E\nInterscope Records: Appetizer Mobile collaborated with Interscope Records to develop 50 Cent - Baby By Me Calculator. This entertaining app features clips of advice from 50 Cent and Twitter integration so users can let everyone know how much 50 says they\u0026#8217;re worth. \nKim Kardashian: Appetizer Mobile developed the official Kim Kardashian app, which offers a glimpse into Kim\u0026#8217;s fabulous life\u0026#8211;watch as she strikes her signature poses or blows a kiss. Discover different ways to interact with Kim, like shaking the phone to make her talk. \nKryptos Communications: Developed by Appetizer Mobile, Kryptos is a secure, fully encrypted voice communications application utilizing military grade 256-bit AES encryption to encrypt voice communications before transmission, using 2048 bit RSA for key exchange.\nMontessorium: Appetizer Mobile has been featured in Apple\u0026#8217;s \u0026#8220;We Believe\u0026#8221; iPad 2 National Commercial for Montessorium\u0026#8217;s \u0026#8220;Intro to Math\u0026#8221; learning app and Apple\u0026#8217;s National iPad commercial iPad is Electric\u009d for Montessorium\u0026#8217;s \u0026#8220;Intro to Letters\u0026#8221; Learning app. Featured in Apple\u0026#8217;s 2010 Rewind, Best Apps of the Year!\nNational Basketball Association (NBA): The NBA, in association with Appetizer Mobile, launched their NBA Mini Bobble Campaign. Available via the iTunes App Store, iPod, iPhone and Android Market owners can now download virtual bobble heads of their favorite NBA players, ranging from Kobe Bryant and Lebron James to Steve Nash and Kevin Garnett. \u003C/p\u003E\n\n\u003Cp\u003EMost recently, Appetizer Mobile launched their newly redesigned website: AppetizerMobile.com. With its fresh design and clean layout, the new site showcases the company\u0026#8217;s capabilities from general mobile consulting, mobile application development, website development with mobile platform integration, to corporate identity, mobile page optimization, and more. Additionally, AppetizerMobile.com offers live 24/7 sales and customer service support to all customers. The website will also continue to maintain its RSS feed allowing visitors to stay up-to-date on the latest news from Apple iOS, Android, Blackberry, HP webOS, and Windows Mobile. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0013/4573/134573v2-max-150x150.png"],
     [[250,
       61],
      "assets/images/resized/0013/4573/134573v2-max-250x250.png"],
     [[450,
       110],
      "assets/images/resized/0013/4573/134573v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "NYC Office",
    "address1": "115 West 45th Street, Suite 501",
    "address2": "",
    "zip_code": "10036",
    "city": "New York City",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}