{"name": "Applane Solutions Pvt. Ltd",
 "permalink": "applane-solutions-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/applane-solutions-pvt-ltd",
 "homepage_url": "http://www.applane.com/business",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "erp-software, crm, hr",
 "alias_list": null,
 "email_address": "help@applane.com",
 "phone_number": "",
 "description": "A web-based ERP software suite.",
 "created_at": "Wed Nov 14 12:28:01 UTC 2012",
 "updated_at": "Sat Nov 24 02:24:38 UTC 2012",
 "overview": "\u003Cp\u003EApplane for Business is cloud-based ERP suite that seamlessly integrates Customer Relationship Management (CRM), Human Capital Management (HCM), Project Management (PM) \u0026amp; Financial Management (FM) in one place. It is simple \u0026amp; intuitive to use and extremely cost effective while offering a stable \u0026amp; safe anytime, anywhere access to its users.\u003C/p\u003E\n\n\u003Cp\u003EApplane for Business is a one-stop solution for your entire organization which is easy to customize, integrate and implement in a very affordable way. Applane helps organizations of all sizes across industries run better, without causing a flutter in their existing operations. Its innovative approach moves ahead from merely capturing of sales data to actually aiding the process of sales and customer relationship. Applane for Business packs a punch of features which instantly shows realizable benefits for your organization.\u003C/p\u003E\n\n\u003Cp\u003EA few key applications within the suite are:\u003C/p\u003E\n\n\u003Cp\u003ECustomer relation management\u003C/p\u003E\n\n\u003Cp\u003EContacts Management(Import Directly from Google contact)\nSales and Customer Relationships:-\nCampaign management\nQuote \u0026amp; Document Management\nTask Management (integrated with Google Calendar)\nMarketing Cost Management\nTwitter Integration and Send notification feature.\nCustomer Support Management\nWon Opportunities Tracking\u003C/p\u003E\n\n\u003Cp\u003EHuman Resource Management:-\u003C/p\u003E\n\n\u003Cp\u003EAttendance Management\nPayroll Management\nTraining and development\nSelf service portal\nEmployee Tour Management System\nActivity/ Event Management\u003C/p\u003E\n\n\u003Cp\u003EOperations Management:-\u003C/p\u003E\n\n\u003Cp\u003EOrder \u0026amp; Delivery management\nProject cost management\nAgeing reports\nResource Allocation and Efficiency  Management.\nTaskspace Management.\nWeekly Task Planning.\nProfit and Loss analysis\u003C/p\u003E\n\n\u003Cp\u003EFinance Management:-\u003C/p\u003E\n\n\u003Cp\u003ESales and Purchase Order Management.\nTax Calculations.\nOrder Invoicing and Receipt Generation.\nFund Transfer Analysis.\nPayments and Due Invoices Report Analysis.\nCredit and Debt Management .\nAsset Tracking and Cost Management.\nLoan and Expenses Management. \nAutomatic Voucher Creation.\nMaintaining Ledger Entries.\nProfit \u0026amp; Loss, Balance Sheets and Cash Flow statements Reconciliation and management.\nAutomated Bank and Cash Reconciliation.\nVendor Management\u003C/p\u003E\n\n\u003Cp\u003EWhy Applane for Business?\u003C/p\u003E\n\n\u003Cp\u003EKey Performance Management: Applane for Business helps you define Key Performance Indicators for your business functions. Every individual and managers have a KPI dashboard where they can visualize their own and their team’s KPI. Each KPI can be drilled down to last level of data to enable quick decision making.\u003C/p\u003E\n\n\u003Cp\u003EAdvanced Filtering and Sorting: Option to filter / sort report or form data in real time using advanced filters.\u003C/p\u003E\n\n\u003Cp\u003EUser Defined Fields: administrators can add fields on the fly and enhance the application as the processes change within the organization.\u003C/p\u003E\n\n\u003Cp\u003EInteractive Reports: Applane for Business has a very rich set of reports. All reports are fully interactive and user can change filters and order drill down in real time.\u003C/p\u003E\n\n\u003Cp\u003EThird Party integration: Applane for business can be integrated with any third party API using web services framework. Currently Applane is integrated with Google Mail, Google Calendar, Twitter and Linkedin. It can be integrated with any third party SMS and payment gateway to leverage existing facilities within the system.\u003C/p\u003E\n\n\u003Cp\u003EValue for your money: We not only provide a great CRM solution, but have a great price too! How about 2 users entirely free? And no long term contracts; just pay as you go. \u003C/p\u003E\n\n\u003Cp\u003EKey features of Applane CRM:\u003C/p\u003E\n\n\u003Cp\u003EContacts Management: Applane CRM imports contacts from various sources and keep them in an integrated manner to make them accessible easily.\nSales \u0026amp; Customer Relationship: Applane CRM empowers you with more efficient and powerful sales enabling engine.\u003C/p\u003E\n\n\u003Cp\u003EEmail Campaigns: You can create email templates for new prospects, opportunities or customers and can communicate a message to a target audience with a single mail. ??\u003C/p\u003E\n\n\u003Cp\u003ECRM API for Third-party Integration: Data in Applane CRM can be accessed and updated through web interface or a web service which means CRM be used in conjunction with your other business applications and data can be replicated both ways via connectors as required.\u003C/p\u003E\n\n\u003Cp\u003ECustomization: Applane CRM is highly customizable and can be customized to your specific business requirements.\u003C/p\u003E\n\n\u003Cp\u003EInteractive Reports \u0026amp; Dashboards: Applane CRM helps you analyze sales \u0026amp; marketing trends and key CRM metrics by amazingly interactive reports and dashboards. \nEasy Access and Follow up: Applane CRM provides for easy follow up of your Leads, Opportunities and Quotes. You can access all information from a single screen and perform functions with minimal possible clicks.\u003C/p\u003E\n\n\u003Cp\u003ERole-based Security: Applane CRM empowers you to control the CRM data access based on users\u0026#8217; job role in your organization hierarchy.\nValue for your money: We not only provide a great CRM solution, but have a great price too! How about 2 users entirely free? And no long term contracts; just pay as you go.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Plot No:11, Opp. Infocity-II",
    "address2": "Sec-33, Hero Honda Chowk",
    "zip_code": "122021",
    "city": "Gurgaon",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.applane.com/business",
    "title": ""}]}