{"name": "Appsafari",
 "permalink": "appsafari",
 "crunchbase_url": "http://www.crunchbase.com/company/appsafari",
 "homepage_url": "http://www.appsafari.com/",
 "blog_url": "http://www.appsafari.com/tips-and-tricks/",
 "blog_feed_url": "",
 "twitter_username": "appsafari",
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "App discovery platform",
 "created_at": "Tue Apr 30 14:33:49 UTC 2013",
 "updated_at": "Mon May 06 05:20:19 UTC 2013",
 "overview": "\u003Cp\u003EAt AppSafari we write honest iPhone app reviews daily, since 2007. Our team is dedicated to finding you the best apps, and writing reviews that help you discover what to buy and what to stay away from in the App Store. We have over 6,324 app reviews and counting.\u003C/p\u003E\n\n\u003Cp\u003EThe App Store is a jungle. Go on a safari of the best iPod touch, iPad and iPhone apps. Our goal to keep things simple and fun and keep you happy by giving you the latest and greatest apps and software developed just for your Apple iPhone or iPod touch.\u003C/p\u003E\n\n\u003Cp\u003ENew apps are released daily and we are constantly updating the site, so make sure to bookmark us on your Mobile Safari browser or computer and visit us regularly for the latest app reviews and news.\u003C/p\u003E\n\n\u003Cp\u003EHere are some of the things you can do at AppSafari to get started: Meet the authors who write the app reviews, read the latest\niPhone app reviews viewable in either a gallery or list format, shop for iPhone and iPad accessories in the AppSafari store, browse the app reviews sorted by rating and category, enter our daily contest to win free apps, and if you’re a developer you can submit your iOS Apps to be considered for review. For tips on using our site and app FAQs check out our help page. Feel free to contact us if you have any questions or comments.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}