{"name": "Appto Us",
 "permalink": "appto-us",
 "crunchbase_url": "http://www.crunchbase.com/company/appto-us",
 "homepage_url": "http://www.appto.us/",
 "blog_url": "http://blog.appto.us/",
 "blog_feed_url": "",
 "twitter_username": "apptous",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-apps, app-distribution, app-management, developers, metadata, iphone, android, simple-management-tools",
 "alias_list": null,
 "email_address": "danielle@wetfishmarketing.com",
 "phone_number": "",
 "description": " Apps marketing and Distribution Company",
 "created_at": "Thu Sep 13 10:26:00 UTC 2012",
 "updated_at": "Wed Sep 19 15:51:53 UTC 2012",
 "overview": "\u003Cp\u003EApptous is a app-management, promotion and distribution platform.\u003C/p\u003E\n\n\u003Cp\u003EBy signing up to Apptous, you’ll have an ever growing toolkit of features on hand to help market, distribute, promote and engage with users, for as many apps as you like through our app promotion platform.\u003C/p\u003E\n\n\u003Cp\u003EWelcome to today’s app-economy!!\u003C/p\u003E\n\n\u003Cp\u003EAs this market-place grew into what it is now, the technology and logistics which are necessary to support such a large-scale ‘movement’ remained under-developed. Amazingly developed and designed apps remain undiscovered, and app-developers are finding it increasingly difficult to make themselves heard above all the noise.\u003C/p\u003E\n\n\u003Cp\u003EThe glaring gap in this new economy was something we decided to help out with. We wanted to provide something that bridges the growing gulf between the skills and expertise needed to take an app from idea to reality, and the time, resources and knowledge needed to turn that app into a success- into a flourishing business.\u003C/p\u003E\n\n\u003Cp\u003EIn essence, we recognized that there was not only a great need for help in getting your apps appearing on the right distribution networks, but also for your apps to stand out and sell themselves when they’re actually there.\u003C/p\u003E\n\n\u003Cp\u003ESo, we’ve put together an end-to-end platform where you can manage multiple apps, releases, their online presence, and important aspects of their promotion and marketing, and keep on top of how your apps are displayed on multiple distribution channels all from your single Apptous account.\u003C/p\u003E\n\n\u003Cp\u003EBut we haven’t just settled at that. The app-economy is still a growing, evolving and changing eco-system, and we will continue to grow, evolve and change with it, ensuring that if you decide to use our platform, you’ll always be at the very forefront of app management, promotion and distribution, and always receiving the best advice and tips on how to help your apps succeed.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[122,
       30],
      "assets/images/resized/0021/1145/211145v2-max-150x150.png"],
     [[122,
       30],
      "assets/images/resized/0021/1145/211145v2-max-250x250.png"],
     [[122,
       30],
      "assets/images/resized/0021/1145/211145v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}