{"name": "Apsu Trading",
 "permalink": "apsu-trading",
 "crunchbase_url": "http://www.crunchbase.com/company/apsu-trading",
 "homepage_url": "http://www.indiamart.com/apsutrading/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "corporate-promotional-gifts, bed-sheets--curtains, sign-board-printing-services, plastic-printing-services-",
 "alias_list": null,
 "email_address": "apsutrading@tradepassport.org",
 "phone_number": "9910433400",
 "description": "Appliances, Computers, Laptops, etc.",
 "created_at": "Fri Apr 05 09:11:42 UTC 2013",
 "updated_at": "Fri Apr 05 09:11:46 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 2011, at Noida (Uttar Pradesh, India), we, “Apsu Trading”, are considered amongst the noteworthy traders and suppliers of a wide assortment of Cotton, Electrical and Electronics Appliances, Computers, Laptops, etc. The offered range comprises Head/Face Protection, Head Protection, Respiratory Protection, Reusable Respirators, Hearing Protection, Welding Helmets, Electronic \u0026amp; Electrical Stocks, Safety Cover All, Safety Shoes, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nOur company is highly renowned in the national as well as the international market for providing qualitative products that are immaculate and unblemished as far as quality is concerned. A panel of quality controllers independently inspects each product to avoid any kind of defects. We procure our offered product range from the consistent and trustworthy vendors of the industry. Our procurement agents follow predefined quality procedures while procuring these products. In addition to this, these products are properly packed before supplying to the clients in to order to hassle free transit.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are responsible for providing a quality assortment of Cotton, Electrical and Electronics Appliances, Computers, Laptops, etc. The products we are offering to the clients are procured from the certified and reliable vendors of the market. Our vendor makes sure that these products are in total compliance with the set global norms. Furthermore, our experienced professionals select our vendors after going through various market researches on the basis of their market reputation, manufacturing facilities, financial position, etc.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client centric organization, we have successfully understood customers’ variegated requirements. By incorporating superior quality standards, transparent business policies and on-time delivery schedules, we have successfully fulfilled the demands of our prestigious clients accordingly. Before supplying products to our clients, we always check them on well-defined parameters in order to ensure their flawlessness. In addition to this, owing to our ethical business practices and timely delivery, we have become the most preferred choice of our valuable clients.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nCorporate Promotional Gifts\nBed Sheets \u0026amp; Curtains\nSign Board Printing Services\nInterior Decoration Services\nPlastic Printing Services\nFlex Printing Services\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8466/248466v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8466/248466v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8466/248466v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}