{"name": "AR Wires",
 "permalink": "ar-wires",
 "crunchbase_url": "http://www.crunchbase.com/company/ar-wires",
 "homepage_url": "http://www.indiamart.com/arwires/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "arwires@tradepassport.org",
 "phone_number": "9829062282",
 "description": "manufacturer, trader, supplier",
 "created_at": "Thu Apr 04 15:30:57 UTC 2013",
 "updated_at": "Thu Apr 04 15:31:00 UTC 2013",
 "overview": "\u003Cp\u003EA R Wires is founded in the year 2012 at Jaipur, Rajasthan (India). We are the prominent manufacturer, trader, supplier and exporter of EDM Wires, Jari Wires, Zinc Coated Wires, Nickel Silver Wires \u0026amp; many more. All these products are of premium quality and have hassle free performance. We always make sure our products have optimum finish, high tensile strength and high durability. No compromise on grounds of quality is done on our part.\u003C/p\u003E\n\n\u003Cp\u003EOur Vendor Base:\nIn order to meet the ever increasing demands of the market and clients, we have collaborated with trustworthy vendors of the industry. Our expert team has taken utmost care to select only the reliable and well-established vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nThe prime forte of our company is best quality products and for that we believe in the tag line of ours \u0026#8220;QUALITY IS OUR STRENGTH\u0026#8221;. To carry out quality analysis, No compromise on grounds of quality is accepted in our company. We have a team of experienced engineers and technicians who are engaged in the observation, analysis and delivery of finest quality products.\u003C/p\u003E\n\n\u003Cp\u003EVision:\nTo offer excellent quality products\nExecution of every product order within the scheduled time frames\nOffering nothing less than the most cost effective products\nTo cater as per the exacting requirements of our esteemed customers\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have emerged as the fastest growing company due to consistency in quality standards, ethical business policies and lower costs in the market. We promise our clients to provide them the best deal at reasonable costs. The final consignments reaches clients’ destination without any delay.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8031/248031v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8031/248031v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8031/248031v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}