{"name": "Aradhana Apparels",
 "permalink": "aradhana-apparels",
 "crunchbase_url": "http://www.crunchbase.com/company/aradhana-apparels",
 "homepage_url": "http://www.indiamart.com/aradhanaapparels/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "aradhanaapparels@tradepassport.org",
 "phone_number": "9892121205",
 "description": "manufacturing \u0026 supplying",
 "created_at": "Fri Apr 05 06:19:49 UTC 2013",
 "updated_at": "Fri Apr 05 06:19:52 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1983, we, \u0026#8216;Aradhana Apparels\u0026#8217;, are a preeminent organization involved in manufacturing and supplying a substantial and peerless collection of Uniforms and their Accessories. In this range, we are offering Men Jackets, Men Shirts, Men Trousers, Men Knitwear, Women Skirts, Women Pants, Women Knitwear, Women Jackets and Neck Ties. In addition to this, we offer Socks, Handkerchiefs, Belts, Blazers, Collar T-shirts, V-Neck T-Shirts, Scout Uniforms and Jackets. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nAt Mumbai, (Maharashtra, India), we have developed a state-of-the-art-infrastructure, which is equipped with all the technically advanced machinery and amenities that are required for manufacturing a peerless collection of Uniforms and their Accessories. Furthermore, owing to the support of our sound infrastructure, we are able to retain the increasing rate of production. \u003C/p\u003E\n\n\u003Cp\u003ETeam of Experts:\nWe are supported by a team of zealous professionals, who are the experts of this domain and support us to execute all our business related activities in a proper systematized manner. Owing to the support of excellent skills of our team members, we are able to hold all the aces in designing attractive collection of Uniforms and their Accessories.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing an eminent organization in the domain, we lay emphasize on offering a qualitative range of S Uniforms and their Accessories to our esteemed patrons. Collection that we offer are manufactured by making use of optimum quality fabrics, like cotton, polyester, synthetic and other such fabric. \u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nOwing to our patrons focused approaches, we have been able to survive through cut throat competition. Under these approaches, we ensure that our patrons receive a high in quality collection of Uniforms and their Accessories. To ensure that our offered spectrum is able to stand tall on the expectations of patrons, we manufacture it using premium quality fabrics, threads and other requisite material, sourced from the most reliable vendors of the industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8319/248319v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8319/248319v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8319/248319v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}