{"name": "Arambla Group LLC",
 "permalink": "arambla-group-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/arambla-group-llc",
 "homepage_url": "http://www.arambla.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "aramblamarket",
 "category_code": "web",
 "number_of_employees": 4,
 "founded_year": 2008,
 "founded_month": 10,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "marketplace, exchange, auction, barter, bargaining, swap, entertainment, fun, ads, map, do-more-with-less, more-than-exchange",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Trading in a non-monetary fashion!",
 "created_at": "Sat Dec 17 13:06:52 UTC 2011",
 "updated_at": "Mon Dec 19 02:27:48 UTC 2011",
 "overview": "\u003Cp\u003ENew freedom - freedom to be independent of money by trading goods and services in a non-monetary fashion!\u003C/p\u003E\n\n\u003Cp\u003EArambla Group LLC is a company, which operates in a field of e-commerce and owns Arambla® marketplace brand. Arambla® marketplace concept is about creating a non-monetary trading platform with immediate goal to provide the best trading environment for all kind of traders.\nArambla Group is trying to solve the problem of lack in non-monetary market segment for the wide range (public) of use.\nOur company provides customers an innovative trading system with integrative bargaining mechanism, which adds a possibility for both parties of a trading process, to be a joint problem-solvers looking for win-win opportunity.\nSystem will help to satisfy current needs without additional expenses by offering goods and services for a trade. Due to the international nature of the product and the fact that traders might be located in the different geographical regions the choice of offered goods and services is significantly increasing. \nAs well as the opportunity traders can use the system for the formalizing and conducting of transactions in non-monetary trade. In simple terms: solution that enables to use our system as non-monetary online bank for wide range (public) of users.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       55],
      "assets/images/resized/0016/6729/166729v2-max-150x150.png"],
     [[218,
       80],
      "assets/images/resized/0016/6729/166729v2-max-250x250.png"],
     [[218,
       80],
      "assets/images/resized/0016/6729/166729v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}