{"name": "Arcplan",
 "permalink": "arcplan",
 "crunchbase_url": "http://www.crunchbase.com/company/arcplan",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Thu Jun 13 06:42:51 UTC 2013",
 "updated_at": "Fri Jun 14 11:54:54 UTC 2013",
 "overview": "\u003Cp\u003Earcplan, Inc. provides business intelligence (BI), dashboard, corporate performance, and planning software solutions for desktop and mobile use. It offers arcplan Enterprise platform for building non-compromising BI and analytic applications. The company’s arcplan Enterprise includes components, such as arcplan Analytic Services to deploy applications in a service-oriented architecture environment; arcplan Application Designer for entry-level programmers or skilled business to build and deploy applications; and arcplan Administration Console for publishing applications and enabling widespread access through the end-user’s browser, desktop, or company portal. arcplan, Inc. also provides arcplan Edge, an enterprise budgeting, planning, and forecasting platform that combines Excel templates with Web-based reporting, dashboards, and workflow; and arcplan Excel Analytics to extend the value of arcplan Enterprise deployments by providing ad-hoc analysis capabilities across multiple data sources in a Microsoft Office environment. In addition, it offers arcplan Engage to allow information consumers and decision-makers to have access to information required for corporate decision-making; arcplan Mobile to distribute interactive and animated dashboards on team’s mobile devices, and create mobile BI and planning applications; and arcplan Spotlight, a self-service analysis solution to build reports, take action, and automate queries. Further, arcplan, Inc. provides partner solution gallery, SAP competence center, Essbase competence center, scorecards and dashboards, operational performance management, SharePoint integration, and solution template-CFO cockpit solutions; and consulting, education, arc|community, and support services. It offers its solutions through a direct sales force and a network of partners worldwide. The company was founded in 1993 and is based in Berwyn, Pennsylvania. arcplan, Inc. operates as a subsidiary of arcplan Information Services GmbH\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Business Development Director APAC",
    "person":
     {"first_name": "Robert",
      "last_name": "Holliday",
      "permalink": "robert-holliday",
      "image":
       {"available_sizes":
         [[[108,
            107],
           "assets/images/resized/0027/4661/274661v1-max-150x150.png"],
          [[108,
            107],
           "assets/images/resized/0027/4661/274661v1-max-250x250.png"],
          [[108,
            107],
           "assets/images/resized/0027/4661/274661v1-max-450x450.png"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}