{"name": "AreYouCatholic?",
 "permalink": "areyoucatholic",
 "crunchbase_url": "http://www.crunchbase.com/company/areyoucatholic",
 "homepage_url": "http://www.AreYouCatholic.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "public_relations",
 "number_of_employees": 1,
 "founded_year": 2010,
 "founded_month": 11,
 "founded_day": 17,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "catholic, catholic-church",
 "alias_list": null,
 "email_address": "info@areyoucatholic.com",
 "phone_number": "888-343-3719",
 "description": "Catholic Social Movement",
 "created_at": "Thu Feb 03 06:23:35 UTC 2011",
 "updated_at": "Thu Feb 03 06:36:16 UTC 2011",
 "overview": "\u003Cp\u003EAreYouCatholic.com - An easy way for Catholics to publicly and anonymously share what it means to be Catholic. An active Catholic Church offers its parishioners the ability to share with the public the random acts of charity they perform in the community. All acts are traced back to the church and offer excellent and positive visibility to the Catholic Church and also helps spread the message of Catholicism.\u003C/p\u003E\n\n\u003Cp\u003EThere has been a recent decline in the number of Catholic Churches since 2000 as the number has dropped from 19,627 in the United States to 18,372 in 2010. (Statistics from 2011 Catholic Almanac) This trend can be directly linked to the need for the Catholic Church to generate other forms of revenue to sustain its presence. AreYouCatholic.com looks to be the first of its kind to generate a steady online presence for the Catholic Church and also give back to the organization that it is targeting.\u003C/p\u003E\n\n\u003Cp\u003EAccording to catholic.org, Pope Benedict XVI is a social media advocate and is the first Pope to have his own YouTube and Facebook accounts. He also states according to catholic.org, \u0026#8220;Priests are thus challenged to proclaim the Gospel by employing the latest generation of audiovisual resources, which, alongside traditional means, can open up broad new vistas for dialogue, evangelization, and catechesis.\u0026#8221; There is a great demand for a new form of Catholic movement and with the open support from the Pope, this vision is a realistic one.\u003C/p\u003E\n\n\u003Cp\u003EThe time is now for a Catholic service as there are none to market currently endorsed by the Catholic Church at this level. Across the world there are nearly 1 billion Catholics, more than both Facebook and Twitter combined. Plus an effort of this size creates an extremely targeted demographic as it only reaches out to Catholics that attend mass on a regular basis.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[139,
       150],
      "assets/images/resized/0012/0259/120259v2-max-150x150.png"],
     [[232,
       250],
      "assets/images/resized/0012/0259/120259v2-max-250x250.png"],
     [[361,
       388],
      "assets/images/resized/0012/0259/120259v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}