{"name": "ArgoSystems",
 "permalink": "argosystems",
 "crunchbase_url": "http://www.crunchbase.com/company/argosystems",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Thu Jun 13 07:31:20 UTC 2013",
 "updated_at": "Fri Jun 14 11:41:01 UTC 2013",
 "overview": "\u003Cp\u003EArgos Systems, Inc. develops and delivers computer aided design (CAD) and product data management solutions. It offers Vertex BD, a building information modeling (BIM) software for wood and cold-formed steel framed residential and light commercial construction; DesignStream, a Web-based design collaboration tool for homebuilding companies, which connects building documentation with sales teams, design centers, estimating, and trade partners; and Vertex Viewer, an application that is used for viewing, red lining, and printing Vertex BD drawings and 3D models. The company also provides Vertex BD Architectural that is primarily used as a house design software; and Vertex BD Framer, which is used primarily as a panel fabrication software by component manufacturers and panelizers to automate the process of generating wall and floor panel fabrication drawings, structural layouts, cut lists, and other material reports. In addition, it offers Vertex BD Products, a full house design, home building, light commercial building, and panel fabrication software; Master Set Manager, which allows designers to automatically generate needed elevations, sections, and layout views; Rendering module that provides the tools needed to create rendered marketing images; and WWW Publisher for publishing documents created during the design work in a folder or on a printer in various file formats. Further, the company provides 20-20 Design, a CAD software that lets the client design, plan, and visualize kitchens and baths; training, support and maintenance, implementation and custom development, customer support, and consulting services. It licenses its software to production, custom, manufactured, and modular home builders; commercial builders, component manufacturers, architecture and engineering companies, material suppliers, plan service providers, and educational institutions in North and South America\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Systems Engineer",
    "person":
     {"first_name": "David",
      "last_name": "Gudmundson",
      "permalink": "david-gudmundson",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}