{"name": "Aries Global",
 "permalink": "aries-global",
 "crunchbase_url": "http://www.crunchbase.com/company/aries-global",
 "homepage_url": "http://www.indiamart.com/ariesglobalaromazs/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ariesglobalaromazs@tradepassport.org",
 "phone_number": "91)-(120)-4130303",
 "description": "Manufacturer, Supplier and Exporter",
 "created_at": "Thu Apr 04 05:53:55 UTC 2013",
 "updated_at": "Thu Apr 04 05:53:59 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012 at, Noida (Uttar Pradesh, India), we, “Aries Global Aromazs Private Limited”, are recognized as one of the most trusted and relied upon Manufacturer, Supplier and Exporter of High- End Cosmetics products like Hair Removal Creams, Bleach Creams, Moisturizing Lotions, Hair Conditioners, Cold Creams, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality is the prime objective of our organization that is why we always ensure to check the quality of our offered products. Our quality controllers always ensure that entire product range is stringently tested on defined quality parameters to eliminate all the flaws from the products.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have set-up a sound manufacturing unit that is spread over a wide area and is equipped up with the most sophisticated technology and latest machines that are essential for the manufacturing quality range of products. Moreover, we regularly upgrade our machines in order to ensure unmatched quality and durability of the product. \u003C/p\u003E\n\n\u003Cp\u003EResearch And Development:\nWe have a separate research and development wing, which is well equipped with the modern facilities that ensure overall development of the product and as per the emerging market trends. This unit also assists us to add new features to the existing products for enhancing the functionality of our range at client\u0026#8217;s end.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\nWe are a leading name engaged in Manufacturing, Supplying and Exporting High- End Cosmetics products like Hair Removal Creams, Bleach Creams, Moisturizing Lotions, Hair Conditioners, Cold Creams, etc. Our strength lies in our incorporated economies of scale to enhance the production without compromising quality. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7556/247556v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7556/247556v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7556/247556v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}