{"name": "Arife Lamoulde Group",
 "permalink": "arife-lamoulde-group",
 "crunchbase_url": "http://www.crunchbase.com/company/arife-lamoulde-group",
 "homepage_url": "http://www.indiamart.com/arifelamouldegroup/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "arifelamouldegroup@tradepassport.org",
 "phone_number": "9768148007",
 "description": "manufacturer, supplier and exporter",
 "created_at": "Fri Apr 05 05:24:44 UTC 2013",
 "updated_at": "Fri Apr 05 05:24:48 UTC 2013",
 "overview": "\u003Cp\u003EArife Lamoulde Group, a Partnership firm was established in 1909 in India has emerged as one of the renowned manufactures, suppliers  \u0026amp; exporters of highly efficient Bakery Equipment \u0026amp; Mould Accessories. Under the able management of Mr. Imran Hamidani, we have been able to offer widespread product range to our valued customers like ke Decorating Tool, Cartoon Cookie Cutter, Fondant Cutter, Plastic Plunger Cutter, Scrapper \u0026amp; Bead Cutter, Spray Gun Machine, PVC Mould, Aluminium Fancy Cake Mould, Non Stick Cake Mould, Paper Cup Mould, Silicone Muffin Mould, Silicone Cake Mould, Silicone Chocolate Mould and Silicone Cup Mould.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nPrime aim of the company is to render quality assured product range in the market. We own a separate quality testing department, where products are tested on stringently on various parameters. Our ardent quality inspectors make use of modernized tools and equipment to keep constant vigil at all stages of product development.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Skilled workers\n    Quality inspectors\n    Warehousing and packaging experts\n    Marketing and sales professionals\n    Managers and supervisors\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nComplete client satisfaction is the prime aim of the company. Continuous attempts are made to alter the product range as per the diverse needs and demands of our customers. Finest of the product range is offered at reasonable rates and are delivered within the committed time frame.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nBeing one of the prominent manufacturers, suppliers \u0026amp; exporters of extensive variety of Bakery equipment, we have enthralled minds and hearts of our clients. With our involvement in transparent dealings and fair practices, we have survived the cut-throat competition and emerged as a leader.\u003C/p\u003E\n\n\u003Cp\u003EOur Professionals:\nWe have employed skilled professionals in our team in order to handle the variegated production and post production processes effectively. Keeping in mind the stiff market challenges, we also ensure to offer requisite training to our professionals to keep them abreast of the changing market trends.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8252/248252v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8252/248252v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8252/248252v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}