{"name": "Arihant Engineering",
 "permalink": "arihant-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/arihant-engineering",
 "homepage_url": "http://www.indiamart.com/arihantengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "arihantengineering@tradepassport.org",
 "phone_number": "9424093000",
 "description": "manufacturing and supplying Bamboo \u0026 Saw",
 "created_at": "Fri Apr 05 09:37:28 UTC 2013",
 "updated_at": "Fri Apr 05 09:37:31 UTC 2013",
 "overview": "\u003Cp\u003EIndia is gifted large resource of bamboos, the second largest in the world.Bamboo is finding wide use in flooring tiles, laminated boards, corrugated sheets, handicrafts, furniture, woven mattresses, kitchen utensils, musical instruments and landscape gardening, Window Blinders, Buckets, Prefab Bamboo Houses, incense sticks, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a deft team of experienced professionals who posses in-depth knowledge in this domain. All these professionals are experts of their department and have proved themselves over the years. Owing to their efforts, we have been successful in completing the toughest tasks with ease.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nLeveraging on the fact that it is the quality and not the quantity of the products that decides the fate of an organization. Therefore, we assure to deliver a quality approved range of products to the clients. For this, the entire range is manufactured in tandem with the international quality standards by using genuine raw material, which is sourced from the coherent vendors of the industry.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed an ultra-modern infrastructure, which sprawls over a large area. Further, for the ease \u0026amp; flexibility of operation, we have segregated our infrastructure into various units and departments. The entire infrastructure is well-installed with all the modern machinery, tools and equipment.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nRelying on the fact that a satisfied customer is the best business strategy, we aim to direct our untiring efforts to attain the utmost satisfaction of the customers. Henceforth, we develop the entire range by employing quality raw material and genuine tools.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\n    Constantly effort to improve the functional efficiency of the products\n    Continuous improvement of work processes to achieve maximum customer satisfaction\n    Capitalize on skilled \u0026amp; experienced manpower\n    Pool of efficient engineers adept with the latest technologies\n    Empowered with strong market network\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8491/248491v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8491/248491v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8491/248491v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}