{"name": "Arima Imports",
 "permalink": "arima-imports",
 "crunchbase_url": "http://www.crunchbase.com/company/arima-imports",
 "homepage_url": "http://www.arimaimpex.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cocopeat, papad, corn, pickles",
 "alias_list": null,
 "email_address": "webmaster@arimaimpex.com",
 "phone_number": " 08373904167",
 "description": " Importing And Exporting of superior qua",
 "created_at": "Fri May 03 08:53:07 UTC 2013",
 "updated_at": "Mon May 06 05:46:27 UTC 2013",
 "overview": "\u003Cp\u003EArima Import \u0026amp; Exports offer a variety of products to protect and improve the client requirements. Our business was established in the year 2012. We believe in providing the best quality products with possible features to our customers. To achieve our goal, we have a determined focus on growth. Our range includes Sea Foods, Papad, Corn, Pickles, Fresh Coconut, Spices, White Rice and Coir Products, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nHybrid invertor\nBatteries\nPickles\nFresh Coconut\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe have connected ourselves with only the specialized and the most reputed vendors in the market. These vendors offer an unmatched range of these products to us. Our professionals check for the quality standards followed by these vendors and their compliance to deliver the products within the committed time frame. These vendors are chosen by our experts after thorough market survey to ascertain their credibility. We ensure that they abide by the international standards of the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nOur professionals give consistent and dedicated efforts to provide our customers the comprehensive range of Food Products. Our organization is backed by a team of quality experts who keep a close eye on the each activity of production unit. We use hi-tech machinery to provide quality products to our customers. The wide array of products is well known for their freshness. We use high quality packaging materials to pack this product.\u003C/p\u003E\n\n\u003Cp\u003EClients Satisfaction:\nWe are a client centric organization, providing client satisfaction is the prime factors of the company. We have multiplied enormous consumers throughout the global market for the quality products that we offer. Our range is well famous for the clarity and perfect structure appearances that made us to keep a long relationship with the various consumers\u0026#8221;.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0025/8085/258085v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0025/8085/258085v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0025/8085/258085v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}