{"name": "ARMAX GAZ",
 "permalink": "armax-gaz",
 "crunchbase_url": "http://www.crunchbase.com/company/armax-gaz",
 "homepage_url": "http://www.armaxgaz.ro",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 350,
 "founded_year": 1925,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gas-and-oil-equipment, gas-dehydration-station, gas-regulating-metering-stations, pressurised-tanks",
 "alias_list": null,
 "email_address": "marketing1@armaxgaz.ro",
 "phone_number": "+40269845864",
 "description": "GAS\u0026OIL EQUIPMENT",
 "created_at": "Fri Dec 18 08:08:17 UTC 2009",
 "updated_at": "Fri Dec 18 19:30:58 UTC 2009",
 "overview": "\u003Cp\u003EARMAX GAZ is one of the national leaders in manufacturing equipment and instruments, metallic confections, spare parts, repairs and service provides for the gas and oil field, having an experience of more than 80 years.\u003C/p\u003E\n\n\u003Cp\u003EThe company implemented and is maintaining an integrated management system according to the requisites of SR EN ISO 9001,\nSR EN ISO 14001 and OHSAS 18001.\u003C/p\u003E\n\n\u003Cp\u003EThe company has a manufacturing preparation workshop endowed with CNC automatic cutting machines and half automatic one with plasma guillotine shears, band saws and alternative one, roll calendar, pipe bending machines.\u003C/p\u003E\n\n\u003Cp\u003EThe forge is equipped with heating furnaces, auto compressor hammers and 500t press.\u003C/p\u003E\n\n\u003Cp\u003EThe mechanical workshop is equipped with universal equipment like: lathes, milling machines, drilling machines and units, MICROCUT precision lathes, CNC lathes and CNC 4 axis machining vertical unit; these equipment giving us the possibility to fabricate the parts according to the highest quality requirements of our customers.\u003C/p\u003E\n\n\u003Cp\u003EThe metallic manufactures shop is endowed with traveling cranes and ESAB welding equipment, having the supply source of inverter type. For all of the welding procedures SME, WIG, MIG, MAG, SAF, we use last generation equipment and we purchase also the consumables and welding materials from the ESAB Company. The handling and welding devices, the rotary and positioning tables, the roller blocks allow synchronization with the MIG-MAG automatic welding equipment and submerged arc welding. The programming and monitoring of the welding parameters have as a result an increase in quality of the welded joints.\u003C/p\u003E\n\n\u003Cp\u003EFor inspections and testing we own an authorized laboratory for mechanical destructive and nondestructive examinations, a metrological lab, a chemical one and the benches, as well.\nFor very complex designs we also assure the product\u0026#8217;s design, at no extra charge. We guarantee that our customers will be satisfied using reliable products, specially designed and manufactured to comply with their needs and demands.\u003C/p\u003E\n\n\u003Cp\u003EThe warranty and post-warranty service teams are very prompt in solving any received notifications from our clients, and because complaints and claims continualy decrease we are confident in our specialist\u0026#8217;s skills and it is one more proof that the quality management system is eficient.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       42],
      "assets/images/resized/0007/0277/70277v2-max-150x150.jpg"],
     [[237,
       67],
      "assets/images/resized/0007/0277/70277v2-max-250x250.jpg"],
     [[237,
       67],
      "assets/images/resized/0007/0277/70277v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "General Manager ",
    "person":
     {"first_name": "Mircea",
      "last_name": "Vescan",
      "permalink": "mircea-vescan",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main location",
    "address1": "Aurel Vlaicu St, No 35",
    "address2": "",
    "zip_code": "551041",
    "city": "Medias",
    "state_code": null,
    "country_code": "ROM",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}