{"name": "Arpaen",
 "permalink": "arpaen",
 "crunchbase_url": "http://www.crunchbase.com/company/arpaen",
 "homepage_url": "http://www.indiamart.com/arpaen-noida/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mens-plain-shirts, mens-striped-shirts, formal-men-shirts, casual-mens-kurta, trendy-mens-kurta, designer-mens-kurta, etc-",
 "alias_list": null,
 "email_address": "arpaen-noida@tradepassport.org",
 "phone_number": "9811357047",
 "description": "Manufacturer and Supplier of the finest ",
 "created_at": "Fri Apr 05 15:38:51 UTC 2013",
 "updated_at": "Fri Apr 05 15:38:56 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, at Noida (Uttar Pradesh, India), we “Arpaen”, are renowned in the industry as the prominent manufacturer and supplier of optimum quality assortment of Mens Blazer, Mens Shirts and Mens Kurta. The extensive gamut of products we provide comprises Fancy Blazer, Designer Mens Blazer, Mercurial Blazer, Mens Plain Shirts, Mens Striped Shirts, Formal Men Shirts, Casual Mens Kurta, Trendy Mens Kurta, Designer Mens Kurta, etc. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe dedicated team of professionals that we have is selected by us adhering to strict HR procedures. Apart from providing attractive and eye-catching collection to our patrons, these professionals also ensure that the ordered consignment is delivered on time at clients\u0026#8217; premises. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur clients are the base of our business and their satisfaction is the basic mantra for our success in the industry. Our presence in the industry for these many years has made it possible for us to understand the requirements of clients. To help our clients, we offer turnkey solutions as well as after sales service facilities to them.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nAs a quality oriented company, we are introducing our respected patrons the premium quality products. These products are fabricated using fabric that we procure from the most reliable and authentic vendors of the market. These market vendors test this fabric on various quality parameters before making its delivery to us. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nFancy Blazer, Designer Mens Blazer, Mercurial Blazer, Mens Plain Shirts, Mens Striped Shirts, Formal Men Shirts, Casual Mens Kurta, Trendy Mens Kurta, Designer Mens Kurta, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8847/248847v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8847/248847v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8847/248847v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}