{"name": "Art Paintings",
 "permalink": "art-paintings",
 "crunchbase_url": "http://www.crunchbase.com/company/art-paintings",
 "homepage_url": "http://www.tuskgallery.com.au/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "artpaintings",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "art-galleries-australia, picture-framing-melbourne, buy-art-online",
 "alias_list": null,
 "email_address": "tuskgallery12@gmail.com",
 "phone_number": "03",
 "description": "Select from a wide range of art work tha",
 "created_at": "Sat Mar 16 05:59:16 UTC 2013",
 "updated_at": "Sat Mar 16 06:01:29 UTC 2013",
 "overview": "\u003Cp\u003EGenerally, people relate the word ‘art gallery’ with an image of empty halls having paintings and dim lights on the walls. It may be right to a certain extent but not in all cases. Exactly, the art galleries in Australia are a single or cluster of rooms that serve the purpose of displaying the various artists’ work. The most common type of work displayed at these places includes paintings, photos, sculptures, picture framing in Melbourne, drawings, or any other form. \u003C/p\u003E\n\n\u003Cp\u003ENew artists in to the world of paintings and drawings are unlikely to spend a lot of time while thinking about how to best display their work with picture framing in Melbourne. They can get idea for framing their artwork by visiting a gallery. There are many art galleries in Australia, which makes it ideal for those people who want to spend their holiday by visiting such places. \u003C/p\u003E\n\n\u003Cp\u003EAdvanced technology has also provided the option to buy art online in just few minutes. Art galleries in Australia can be a place where visitors can find the best picture framing in Melbourne and share their common interest to appreciate and admire the work of aspirant or well-known artists. \nMany enthusiastic people visit these places to purchase the work of various artists. Some artist also provides option to buy art online. There are many different styles of online galleries in Australia so finding a trustworthy online gallery is one of the most important things you should consider when you decide to buy art online.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}