{"name": "Artistir",
 "permalink": "artistir",
 "crunchbase_url": "http://www.crunchbase.com/company/artistir",
 "homepage_url": "http://www.artistir.com",
 "blog_url": "http://artistir.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "artistir",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 27,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "promote-your-music, unsigned, musicians, bands, sell-music, download-music",
 "alias_list": null,
 "email_address": "support@artistir.com",
 "phone_number": "781-290-6556",
 "description": "Music Social Network",
 "created_at": "Mon Mar 26 18:46:28 UTC 2012",
 "updated_at": "Fri Apr 06 04:19:08 UTC 2012",
 "overview": "\u003Cp\u003EThere are many websites aimed specifically at musicians to distribute and showcase their material, but something different has just launched.  This site has the potential to change the way independent musicians and other performing artists can showcase and distribute their material, plus more, in a completely different way.  A startup website, www.artistir.com, has just launched.  This website offers a completely new experience for musicians, comedians, artists, or just fans, to interact with each other.\u003C/p\u003E\n\n\u003Cp\u003EArtistir is a web community designed by a couple of technology wizards, and avid music fans.  They are incorporated as Artistir, Co. in Massachusetts, and have designed the site to offer something different and more accessible to independent musicians.  “We have been through all of the other online music sites, and have heard the complaints and praises,” says President and Founder, Derek Arsenault.  “We had a vision to build a site where you don’t have to pay extra money to be on the top of the charts.  We wanted a place where musicians could all come together; interact with each other, and their fans.”\u003C/p\u003E\n\n\u003Cp\u003EWhat Artistir is doing is changing the way artists communicate with each other, their fans, and the world.  It is a fully featured social network, chat and all, that is geared towards artists and fans alike.  The site allows artists to create albums, distribute their music (either for free, or they can sell it for profit), and network with fans and other musicians, whether in the same city, or across the globe.\u003Cbr/\u003E\nThe interface of the website is very clean..  For a website that has all of these features, it is extremely simple to navigate.  When you go to the site, as a fan or artist, you are brought to your own homepage, or “Dashboard”.  The Dashboard includes things such as “Featured Artists”, allow artists to add blogs, videos, and add music to their band profiles, etc.  There is a “Shoutbox”, where a stream of real-time announcements from other friends, bands, or musicians will scroll through.\u003C/p\u003E\n\n\u003Cp\u003EOne thing that is different here is that musicians will have essentially two different types of profiles.  When you first sign up, you are creating a personal profile and bio for yourself, not your band, or even your solo act.  Once signed up, You will have a profile page, sorted out into different tabs, also making the navigation easy.  If you are just a fan, that is about as far as you’ll probably go, as far as profile setup.  On the other hand, if you are a musician, you will then be given the option to create a sub-account for your band or solo act, under “Create an Artist Page”.  These are more than just pages, but another entire profile for your solo act or band.  Once you create an Artist profile, you will have the option to add songs, add or create albums, and be featured in the charts.\u003C/p\u003E\n\n\u003Cp\u003EThe site has a navigation bar that brings you to other parts of the site.  There is a “Marketplace”, where artists can buy and sell equipment and merchandise, almost in an eBay/Craigslist fashion.  There is a fully functional discussion board and forum.  There is a standalone Flash-based music player that people will have the opportunity to download, purchase, rate, or listen to your songs, even when navigating away from the page.  \u003C/p\u003E\n\n\u003Cp\u003EThis site has launched very recently. The owners are currently working on other implementations for the future, such as allowing artists to add songs into iTunes and Amazonmp3, along with many other benefits that the artists can use.  “We have been in talks with some key figures, one of which who has his own network TV show,” says Derek, “He is very interested in collaborating with us to give our top artists the opportunity to play a song or two on television, reaching millions of people.”  There is no catch or sign-up fee to be selected for this.  “We just want to offer the best that we have on our site to be able to perform on a bigger stage.  The music industry has changed drastically over the years.  MTV and local radio were the only hopes of getting this type of exposure.  Other sites offer these opportunities, but at a price.  We just want to be able to give an incentive to the artists who receive the best ratings and get the most plays.  We aren’t looking to dip into their pocket for any opportunity that we may come to offer.”\u003C/p\u003E\n\n\u003Cp\u003EThe site and all of its features are completely free, with the exception of opening an online store, or “Seller Account”, which costs $20 per year. This enables artists to sell their material.  “We had to implement some sort of way to get the site up and running,” says Chris Sheather, CEO, “We did not want to charge any upfront fee for anything on the site.  Initially, the plan was to take a small commission from any song or album sale made through the site.  However, due to technological and manpower restraints, we found it easier to charge $20, and that is ONLY for those who are looking to sell their material.  Plus, this way, the artists keeps one hundred percent of the profit that they make.  Anyone who puts their material up for streaming or free download will not pay a penny.”  Artistir is geared to help struggling artists, musicians, comedians, DJs, and even voice-over personalities.  This makes it different from other music communities, in the respect that you don’t have to pay to use additional features.  \u003C/p\u003E\n\n\u003Cp\u003EArtistir is definitely a different experience for independent musicians.  It is another outlet to expose you or your band that has a much different feel from everything else out there.  If you’re an artist looking for exposure, this could be the web community that you were looking for. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       105],
      "assets/images/resized/0018/1184/181184v2-max-150x150.png"],
     [[120,
       105],
      "assets/images/resized/0018/1184/181184v2-max-250x250.png"],
     [[120,
       105],
      "assets/images/resized/0018/1184/181184v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President/Founder/Co-CEO",
    "person":
     {"first_name": "Derek",
      "last_name": "Arsenault",
      "permalink": "derek-arsenault",
      "image": null}},
   {"is_past": false,
    "title": "Co-CEO",
    "person":
     {"first_name": "Chris",
      "last_name": "Sheather",
      "permalink": "chris-sheather",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "ReverbNation",
      "permalink": "reverbnation",
      "image":
       {"available_sizes":
         [[[150,
            112],
           "assets/images/resized/0002/6867/26867v13-max-150x150.jpg"],
          [[250,
            187],
           "assets/images/resized/0002/6867/26867v13-max-250x250.jpg"],
          [[450,
            337],
           "assets/images/resized/0002/6867/26867v13-max-450x450.jpg"]],
        "attribution": null}}},
   {"competitor":
     {"name": "Bandcamp",
      "permalink": "bandcamp",
      "image":
       {"available_sizes":
         [[[150,
            22],
           "assets/images/resized/0002/5338/25338v1-max-150x150.png"],
          [[250,
            37],
           "assets/images/resized/0002/5338/25338v1-max-250x250.png"],
          [[351,
            53],
           "assets/images/resized/0002/5338/25338v1-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "SoundCloud",
      "permalink": "soundcloud",
      "image":
       {"available_sizes":
         [[[150,
            93],
           "assets/images/resized/0002/0462/20462v19-max-150x150.png"],
          [[250,
            156],
           "assets/images/resized/0002/0462/20462v19-max-250x250.png"],
          [[250,
            156],
           "assets/images/resized/0002/0462/20462v19-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[128,
        150],
       "assets/images/resized/0018/1183/181183v2-max-150x150.jpg"],
      [[214,
        250],
       "assets/images/resized/0018/1183/181183v2-max-250x250.jpg"],
      [[385,
        450],
       "assets/images/resized/0018/1183/181183v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.artistir.com",
    "title": ""}]}