{"name": "Aryama Impex",
 "permalink": "aryama-impex",
 "crunchbase_url": "http://www.crunchbase.com/company/aryama-impex",
 "homepage_url": "http://www.indiamart.com/aryamaimpex/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "9874085164",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "horn-spoon, shell-napkin-ring, horn-salad-set, terracotta-diya, hair-comb-and-many-more-",
 "alias_list": null,
 "email_address": "",
 "phone_number": "aryamaimpex@tradepassport.org",
 "description": "Welcome to ARYAMA IMPEX An arena ,",
 "created_at": "Fri Apr 05 10:04:59 UTC 2013",
 "updated_at": "Fri Apr 05 10:05:05 UTC 2013",
 "overview": "\u003Cp\u003EAryama Impex is a sole proprietorship based business venture, which came into existence in the year 2009 at Kolkata, West Bengal. We are one of the most recognized manufacturer, supplier, exporter and wholesaler engaged in delivering  an eccentric collection of Exclusive Table Calendar, Horn Spoon, Shell Napkin Ring, Horn Salad Set, Terracotta Diya, Hair Comb and many more. The products offered by us are appreciated across the country for its clear prints, durability and excellent finish. As far as the superiority of these products is concerned, the materials used to manufacture these products are meant to deliver as per the latest industrial standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nThe company is backed by superior infrastructure that has been built keeping in mind the leading global norms. Backed by round the clock power supply, our manufacturing units have been designed to cater to all kinds of challenges and are built to cater to heavy market demand. The ultra-modern infrastructure that we boast of has been bifurcated into various units and departments which enable us to function in a systematic manner and cater to the requirements of our clients with utmost precision and accuracy. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have earned the reputation of being a top quality product manufacturer mainly because of our highly qualified and able workforce which enables us to deliver as per the requirements of our clients. Regular training is departed to our talented professionals which creates a chain reaction of success both in terms of gaining quality experience and innovating new processes and techniques to boost the operations of the company. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nCustomers have always remained the greatest source of motivation and inspiration for our company due to their constant feedbacks. Our experts understand the viewpoints of our clients, and then offer solution and services accordingly. Our prompt response to the queries of the clients’, reliable business solutions, quick implementation and execution of the assignment, effective after-sales support and market specific rates helps us to stay ahead of our competitors.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nExclusive Table Calendar, Horn Spoon, Shell Napkin Ring, Horn Salad Set, Terracotta Diya, Hair Comb and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/8510/248510v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/8510/248510v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/8510/248510v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}