{"name": "As.so.ci.a.tion",
 "permalink": "as-so-ci-a-tion",
 "crunchbase_url": "http://www.crunchbase.com/company/as-so-ci-a-tion",
 "homepage_url": "http://www.assn.ca",
 "blog_url": "http://www.assn.ca",
 "blog_feed_url": "http://www.assn.ca",
 "twitter_username": "assn_ca",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "calgary",
 "alias_list": null,
 "email_address": "opportunities@assn.ca",
 "phone_number": "403-829-4117",
 "description": "IT Consulting and Recruitment",
 "created_at": "Tue Oct 12 16:55:50 UTC 2010",
 "updated_at": "Tue Oct 12 18:14:06 UTC 2010",
 "overview": "\u003Cp\u003EAs.so.ci.a.tion is an IT consulting company. We like to work with smart clients, and clever consultants on interesting projects. \u003C/p\u003E\n\n\u003Cp\u003EWe\u0026#8217;ve done work for oil and gas, retail, cable, telecommunications, and construction. Our home base is Calgary, Alberta Canada, but we love to travel. \u003C/p\u003E\n\n\u003Cp\u003EWhere we started\nAfter 12 years, we know how the consulting and recruiting business works - and we want to change it. We know that the recruiting and consulting business hasn\u0026#8217;t evolved in a very, very long time, and should be as up to date as the rest of the IT industry. The model that worked 15 years ago doesn\u0026#8217;t fit well today.\u003C/p\u003E\n\n\u003Cp\u003EWe work most often by referral. The consultants we work with are our peers, and part of our community - we work with them because we know them, their reputation, and the quality of their work.\nHow we\u0026#8217;re different\u003C/p\u003E\n\n\u003Cp\u003EAs.so.ci.a.tion is built on a number of core beliefs, values, and understandings.\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* We believe relationships are the heart of our business, and our brand.\n* We value transparency in all our dealings. That includes margins, the negotiation process, and contract terms.\n* We believe that trust and loyalty is earned, and has immense value. That\u0026amp;amp;#8217;s why we don\u0026amp;amp;#8217;t use non-competes to keep consultants. Our people choose to work with us whenever they can.\n* We actively participate in community building, social media, and the open exchange of ideas and information. We attend and present at local and national events - regularly.\n* We understand that communication is a two-way process, and that listening comes first. Your team has unique needs, and we want to understand what they are.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EWe\u0026#8217;d love to show you how we put these beliefs into practice, everyday, and how it can help you find your next contract or consultant.\nWe\u0026#8217;re the real deal\nWe\u0026#8217;re actual, real, genuine, dyed-in-the-wool techies - we love to make stuff with code and we\u0026#8217;re passionate about technology. \u003C/p\u003E\n\n\u003Cp\u003EIf You need some help\nWe\u0026#8217;d love to hear about your company, team, or dream product. Maybe we can build you something amazing, or help you find the perfect person to help you out. Feel free to email us and we\u0026#8217;ll get it touch for a chat - opportunities@assn.ca\u003C/p\u003E\n\n\u003Cp\u003EIf You\u0026#8217;re one of us\nAre you a person who sees connections where others just see dots? Do you often find yourself saying \u0026#8216;I should really build a\u0026#8230;\u0026#8217;? Are you an experienced IT professional? Then you should probably send us your resume . We\u0026#8217;re always looking to connect with talented people.\nContact us\u003C/p\u003E\n\n\u003Cp\u003EIf you\u0026#8217;d like to speak to a member of our Executive or Sales team please feel free to contact us at opportunities@assn.ca.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       87],
      "assets/images/resized/0010/5247/105247v2-max-150x150.png"],
     [[250,
       145],
      "assets/images/resized/0010/5247/105247v2-max-250x250.png"],
     [[305,
       177],
      "assets/images/resized/0010/5247/105247v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}