{"name": "Asher Enterprises",
 "permalink": "asher-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/asher-enterprises",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 20,
 "founded_year": 2000,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "asher_enterprises@yahoo.com",
 "phone_number": "",
 "description": "Investments",
 "created_at": "Mon May 07 13:45:37 UTC 2012",
 "updated_at": "Thu May 10 20:23:57 UTC 2012",
 "overview": "\u003Cp\u003ECurt Kramer founded Asher Enterprises to provide funding to small businesses who either decide not to work with traditional banks or who were denied by traditional banks. The company provides loans to start-ups out of its own assets. In exchange for these loans, we issue convertible promissory notes. \u003C/p\u003E\n\n\u003Cp\u003EConvertible promissory notes help small businesses manage their cash-flow. Instead of repaying the loan in cash, our company has the right to convert the amount owed to equity in the company. If a small business succeeds, this is a positive situation for all parties. \u003C/p\u003E\n\n\u003Cp\u003ECurt\u0026#8217;s Bio\u003C/p\u003E\n\n\u003Cp\u003EBefore he started Asher Enterprises, Curt was a successful private investor. He started the company as a way to help other entrepreneurs and go-getters like himself. With his market know-how and skill, Curt has shown that he has what it takes to lead Asher Enterprises into the future. As he is the only shareholder in the company, his decisions are final.\u003C/p\u003E\n\n\u003Cp\u003EBorn and raised on Long Island, Curt decided that Great Neck, NY was the ideal place to establish offices for Asher Enterprises. A man committed to both family and community, Curt married his high school girlfriend. Together, they are raising a family of three children.\u003C/p\u003E\n\n\u003Cp\u003ECurt is an employee\u0026#8217;s boss. An avid reader, he\u0026#8217;s always ready to share the latest inspiring book with his staff. He\u0026#8217;s also there to provide a listening ear to employees and to help them advance in their career. Employees rest assured that they can turn to Curt with any concerns.\u003C/p\u003E\n\n\u003Cp\u003EWhat We Do\u003C/p\u003E\n\n\u003Cp\u003EAn avid investor, Curt is able to see the potential for many small businesses, which is why Asher Enterprises is so willing to invest. A community cannot thrive if there is no growth, and that growth comes from new businesses. However, that is not the way the traditional banking industry works. With traditional banking, you have to prove your creditworthiness before you get a loan. With a new start-up business, proving past creditworthiness is nearly impossible, unless you want to risk your own assets.\u003C/p\u003E\n\n\u003Cp\u003EBut Asher Enterprises does not rely on credit histories or scores to deliver funding. The ability to make a final decision on a loan comes to down to Curt, not a numerical score. Asher Enterprises is not alone in its desire to lend to small business. Recently, the House of Representatives passed the Jumpstart Our Business Startups Act, which promotes loans for new companies.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}