{"name": "Ashoka Tools",
 "permalink": "ashoka-tools",
 "crunchbase_url": "http://www.crunchbase.com/company/ashoka-tools",
 "homepage_url": "http://www.indiamart.com/ashokatools/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ashokatools@tradepassport.org",
 "phone_number": "9312208188",
 "description": "Manufacturer and Supplier",
 "created_at": "Thu Apr 04 12:54:27 UTC 2013",
 "updated_at": "Thu Apr 04 12:54:29 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, at Noida (Uttar Pradesh, India), we “Ashoka Tools”, are recognized as one of the leading Manufacturer, Exporter and Supplier of superior quality Injection Cavity Inserts, Pet Injection Mold. This range consists of Preform Injection Mold, Jar Blow Mold, Jar Blow Mold, Blow Mold, Plastic Injection Mold etc. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\nAdhering to the principles of discipline and honesty, we have carved out a distinct place in the market. By maintaining strict standards on high quality, our firm has succeeded in exceeding the expectations of the clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur clients are the base of our business and their satisfaction is the basic mantra for our success in the industry. Our presence in the industry for these many years has made it possible for us to understand the requirements of clients. To help our clients, we offer turnkey solutions as well as after sales service facilities to them.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a team of experienced and qualified engineers, technicians, quality controllers, marketing representatives, administrators, managers and skilled workforce. Our team is very much capable of understanding the market demand and designs the product accordingly. We have hired a well-knowledgeable and talented professionals who enable us to offer a broad range of Plastic Injection Molds, Pet Injection Mold as per the international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality is our sphere and to make sure of the maximum quality standards of our products, we carry out stringent tests at regular interval of time. All the tests are to be carried very carefully by our experienced quality controllers.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have constructed a well-established infrastructure in order to stay ahead with our competitors of the industry by providing superior quality products. In our infrastructure, we have installed all the requisite machines and superior technology that is required for the fabrication of our product assortment. Our infrastructure is segregated into various units like manufacturing facility, quality testing laboratory, sales \u0026amp; marketing departments, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7912/247912v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7912/247912v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7912/247912v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}