{"name": "ashriwal",
 "permalink": "ashriwal",
 "crunchbase_url": "http://www.crunchbase.com/company/ashriwal",
 "homepage_url": "http://www.truelyuttarakhand.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 1,
 "founded_year": 2012,
 "founded_month": 6,
 "founded_day": 24,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "travel, uttarakhand-tourism, chardham, national-park, ganga, himalayas",
 "alias_list": null,
 "email_address": "truelyuttarakhand@gmail.com",
 "phone_number": "9911504211",
 "description": "Uttarakhand Tourism",
 "created_at": "Mon Oct 22 16:39:59 UTC 2012",
 "updated_at": "Fri Oct 26 18:30:17 UTC 2012",
 "overview": "\u003Cp\u003EFirst of all heartiest welcome to all Uttarakhand lovers from all over the world.\u003C/p\u003E\n\n\u003Cp\u003Etruelyuttarakhand , is a complete information based website dedicated to Uttarakhand. The site is ideal in terms of education as well as tourism. In this site we try to give complete information on Uttarakhand so that you can explore uttarakhand as per their own needs. For this we try to categorize all relevant fields under different headings which will definitely helps you in the search of your need and access the site in a systematic and user friendly way.\u003C/p\u003E\n\n\u003Cp\u003EThe Land of Gods \u0026#8211; Uttarakhand is the heartland of the Himalayas. A wide expanse between the Himalayas in the north and the Shivalik range in the south, it \noffers the most breathtaking views of the mighty peaks, mist covered gorges and verdant valleys.\nFor all destinations in Uttarakhand visit truelyuttarakhand.com\u003C/p\u003E\n\n\u003Cp\u003EAt the doorstep, of this heaven. Uttarakhand is a wonderful place to unwind, soothed by the sound of the rushing, bubbling and swishing Himalayan stream. Here you do what Uttarakhand encourages you to do to your heart\u0026#8217;s content. The state has unavoidable romance in the air. An Estelle respite for tourists and people who seek relief for the hot sultry conditions of the pains. Nature has gifted Uttarakhand everything, which makes a place charming and cherubic.\u003C/p\u003E\n\n\u003Cp\u003EUttarakhand is fast emerging as a gem among the travel destinations. It comes as a pleasant surprise for the weekend travellers, who find it more peaceful \nand more relaxing. It’s a Different experience altogether. Uttarakhand is away from the crowd, busy market Places and pollution. In Uttarakhand mostly you \nwill see Set amidst thick virgin forests of Deodars, Oaks and Rhododendrons it’s an ideal location that ensures absolute peace of mind. The Green Meadows, \ntowering trees, breathtaking view of the snow-capped Himalayan Peaks, make Uttarakhand an enviable hideaway. The long wooded slopes, lazy outings, cool \ncaressing breeze, warm and hospitable in habitats, lovely weather and fabulous view of snow covered mountains makes it an ideal retreat for a relaxed holiday.\u003C/p\u003E\n\n\u003Cp\u003EFor all destinations in Uttarakhand visit our website\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}