{"name": "Asian Elevators",
 "permalink": "asian-elevators",
 "crunchbase_url": "http://www.crunchbase.com/company/asian-elevators",
 "homepage_url": "http://www.indiamart.com/asian-elevators/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "asian-elevators@tradepassport.org",
 "phone_number": "09953357958",
 "description": "providing Elevator, Traction Machine ",
 "created_at": "Thu Apr 04 13:15:19 UTC 2013",
 "updated_at": "Thu Apr 04 13:15:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in year 2012, we “Asian Elevators” are one of the coveted firms engaged in providing Industrial Cabin, Elevator Door, Door Operator Series, Elevator Traction Machine, Car Parking Lift, Hydraulic Elevator, Home Elevator, MRL Elevator and many more to our deemed clients. Products that we offer comprises Steel Powder Coated Cabin, M.S. Powder Coated Cabin, S.S. Cabin, Mirror Etched Vandal Finish Stainless Steel Cabin and others.\u003C/p\u003E\n\n\u003Cp\u003EMission \u0026amp; Vision:\nWe intend to be the recognized leader in service excellence among all companies across worldwide including elevator companies. We encourage our customers’ total confidence by providing exceptional service that enhances 100 % profit of their business and time.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nSupported by a competent team of hardworking and enthusiastic professionals, we engaged in offering a durable assortment of Industrial Cabin, Elevator Door, Door Operator Series, Elevator Traction Machine, Car Parking Lift, Hydraulic Elevator and many more to our deemed clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nSince our inception, we have gathered immense knowledge and expertise to offer our patrons a highly functional assortment of Industrial Cabin, Elevator Door, Door Operator Series, Elevator Traction Machine, Car Parking Lift, Hydraulic Elevator and many more.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nIn order to meet the varied requirements of the clients in a well defined manner, we house a spacious setup that facilitates us in analyzing the production procedure in a smooth and swift manner. Manufacturing unit being the core of any unit, fulfills the bulk requirements of the clients in a well defined manner.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client centric organization to take utmost care to ensure maximum level of customer satisfaction in activities and that are carried forward with us. For the same, we make sure that the the professionals recruited with us take care of the jobs that are allocated to them. Well versed in this domain, these team members are well trained and hold higher qualifications.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[90,
       125],
      "assets/images/resized/0024/7920/247920v2-max-150x150.jpg"],
     [[90,
       125],
      "assets/images/resized/0024/7920/247920v2-max-250x250.jpg"],
     [[90,
       125],
      "assets/images/resized/0024/7920/247920v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}