{"name": "AsiaPower Control",
 "permalink": "asiapower-control",
 "crunchbase_url": "http://www.crunchbase.com/company/asiapower-control",
 "homepage_url": "http://www.indiamart.com/asiapowercontrol/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we-are-among-the-reputed-organizations-engaged-in-manufacturing-and-supplying-a-wide-range-of-power-panels-and-control-desks-",
 "alias_list": null,
 "email_address": "asiapowercontrol@tradepassport.org",
 "phone_number": "9773519729",
 "description": "We are among the reputed organizations e",
 "created_at": "Thu Apr 04 05:29:03 UTC 2013",
 "updated_at": "Thu Apr 04 05:29:05 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, we, \u0026#8220;Asia Power Control\u0026#8221;, are one of the leading organizations engaged in Manufacturing and Supplying a comprehensive range of Power Panels and Control Desks. Our range encompasses Wired PLC Panels, PLC-RIO Panels, Simulation Panels for PLC, AC Drive Panels, AC/DC Drive Panels, AC Motors, Control Desks for PLC Panels and Control Desks. Apart from these, we provide APFC Panels, Marshalling Panels, MCC Panels, Power Distribution Panels, VFD Panels, MV Panel Boards, Display Panel Boards, Electrical Panel Boards, SCADA, Human Machine Interface, Electrical Automation and Electronic Automation.\u003C/p\u003E\n\n\u003Cp\u003EManufacturing Facility:\nIn our company, we have a well equipped manufacturing unit which enables us to manufacture quality products using latest methodologies. This manufacturing unit is well managed by our efficient team of professionals, who has rich knowledge in the respective domain. Basically, this unit is the mirror of our success in the industry market of Industrial Process Instruments.\u003C/p\u003E\n\n\u003Cp\u003EApplication Areas:\n    Pharmaceutical\n    Petrochemicals \u0026amp; Chemical\n    Automobile\n    Electronic \u0026amp; Petro Chemical\n    CNC machine shops\n    Sugar mills\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have appointed a team of hardworking, passionate and qualified professionals, who have years of experience and in-depth knowledge in their respective domains. They use all the available resources for making a qualitative range of Power Panels and Control Desks as per the demands of customers. Our professionals work in synchronization with each other to carry out all business operations smoothly and accurately. Furthermore, we provide our professionals several trainings to keep them abreast of market trends and technological advancements.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a quality-driven organization, we strive to maintain equal standards in all our products. For this, we use premium raw material \u0026amp; components for making a flawless range of Power Panels and Control Desks. Apart from this, we have an in-house testing laboratory, which is equipped with latest technology and instruments that are required for carrying out checking procedures fast and accurately. \u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nDrive Panels\nControl Desks\nPanel Boards\nAutomation Equipment\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7544/247544v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7544/247544v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7544/247544v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}