{"name": "Asprey Chase International",
 "permalink": "asprey-chase-international",
 "crunchbase_url": "http://www.crunchbase.com/company/asprey-chase-international",
 "homepage_url": "http://www.aspreychase.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 20,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "rlandy@aspreychase.com",
 "phone_number": "+44203 328 8889",
 "description": "Oil, Gas and Energy recruitment",
 "created_at": "Sat Apr 13 14:45:21 UTC 2013",
 "updated_at": "Sat Apr 13 14:45:25 UTC 2013",
 "overview": "\u003Cp\u003EAsprey Chase International provides a wide variety of recruitment solutions and outsourcing services to the Oil, Gas and Energy sectors. Our focus is working as a recruitment partner to our client’s organization by understanding the needs of the business and the roles that need to be fulfilled.  We have a proven track record in providing an unparalleled level of customer service, combined with a results driven approach to our client’s requirements.\nDelivering talent, supported with a customer service approach, based on integrity, are the core values of our company.\u003C/p\u003E\n\n\u003Cp\u003EWhy hire Asprey Chase?\u003C/p\u003E\n\n\u003Cp\u003EWe understand that we are only as good as the last candidate we have successfully placed; therefore we go to considerable lengths to maintain and build long-term relationships resulting in a better quality service all round.  We employ a consistent approach in our thinking and planning, thereby ensuring we are always looking to meet both current and future demands for our clients\u003C/p\u003E\n\n\u003Cp\u003EHow our recruitment process works\u003C/p\u003E\n\n\u003Cp\u003EMany valuable business hours can be wasted and potential revenue lost on processing unsuitable candidates.  Therefore all our candidates are fully screened, to meet out strict hiring criteria, prior to interview.  As a result, our clients will never receive an irrelevant candidate and no more than 3 CV’s via email, per active role.  These candidates will be available and highly suitable for the vacant position that has been engaged with us.\u003C/p\u003E\n\n\u003Cp\u003EOur tried and tested recruitment process is shown below - \u003C/p\u003E\n\n\u003Cp\u003ETelephone screening \u0026gt; Application form \u0026gt; Compliance   \u0026gt; Consultant appraisal \u0026gt; Minimum 2 reference checks \u0026gt; Formatted CV with consultant notes attached \u0026gt; Delivery to Client\u003C/p\u003E\n\n\u003Cp\u003EA reliable recruitment partner\u003C/p\u003E\n\n\u003Cp\u003EWhether you are looking for key permanent hire employees or need assistance putting together a contract team for an upcoming project we have the knowledge and global presence to react swiftly to your needs and deliver talented individuals.\u003Cbr/\u003E\nFor more information on our services or if you require any assistance contact one of our local offices or complete online order form and a consultant will contact you directly.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "42 Tower Bridge Rd",
    "address2": " ",
    "zip_code": "SE1 4TR",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}