{"name": "Asset Vue LLC.",
 "permalink": "assetvue",
 "crunchbase_url": "http://www.crunchbase.com/company/assetvue",
 "homepage_url": "http://www.assetvue.net/",
 "blog_url": "http://www.assetvue.net/blog/",
 "blog_feed_url": "",
 "twitter_username": "scotter487",
 "category_code": "enterprise",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rfid, data-center-management, data-center-rfid",
 "alias_list": "",
 "email_address": "contact@assetvue.net",
 "phone_number": "2158261120",
 "description": "RFID Data Center Management",
 "created_at": "Mon Oct 24 01:45:08 UTC 2011",
 "updated_at": "Mon Apr 01 04:31:30 UTC 2013",
 "overview": "\u003Cp\u003EAsset Vue, LLC, a Bristol, PA-based provider of RFID based asset management and data center management solutions.\u003C/p\u003E\n\n\u003Cp\u003EOptimizing the selection of a vendor to assist in the critical task of improving the accuracy and reducing the inefficiency associated with tracking data center assets requires close examination of both the company and the solution.  Upon close inspection, Asset VUE offers a combination that is superior to alternative offerings from both of these important perspectives.\u003C/p\u003E\n\n\u003Cp\u003EAs an organization, the company’s executive leadership and product development staff bring vast, direct experience from the world of data center operation.  Some of the largest, most complex and most high-profile data center operations in the world have been influenced or touched by Asset VUE personnel.  The solution delivered to Asset VUE clients is a refined culmination of living and working through the daily challenges faced by data center management/leadership across the industry.  The technology is built with a domain precision towards directly solving the kinds of regular challenges faced by “data center people” regarding their daily roles and their strategic responsibilities that is not found in other tools.\u003C/p\u003E\n\n\u003Cp\u003EThe solution is a powerful technology blend of both software and hardware.  The core system is comprised of several sophisticated but easy-to-use elements that are designed to automatically monitor data center environments and track the wide variety of devices contained within them.\u003C/p\u003E\n\n\u003Cp\u003EThe primary components of this innovative tool include:\u003C/p\u003E\n\n\u003Cp\u003EA comprehensive database and visual laptop display that records multiple asset attributes and builds real-time elevation diagrams that identify rack devices in their precise locations.  Details about specific asset characteristics including name, age, current location, power consumption, required rack space and serial number along with multiple user-defined fields are simply recorded and instantly presented.\nA versatile reporting module that contains pre-programmed strategic reports associated with critical organizational decision-making around the areas of capacity, expansion, performance, inventory levels and asset lifecycles and that is augmented by a powerful customization reporting capability.\nA mobile auditing system that features a battery-powered cart, a pre-installed Windows laptop and antenna components for fast and accurate RFID (radio frequency identification) scanning and provides for asset tracking so simple it merely requires wheeling the cart down a data center aisle or running a wand over a data center rack.\nA complementary assortment of RFID tags that facilitate the identification and location of assets with a file locator that directs the update process to a specific database record for each device.\nThe net effect of leveraging both the vast experience levels of the Asset VUE team as your partner, coupled with implementing the simple yet sophisticated technology, creates a high-impact benefit for your department and your organization.  You can expect substantial and measurable savings in the areas of time and effort along with solid strategic improvements as a core business function due to increased accuracy and efficiency of your data center operations.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0015/9253/159253v1-max-150x150.png"],
     [[153,
       104],
      "assets/images/resized/0015/9253/159253v1-max-250x250.png"],
     [[153,
       104],
      "assets/images/resized/0015/9253/159253v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Chairman",
    "person":
     {"first_name": "Mike",
      "last_name": "Murphy",
      "permalink": "mike-murphy-2",
      "image": null}},
   {"is_past": false,
    "title": "Vice President",
    "person":
     {"first_name": "Gary",
      "last_name": "Aron",
      "permalink": "gary-aron",
      "image": null}},
   {"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Sean",
      "last_name": "Cotter",
      "permalink": "sean-cotter",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$200k",
 "funding_rounds":
  [{"round_code": "unattributed",
    "source_url": "http://www.finsmes.com/2011/10/assetvue-receives-200k-ben-franklin-technology-partners.html?utm_source=feedburner\u0026utm_medium=feed\u0026utm_campaign=Feed%3A+finsmes%2FcNHu+%28FinSMEs%29",
    "source_description": "AssetVUE Receives $200K from Ben Franklin Technology Partners",
    "raised_amount": 200000.0,
    "raised_currency_code": "USD",
    "funded_year": 2011,
    "funded_month": 10,
    "funded_day": 23,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "Ben Franklin Technology Partners of Southeastern Pennsylvania",
         "permalink": "ben-franklin-technology-partners-of-southeastern-pennsylvania",
         "image":
          {"available_sizes":
            [[[150,
               60],
              "assets/images/resized/0005/5082/55082v1-max-150x150.jpg"],
             [[178,
               72],
              "assets/images/resized/0005/5082/55082v1-max-250x250.jpg"],
             [[178,
               72],
              "assets/images/resized/0005/5082/55082v1-max-450x450.jpg"]],
           "attribution": null}},
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "115 Sinclair Road",
    "address2": "",
    "zip_code": "19007",
    "city": "Bristol,",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": 40.1136896,
    "longitude": -74.8962109}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.itassetmanagement.net/2012/01/09/data-center-inventory-management-passive-rfid/",
    "title": "ITAM Review - Data Center Inventory Management Using Passive RFID"}]}