{"name": "Astera LED Technology",
 "permalink": "astera-led-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/astera-led-technology",
 "homepage_url": "http://www.astera-led.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 65,
 "founded_year": 2007,
 "founded_month": 6,
 "founded_day": 30,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "wireless-lighting, controls",
 "alias_list": null,
 "email_address": "ernst@astera-led.com",
 "phone_number": "+49-6536-355361",
 "description": "High-Tech Firm",
 "created_at": "Tue Apr 02 12:10:20 UTC 2013",
 "updated_at": "Wed Apr 03 17:43:01 UTC 2013",
 "overview": "\u003Cp\u003EAstera manufactures a complete range of LED fixtures and controllers, and are the market leaders for ambient wireless lighting.\u003C/p\u003E\n\n\u003Cp\u003EAstera-LED Technology was founded in Germany in 2007. Astera’s core engineers and management team have been operating in the LED lighting business since 2003 and have been working at the forefront of innovation ever since.\u003C/p\u003E\n\n\u003Cp\u003EAstera is the leading manufacturer of wireless LED fixtures and controllers for event lighting.  In addition, the company has developed several outstanding LED lightsources and controllers for architectural lighting. Furthermore, the company designs and manufactures LED lights for other US and European companies.\u003C/p\u003E\n\n\u003Cp\u003EAstera’s young and dynamic R\u0026amp;D team is specialized in developing embedded LED control systems and advanced LED lights. An outstanding R\u0026amp;D team, with the support of an experienced management team, means that Astera is constantly asserting on all markets that are sensitive to innovations of the LED lighting business.\u003C/p\u003E\n\n\u003Cp\u003EBased on our global network of partners and suppliers, Astera pulls together the competences for helping customers to find the optimal LED solutions for their specific needs. The company is co-working with experienced and reliable companies in the LED business which are involved in the latest technologies worldwide. Astera is providing its customers with LED controllers for various interfaces, like DMX-512 wireless radio-control and Ethernet.\u003C/p\u003E\n\n\u003Cp\u003EFor special needs and exclusive projects Astera is developing customized or completely new LED solutions. With a team of dedicated engineers, a work facility, and QC management in Southern China, Astera has developed a strong and effective set-up for quickly developing new solutions. Before actual development of the LED product begins, Astera provides its customers with light simulations which are showing how illuminated objects will finally appear.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Norbert",
      "last_name": "Ernst",
      "permalink": "norbert-ernst",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Astera Europe",
    "address1": "Nahestrasse 68-70",
    "address2": "Rüdesheim an der Nahe",
    "zip_code": "55593",
    "city": "Kreis Bad Kreuznach",
    "state_code": null,
    "country_code": "DEU",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://invest.astera-led.com",
    "title": "Astera Investors Website"}]}