{"name": "Astha Sanitation",
 "permalink": "astha-sanitation",
 "crunchbase_url": "http://www.crunchbase.com/company/astha-sanitation",
 "homepage_url": "http://www.indiamart.com/asthasanitationmarketing/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "asthasanitationmarketing@tradepassport.org",
 "phone_number": "9830054278",
 "description": "Manufacturing and supplying ,",
 "created_at": "Thu Apr 04 15:53:42 UTC 2013",
 "updated_at": "Thu Apr 04 15:53:45 UTC 2013",
 "overview": "\u003Cp\u003EIncepted in the year 2011 at Kolkata, West Bengal, Astha Sanitation Marketing Pvt. Ltd. is engaged in manufacturing and supplying of Tempered Glass Basins, Wall Mounted Vanity Cabinets and Floor Vanity Cabinets. These are finely finished and are manufactured using high grade raw material that is procured from the reliable sources. Our dexterous team of professionals designs our products as per the latest market trends to deliver a range of flawless products. Under the able guidance of Mr. Indranath Dutta, Director we have carved a distinct niche in the realms of manufacturing and supplying of Basins. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality has always been the top priority for our company and that is why we follow stringent quality parameters ion the manufacturing of our products to ensure the production of impeccable quality products. Our products go though various stages of quality testing adhering to the international quality standards before they are finally dispatched into the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur infrastructure enables us to boast about out high production capacity within a very short period of time. We have installed highly advanced machinery and cutting edge technology in our sophisticated facility to develop a range of top notch quality products. All the departments are interconnected to maintain the proper communication amongst the workforce for the effective functioning of all the operations.\u003C/p\u003E\n\n\u003Cp\u003EOur Warehouse:\nWe have a capacious warehouse that has optimum space to enable the damage free storage of all the finished products. Proper segmentation into various segments allows us to develop a streamlined storage plan that helps in quick processing of the bulk orders. Our warehousing personnel are well experienced in the domain and enable the customized packaging of the products ensuring complete customer satisfaction.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nTempered Glass Basins\nWall Mounted Vanity Cabinets\nFloor Vanity Cabinets\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8048/248048v2-max-150x150.jpg"],
     [[250,
       113],
      "assets/images/resized/0024/8048/248048v2-max-250x250.jpg"],
     [[250,
       113],
      "assets/images/resized/0024/8048/248048v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}