{"name": "ASTRATECH AGENCY",
 "permalink": "astratech-agency",
 "crunchbase_url": "http://www.crunchbase.com/company/astratech-agency",
 "homepage_url": "http://www.astratechagency.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@astratechagency.com",
 "phone_number": "9331063235",
 "description": "ervice Provider of Steel Building Constr",
 "created_at": "Sat May 04 06:21:03 UTC 2013",
 "updated_at": "Mon May 06 05:59:23 UTC 2013",
 "overview": "\u003Cp\u003EOur partnership firm, \u0026#8220;Astratech Agency\u0026#8221; was established in the year 2003 at Jodhpur Park, Kolkata, India. Efficient inputs of our dedicated professionals backed up with experience of firm’s partners, our organization has been acclaimed to be the leading service provider of all dimensional sizes and designs of Steel Building Construction, Building Construction, Steel Slab, Structural Work, Steel Frame, Water Treatment Plant and Ground Level Reservoir Construction.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe firm has appointed extremely talented \u0026amp; skilled craftsmen and professionals for taking up various activities of manufacture, quality control and finishing under their control. The firm is particular about quality of its products and timely delivery to the customers. The basis of selection of our engineers, architects and other professionals into the firm has been their experience and skills in the domain. Our skilled personnel are a competent lot to meet all the quality, functionality and dimensional parameters.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nThe production activities are undertaken in well equipped ultra modern infrastructure that has been installed and it sprawls over a large area. Large spacious areas for execution of assignments have enabled the workmen to conduct the manufacturing and other activities smoothly and uninterruptedly.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nAll the building and structural products manufactured and offered by us to the customers are of superb quality. Only the best quality of raw materials is put in use for maintaining the high performance quality of the final products. Our organization believes that quality plays a pivotal role in giving successful growth to the firm. Therefore, the management ensures extreme care to maintain the quality standards of the vast range of products offered to the clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\n    Capacity to meet huge demands\n    Competent team of professionals\n    Stringent quality control\n    Customized products\n    On time delivery\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0025/8554/258554v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0025/8554/258554v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0025/8554/258554v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}