{"name": "ATech Electrical",
 "permalink": "atech-electrical",
 "crunchbase_url": "http://www.crunchbase.com/company/atech-electrical",
 "homepage_url": "http://www.indiamart.com/atechelectricalindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "voltage-controller, transformer-and-electoplating-machine",
 "alias_list": null,
 "email_address": "atechelectricalindustries@tradepassport.org",
 "phone_number": "9872942420",
 "description": "We are a leading manufacturer,",
 "created_at": "Thu Apr 04 10:04:52 UTC 2013",
 "updated_at": "Thu Apr 04 10:05:01 UTC 2013",
 "overview": "\u003Cp\u003EA-Tech Electrical Industries was incorporated in the year 2000 at Ludhiana and since then, it is engaged in manufacturing and supplying of Voltage Controller, Transformer and Electoplating Machine. These are manufactured in our sophisticated facility using advanced technology and modern machinery to facilitate the production of an extensive range of products that is at par with the industry standards. Since inception, we have been striving extremely hard to work towards the attainment of complete customer satisfaction by ensuring maximum customer benefits. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a state-of-the art infrastructure that sprawls over a large area and is outfitted with all the requisite tools and cutting edge technology facilitating the production of top notch quality products. We have segregated our facility into various departments to enable smooth functioning of all the business operations.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality has always been the top priority for our organization and that is why we follow stringent quality parameters in the manufacturing process adhering to international quality standards. We make use of the finest quality raw material that is procured from the vendors of high repute after doing a diligent study based on several quality parameters. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have dexterous team of professionals that has made us to set benchmarks in the industrial and successfully raise the bars of customer satisfaction. Our warehousing personnel have a very rich experience in the industry domain allowing us to stock all the finished products in a streamlined manner. Moreover, our packaging experts make use of the finest quality packaging material that has the brilliant ability to withstand all sort of material handling during transit.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nElectroplating Machine\u003C/p\u003E\n\n\u003Cp\u003EIndustrial Panel\u003C/p\u003E\n\n\u003Cp\u003EServo Stabilizer\u003C/p\u003E\n\n\u003Cp\u003EVoltage Controller\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7789/247789v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7789/247789v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7789/247789v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}