{"name": "Atharv Pneumatic",
 "permalink": "atharv-pneumatic",
 "crunchbase_url": "http://www.crunchbase.com/company/atharv-pneumatic",
 "homepage_url": "http://www.indiamart.com/atharvpneumaticsystems/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "atharvpneumaticsystems@tradepassport.org",
 "phone_number": "9833482710",
 "description": "manufacturing and supplying ",
 "created_at": "Thu Apr 04 09:55:38 UTC 2013",
 "updated_at": "Thu Apr 04 09:55:40 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, we, “Atharv Pneumatic Systems”, are one of the proficient manufacturers and suppliers of Blowing \u0026amp; Water Filling Machines, RO Plants and Pneumatic Presses. In this product range, we offer Fully Automatic Blowing Machines, Semi Automatic Blowing Machines, Blowing Machines, Pneumatics Cylinders, Pneumatics Valves and Pneumatics Regulators.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a highly proficient team, which helps us bring forth premium quality Blowing \u0026amp; Water Filling Machines, RO Plants and Pneumatic Presses, in accordance with clients\u0026#8217; demand. The professionals hired by us remain focused on maintaining international quality standards in our every business activity.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nThe infrastructure facility of our organisation is highly advanced, and helps us timely deliver optimum quality Blowing \u0026amp; Water Filling Machines, RO Plants and Pneumatic Presses. It has been segregated into specialised divisions for ensuring systematic and hassle-free operations. Each department is manned by proficient personnel having immense expertise in this domain.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe are known in the industry for our quality-oriented approach and quality commitments. Since inception, we have been consistently providing clients with best quality Blowing \u0026amp; Water Filling Machines, RO Plants and Pneumatic Presses. Forged carbon steel, stainless steel and alloy steel procured from trusted vendors of the market are used in the manufacturing process of these products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client-oriented organisation focused on attaining maximum customer satisfaction. For ensuring the same, we provide our patrons with optimum quality Blowing \u0026amp; Water Filling Machines, RO Plants and Pneumatic Presses at market leading prices and within the promised time frame. Further, client-centric business ethics are strictly followed by us while carrying out different tasks.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7778/247778v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7778/247778v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7778/247778v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}