{"name": "Atlas Paper Mills",
 "permalink": "atlas-paper-mills",
 "crunchbase_url": "http://www.crunchbase.com/company/atlas-paper-mills",
 "homepage_url": "http://atlaspapermills.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Thu May 23 06:25:26 UTC 2013",
 "updated_at": "Thu May 23 06:31:48 UTC 2013",
 "overview": "\u003Cp\u003EAtlas Paper Mills is the leading US manufacturer of recycled paper products produced to anticipate and exceed the environmental stewardship and value needs of our customers. Atlas Paper Mills is based in Miami, Florida and is a leader in the production of tissue paper, utilizing 100% recycled fiber and a manufacturing process free of chlorine, chlorine derivatives or any other potentially harmful chemicals.\u003C/p\u003E\n\n\u003Cp\u003EToday, Atlas produces over 36,000 tons of recycled tissue products per year and converts approximately three million cases of Eco-friendly towels and tissue for use in the Away From Home and Retail Marketplace. In addition to toilet tissue, our paper lines can convert kitchen roll towels, hard-wound roll towels and center-pull towels. Atlas Paper Mills is committed to producing, in a highly cost effective manner, tissue products which are certifiably Green.\u003C/p\u003E\n\n\u003Cp\u003EToday, all products produced by Atlas are made from 100% Recycled Wastepaper Composed of more than 20% Post-Consumer Content 100% Chlorine-Free and produced in a Chlorine-Free Manufacturing Environment Produced using a source-reducing array of waste raw material sources (including aseptic packaging containers) thereby eliminating thousands of pounds of waste from entering landfills annually Qualified for LEED Certification points Representing exceptional customer value when compared to other Certifiably Green Tissue Based Products\u003C/p\u003E\n\n\u003Cp\u003EAtlas Paper Mills was truly \u0026#8220;Born Green TM\u0026#8221; and through advancements in its papermaking, manufacturing and converting processes, has become an even deeper shade of Green. Atlas focuses on the four R\u0026#8217;s of Environmental Stewardship: Recycle, Reuse, Reduce and Respect for our resources and our earth. To this end, the Atlas manufacturing process and our end products are dedicated to Saving trees, Saving landfill space, Saving water consumption and Saving energy.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       25],
      "assets/images/resized/0026/5842/265842v1-max-150x150.png"],
     [[209,
       36],
      "assets/images/resized/0026/5842/265842v1-max-250x250.png"],
     [[209,
       36],
      "assets/images/resized/0026/5842/265842v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "3301 NW 107th street",
    "address2": "",
    "zip_code": "33167",
    "city": "Miami",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": 25.8715828,
    "longitude": -80.2533613}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        97],
       "assets/images/resized/0026/5841/265841v1-max-150x150.png"],
      [[250,
        163],
       "assets/images/resized/0026/5841/265841v1-max-250x250.png"],
      [[450,
        293],
       "assets/images/resized/0026/5841/265841v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}