{"name": "Attrahent Technologies",
 "permalink": "attrahent-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/attrahent-technologies",
 "homepage_url": "http://www.attrahenttechnologies.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "attrahent",
 "category_code": "software",
 "number_of_employees": 40,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 12,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design, web-development, seo, smm, ppc, orm",
 "alias_list": null,
 "email_address": "info@attrahent.co.in",
 "phone_number": "+1(888) 863-5256",
 "description": "",
 "created_at": "Fri Apr 26 11:20:30 UTC 2013",
 "updated_at": "Mon Apr 29 21:33:10 UTC 2013",
 "overview": "\u003Cp\u003EAttrahent Technologies is a leading web design and web development solution provider of India. At Attrahent Technologies we only believe in hard work, sincerity, honesty and  up gradation of existing skill. We are a India based web designing and development company, offer finest quality assistance in this field in an affordable rate. We are proud to be the part of many of our clients’ corporate growth as we provide them cutting edge solution for their websites during last few years.\u003C/p\u003E\n\n\u003Cp\u003EOur Goal:\u003C/p\u003E\n\n\u003Cp\u003EYour Website is your online identity and we try to make it clearer, brighter and more attractive. \u003C/p\u003E\n\n\u003Cp\u003EYou always wish to have maximum traffic for your website and for that you need to make sure that your site is worthy of visiting again and again. The main aim of our development team is to create the website in such a manner that it looks great and provides useful information to the viewers so that they find it interesting to have a look at your site frequently.\u003C/p\u003E\n\n\u003Cp\u003EWe do not want to make our services limited to any particular type of industry; rather we like to offer our world class assistance in development to all kind of business, irrespective to their size and pattern. With us you can shop a wide array of services related to web development and design. Combining our realistic domain experience, technical expertise, profound knowledge of latest industry trends and quality-driven delivery model we offer progressive end-to-end web solutions.\u003C/p\u003E\n\n\u003Cp\u003EWe provide a total solution of Website Design including a wide variety of services ranging from Custom Website Design to Website Redesign, Website Template Design to Template based Website Design, Flash Design to Creating Corporate Logo Identity to Website Maintenance.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0025/5257/255257v2-max-150x150.png"],
     [[248,
       82],
      "assets/images/resized/0025/5257/255257v2-max-250x250.png"],
     [[248,
       82],
      "assets/images/resized/0025/5257/255257v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Attrahent Technnologies",
    "address1": "BC-98, Sector- 1",
    "address2": "Salt Lake City ",
    "zip_code": "700064",
    "city": "Kolkata",
    "state_code": null,
    "country_code": "IND",
    "latitude": 22.5911208,
    "longitude": 88.4040291}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}