{"name": "Auction Masters",
 "permalink": "auction-masters",
 "crunchbase_url": "http://www.crunchbase.com/company/auction-masters",
 "homepage_url": "http://www.auctionmasters.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "auctioneers, auction-services, sales, business-liquidation",
 "alias_list": null,
 "email_address": "greg@auctionmasters.com",
 "phone_number": "763-428-2271",
 "description": "Leader in Auction Industry",
 "created_at": "Tue Apr 23 14:28:13 UTC 2013",
 "updated_at": "Mon Apr 29 16:31:41 UTC 2013",
 "overview": "\u003Cp\u003EAuction Masters provides customers with 40 years of proven results and market exposure, making us a leader in the commercial industrial auction industry. We provide our auction services at either your business location or our auction facility - the Twin Cities hub of metro auction commerce. Take a look at our website to learn more about how we employ cutting edge technology and also how we arrange auctions to fit the needs of each seller. We are innovative, flexible and masters in the auction industry.  We know that marketing is the key to your auction’s success and Auction Masters’ expertise in online marketing assures your auction will be presented in the right markets to the right people. Our set up team supplies expert-level skills in merchandising by making sure each item is presented in its best light. They also keep informed on potential challenges such as security, loading layout, or electrical disconnects. We staff the inspections with people that can answer questions. Additionally, the payment and removal process is a secure with our staff managing the flow and facilitating the process.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}