{"name": "Automotix",
 "permalink": "automotix",
 "crunchbase_url": "http://www.crunchbase.com/company/automotix",
 "homepage_url": "http://www.automotix.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Automotixllc",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "automotix, automotix-net, auto-e-commerce, automotive-parts",
 "alias_list": null,
 "email_address": "info@automotix.net",
 "phone_number": "(913) 236-9629",
 "description": "Auto parts e-commerce store",
 "created_at": "Mon Jan 14 18:53:04 UTC 2013",
 "updated_at": "Thu Jan 17 07:54:32 UTC 2013",
 "overview": "\u003Cp\u003EThe focus at Automotix is connecting buyers with sellers in the auto parts industry. We are the largest network of certified used OEM auto parts in the nation. We also directly offer buying solutions from suppliers specifically focused on remanufactured engines/transmissions, aftermarket wheels, aftermarket auto body parts, and accessories. Our main network of suppliers has daily well over 30 million auto parts on sale. Our goal is to bring streamlining technology to auto part suppliers in the industry. Furthermore, our desire is to facilitate the selling of as many of auto parts as possible and expand our suppliers reach toward targeted buyers. For the buyers, or desire is to be the one stop shop for all auto parts needs. We offer a “part locating” service that allows buyers to exponentially expand their auto part search across the nation to a vast network of qualified suppliers. Automotix is the Amazon of the auto parts industry. Other key elements of Automotix is being a industry leader in providing “DIY” auto repair data and manuals/diagrams. All our efforts are focused in on providing value, new customers, savings, technology, enhanced profitability and buying/selling solutions to both buyers and sellers in the auto parts industry.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}