{"name": "AutobrokerZ",
 "permalink": "autobrokerz",
 "crunchbase_url": "http://www.crunchbase.com/company/autobrokerz",
 "homepage_url": "http://www.autobrokerz.com/",
 "blog_url": "http://autobrokerz.com/forum/",
 "blog_feed_url": "",
 "twitter_username": "autobrokerz",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "auto-transporting, auto-shipping, auto-buying, auto-warranty, auto-parts, car-parts, vehicle-parts, vehicle-shipping, vehicle-transport, carshipping, car-coverage, wholesale-buying, auction-buying-of-cars",
 "alias_list": null,
 "email_address": "support@autobrokerz.com",
 "phone_number": "800-878-1784",
 "description": "Auto Needs from A-Z",
 "created_at": "Mon Nov 08 17:26:18 UTC 2010",
 "updated_at": "Wed Nov 10 00:30:32 UTC 2010",
 "overview": "\u003Cp\u003EWhether you want to buy a used car, truck, van or SUV at wholesale pricing, ship your vehicle, find a vehicle part, or protect your purchase with a warranty, AutobrokerZ.com will save you money with our \u0026#8220;Price Beat Guarantee\u0026#8221; Program, while making the experience easy and painless!\u003C/p\u003E\n\n\u003Cp\u003EAt Autobrokerz.com, we\u0026#8217;ll buy the vehicle of your choice \u0026#8230; at Wholesale Auctions on your behalf. We\u0026#8217;re just not aware of another way to save more. No longer will you have to pay for showroom overhead, sales commissions, staff salaries, large inventory costs, big advertising budgets \u0026#8230; and a whole lot more! We\u0026#8217;ll go to these Wholesale Dealer Auctions as YOUR representative. In effect, our unique Auto Broker Service puts you right there at these special, closed-to-the-public auctions \u0026#8230; with full access to their \u0026#8220;car dealer\u0026#8221; only wholesale prices. \u003C/p\u003E\n\n\u003Cp\u003EGet the best rates for shipping your automobile anywhere in the US! We work with over 5,000 car carriers with over 30,000 trucks to ship with each week\u0026#8211;virtually every licensed car carrier in the U.S. Our prices and service are the BEST in the industry\u003C/p\u003E\n\n\u003Cp\u003EWe have access to over 125 Million auto inventoried parts. Autobrokerz.com is the premier internet site for finding used auto parts. Although we specialize in used auto parts in used auto parts, we can also locate used truck parts and used parts for RV\u0026#8217;s, ATV\u0026#8217;s Motorcycles and Snowmobiles. Why buy new when used will do? Many of our partners offer at no additional cost a warranty to cover the used part. Save on cost, phone calls and searching time. Let us do all of the work and find you the best price! We access highly quality automotive recyclers, auto salvage yards, used/junk yards and discount car part dealers. We leave no stone unturned when searching for your part! \u003C/p\u003E\n\n\u003Cp\u003EWe offer one of the most efficient service agreements in the industry. It offers mechanical breakdown coverage and protects you against the high cost of major repairs. $0 Deductible on ALL Plans There are various levels of protection to choose from and all plans provide for 24 Hour Emergency Roadside Service throughout the life of the contract. If you ever decide to sell your car, you can transfer the agreement to another private purchaser of your vehicle. Vehicles with a service agreement typically offer much higher resale values because the buyer knows they are not going to get hit with huge repair costs. We\u0026#8217;ve got you covered! \u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Your Road to the Best Deal\u0026#8221;\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       65],
      "assets/images/resized/0010/9171/109171v2-max-150x150.png"],
     [[250,
       108],
      "assets/images/resized/0010/9171/109171v2-max-250x250.png"],
     [[450,
       195],
      "assets/images/resized/0010/9171/109171v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}