{"name": "Autotech Engineers",
 "permalink": "autotech-engineers",
 "crunchbase_url": "http://www.crunchbase.com/company/autotech-engineers",
 "homepage_url": "http://www.indiamart.com/autotechengineers-coimbatore/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "jigs-and-fixtures, carbide-tools, automobile-spare-parts",
 "alias_list": null,
 "email_address": "autotechengineers-coimbatore@tradepassport.org",
 "phone_number": "9894498555 ",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 06:10:20 UTC 2013",
 "updated_at": "Fri Apr 05 06:10:24 UTC 2013",
 "overview": "\u003Cp\u003EAutotech Engineers came into inception in the year 2005 as a Partnership firm in Coimbatore, Tamil Nadu. We have been successful in proving our competency and worth in manufacturing, supplying and exporting of Industrial Components, Burnishing Tools, Jigs and Fixtures, Carbide Tools, Automobile Spare Parts, Precision Turned components and Industrial Rollers. All the products that we manufacture are known for their excellent performance, corrosion resistance, seamless finish and long functional life. We are known to provide uncompromised quality products in the market owing to our manufacturing process and in-depth technical know-how.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe are well aware about the role played by efficient infrastructure in growth of any organization. To ensure excellent performance we have equipped our manufacturing unit with latest machines. Making proper use of planning, we have segregated our infrastructure into different smaller units for better results. Our infrastructure comprises administration, sales and marketing, logistics, manufacturing and other varied departments. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOver the years we have been successful in gaining expertise in manufacturing these products. In order to garner excellent quality, we ensure to use premium quality of raw material in manufacturing. The raw material is procured from vendors, who have an excellent goodwill in the market. We conduct series of tests in determining the quality, this has ensured consistent quality every time.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nEvery effort is made at our end to fulfill all the requirements of clients with complete sincerity. Our manufacturing process and other business processes are planned keeping the priorities of customers in mind. All our products match international quality in terms of quality and we ensure this is done ceaselessly. We use only premium quality of raw material in manufacturing our complete range. This plays a significant role in achieving desired results.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nCarbide Tools\nAutomobile Spare Parts\nPrecision Turned components\nIndustrial Rollers\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8310/248310v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8310/248310v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8310/248310v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}