{"name": "AV Helpdesk Inc.",
 "permalink": "av-helpdesk-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/av-helpdesk-inc",
 "homepage_url": "http://www.avhelpdesk.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "avhelpdesk",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2003,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "av, audiovisual, audio, video, audio-visual, consultant, design, enginneering, technology, integration",
 "alias_list": null,
 "email_address": "info@avhelpdesk.com",
 "phone_number": "9086927130",
 "description": "AV Helpdesk Inc.",
 "created_at": "Wed Jun 05 18:46:38 UTC 2013",
 "updated_at": "Wed Jun 05 18:53:36 UTC 2013",
 "overview": "\u003Cp\u003EOur company is easy to define in broad terms: we are a consulting firm that specializes in providing companies and institutions with the knowledge needed to design and implement integrated audiovisual solutions.\nYet, that definition doesn’t capture what we wake up thinking about every morning, what drives us, or what we do better than anybody else in the world: create unparalleled audiovisual experiences.  We didn’t found our company because we get excited about telephones and video cameras; it was because we recognize the power of technology to break down the barriers to communication. We knew that we had an unique ability to simplify people\u0026#8217;s interactions with technology, and in doing so could revolutionize the way they are seen, heard, and understood.\u003C/p\u003E\n\n\u003Cp\u003EDriven by this passion for innovative design, we have developed a business model very different from that of other audiovisual companies that you might meet when you begin searching for a service provider. We recognize that form and function are not independent concepts, and the facilities we design and manage for our clients are visually appealing, comfortable, and above all easy to use.\u003C/p\u003E\n\n\u003Cp\u003ETechnology in and of itself is not the solution, but a piece of the puzzle.  Phone systems, video cameras, and software come and go; it is the foundation that makes an audiovisual facility work. This foundation begins with the ability to design the concept, but extends to being able to expertly engineer it, coordinate its development, and even manage its use after it is complete.  Our business is based on this foundational philosophy, and we apply it to every task we undertake.\u003C/p\u003E\n\n\u003Cp\u003EIf you are looking for a different approach to improving your global audiovisual communications, you want a team that not only understands your needs, but can also effectively turn your ideas into reality.  We possess the knowledge and skills to do both.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[130,
       52],
      "assets/images/resized/0027/1682/271682v2-max-150x150.png"],
     [[130,
       52],
      "assets/images/resized/0027/1682/271682v2-max-250x250.png"],
     [[130,
       52],
      "assets/images/resized/0027/1682/271682v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "423 Brookline Avenue Suite 242 Boston, MA 02215",
    "address2": "",
    "zip_code": "Boston, MA 02215",
    "city": "Boston",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "AV Helpdesk Inc.",
    "address1": "244 Madison Ave.",
    "address2": "",
    "zip_code": "10016",
    "city": "New York",
    "state_code": "NJ",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}