{"name": "Avantic Corporation",
 "permalink": "avantic-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/avantic-corporation",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Fri Jun 14 04:17:22 UTC 2013",
 "updated_at": "Fri Jun 14 11:05:44 UTC 2013",
 "overview": "\u003Cp\u003EAvanti Corporation provides earth protection services. It offers ecological and human health risk and benefits assessments, such as fisheries impacts, exposure assessments, decreased life expectancy, blood lead levels, subsistence population impacts, wetlands loss, attainment of water quality standards, and increased/decreased environmental loadings. The company also provides site assessments and remediation services, including sampling and analysis, monitoring well installation and monitoring, exposure modeling, groundwater and soils modeling, excavation, tank removal, soil vapor extraction, air sparging, in-situ chemical oxidation, community relations, soil and groundwater investigations, and contaminant characterization services. In addition, it offers NPDES program support services, which include development of proposed and final fact sheets and permits, water quality-based limitations calculations/reasonable potential analyses, monitoring and reporting requirements, fee/rate calculations, responses to public comments, administrative records, and pretreatment audits; and compliance support services, such as development of training tools, program implementation audits and compliance evaluations, compliance inspections and outreach, data management tracking and trends reporting, call center support, online compliance reporting system development, pollution prevention, sampling and sample analysis, and environmental justice. Further, Avanti Corporation provides data management and systems support services, such as collection, compilation, and statistical analysis of environmental data; design, development, and implementation of data collection systems; online compliance tracking and permit application systems; records and file maintenance processes and guidance; data process reengineering; and life cycle analysis. The company was founded in 2005 and is based in Alexandria, Virginia.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder \u0026 CEO",
    "person":
     {"first_name": "Ryan",
      "last_name": "Koonce",
      "permalink": "ryan-koonce-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}