{"name": "Avanse Financial Services",
 "permalink": "avanse-financial-services",
 "crunchbase_url": "http://www.crunchbase.com/company/avanse-financial-services",
 "homepage_url": "http://www.avanse.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 50,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "education-loan, educational-loan, study-loan, student-loan",
 "alias_list": null,
 "email_address": "response@avanse.com",
 "phone_number": "02271112233",
 "description": "Avanse is a new age education finance co",
 "created_at": "Thu Jan 03 11:45:25 UTC 2013",
 "updated_at": "Thu Jan 10 23:37:17 UTC 2013",
 "overview": "\u003Cp\u003EAvanse is a new age education finance company. We are an Associate Company of Dewan Housing Finance Ltd. (DHFL), a leading player in the housing finance sphere. Avanse is a Non Banking Finance Company (NBFC) and is regulated by the Reserve Bank of India.\u003C/p\u003E\n\n\u003Cp\u003EAvanse was conceived with the aim to fulfill the gnawing need for education finance at reasonable terms, thus enabling every student to pursue their right to an education of their choice and achieve their career goals.\u003C/p\u003E\n\n\u003Cp\u003EThe word Avanse has been derived from the French word ‘Avance’, which means ‘to advance’. This meaning has become the cornerstone of the brand promise, which encourages students to chart out the course to their future, without encumbrances or any limits. The essence of the brand has thus been distilled and well encapsulated in the tagline: “Aspire Without Boundaries”\u003C/p\u003E\n\n\u003Cp\u003EOUR INSPIRATION\nIn 1984, the Late Shri. Rajesh Kumar Wadhawan dreamed of a home for every Indian and thus was born DHFL, the housing finance brand that revolutionized the real estate sector. Today, it is one of India’s largest housing finance companies in the private sector, having helped hundreds of thousands of Indians to fulfill their dreams of owning a home. \nTaking a leaf from the DHFL book, Avanse is ready to do likewise to the education finance sector, by advancing loans with a difference. Students can rest assured that their dreams will be fueled well, paving the way for a bright future.\u003C/p\u003E\n\n\u003Cp\u003EOUR VISION\u003C/p\u003E\n\n\u003Cp\u003ETo empower the Indian youth in their quest for a better future, by fueling their aspirations through easy access to education finance.\u003C/p\u003E\n\n\u003Cp\u003EWe see an India where every student can aspire for a better future; an India where dreams can come true, and not be sacrificed at the altar of financial limitations. At Avanse we understand the strength and potential of a young India and strive to be the wind beneath their wings, by providing education finance on the best terms possible.\u003C/p\u003E\n\n\u003Cp\u003EOUR MISSION\u003C/p\u003E\n\n\u003Cp\u003EAvanse aims to provide hassle-free and 100% education finance to Indians, to study in India and abroad.\nThrough customized solutions and flexible repayment plans\nEncouraging and mentoring the holistic development of all students, through underwriting innovation, accessibility \u0026amp; trustworthiness.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0022/7850/227850v2-max-150x150.png"],
     [[250,
       82],
      "assets/images/resized/0022/7850/227850v2-max-250x250.png"],
     [[250,
       82],
      "assets/images/resized/0022/7850/227850v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Avanse",
      "last_name": "India",
      "permalink": "avanse-india",
      "image": null}},
   {"is_past": false,
    "title": "",
    "person":
     {"first_name": "Benoy",
      "last_name": "Joseph",
      "permalink": "benoy-joseph",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "Gr. Floor, Madhava Building, Bandra Kurla Complex",
    "address2": "Near Family Court, Bandra – East",
    "zip_code": "400051",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://www.facebook.com/AvanseEducationLoan",
    "title": "Facebook Page"}]}