{"name": "Avanquest Software",
 "permalink": "avanquest-software",
 "crunchbase_url": "http://www.crunchbase.com/company/avanquest-software",
 "homepage_url": "http://www.avanquest.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Avanquest",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 1988,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-software",
 "alias_list": "",
 "email_address": "",
 "phone_number": "818.591.6258 ",
 "description": "",
 "created_at": "Fri Aug 01 03:31:48 UTC 2008",
 "updated_at": "Sun May 26 05:19:35 UTC 2013",
 "overview": "\u003Cp\u003EAvanquest Software is a developer and publisher of consumer software and business solutions. The group markets a wide range of  programs developed both in-house and by developer partners. \u003C/p\u003E\n\n\u003Cp\u003EAvanquest distributes its products to consumers, enterprises, and major companies in the mobile telephone and computer industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0002/3171/23171v3-max-150x150.png"],
     [[250,
       66],
      "assets/images/resized/0002/3171/23171v3-max-250x250.png"],
     [[294,
       78],
      "assets/images/resized/0002/3171/23171v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Member of The Board of Directors \u0026 Chairman, M\u0026A Committee",
    "person":
     {"first_name": "Andy",
      "last_name": "Goldstein",
      "permalink": "andy-goldstein",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder, President, and CEO",
    "person":
     {"first_name": "Bruno",
      "last_name": "Vanryb",
      "permalink": "bruno-vanryb",
      "image":
       {"available_sizes":
         [[[101,
            132],
           "assets/images/resized/0003/0496/30496v2-max-150x150.jpg"],
          [[101,
            132],
           "assets/images/resized/0003/0496/30496v2-max-250x250.jpg"],
          [[101,
            132],
           "assets/images/resized/0003/0496/30496v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003EBV\u003C/p\u003E"}}},
   {"is_past": false,
    "title": "CFO",
    "person":
     {"first_name": "Thierry",
      "last_name": "Bonnefoi",
      "permalink": "thierry-bonnefoi",
      "image": null}},
   {"is_past": false,
    "title": "Managing Director of Avanquest Software Publishing Ltd",
    "person":
     {"first_name": "Dave",
      "last_name": "Brass",
      "permalink": "dave-brass",
      "image": null}},
   {"is_past": true,
    "title": "Co-Founder and CTO",
    "person":
     {"first_name": "Roger",
      "last_name": "Politis",
      "permalink": "roger-politis",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [{"funding_round":
     {"round_code": "unattributed",
      "source_url": "http://www.finsmes.com/2011/06/antvoice-raises-e750k-funding.html?utm_source=feedburner\u0026utm_medium=feed\u0026utm_campaign=Feed%3A+finsmes%2FcNHu+%28FinSMEs%29",
      "source_description": "AntVoice Raises â‚¬750k in Funding",
      "raised_amount": 750000.0,
      "raised_currency_code": "EUR",
      "funded_year": 2011,
      "funded_month": 6,
      "funded_day": 20,
      "company":
       {"name": "AntVoice",
        "permalink": "antvoice",
        "image":
         {"available_sizes":
           [[[150,
              43],
             "assets/images/resized/0014/0153/140153v3-max-150x150.png"],
            [[230,
              66],
             "assets/images/resized/0014/0153/140153v3-max-250x250.png"],
            [[230,
              66],
             "assets/images/resized/0014/0153/140153v3-max-450x450.png"]],
          "attribution": null}}}}],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Global Headquarters",
    "address1": "91, boulevard National ",
    "address2": "",
    "zip_code": "92250 ",
    "city": "La Garenne Colombes",
    "state_code": null,
    "country_code": "FRA",
    "latitude": 48.905306,
    "longitude": 2.239065},
   {"description": "Avanquest North America ",
    "address1": "23801 Calabasas Road",
    "address2": "Suite 2005  ",
    "zip_code": "91302-1547 ",
    "city": "Calabasas",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 34.155212,
    "longitude": -118.646105},
   {"description": "Avanquest Software USA  ",
    "address1": "1333 West, 120th Avenue",
    "address2": "Suite 314 ",
    "zip_code": "80234",
    "city": "Westminster",
    "state_code": "CO",
    "country_code": "USA",
    "latitude": 39.914611,
    "longitude": -105.002286}],
 "milestones":
  [{"description": "Avanquest Launches Complete Network Connection Solution",
    "stoned_year": 2008,
    "stoned_month": 7,
    "stoned_day": 24,
    "source_url": "http://www.tradingmarkets.com/.site/news/Stock%20News/1780108/",
    "source_text": "PLEASANTON, CA, Jul 24, 2008 (MARKET WIRE via COMTEX) -- AVQFF | Quote | Chart | News | PowerRating -- Avanquest Software, a leading developer and publisher of business and consumer software for the global PC market, today introduced its latest-generation Connection Manager networking tool, enabling instant and secure Internet connectivity over the best available network to give on-the-go laptop users easy communication every time and anywhere they want to access the web.\r\n\r\nAs a special promotion for new Connection Manager users, Avanquest Software is now offering the $29.95 retail software package for download at no cost by visiting http://www.ConnectMyLaptop.com, in order to encourage users to browse and take advantage of the wide range of personal productivity, multimedia, business, educational and recreational applications available at the Avanquest online store.\r\n\r\nAccommodating the increasingly mobile lifestyle of executives, professionals, college students and even families, the new Connection Manager ensures that establishing an Internet connection and getting online securely is never a problem. Providing the most complete solution for creating location-based network profiles, Connection Manager lets users transition quickly and easily between home, office, school, coffee shop, hotel room, convention center or airport networks. See how it works here: http://www.ConnectMyLaptop.com.\r\n\r\nConnection Manager automatically identifies and stores necessary network and security parameters for virtually every type of publicly used connection standard, including standard Ethernet, Wi-Fi, ADSL and WiMax. By memorizing preferred network connection settings, including internet, Virtual Private Network (VPN), email client, default printer and shared disk drives, laptop users can seamlessly transition from one network to the next without having to adjust settings or deal with annoying error messages.\r\n\r\nTo ensure a secure interface in any situation, Connection Manager works with a computer's existing firewall and network security applications to guarantee optimal protection levels for the chosen network environment. Whether used within the office IT infrastructure or on the road where a firewall and VPN connection may be required, Connection Manager will automatically launch the needed security settings. Additionally the software includes network traffic monitoring tools, the latest WPA encryption protocols and 64- or 128-bit WEP key compatibility for a safe and trustworthy web-surfing environment.\r\n\r\n\"With Avanquest Connection Manager, laptop users can forego the burden of Internet connection configuration each time they change locations and enjoy simple and fast Web connection wherever they are,\" said Ryan Smith, Director of Product Marketing, Avanquest Publishing USA. \"It's no longer a problem for a user moving from a primary office location, with a default printer and three shared drives, to a remote location with a different printer and share drives. Connection Manager takes the headache out of connection setup, automatically adjusting to the right printer and drives at each location.\"\r\n\r\n\"We hope our customers will appreciate this free offer to take advantage of this powerful but simple to use utility,\" Smith said. \"Whether novice users or power users, everyone can appreciate Connection Manger's automatic handling of tedious Internet connection configurations, letting anyone just simply turn on their laptop and start surfing the Web.\"\r\n\r\nConnection Manager is compatible with the majority of Ethernet cards, analog modems and xDSL systems. The program operates within Windows XP and Vista-ready PC platforms. This free version is available for download from Avanquest's web site http://www.ConnectMyLaptop.com. For more information about Connection Manager and a complete listing of software titles available from Avanquest, visit http://www.avanquest.com.\r\n\r\nAbout Avanquest Software\r\n\r\nAvanquest Software is a global developer and leading publisher of best-selling personal and professional software designed for utilities, office productivity, communications and mobility worldwide. Avanquest Software products are marketed in over 100 countries, through e-commerce, OEM partnerships and IT resellers. Founded in 1984 as BVRP Software and listed since December 1996 on Euronext (ISIN FR0004026714), Avanquest Software forms part of the Eurolist, NextEconomy segment and SBF 250 index. Additional information on Avanquest Software is available at www.avanquest.com.\r\n",
    "source_description": "Avanquest Software Simplifies Life on the Go, Offering Digital Nomads Complete Network Connection Solution",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Avanquest Software",
      "permalink": "avanquest-software"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}