{"name": "Aventure Mail",
 "permalink": "aventure-mail",
 "crunchbase_url": "http://www.crunchbase.com/company/aventure-mail",
 "homepage_url": "http://aventuremail.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Sat Aug 30 22:46:13 UTC 2008",
 "updated_at": "Mon Jun 17 02:51:29 UTC 2013",
 "overview": "\u003Cp\u003EThe purpose of aventuremail.co.uk is to assist banking professionals and people who wish to provide excellent customer service to their clients. This blog is run by a group of banking experts dedicated to writing original and quality content about banking related subjects.\u003C/p\u003E\n\n\u003Cp\u003EWe will provide tips on how to present discussion forums, formulate new plans and how to respond to mails promptly and accurately.\u003C/p\u003E\n\n\u003Cp\u003EEvery banker should follow this simple guideline – understand the importance of customers and explore business ideas. Our writers will help you gain positive business results, and provide advice on enhancing customer experience as well. Analysis on retail banking, mortgage and credit cards are the key subjects this blog deals with. We will address financial issues, the impact of market fluctuations on banking, and other related topics too.\u003C/p\u003E\n\n\u003Cp\u003EIn this blog, you will also find information on mobile banking and the best practices to follow to facilitate customer relationships. Aventuremail.co.uk is committed to helping people understand and adapt to the changes in a dynamic banking sector. Our team of experts examine current trends in banking services and anticipate any changes.\u003C/p\u003E\n\n\u003Cp\u003EYou can get in touch with our writers at any time via email. Kindly visit the contact page and fill in the necessary details, along with your questions or suggestions. We will respond as soon as possible. If you have any issues regarding the content of this blog, or need to report inaccurate information, please do so immediately. You can contribute articles to this blog as well.  \u003C/p\u003E\n\n\u003Cp\u003EThank you for visiting.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Managing Director",
    "person":
     {"first_name": "Richard",
      "last_name": "Kennedy",
      "permalink": "richard-kennedy",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}