{"name": "Avnera Corporation",
 "permalink": "avnera-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/avnera-corporation",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Sat Apr 27 06:56:00 UTC 2013",
 "updated_at": "Mon Jun 17 12:16:00 UTC 2013",
 "overview": "\u003Cp\u003EAvnera Corporation, a fabless analog semiconductor company, offers analog systems-on-chip (ASoC) technology products for consumer electronics applications. It offers AudioMagic ASoCs for wireless streaming audio applications, including wireless headphones, wireless speakers, and other whole-home audio streaming products; point to multi-point wireless audio streaming applications; and multi-point to multi-point wireless audio streaming solutions. The company also provides AudioMagic 2G products to offer a multi-point to multi-point wireless whole-home audio solution; and enable consumer electronics manufacturers to support various simultaneous streams of uncompressed HD-quality audio in various wireless send/receive combinations. In addition, Avnera Corporation offers AudioMagic 1G products for point to multi-point wireless audio streaming applications. Further, the company provides VoiceMagic ASoCs for point to point and point to multi-point wireless voice market for headsets and microphones; and integrating various circuits/components needed to implement wireless voice products onto a single chip. Its products are used in consumer markets, such as PC and iPhone accessories, gaming products, home audio/video products, and TV accessories, as well as enterprise markets, such as audio and voice conferencing products. The company sells its products worldwide. Avnera Corporation was incorporated in 2003 and is based in Beaverton, Oregon.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Board Member",
    "person":
     {"first_name": "Umesh",
      "last_name": "Padval",
      "permalink": "umesh-padval",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0025/5503/255503v1-max-150x150.jpg"],
          [[150,
            150],
           "assets/images/resized/0025/5503/255503v1-max-250x250.jpg"],
          [[150,
            150],
           "assets/images/resized/0025/5503/255503v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}