{"name": "Avocent Corporation",
 "permalink": "avocent-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/avocent-corporation",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Thu May 02 03:22:01 UTC 2013",
 "updated_at": "Mon Jun 17 12:07:57 UTC 2013",
 "overview": "\u003Cp\u003EAvocent Corporation offers software, hardware, and embedded technologies to help enterprise-level information technology (IT) organizations to control, plan, evolve, and secure their IT infrastructure. It provides data center management software for planning, accessing, controlling, and reporting data center assets; analog and digital KVM appliances to consolidate access at the desk, at the rack, or across the data center; LCD console trays to mount in 1U of space and provide direct control of rack equipment; power distribution units, including metered and switched models to control and measure power usage; and serial appliances, such as console servers for IT professionals and network operations centers to conduct remote data center management. The company offers MergePoint service processor management devices to monitor and maintain server health; extension technology; embedded management software that allows OEM and ODM customers to implement remote access and device management functionality on platforms designed to support baseboard service processors; data center management and planning, power management, branch infrastructure, control room, and digital signage solutions; and technical support, professional services, and training programs. It serves media and entertainment, and public sector industry segments, as well as OEM/embedded partners and small/midsize businesses. The company was formerly known as Aegean Sea, Inc. and changed its name to Avocent Corporation in March 2001. The company was founded in 2000 and is headquartered in Huntsville, Alabama with locations in the United States, Canada, Brazil, Australia, China, Hong Kong, Japan, Korea, Singapore, Malaysia, Indonesia, Thailand, the Philippines, Vietnam, Taiwan, India, the United Kingdom, Benelux, Deutschland, Austria, Iberia, France, Ireland, Israel, Italia, the Netherlands, Russia, Sweden, and Switzerland. As of December 11, 2009, Avocent Corporation operates as a subsidiary of Emerson Electric Co\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Director of Channel / SI Sales",
    "person":
     {"first_name": "Pan",
      "last_name": "Kamal",
      "permalink": "pan-kamal",
      "image":
       {"available_sizes":
         [[[113,
            126],
           "assets/images/resized/0025/7219/257219v1-max-150x150.jpg"],
          [[113,
            126],
           "assets/images/resized/0025/7219/257219v1-max-250x250.jpg"],
          [[113,
            126],
           "assets/images/resized/0025/7219/257219v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}