{"name": "Avon",
 "permalink": "avon",
 "crunchbase_url": "http://www.crunchbase.com/company/avon",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Thu May 30 10:04:44 UTC 2013",
 "updated_at": "Mon Jun 17 12:02:18 UTC 2013",
 "overview": "\u003Cp\u003EAvon, the company for women, is a leading global beauty company, with nearly $11 billion in annual revenue.  As one of the world\u0026#8217;s largest direct sellers, Avon is sold through more than 6 million active independent Avon Sales Representatives.  Avon products are available in over 100 countries, and the product line includes color cosmetics, skincare, fragrance, fashion and home products, featuring such well-recognized brand names as Avon Color, ANEW, Skin-So-Soft, Advance Techniques, and mark.  Learn more about Avon and its products at www.avoncompany.com.\u003C/p\u003E\n\n\u003Cp\u003EAvon has a proven history of delivering first-to-market beauty technologies, making the company a perennial game-changer. Time and again, Avon and its global team of scientists have led the industry in giving consumers breakthrough products that marry beauty and innovation. Light-adjusting makeup, more durable mascara, better-hydrating lipstick, revolutionary anti-aging skincare products, and an at-home alternative to pricey in-salon smoothing treatments. The list goes on and on. Simply put, Avon gives women around the globe products that help them look and feel their best \u0026#8211; in fact, two out of five women worldwide purchased an Avon product in the last year.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Marketing Director",
    "person":
     {"first_name": "Catherine",
      "last_name": "Khan",
      "permalink": "catherine-khan",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}