{"name": "Awarepoint Corporation",
 "permalink": "awarepoint-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/awarepoint-corporation",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Wed Apr 24 13:06:25 UTC 2013",
 "updated_at": "Mon Jun 17 11:47:34 UTC 2013",
 "overview": "\u003Cp\u003EAwarepoint Corporation develops and delivers real-time location systems that are used by hospitals to track, monitor, and optimize the utilization and workflow of personnel, patients, and equipment. It offers aware360°suite for automatically managing patient flow in clinical units, such as the emergency department, the perioperative department, the cardiac catheterization laboratory, and diagnostic imaging; locating and routing movable medical equipment and various assets to ensure their proper cleaning, maintenance, distribution, and security; distributing, retrieving, cleaning, and staging instrument trays; monitoring and documenting staff members’ compliance with hand hygiene requirements and various infection-containment protocols; monitoring temperature-controlled environments, logging out-of-range events, and documenting corrective actions; and managing the turnover of inpatient beds by monitoring occupancy, status, and availability. The company provides awareTracker solution, a Web-based enterprise visibility and workflow automation system that interprets asset location, maps staff and patient movements, and reports in real-time; and awareHandHygiene solution, an auto-ID hand hygiene monitoring solution that observes and reports on hand hygiene compliance. It also offers Awarenet that broadcasts radio messages, which allow the client to locate specific equipment and people, and provide information about their movement and status; and sensors and bridges. The company serves hospital clients, including teaching institutions, independents, military facilities, and members of major integrated delivery networks with enterprise hospital sites in the United States. It distributes its solutions through its strategic partners. Awarepoint Corporation was formerly known as NeverLost Networks, Inc. The company was founded in 2002 and is based in San Diego, California.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Cofounder",
    "person":
     {"first_name": "James",
      "last_name": "Adams",
      "permalink": "james-adams",
      "image":
       {"available_sizes":
         [[[95,
            150],
           "assets/images/resized/0025/4575/254575v1-max-150x150.jpg"],
          [[159,
            250],
           "assets/images/resized/0025/4575/254575v1-max-250x250.jpg"],
          [[159,
            250],
           "assets/images/resized/0025/4575/254575v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}