{"name": "Awe",
 "permalink": "awe",
 "crunchbase_url": "http://www.crunchbase.com/company/awe",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Fri Sep 17 21:52:43 UTC 2010",
 "updated_at": "Mon Jun 17 11:43:49 UTC 2013",
 "overview": "\u003Cp\u003EAWE has been central to the defence of the United Kingdom for more than 50 years. We provide and maintain the warheads for the country’s nuclear deterrent, Trident.\u003C/p\u003E\n\n\u003Cp\u003ETrident is a submarine-launched, inter-continental ballistic nuclear missile weapons system, carried by Royal Navy Vanguard-class submarines. Our role at AWE is to manufacture and sustain the warheads for the Trident system, ensuring optimum safety and performance, but also to maintain a capability to produce a successor system should the Government require one in the future.\u003C/p\u003E\n\n\u003Cp\u003EOur work at AWE covers the entire life cycle of nuclear warheads; from initial concept, assessment and design, through to component manufacture and assembly, in-service support, and finally decommissioning and disposal.\u003C/p\u003E\n\n\u003Cp\u003EThe scientists, engineers and business specialists employed by AWE are world renowned. Achieving and maintaining the very highest standards in everything we do is at the heart of our vision for the future – a vision which is to achieve widespread international recognition as a world-class company, building upon our reputation as a centre of scientific and technological excellence. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}