{"name": "AXEON Water Technologies",
 "permalink": "axeon-water-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/axeon-water-technologies",
 "homepage_url": "http://www.axeonwater.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "AXEONWATER",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1985,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-technologies, membrane-solutions, reverse-osmosis, membrane-systems, membrane-housings",
 "alias_list": null,
 "email_address": "axeonwatertechnologies@gmail.com",
 "phone_number": "760-723-5417",
 "description": "AXEON Water Technologies is an innovativ",
 "created_at": "Thu Aug 09 10:55:14 UTC 2012",
 "updated_at": "Wed Jan 02 02:18:41 UTC 2013",
 "overview": "\u003Cp\u003EAXEON\u0026#8217;s Values\u003C/p\u003E\n\n\u003Cp\u003EAXEON Water Technologies is proud to be a leader in membrane technology, including systems, elements, housing and chemicals. We are proud of our relationships with our customers, they are built on mutual trust and support. Our customers know when they call AXEON that they will be treated with respect, honesty and cooperation, while they receive AXEON\u0026#8217;s quality sales, marketing and technical support. Together, we form a strategic partnership that is built upon integrity at every level.\u003C/p\u003E\n\n\u003Cp\u003EMISSION STATEMENT\u003C/p\u003E\n\n\u003Cp\u003EAXEON Water Technologies will utilize more than two decades of experience in membrane technology, research, development and manufacturing in order to remain at the forefront of the water treatment industry as a leading membrane solutions provider.\u003C/p\u003E\n\n\u003Cp\u003EINNOVATION\u003C/p\u003E\n\n\u003Cp\u003EFor more than two decades, AXEON has dedicated engineering and technical resources to innovation in the design, manufacturing and application of membrane systems, elements, housings and chemicals worldwide. AXEON\u0026#8217;s innovative approach assures the most successful application of water treatment products in any environment. AXEON\u0026#8217;s innovative spirit has led to unique product developments such as AXEON HF5 Membrane Elements, the industry\u0026#8217;s lowest operating membrane and AXEON R2 and M2-Series Low Energy Brackish Water RO Systems that are designed for higher efficiency levels.\u003C/p\u003E\n\n\u003Cp\u003EQUALITY\u003C/p\u003E\n\n\u003Cp\u003EAXEON\u0026#8217;s commitment to the best quality products and services is demonstrated through our expert quality assurance and research and development teams; professional manufacturing and product testing facilities; extensive distribution network; and the AXEON Quality Guarantee.\u003C/p\u003E\n\n\u003Cp\u003ESUPPORT\u003C/p\u003E\n\n\u003Cp\u003EFrom unparalleled customer support to training in sales, marketing and technical support of AXEON products, AXEON is committed to helping our customers succeed every step of the way. Call us today to learn how AXEON\u0026#8217;s commitment to innovation, quality, and support will benefit your business — 800-320-4074.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0022/7552/227552v2-max-150x150.jpg"],
     [[200,
       67],
      "assets/images/resized/0022/7552/227552v2-max-250x250.jpg"],
     [[200,
       67],
      "assets/images/resized/0022/7552/227552v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}