{"name": "Ayurleaf herbals",
 "permalink": "ayurleaf-herbals",
 "crunchbase_url": "http://www.crunchbase.com/company/ayurleaf-herbals",
 "homepage_url": "http://www.ayurleaf.in/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@ayurleaf.com",
 "phone_number": "9619079944",
 "description": "offering Herbal Medicines",
 "created_at": "Thu May 02 15:30:21 UTC 2013",
 "updated_at": "Mon May 06 05:41:01 UTC 2013",
 "overview": "\u003Cp\u003EWe \u0026#8220;Ayurleaf herbal (Powered by BIO-BAXY Technologies)\u0026#8221;, established in the year 2009 is a  company that manufactures premium herbal \u0026amp; food supplements products in India that are synonymous with quality. Ayur Leaf Herbals is an online pharma portal that has been formulated with the intention to bring on the digital platform the holistic goodness of Ayurveda to maximum consumers worldwide. Medical care has become an important facet of our lives. Universal formulas that are available naturally and can be purchased at affordable costs is correspondingly important. \u003C/p\u003E\n\n\u003Cp\u003EOur Vision:\nThe vision is to multiply the opportunity of Ayurveda in the world of medicine. We are in a social vision to teach the importance and manipulate the availability of Ayurveda in the common to see a healthy India.\u003C/p\u003E\n\n\u003Cp\u003EOur Mission:\nOur mission of our business is not focusing any financial point. Our strategy is social. We are taking the responsibility of quality to fulfill the social need.\u003C/p\u003E\n\n\u003Cp\u003EOur Company\u0026#8217;s Life Force:\nA young entrepreneur Mohammed Husain visualized the need for bringing the goodness of Ayurveda to consumers. The idea was to give various long-term makers of Ayurveda medicines a digital platform where they could share their expertise and also sell their products online. Already with a strong base with Biobaxy Technologies, he created an online pharmacy that now caters to regular clients across continents. With his expertise he got the germ to expand the pharmacy to the next level.\u003C/p\u003E\n\n\u003Cp\u003EOpportunity for Wholesale/Bulk buyers:\nAyurLeaf Herbals has a dedicated digital platform where there is an ever-increasing opportunity for wholesale/bulk buyers of Ayurveda products and medicines. We are geared to provide mercantile facility for them to reach out to patients worldwide. The e-commerce section is designed and developed to attract manufacturers, dealers and pharmacists who provide Ayurveda remedies for common ailments like joint pains, Psoriasis, conditions like diabetes, stones in kidney, digestive disorders, painful piles and sexual disorders of varying kinds.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0025/7741/257741v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0025/7741/257741v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0025/7741/257741v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}