{"name": "B² Interactive",
 "permalink": "b-interactive",
 "crunchbase_url": "http://www.crunchbase.com/company/b-interactive",
 "homepage_url": "http://www.b2interactive.com",
 "blog_url": "",
 "blog_feed_url": "http://www.b2interactive.com/feed/",
 "twitter_username": "b2interactive",
 "category_code": "web",
 "number_of_employees": 12,
 "founded_year": 2012,
 "founded_month": 12,
 "founded_day": 28,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "omaha, web, seo, sem, ppc, social-media, web-design, internet-marketing, nebraska",
 "alias_list": null,
 "email_address": "info@b2interactive.com",
 "phone_number": "402-932-9990",
 "description": "web design \u0026 internet marketing",
 "created_at": "Mon Apr 15 19:52:21 UTC 2013",
 "updated_at": "Mon Apr 15 19:52:26 UTC 2013",
 "overview": "\u003Cp\u003EB2 Interactive is a web design, development and marketing firm in Omaha, Nebraska.  \u003C/p\u003E\n\n\u003Cp\u003EB2 Interactive\u0026#8217;s focus is on effective design, development, deployment and marketing of commercial websites.  The founders of b2i each have more than 15 years of experience in building websites that work for their intended purpose.  Designing a website can be done by anyone of the hundreds of local and thousands of national website design firms.  Our website development and marketing process is a bit different.  We have a philosophy that a website that doesn’t bring you the right visitors and then meet all of the needs your targeted visitor may have just isn’t worth operating.  Each of our projects is designed thusly with an end-goal of satisfying both our client and their customers’ needs.\u003C/p\u003E\n\n\u003Cp\u003ELet’s face it.  The reason you are hopefully launching a website or redesigning an existing website is to further the value of your online presence.  If you are simply looking to launch a website because your competitor has one but you don’t have any real goals set for your website you may want to take a step back behind the starting line and start by setting some measurable goals for what you want your web presence to accomplish.  No matter what kind of business you operate your website is meant to create a conversion of some kind.  Whether your site is mostly information or you operate a full e-commerce website your website is meant to create a conversion that could be as defined as an online purchase or as loose as providing customers with a more clear picture of what exactly your company or organization can do for them.\u003C/p\u003E\n\n\u003Cp\u003EWhether you already have a pretty good website or are just starting out, b2i has the experience and expertise to take your online presence to the next level.  We feel that all parts of your online presence tie together and should work in harmony.  Your web presence should help you accomplish the specific goals we previously discussed having and should also help you build a better brand presence.  b2i provides you with each of the services to accomplish both.  We help you not only build your website but also will help build, deploy and manage a comprehensive online marketing strategy, which includes;\u003C/p\u003E\n\n\u003Cp\u003E•Website Design and Development \n•Custom Software and Application Development\n•Website Hosting \n•E-mail Hosting\u003C/p\u003E\n\n\u003Cp\u003E•Search Engine Optimization (SEO)  and Search Engine Marketing (SEM) – we help your site move its way up the major search engine’s search results to bring your site the visitors you are looking for.  SEO and SEM services from b2i include on-site and off-site improvements that will help you be found online more often.  We will let you and everyone else in on the secret formula to bringing quality organic traffic to your website right now -  a quality, relevant and current website that meets the needs of people searching for what you offer is 90% of what you need to be found naturally in the major search engines.  How well you get your story out there, both socially and by having other websites devote time and space to talking about your brand and/or website.  In addition there are scores of on-site off-site factors that you must look at in making sure your site is found naturally.  From site design and through every step of the online marketing process we have SEO on our minds and make sure your website and online marketing efforts are fully optimizing SEO best practices.\n•Social Media Marketing and Management – an active presence in the social-sphere is a must for most companies and organizations today.  Not only will a well planned and managed Social Media Marketing campaign help you find new customers and new customers find you but it is also an important part of building and maintaining your company or organization’s identity.  Social Media is a great place to start building your brand and a way to engage immediately with those who either already know you but to identify those you people you want to get to know your brand.\n•Content Marketing and Management – content has quickly become more and more important to your website’s success.  b2i will help you develop an effective on-site and off-site content marketing and management strategy to keep your website fresh with content that visitors and search engines alike are desperately looking for about you and what you do.  b2i can help you develop a content strategy and/or can provide you with content from our team of Journalism, English and Marketing graduates that make up our content marketing and management team.\n•Paid Search Advertising Management – the search engines certainly have made it easy for every website to start advertising their website through paid search advertising – often called PPC.  You could have a paid advertising campaign up and running in a matter of minutes but are you seeing a positive return on the dollars you are spending here?  b2i will help you not only set-up a campaign\n•Website, SEO and Social Media Analytics and Optimization – hopefully you would never jump behind the wheel of your car and drive blindfolded.  Don’t do the equivalent with your website and online marketing efforts.  Our expert team can look deep into the inner workings of your website, the sources that provide you with website traffic and the visitor behavior on your website to tell you exactly what is happening and identify areas of optimization.  Years of experience have given our team the ability to provide you with comprehensive reporting that shows how your website is performing and how it can be improved.  We provide you with this data and recommendations in a way you can understand and act upon.  Decision making is easy with the right information – we make sure you have the right information along with our recommendations for where to go next with your website and other online marketing efforts.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Bill",
      "last_name": "Hipsher",
      "permalink": "bill-hipsher",
      "image":
       {"available_sizes":
         [[[150,
            100],
           "assets/images/resized/0026/0167/260167v2-max-150x150.jpg"],
          [[250,
            166],
           "assets/images/resized/0026/0167/260167v2-max-250x250.jpg"],
          [[450,
            300],
           "assets/images/resized/0026/0167/260167v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003EBill Hipsher from Wall Street Journal\u003C/p\u003E"}}},
   {"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Brandon",
      "last_name": "Taylor",
      "permalink": "brandon-taylor",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "B2 interactive",
    "address1": "4223 South 143rd Circle",
    "address2": "",
    "zip_code": "68137",
    "city": "Omaha",
    "state_code": "NE",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}