{"name": "Baanto International",
 "permalink": "baanto-international",
 "crunchbase_url": "http://www.crunchbase.com/company/baanto-international",
 "homepage_url": "http://www.baanto.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": 15,
 "founded_year": 2009,
 "founded_month": 11,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "touchscreen, multi-touch, digital-signage, interactivity",
 "alias_list": null,
 "email_address": "jkotas@baanto.com",
 "phone_number": "+1 408 940 4747",
 "description": "Touchscreen Manufacturer",
 "created_at": "Tue Sep 25 18:55:03 UTC 2012",
 "updated_at": "Thu Oct 11 21:53:52 UTC 2012",
 "overview": "\u003Cp\u003EBaanto International is a Mississauga, Ontario based company engaged in the design, development and marketing of proprietary infra-red (IR) based optical touchscreens based upon ShadowSense™ technology. \u003C/p\u003E\n\n\u003Cp\u003EBaanto was formed in 2009 as the commercialization vehicle for what is now known as ShadowSense.  Eight (8) patents have been filed since the inception of the technology and cover the topology, implementation, and algorithmic aspects of ShadowSense position sensing technology.  ShadowSense touchscreens combine high performance with a cost effective architecture, allowing Baanto to compete effectively in multiple market segments and across various use models.\u003C/p\u003E\n\n\u003Cp\u003EBaanto is exiting 2012 with twelve (12) production touchscreen solutions ranging in size from 8” (diagonal) to one of the largest commercial touchscreens in the world with a diagonal span of \u0026gt; 266”.  \u003C/p\u003E\n\n\u003Cp\u003EBaanto product momentum is supported by the multi-touch experience and familiarity developed by the 500 million + smartphones and tablets sold over the last 5 years.  The majority of these devices are multi-touch enabled, creating a user expectation that displays of all sizes will be interactive and have the common “iPad®” multi-touch experience of swipes, pinches, and rotates.  On the PC front, the touch capability of Windows 7® and pending release of the multi-touch features of Windows 8 reinforces the need for the multi-touch experience to be present on laptops, “All in Ones”,  PC desktops and larger displays as well.\u003C/p\u003E\n\n\u003Cp\u003EAs a result of the staggering growth over the last five years, DisplaySearch estimates the touchscreen market size (TAM) to be $15.88 billion (USD) in 2012 and growing to more than $24 billion by 2017.  While a significant portion of the recent growth is directly attributed to smartphones, tablets, and PC’s, even excluding these market segments the Baanto served available market (SAM) for existing products is estimated to be $2.67 billion (2012) with a calculated average growth rate (CAGR) of 13.6%. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       115],
      "assets/images/resized/0021/3025/213025v2-max-150x150.jpg"],
     [[250,
       193],
      "assets/images/resized/0021/3025/213025v2-max-250x250.jpg"],
     [[450,
       347],
      "assets/images/resized/0021/3025/213025v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}