{"name": "Babysoft Software",
 "permalink": "babysoft-software",
 "crunchbase_url": "http://www.crunchbase.com/company/babysoft-software",
 "homepage_url": "http://www.babysoft.in",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "babysoftS",
 "category_code": "software",
 "number_of_employees": 6,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-hosting, web-design, seo, web-development, api-integration, sms-solution",
 "alias_list": null,
 "email_address": "welcome@babysoft.in",
 "phone_number": "9236144812",
 "description": "web design, software, web development ",
 "created_at": "Mon Jun 06 09:32:36 UTC 2011",
 "updated_at": "Wed Apr 11 20:21:49 UTC 2012",
 "overview": "\u003Cp\u003EBabysoft is the new name round the corner for the optimized website design and development at reasonable prices. \u003C/p\u003E\n\n\u003Cp\u003EIn the hands of young, talented and energetic individuals Babysoft is one of the emerging Online Marketing and Software Support Company in Lucknow. We are continuously growing and extending our services due to immense support from our prestigious clients. We are working in 365*24*7 environment to improve our work for our clients to meet better end user requirements.We are adopting the new technologies and providing research based solution. Our expert team of professionals is committed to deliver out of the box solution. Our focus is on medium and small scale enterprises who want to increase their revenue by adopting Information Technology. Our services include customization of open source technology, Web applications, Software Support, Website Design, Blogs, Custom Software, IT Consulting and Infrastructure Maintenance. We are providing all the services at a competitive price.\u003C/p\u003E\n\n\u003Cp\u003EBabysoft Software is recognised and respected for its superior track record exceeding client expectation and end-user expectations and for building lasting relationships. We offer comprehensive business optimization solutions much beyond the traditional IT Solution.\u003C/p\u003E\n\n\u003Cp\u003EExcellence. Reliability. Integrity. Not just abstract concepts at BabysoftS, but the way we conduct business with clients, partners and mid size business. Add individual responsibility to the mix and you have the recipe for a dynamic environment, technological achievement, challenging career opportunities, and the potential for personal growth. Team members at BabysoftS understand that they are helping to shape the future of cutting edge technology in the future of web applications and online softwares. That\u0026#8217;s why we\u0026#8217;re always looking for the best and the hard working to join our winning team.\u003C/p\u003E\n\n\u003Cp\u003EAdd wings to your career\u003C/p\u003E\n\n\u003Cp\u003EOur workplace combines the resources of a leading-edge technology pioneer with the entrepreneurial spirit of a start-up. We emphasize individual responsibility and enable team mates to directly affect results. We want our team mates to succeed and to face new challenges, with continuous learning that champions career and leadership development. Our work policies are family-friendly, including a flexible work environment. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       78],
      "assets/images/resized/0018/3528/183528v3-max-150x150.png"],
     [[250,
       130],
      "assets/images/resized/0018/3528/183528v3-max-250x250.png"],
     [[450,
       234],
      "assets/images/resized/0018/3528/183528v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder",
    "person":
     {"first_name": "Vibhor",
      "last_name": "Sahu",
      "permalink": "vibhor-sahu-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Unit 1",
    "address1": "Station Road ",
    "address2": "Lucknow",
    "zip_code": "226001",
    "city": "Lucknow",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}