{"name": "Babynology Baby Names",
 "permalink": "babynology-baby-names",
 "crunchbase_url": "http://www.crunchbase.com/company/babynology-baby-names",
 "homepage_url": "http://www.babynology.com",
 "blog_url": "http://babynamesandmeaning.wordpress.com/",
 "blog_feed_url": "http://babynamesandmeaning.wordpress.com/feed/",
 "twitter_username": "Babynology",
 "category_code": "search",
 "number_of_employees": 30,
 "founded_year": 2003,
 "founded_month": 4,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "baby-names, baby-names-meanings, boys-names, girls-names, what-does-my-name-mean, popular-names, hindu-names, cute-names, top-names",
 "alias_list": null,
 "email_address": "resources@babynology.com",
 "phone_number": "",
 "description": "Baby names and meaning directory.",
 "created_at": "Fri Mar 02 09:47:39 UTC 2012",
 "updated_at": "Tue Mar 06 20:21:48 UTC 2012",
 "overview": "\u003Cp\u003EBabynology is a well equipped and complete family oriented website introduced in the year of 2003 for finding baby names from all over the world along with origin, sub origin, meaning, numerology etc. We provide ease to your search for Cute baby names, Popular baby names, Famous baby names, Unique baby names, Unusual baby names, Uncommon baby names, God names for babies and many more versatile categories. The list or categories of baby names include baby girl names or baby boy names are up-to-date and recent with comprehensive meaning and description. One can have the opportunity to explore the world of baby names through Babynology. The purpose of establishing Babynology is to simplify your search and guides you an easy way to keep an interesting baby name for your little ones without any confusion.\u003C/p\u003E\n\n\u003Cp\u003EIn addition, the baby names offered by Babynology are well researched and accurate in terms of meaning and origin. We also invite our website visitors to give their individual online comments and suggestions on baby names to make it more interactive.Babynology elicits a flawless website that can guide you in your search for unique and cute baby names. Baby Photo contest held on each month by us is another attraction of the website to raise the popularity; parents can put their baby photos to participate in the photo contest and get the certification. Babynology is the right place to get parenting and family tips on just one click; you can also get a number of helpful parenting articles and tips. So, you don’t need to go anywhere else after clicking on Babynology.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        112],
       "assets/images/resized/0017/6665/176665v2-max-150x150.jpg"],
      [[250,
        187],
       "assets/images/resized/0017/6665/176665v2-max-250x250.jpg"],
      [[450,
        337],
       "assets/images/resized/0017/6665/176665v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.suggestbabynames.com",
    "title": "Suggest Baby Names"}]}