{"name": "BackBid",
 "permalink": "backbid",
 "crunchbase_url": "http://www.crunchbase.com/company/backbid",
 "homepage_url": "http://www.backbid.com",
 "blog_url": "http://www.backbid.com/Common/BlogE.aspx?id=13",
 "blog_feed_url": "",
 "twitter_username": "backbid",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": 2,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hotels, booking, deals, online, bids, e-commerce, hi-tech",
 "alias_list": null,
 "email_address": "info@backbid.com",
 "phone_number": "",
 "description": "Have hotels BID on you!",
 "created_at": "Wed Mar 14 18:10:42 UTC 2012",
 "updated_at": "Mon Apr 08 01:21:18 UTC 2013",
 "overview": "\u003Cp\u003EAt BackBid, we have created a marketplace for consumers to post their existing hotel reservations and/or travel intentions so that BackBid partners can deliver better rates and free amenities in an attempt to win their business.\u003C/p\u003E\n\n\u003Cp\u003EBackBid is a hotel booking website that revolutionizes how travelers book hotel rooms. BackBid empowers you, the traveler, to find the best possible hotel room, for the best price, with no elaborate or time-consuming searches necessary. By posting your existing hotel reservation to BackBid, hotels are able to see your travel plans and offer bids for your business, offering either discounts or value-added services, like upgraded rooms, free parking or breakfast. Unlike other travel sites who offer discounts without telling you any info about the hotel that you’re booking, BackBid gives you all of the details about the property, the amenities offered and the specific bid being offered before you confirm and process the reservation. This helps you to save money but also to ensure that your hotel stay will meet – or even exceed – all of your expectations.\u003C/p\u003E\n\n\u003Cp\u003EThe best part about BackBid is that there is absolutely no risk to you; if you don’t like any of the bids that you receive, just keep your existing reservation.\u003C/p\u003E\n\n\u003Cp\u003EHow does it work?\u003C/p\u003E\n\n\u003Cp\u003ETravelers book their hotel stay as they normally would through their channel of choice.\nThe traveler posts their confirmed reservation and travel preferences on the site as a BackBid Traveler.\nBackBid provides hotels with instant access to the database of all BackBid Travelers traveling to their destination. Hotels can then submit bids to encourage travelers to abandon their current reservation and book with their property instead.\nBackBid Travelers are notified of all hotel bids via email and can access the details by logging into their BackBid account.\nOnce the BackBid Traveler accepts a bid, the reservation and the payment are processed by the hotel.\nTravelers that are not currently holding confirmed reservations can receive bids from hotels by posting their needs, preferences, and travel plans on the site.\u003C/p\u003E\n\n\u003Cp\u003EWhy did we create BackBid?\u003C/p\u003E\n\n\u003Cp\u003EWe, at BackBid, are travelers just like you and were really tired of all the work that goes into finding the best rate for our hotel stays. The choices are endless, the pricing confusing and the whole process is very time-consuming. Often we would cancel and rebook the same reservation several times as prices fluctuated, and at the end of it all, we weren\u0026#8217;t even sure if we\u0026#8217;d gotten the best deal! \nThat\u0026#8217;s when the idea came to us: create a website that makes it simple to find the best price and value by making the hotels do all the hard work by bidding on travelers’ business! And so BackBid was born.\u003C/p\u003E\n\n\u003Cp\u003ENeed more information about BackBid?\u003C/p\u003E\n\n\u003Cp\u003EContact us at info@backbid.com \n1-514-773-BIDS (2437)\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       64],
      "assets/images/resized/0024/9247/249247v2-max-150x150.jpg"],
     [[150,
       64],
      "assets/images/resized/0024/9247/249247v2-max-250x250.jpg"],
     [[150,
       64],
      "assets/images/resized/0024/9247/249247v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "Rich Media",
    "is_past": false,
    "provider":
     {"name": "VFM Leonardo",
      "permalink": "vfm-leonardo",
      "image": null}},
   {"title": "Database",
    "is_past": false,
    "provider":
     {"name": "Northstar",
      "permalink": "northstar",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.washingtonpost.com/lifestyle/travel/the-navigator-new-web-site-backbid-lets-you-get-a-better-hotel-deal/2012/02/29/gIQAlEo6BS_story.html",
    "title": "New Web site BackBid lets you get a better hotel deal"},
   {"external_url": "http://travel.usatoday.com/digitaltraveler/story/2012-01-30/New-website-lets-hotels-bid-for-your-business/52886316/1?loc=interstitialskip",
    "title": "BackBid Lets Hotels Compete For Your Business"},
   {"external_url": "http://www.budgettravel.com/feature/8-new-hotel-booking-websites-for-finding-the-perfect-hotel%2c8372/",
    "title": "Best Hotel Booking Websites"},
   {"external_url": "http://www.frommers.com/community/blogs/blog.cfm/arthur-frommer-online/new-hotel-finding-website-choice-of-hotel-win-win-proposition-enabling-better-price-next-stay",
    "title": "New Website Win-Win"}]}