{"name": "Baggas Adaliz",
 "permalink": "baggas-adaliz",
 "crunchbase_url": "http://www.crunchbase.com/company/baggas-adaliz",
 "homepage_url": "http://www.indiamart.com/baggasadaliz/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we-have-been-into-manufacturing, supplying-and-exporting-of-meenakari-handicraft, marble-suparidan, wooden-handicraft-and-many-more-",
 "alias_list": null,
 "email_address": "baggasadaliz@tradepassport.org",
 "phone_number": "9928375178",
 "description": "We are prominent manufacturer, supplier ",
 "created_at": "Thu Apr 04 15:20:45 UTC 2013",
 "updated_at": "Thu Apr 04 15:21:10 UTC 2013",
 "overview": "\u003Cp\u003EBaggas Adaliz came into market in 2007 as sole proprietorship firm at Jaipur in Rajasthan, India. We have been into manufacturing, supplying and exporting of Meenakari Handicraft, Marble Suparidan, Wooden Handicraft and many more. Being into decorative industry, we do understand the requirements of our clients and make every effort to ensure they are delighted to possess handcrafted items designed by us. Our team comprises highly skilled craftsmen who understand diverse need of our customers. We ensure at our end the products manufactured by us are of world class quality and unique due to usage of excellent raw material and highly skilled workforce behind them.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are proud to have a complete state-of the- art infrastructure keeping abreast with modern technology. We have classified our facility into separate manufacturing, designing, warehousing and packaging unit. This has facilitated the smooth functioning of all the departments. The aim with which we work i.e. customer’s satisfaction is always achieved due to excellent co-ordination among all the departments. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a devoted team of professionals who ensure manufacturing of products with marvelous finish and class. The reason for this achievement every time is due to their commitment, training, and skill set. We also ensure our professional get sufficient training with the modern techniques and machinery as to make best use of technology every effort is made to make them aware about the market and latest trend in demand. Meticulous attention is given to ensure customer’s delight.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe are brand in terms of quality and this has given us access to huge customer base. The quality screening starts from the procurement of raw material till the product is finally shaped and packed. Our Team of quality is always vigilant as to ensure no compromises are made at any level to ensure the excellence every time.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nWe have been into manufacturing, supplying and exporting of Meenakari Handicraft, Marble Suparidan, Wooden Handicraft and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8023/248023v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8023/248023v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8023/248023v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}