{"name": "Banc De Binary",
 "permalink": "banc-de-binary",
 "crunchbase_url": "http://www.crunchbase.com/company/banc-de-binary",
 "homepage_url": "http://www.bbinary.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "trading, investment, binary-options, financial",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "a privately held trading and investment",
 "created_at": "Wed Dec 05 07:30:39 UTC 2012",
 "updated_at": "Mon Feb 25 04:45:56 UTC 2013",
 "overview": "\u003Cp\u003EAn investment trading revolution:\u003C/p\u003E\n\n\u003Cp\u003EThe Banc De Binary team of senior staff members are a team of professionals that hail from the old world of financial institutions. The valuable employees of Banc De Binary have years of experience with the methods of operation in the finance and trading world of the past. These executives also form part of the growing movement of professionals that came to realize that the way that businesses are functioning in their specialized area has become out of date and prone to hazard. Some of the biggest financial institutions have seen some of the largest failures and have greatly depreciated. Banks, investment firms and brokerage companies have endured much suffering with assets and equities losing value, and the worldwide economic failure has become their responsibility. Archaic methods are now being left behind by those in the know and they are paving the way to the future. Banc De Binary and its people are embracing the future by making full use of the advanced technology now available throughout the world and by trading in binary assets. \u003C/p\u003E\n\n\u003Cp\u003EWhat is binary option trading in a nutshell?\u003C/p\u003E\n\n\u003Cp\u003EAlthough relatively new to the market, binary option trading is growing in popularity all over the world. Who would not be thoroughly interested in a high yield and comprehensible investment? While regular investment options depend on buying and selling at the right time, binary options have a clearly fixed period. The short lifespan of the investment goes in hand with the equally attractive fixed return. Binary trading simplifies things and this simplicity of having set outcomes and time periods of the investment is attractive to those weary of the complexity and volatility of the traditional market. \u003C/p\u003E\n\n\u003Cp\u003EHand-picked; Banc De Binary’s team extraordinaire:\u003C/p\u003E\n\n\u003Cp\u003EThe management team at Banc De Binary has tremendous pride in their staff members and takes recruitment of top notch professionals very seriously. With an outright guarantee of expert counsel on call 24 hours a day every day of the week, Banc De Binary has faith in their employees to deliver the very best service to valued clients all over the world. Brokers and private investors alike benefit from the expert knowledge gained by those that are not limited to the narrow scope of customary trading. Banc De Binary strongly advocates diversity in the workplace. Employee efforts are greatly appreciated and mutually beneficial contracts are upheld. Banc De Binary employees have exposure to accelerated learning programmes and mentoring to aid the furthering of their careers within the establishment.\u003C/p\u003E\n\n\u003Cp\u003EUpholding ethical business practices:\u003C/p\u003E\n\n\u003Cp\u003EBanc De Binary is focussed on the responsibility that corporate concerns hold to the rest of the world. According to this company it is the duty of all businesses with influence to promote ethical business practices and work together to preserve capital markets in a sustainable environment. As a strong believer in human rights, community and preservation of the environment, Banc De Binary actively assist companies with environmental impact evaluations and seek to improve the adherence levels of corporate concerns to environmental regulations.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/3917/223917v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0022/3917/223917v2-max-250x250.jpg"],
     [[450,
       450],
      "assets/images/resized/0022/3917/223917v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.bancdebinaryinfo.com/",
    "title": "Banc De Binary Lookuppage"},
   {"external_url": "http://banc-debinary.tumblr.com/",
    "title": "Banc De Binary on Tumblr"},
   {"external_url": "http://banc-debinary.fr",
    "title": "Banc De Binary"},
   {"external_url": "http://www.bancdebinary.com/",
    "title": "Banc De Binary info"},
   {"external_url": "http://www.banc-debinary.fr",
    "title": ""},
   {"external_url": "http://www.banc-debinary.fr",
    "title": "Banc De Binary"}]}