{"name": "Baneet International",
 "permalink": "baneet-international",
 "crunchbase_url": "http://www.crunchbase.com/company/baneet-international",
 "homepage_url": "http://www.indiamart.com/baneetinternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "baneetinternational@tradepassport.org",
 "phone_number": "09953360079",
 "description": "Manufacturing and Trading of Engine Part",
 "created_at": "Fri Apr 05 11:59:34 UTC 2013",
 "updated_at": "Fri Apr 05 11:59:37 UTC 2013",
 "overview": "\u003Cp\u003E\u0026#8220;Baneet International\u0026#8221;, was established in the year 2000, as a sole proprietorship company and engaged in manufacturing and trading of high quality automobile spares parts. Baneet International is a name synonymous with high precision and top quality automobile parts. We consistently stand up to the high qualitative expectations of our clients.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe do extensive market research with the help of our expert sourcing agents to find the best vendors for raw material supply. They deal only in high quality raw material and as per the set industry norms. We have long term association with our vendors which helps us in procuring bulk quantity raw materials in the shortest delivery time. We have excellent back up arrangements to meet any emergency and do not depend on a single supply source as most competitors do.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are a team of professionals who are committed to render quality services to our clients. Each member of the organization is like a part of the family and puts in the best of his or her services. Everybody puts in their extra effort to achieve the varied targets set by the company and have contributed to the success of the company. It is owing to their support that we have completed every assigned task efficiently and on time.    \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe have built a commendable reputation for reliability and quality due to our uncompromising adherence to strictest standards of quality. Total quality control is a part of our organizational structure. There are foolproof systems in place to make sure that only materials of the finest quality are used for manufacturing all our products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur clients are the support and backbone of our business and their complete satisfaction is what all the departments of our organization is zealously focused on. We have emerged as one of the top leaders in the industry because we have client satisfaction at the very top of our list of priorities.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8615/248615v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8615/248615v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8615/248615v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}