{"name": "Bartech Solutions",
 "permalink": "bartech-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/bartech-solutions",
 "homepage_url": "http://www.indiamart.com/bartech-solutions/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "bartech-solutions@tradepassport.org",
 "phone_number": "9449081533",
 "description": "manufacturers, suppliers and exporters",
 "created_at": "Fri Apr 05 10:21:38 UTC 2013",
 "updated_at": "Fri Apr 05 10:21:41 UTC 2013",
 "overview": "\u003Cp\u003EBartech Solutions took off in the year 2010 as a Proprietorship unit. Over the years we have focused to supply the best quality products to our clients. In this process we have done substantial advancements at our end, so that we are in tune with the changing industry needs and cater them accordingly.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe operate within a sound infrastructure that includes latest technologies and machinery used to produce highest quality of products. The infrastructure really helps us to deliver the products within the stipulated time frame, and thus helping us to achieve newer and higher standards. The inspiring unit helps to keep the production graph going up.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe have always excelled in quality parameters and have set a benchmark in the industry as per our quality standards. To further educate our people we constantly engage them on certain platforms where in they interact with industry stalwarts and sharpen their base. This not only helps them to work with finesse, at the same time create a healthy image in the mind of clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have set of highly professionals who work with a very dedicated approach to achieve production excellence. The market experience and industrial knowledge of these professionals has enabled us to target the consumers in right manner and to earn maximum profit. They keep close vigil on even the minor changes taking place in industry and ensure that their plans are further planned accordingly.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have always believed to achieve highest ranks in client satisfaction. Our clients are fairly large in numbers, and we have always given the priority. This helps to create a positive image at the back of clients’ mind. The reason we are getting business, simply lies in this fact the clients’ keep coming back to us.\u003C/p\u003E\n\n\u003Cp\u003EOur Clientele:\nAs a result of high quality workmanship, we have got some of the leading names across various domains as our clients. This further motivates us to deliver the best and keep the momentum going.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8527/248527v2-max-150x150.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8527/248527v2-max-250x250.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8527/248527v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}