{"name": "BASF",
 "permalink": "basf-2",
 "crunchbase_url": "http://www.crunchbase.com/company/basf-2",
 "homepage_url": "http://www.basf.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "chemicals, construction-chemicals",
 "alias_list": "",
 "email_address": "",
 "phone_number": "49 621 60 0",
 "description": "",
 "created_at": "Thu Sep 24 02:29:23 UTC 2009",
 "updated_at": "Fri Jun 14 20:08:18 UTC 2013",
 "overview": "\u003Cp\u003EBASF SE operates as a chemical company worldwide. The company conducts its operations through six business segments, including Chemicals, Plastics, Performance Products, Functional Solutions, Agricultural Solutions, and Oil and Gas. Chemicals segment In the Chemicals segment, the company offers products for customers in the chemical, electronic, construction, textile, automotive, pharmaceutical, and agricultural industries; and provides other BASF segments with chemicals for the production of higher-value products. The company\u0026#8217;s portfolio ranges from basic chemicals, glues and electronic chemicals for the semiconductor and flat panel display industry, to solvents and plasticizers, as well as starting materials for detergents, plastics, textile fibers, paints, coatings and pharmaceuticals. The Chemicals segment consists of the Inorganics, Petrochemicals and Intermediates divisions. Inorganics: The company\u0026#8217;s basic products are ammonia, methanol, sodium hydroxide, chlorine, as well as sulfuric and nitric acid. It serves electronic chemicals market in Asia and Europe. Petrochemicals division: The Petrochemicals division offers a range of products, such as ethylene, propylene, butadiene, and benzene are produced in steam crackers from naphtha or natural gas. In further processing stages, the company produces alcohols, solvents and plasticizers for the chemicals and plastics industries. Alkylene oxides and glycols are starting materials for the detergents, automotive, packaging and textile industries. Intermediates: With its 600 products, the company\u0026#8217;s Intermediates division develops, produces, and markets a range of intermediates of all producers worldwide. The company\u0026#8217;s product lines include amines, diols, polyalcohols, acids and specialties. They serve as starting materials for products such as coatings, plastics, pharmaceuticals, textile fibers, crop protection products, as well as detergents and cleaners. Plastics segment The Plastics segment offers a range of products, system solutions and services. The company offers engineering plastics for the automotive and electric industries, as well as for use in household appliances, sport and leisure. The company\u0026#8217;s styrenic foams are used as insulating materials in the construction industry and in the packaging industry. The company\u0026#8217;s polyurethanes are versatile: as soft foams, they are to be found in car seats and mattresses, and as rigid foams they serve as insulation in refrigerators. This segment produces plastics. The Performance Polymers and Polyurethanes divisions offer its customers energy-efficient products, system solutions and services. The company\u0026#8217;s customers are primarily in the automotive, electric/electronics, textile, packaging and construction industries. Performance Polymers: The company offers performance polymers, such as engineering plastics, polyamide and polyamide intermediates, as well as foams and specialty plastics for various applications. Polyurethanes: The company offers Polyurethanes, such as basic products, customer-specific systems and specialties for automotive, construction and furniture industries, as well as household appliances. Performance Products The Performance Products segment consists of the Acrylics \u0026amp; Dispersions, Care Chemicals and Performance Chemicals divisions.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0006/0665/60665v1-max-150x150.png"],
     [[160,
       160],
      "assets/images/resized/0006/0665/60665v1-max-250x250.png"],
     [[160,
       160],
      "assets/images/resized/0006/0665/60665v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CFO",
    "person":
     {"first_name": "Kurt",
      "last_name": "Bock",
      "permalink": "kurt-bock",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [{"price_amount": null,
    "price_currency_code": "USD",
    "term_code": null,
    "source_url": "",
    "source_description": "Cap Funding Report",
    "acquired_year": 2008,
    "acquired_month": 10,
    "acquired_day": 22,
    "company":
     {"name": "BASF Plant Science",
      "permalink": "basf-plant-science",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0006/0664/60664v1-max-150x150.png"],
          [[160,
            160],
           "assets/images/resized/0006/0664/60664v1-max-250x250.png"],
          [[160,
            160],
           "assets/images/resized/0006/0664/60664v1-max-450x450.png"]],
        "attribution": null}}}],
 "offices":
  [{"description": "",
    "address1": "Carl Bosch Strasse 38",
    "address2": "",
    "zip_code": "67056",
    "city": "Ludwigshafen",
    "state_code": null,
    "country_code": "DEU",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}