{"name": "Basic Materials Sector Watch",
 "permalink": "basic-materials-sector-watch",
 "crunchbase_url": "http://www.crunchbase.com/company/basic-materials-sector-watch",
 "homepage_url": "http://www.bmsectorwatch.com/",
 "blog_url": "http://www.bmsectorwatch.com/",
 "blog_feed_url": "http://feeds2.feedburner.com/BasicMaterialsSector",
 "twitter_username": "BMSectorWatch",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "basic-materials-sector, pdf, reports, chemical, plastics, wood, mining, gold, silver, copper, packaging, iron, steel, fabrication, paper, nyse, nasdaq, dax, finance, business, money, stocks, cobe, futures, options, tse, sehk",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "News and info from this sector.",
 "created_at": "Sat Feb 23 12:03:10 UTC 2013",
 "updated_at": "Sat Mar 16 19:38:52 UTC 2013",
 "overview": "\u003Cp\u003EMaterials Sector Watch, a non-biased financial analysis site that is dedicated at looking at the Basic Materials Sector as defined by Dow Jones \u0026amp; Company.  This means that we typically only do our financial analysis and news reporting on components that make up the Dow Jones U.S. Basic Materials Index (DJUSBM).  This index is comprised of sub-sectors such as Chemical and Plastic manufacturing; building materials;  wood and paper processing; gold, silver and precious metals mining; non-metallic mining; iron and steel manufacturing; and container and packaging companies, to name a few.\u003Cbr/\u003E\nOur basic philosophy is become experts in an important financial sector that is often overlooked by the mainstream financial news media.  We use many methodologies when looking basic material stocks, including using relative valuation methods, discounted cash flow valuations, earnings, beta analysis, value multiples, earnings per share, and ratios, including Profitability, Liquidity, Activity, Financing and Market ratios.\u003Cbr/\u003E\nIn addition to concentrating on the Basic Materials index, we also occasionally report news from other sectors that are important to various markets, like the Dow Jones, NASDAQ, S\u0026amp;P500,  CBOE, and international markets like the Hang Seng, Nikkei, FTSE, EURO STOXX, Shanghai, and the TSCE among others.\nAt Basic Materials Sector Watch we typically look at the sector as whole, as well as individual equities, to determine what their short term and long terms future values might be based on information provided from their SEC 10k reports and overall economic health.   We do not suggest stocks to buy, hold or sell – we feel that is the job of an individual and their financial advisor.  Our analysis is meant to be a starting point that individual investors can use to help diversify their overall portfolios.  The actual acquisitions of equities are, ultimately, the responsibility of each individual investor.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[132,
       127],
      "assets/images/resized/0024/2925/242925v2-max-150x150.png"],
     [[132,
       127],
      "assets/images/resized/0024/2925/242925v2-max-250x250.png"],
     [[132,
       127],
      "assets/images/resized/0024/2925/242925v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}