{"name": "Bateriacompulsiva.com",
 "permalink": "bateriacompulsiva-com",
 "crunchbase_url": "http://www.crunchbase.com/company/bateriacompulsiva-com",
 "homepage_url": "http://www.bateriacompulsiva.com",
 "blog_url": "http://bateriacompulsiva.blogspot.com.es/",
 "blog_feed_url": "",
 "twitter_username": "BateriaComp",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 12,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "external-batteries, laptop-batteries, mobile-batteries, solar-batteries, solar-external-battery, external-battery-cell-phone, laptop-external-battery",
 "alias_list": null,
 "email_address": "bateriacompulsiva@gmail.com",
 "phone_number": "628581902",
 "description": "Gadgets, batteries, lots of stuff",
 "created_at": "Wed Dec 12 01:46:23 UTC 2012",
 "updated_at": "Tue Dec 18 08:34:13 UTC 2012",
 "overview": "\u003Cp\u003EThe Bateriacompulsiva.com story is simple: it all started in March 2012 with the desire to provide external battery to potential customers, improving the performance of their devices. Prioritizing quality and speed of service (especially thanks to MRW), have a high satisfactory purchase history for both individuals and businesses with our first products: Powerbank external batteries, laptop chargers our quality and cheaply, and USB plugs and Dockings Hard Drive.\n     Thereafter, and client requests, gradually incorporate other products: start with inks and toners, so we have very competitive prices (we even have a 20 € toners and inks to 1 €), and we expanding the catalog, adding batteries for all types of devices and inhibitors for enforcement and for individuals concerned about their privacy and privacy. We also had to finish including, gradually, the languages of our customers, for convenience concerns them. Therefore, our currently has 33 languages, although not everything is translated, it has attempted to customers of different countries are comfortable shopping in their own language.\n         We currently have agreements with factories contract and internationally so that products reach the customer directly home, products, high quality, come from China, Russia, United States and Germany. Also, we deal with several carriers internationally known to deliver packages to suit the client (for all budgets and all possible times), ranging from 25 days to 1 week depending on customer need.\n        Gradually we continue to grow, and we already have a good customer base, not only in product purchases, but small businesses who would develop their own online business, or tweak your web we create, and even help them in possible to optimize their businesses: from a frame shop to a grocery store product Latino. We even tried to help small businesses with visibility, making contact and some of their products on the web, to help gradually having renowned, which is not effortless and it is gratifying to see growing support.\n        With all this combined, with the desire to give our customers a satisfying experience and above all, hoping to continue providing products at good prices.\n          Thank you for visiting, and we hope that the website will enjoy it and find what you need. In case you do not find or have questions, please feel free to contact us.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       48],
      "assets/images/resized/0022/4967/224967v2-max-150x150.jpg"],
     [[230,
       75],
      "assets/images/resized/0022/4967/224967v2-max-250x250.jpg"],
     [[230,
       75],
      "assets/images/resized/0022/4967/224967v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}