{"name": "Bay Search Partners",
 "permalink": "bay-search-partners",
 "crunchbase_url": "http://www.crunchbase.com/company/bay-search-partners",
 "homepage_url": "http://www.baysearchpartners.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2000,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "search, placement, recruiting, human-resources, biotechnology, emerging-markets",
 "alias_list": null,
 "email_address": "marc@baysearchpartners.com",
 "phone_number": "510-996-0123",
 "description": "Recruiting Compliance Search Employment",
 "created_at": "Mon Nov 07 20:11:38 UTC 2011",
 "updated_at": "Fri Aug 03 20:26:37 UTC 2012",
 "overview": "\u003Cp\u003EBay Search Partners is a leading provider of full-service recruiting and human resource consulting and compliance solutions to Engineering, Energy, IT, Biotechnology, Pharmaceutical, Nonprofit, Media Entertainment, Legal, Medical, Dental and Financial clients in the Northern California Bay area and Nationally. We can assist you with your specific needs in these key areas:\u003C/p\u003E\n\n\u003Cp\u003EKey Team Placement. We place top-level, senior-executive, mid-management and highly-skilled professional candidates with backgrounds matched specifically to key positions using an effective precision search approach.\u003C/p\u003E\n\n\u003Cp\u003EOur research capabilities, industry expertise, extensive network of contacts and determination allows us to find the top performers that best fit your particular requirements.\u003C/p\u003E\n\n\u003Cp\u003EHuman Resouce Consulting \u0026amp; Compliance Services.  At Bay Search Partners, we take a balanced approach to your organization\u0026#8217;s human resource needs. We believe each organization is unique to the strategic management of their employees, programs, policies and procedures that defines a company\u0026#8217;s road to success while incorporating effective risk avoidance and legally compliant initiatives. \u003C/p\u003E\n\n\u003Cp\u003EWe offer our on site \u0026#8220;Compliance Review\u0026#8221; that has proven to save our clients $$$$$$ (tens of thousands of dollars) in possible fines and penalities by  providing the tools necessary to be in line with Federal and State Laws and Regulations.\u003C/p\u003E\n\n\u003Cp\u003EWe understand that it is necessary for all of our partners to have a competitive edge in 2012 and beyond and we take pride in adding that next successful individual to your team and your company being in line with the complex operational standards for your business.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "San Francisco Bay Office",
    "address1": "484 Lake Park Avenue",
    "address2": "Suite 308",
    "zip_code": "94610",
    "city": "Oakland",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}