{"name": "BBinary",
 "permalink": "bbinary",
 "crunchbase_url": "http://www.crunchbase.com/company/bbinary",
 "homepage_url": "http://www.bbinary.fr",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "banc-de-binary, options-binaires, oren-laurent",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Traders d'options binaires",
 "created_at": "Tue Feb 26 16:00:03 UTC 2013",
 "updated_at": "Wed Feb 27 06:25:20 UTC 2013",
 "overview": "\u003Cp\u003EBanc de Binary\u003C/p\u003E\n\n\u003Cp\u003EBanc de Binary est une compagnie privée de trading financier et d\u0026#8217;investissement dont le siège social se trouve au cœur du monde financier et bancaire, à New York. Fondée en 2009, suite à la crise financière mondiale, la compagnie est aujourd\u0026#8217;hui active dans plus de 80 pays à travers l\u0026#8217;Asie, le Moyen-Orient, l\u0026#8217;Europe et l\u0026#8217;Amérique du Nord. Banc de Binary est fière de sa position de pionnière dans le domaine, en proposant des solutions à la pointe et innovantes pour le trading d\u0026#8217;options binaires. La compagnie peut se vanter d\u0026#8217;un portefeuille toujours croissant de plus de 20.000 comptes clients.\u003C/p\u003E\n\n\u003Cp\u003EFinance globale et experts en investissement\u003C/p\u003E\n\n\u003Cp\u003ELe fondateur de Banc de Binary, Oren Laurent, est considéré par beaucoup comme le pionnier du secteur des options binaires. Aujourd\u0026#8217;hui, Laurent endosse le rôle de PDG et est responsable d\u0026#8217;apporter une contribution significative à tous les niveaux de l\u0026#8217;organisation. Expert dans les transactions multidevises et dans l\u0026#8217;e-commerce, c\u0026#8217;est grâce à son engouement, sa vision, son expertise dans le domaine et la connaissance de sa propre équipe, que la compagnie a évolué pour devenir l\u0026#8217;un des leaders du marché dans le monde du trading binaire et des investissements internationaux. Oren Laurent compte aussi sur son expérience du trading global et de la gestion de hedge funds, qui lui ont permis de concevoir et d’intégrer de nombreuses stratégies d\u0026#8217;investissement qui ont eu un succès mondial.\u003C/p\u003E\n\n\u003Cp\u003EJack Caine, vice-président de Banc de Binary et expert en technologie, est l’autre force derrière le succès continuel de la société. Responsable de la sécurité technologique, le rôle principal de Caine a été de développer le logiciel de trading innovant et précis de Banc de Binary.\u003C/p\u003E\n\n\u003Cp\u003EL\u0026#8217;excellence dans le trading\u003C/p\u003E\n\n\u003Cp\u003EBanc de Binary aide plus de 2000 traders à optimaliser leurs portefeuilles d\u0026#8217;investissements et à atteindre des marges de profit croissantes et perpétuelles. En calculant précisément les risques et en fournissant un environnement sécurisé dans lequel trader, la compagnie offre le dernier cri en matière d\u0026#8217;innovation technologique et assiste les investisseurs  grâce à ses nombreuses années d\u0026#8217;expérience dans le monde des investissements financiers. Avec un portefeuille de clients en perpétuelle croissance, Banc de Binary est fière de proposer un nouveau service à la clientèle 24/7 sans équivalant, avec une garantie de fournir des conseils financiers experts. Etant donné que la compagnie continue à grandir, elle s\u0026#8217;engage à suivre tous ses clients individuellement, leur assurant ainsi de recevoir le meilleur du conseil et du service.\u003C/p\u003E\n\n\u003Cp\u003EUne organisation primée\u003C/p\u003E\n\n\u003Cp\u003EDu travail d\u0026#8217;excellente qualité a été effectué par  Banc de Binary ces dernières années et la compagnie est reconnue par nombre de ses paires dans l\u0026#8217;industrie. En 2011, elle a reçu le titre de « Meilleur Service à la Clientèle » par FX Empire ainsi que le prix du « Courtier Binaire le Mieux Sécurisé ». L’année 2012 a été encore plus généreuse, car World Finance a primé la compagnie « la Meilleure Plateforme d\u0026#8217;Options Binaires d\u0026#8217;Amérique du nord » et « la Meilleure Plateforme d\u0026#8217;Options Binaires d\u0026#8217;Asie ». Banc de Binary est aussi une compagnie listée dans le World Finance 100 et le seul broker d\u0026#8217;options binaires régulé par le CYSEC.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/8510/238510v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0023/8510/238510v2-max-250x250.jpg"],
     [[450,
       450],
      "assets/images/resized/0023/8510/238510v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Oren",
      "last_name": "Laurent",
      "permalink": "oren-laurent",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "European Headquarters",
    "address1": "12 Arch. Makariou III, Kristelina Tower",
    "address2": "3rd Floor Office 301, Mesa Yeitonia",
    "zip_code": "4000",
    "city": " Limassol",
    "state_code": null,
    "country_code": "CYP",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.bbinaryavis.fr/",
    "title": "BBinary Avis"},
   {"external_url": "http://www.bbinaryavis.name/",
    "title": "Leaders dans le Trading Binaire International"}]}