{"name": "BCG Attorney Search",
 "permalink": "bcg-attorney-search",
 "crunchbase_url": "http://www.crunchbase.com/company/bcg-attorney-search",
 "homepage_url": "http://www.bcgsearch.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "BCGAttorneyJobs",
 "category_code": "legal",
 "number_of_employees": 100,
 "founded_year": 2000,
 "founded_month": 10,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "attorney-jobs, law-jobs, harrison-barnes, a-harrison-barnes",
 "alias_list": null,
 "email_address": "jobs@bcgsearch.com",
 "phone_number": "212-232-0277",
 "description": "Attorney Jobs",
 "created_at": "Mon Dec 22 09:59:41 UTC 2008",
 "updated_at": "Mon Oct 08 14:58:16 UTC 2012",
 "overview": "\u003Cp\u003E\u0026#8220;BCG Attorney Search is a name that has become synonymous with success in placing attorneys in top law firms throughout the country. We are based in Pasadena, California and have offices nationwide. As a recruiting firm, we are very selective in choosing who we work with and that is the reason that we select very few attorneys as our clients every year. \u003C/p\u003E\n\n\u003Cp\u003EEstablished in January 2000, BCG Attorney Search is part of the Employment Research Institute – which specializes in career services and job aggregator websites. We have built up a network of recruiters who themselves are lawyers and have gone to top law schools and often worked for BigLaw firms before joining our team. We have been successful in placing thousands of attorneys in reputed law firms and in firms practicing in niche legal markets. \u003C/p\u003E\n\n\u003Cp\u003EIn 2008 and 2009, when the legal market was at its lowest in recent history, our recruiters were still able to place our clients in well-paid positions. Our list of placements includes partners as well. The reason for this is that BCG Attorney Search has a method of training recruiters in making placements that produces outstanding results for our clients. \u003C/p\u003E\n\n\u003Cp\u003EWe expect our recruiters to represent attorneys with the same level of commitment, drive, and insight that outstanding attorneys demonstrate when representing their clients. Our recruiters are trained in-house by our CEO A. Harrison Barnes through an intensive training program created from his own experience as a legal recruiter and input from other top recruiters.\u003C/p\u003E\n\n\u003Cp\u003EOur recruiters also have a team of researchers at their disposal who study and analyze the latest trends in the legal market. We have offices in Century City, Chicago, Houston, Los Angeles, New York, Newport Beach and Washington, D.C. \u003C/p\u003E\n\n\u003Cp\u003EWe also publish in-depth market reports and reports on the best law schools in the country. Our report on law schools, The BCG Attorney Search Guide to America\u0026#8217;s Top 50 Law Schools, is now considered an essential reference source for most American law firms. We also publish state of the market reports for attorneys, the latest of which is State of the Market Report Summer 2011.\nOur partner companies include LawCrossing, Legal Authority, and Attorney Resume. We are so confident in the quality of our services at BCG Attorney Search, that we guarantee our clients that we can get them a job, and failing to do that we will give them free Legal Authority services worth $5,000.\u0026#8221;\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[122,
       57],
      "assets/images/resized/0003/2230/32230v2-max-150x150.jpg"],
     [[122,
       57],
      "assets/images/resized/0003/2230/32230v2-max-250x250.jpg"],
     [[122,
       57],
      "assets/images/resized/0003/2230/32230v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "A",
      "last_name": "Harrison Barnes",
      "permalink": "a-harrison-barnes",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "BCG Attorney Search",
    "address1": "445 Park Ave",
    "address2": "Fl 9",
    "zip_code": "10022",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": 34.1428388,
    "longitude": -118.1323783}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}