{"name": "bDigital",
 "permalink": "bdigital",
 "crunchbase_url": "http://www.crunchbase.com/company/bdigital",
 "homepage_url": "http://www.bdigital.info/home.html",
 "blog_url": "http://www.bdigital.info/services.html",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "marketing, email-marketing, cpm, cpc, cpa, seo, sem, targeting, search-engine, optimization, website, grow, traffic, retargeting, google, bespoke, social-media, email, advertising",
 "alias_list": null,
 "email_address": "team@bdigital.com",
 "phone_number": "(+351) 239 705 515 ",
 "description": "",
 "created_at": "Thu Apr 18 15:47:08 UTC 2013",
 "updated_at": "Wed Apr 24 06:32:02 UTC 2013",
 "overview": "\u003Cp\u003EbDigital offers a wide array of SEM solutions to help companies increase the ROI on marketing initiatives. Towards the beginning of all search engine marketing campaigns, it is important to develop a strategy that matches the objectives of the campaign. We can work on a CPC+CPA/CPL basis or just CPA. Google share of search market is around 80% Net Market Share Source\u003C/p\u003E\n\n\u003Cp\u003EbDigital offers a complete range of advertising services. From standard Run-of-Network campaigns, to full channel customization through the Site Selection solution, their services portfolio caters to all advertising needs.\u003C/p\u003E\n\n\u003Cp\u003EbDigital also offers Retargeting campaigns which is a simple and effective form of keeping track of people who visit their clients website and displaying their retargeting ads to them as they visit other websites. Behavioral Targeting is another solution bDigital offers that consists in a range of technologies and techniques used by online websites to increase the effectiveness of their campaigns by capturing data generated by website and landing page visitors.\u003C/p\u003E\n\n\u003Cp\u003EbDigital helps their clients to understand the impact that social media is having on their organization and work with them to implement the changes that need to be made as a result. bDigital develops overall social media strategies, providing bespoke training, help specify\nand recruit for social media roles, design and implement listening and responding programmes, advise on crisis planning and provides ad-hoc social media consultancy and advice. Help on planning CPM, CPC \u003C/p\u003E\n\n\u003Cp\u003EGet closer to the customers, generate sales, build loyalty, increase awareness, see a clear return on the marketing spend, Email marketing offers a fast, flexible, and dynamic way to get the messages across that is both cost effective and proven to deliver results. \u003C/p\u003E\n\n\u003Cp\u003EbDigital, offers a Opt-In BO to deliver campaigns, in all metrics commissions.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[128,
       150],
      "assets/images/resized/0025/2774/252774v2-max-150x150.png"],
     [[214,
       250],
      "assets/images/resized/0025/2774/252774v2-max-250x250.png"],
     [[385,
       450],
      "assets/images/resized/0025/2774/252774v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Pedro",
      "last_name": "Gaspar",
      "permalink": "pedro-gaspar-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Take Portugal Lda.",
    "address1": "IPN Incubadora",
    "address2": "",
    "zip_code": "3030-199",
    "city": "Coimbra",
    "state_code": null,
    "country_code": "PRT",
    "latitude": 40.1923781,
    "longitude": -8.4115692}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}