{"name": "BE Stylish",
 "permalink": "be-stylish",
 "crunchbase_url": "http://www.crunchbase.com/company/be-stylish",
 "homepage_url": "http://bestylishsalon.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 20,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "beauty-salon-kolkata, beauty-parlour-in-kolkata, unisex-beauty-salon",
 "alias_list": null,
 "email_address": "bestylishsalon5@gmail.com",
 "phone_number": "91 903 808 1555",
 "description": "Beauty Salon Kolkata",
 "created_at": "Fri May 24 06:50:03 UTC 2013",
 "updated_at": "Mon May 27 15:07:46 UTC 2013",
 "overview": "\u003Cp\u003EWelcome to BeStylish: your ultimate styling salon! Bestylish is a professional beauty salon in Kolkata offering complete salon services for both men and women. Bring out the inner beauty from within yourself by engaging in the services offered by us. This beauty salon uses an array of branded beauty products and the latest techniques for its beauty treatments. This Beauty salon in Kolkata assures its loyal customers with major hair styling and beauty services at reasonable prices. \u003C/p\u003E\n\n\u003Cp\u003EStay trendy and ultra fashionable with varied treatments available in this beauty parlour. Be Stylish salon is an ultimate spa clinic and beauty salon in Kolkata. It strives to meet every need of a modern day lifestyle and provide services accordingly. We are committed to provide a total rejuvenating service and indulge you in the best beauty salon experience ever. Our major concern areas include beauty treatments like spa treatments, facial Whitening and aromatherapy, veg peel and the latest Plant Stem Cells facial. We also indulge in services like Body Polish, pedicure, manicure, Nose and Ear piercing. Breathtaking Bridal make up is also provided impeccably by the professional team of stylists available in the salon.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}