{"name": "BehaviorMatrix",
 "permalink": "behaviormatrix",
 "crunchbase_url": "http://www.crunchbase.com/company/behaviormatrix",
 "homepage_url": "http://www.BehaviorMatrix.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "analytics, consumer-behavior, enterprise-reports, behavioral-analytics, behavioral-marketing, social-listening, sentiment-analysis, natural-language-processing, blue-bell, big-data-analytics, emotional-analytics",
 "alias_list": null,
 "email_address": "",
 "phone_number": "(610) 365-1200",
 "description": "Behavioral Analtyics Technology",
 "created_at": "Tue Apr 10 22:59:12 UTC 2012",
 "updated_at": "Mon Apr 01 19:31:04 UTC 2013",
 "overview": "\u003Cp\u003EBehaviorMatrix is a behavioral analytics firm founded on the principle that human behavior is driven by emotion.\u003C/p\u003E\n\n\u003Cp\u003EThis unique approach is built on proprietary technology, which allows BehaviorMatrix℠ to delve deeper in the data mines of human perception and emotion, to deliver actionable data that a brand or company needs to be successful. Being able to find the emotional drivers and track them over time gives BehaviorMatrix the most comprehensive information in the field of behavioral analytics. \u003C/p\u003E\n\n\u003Cp\u003ETraditional analytics and business performance measures focus on behavior – measuring what people have already done. These systems give brands exceptional visibility into consumer actions like purchasing, voting, endorsements and complaints, but very little insight into the motivation behind those actions. Emotions, on the other hand, are a precursor for behavior. By measuring them, you can predict what people will do in the future. By understanding the emotional drivers behind behavior, brands can proactively work to change those perceptions in their favor.\u003C/p\u003E\n\n\u003Cp\u003EUntil now, measurement of consumer emotion has largely been based on surveys and focus groups. These slow, time-consuming methods attempt to extrapolate the entire population from just a small sample. BehaviorMatrix℠ turns this model on its head, using the entire Internet as a source of “emotional signals”. Unlike other “social listening” and “sentiment analysis” tools, BehaviorMatrix℠ measures much more than just positive and negative sentiment. This new platform measures and analyzes more than 100 different human emotions, from the simple (love, hate, joy), to the sophisticated (trust, apathy, amazement).\u003C/p\u003E\n\n\u003Cp\u003EBehaviorMatrix℠ has been developing the patent-pending technology behind this platform since 2008. This technology pulls in tens of millions of unstructured data points from a diverse set of sources, going far beyond the standard social outlets of Facebook and Twitter. This massive trove of data undergoes advanced linguistic and cognitive behavioral analysis to identify and quantify emotional signals, from nuanced feelings to polarizing outbursts.\u003C/p\u003E\n\n\u003Cp\u003EThe result is a true quantitative analysis of something that has previously been considered purely qualitative. Brands get numeric measurements of emotion, along with the ability to analyze the magnitude and directionality of change in the numbers. This gives them the power to incorporate emotional data into their strategic processes.\u003C/p\u003E\n\n\u003Cp\u003EBehaviorMatrix is offers three unique products based on its technology:\u003C/p\u003E\n\n\u003Cp\u003EEmotional Indexes℠ – A data feed that extracts and quantifies an individual emotional factor (such as “Joy”, “Trust”, “Fear”, etc.) as it relates to a brand and its competitors. Emotional Indexes are updated daily, allowing a brand to monitor consumer perceptions on a near-real-time basis.\u003C/p\u003E\n\n\u003Cp\u003EEmScape℠ Reports – A customized, high-level analysis of the entire emotional landscape surrounding a brand or product. EmScape℠ Reports also benchmark the brand against an average of the competition.\u003C/p\u003E\n\n\u003Cp\u003EEmPower℠ Reports – A comprehensive, highly detailed analysis of the emotional and competitive landscape surrounding a brand or product. These reports provide a segmented analysis of emotional signals, including demographics of opinion leaders (both promoters and detractors), and a complete comparative analysis of competitive brands and products.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       64],
      "assets/images/resized/0018/3560/183560v2-max-150x150.jpg"],
     [[250,
       106],
      "assets/images/resized/0018/3560/183560v2-max-250x250.jpg"],
     [[450,
       192],
      "assets/images/resized/0018/3560/183560v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "676 DeKalb Pike",
    "address2": "Suite 108",
    "zip_code": "19422",
    "city": "Blue Bell",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": 40.169752,
    "longitude": -75.285873}],
 "milestones":
  [{"description": "Largest Oncology Blog Study Ever Conducted",
    "stoned_year": 2013,
    "stoned_month": 3,
    "stoned_day": 5,
    "source_url": "http://markets.financialcontent.com/newsday/news/read/23683881/New_Emotional_Analytics_Provider",
    "source_text": null,
    "source_description": "New Emotional Analytics Provider",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "BehaviorMatrix",
      "permalink": "behaviormatrix"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        78],
       "assets/images/resized/0024/7020/247020v2-max-150x150.jpg"],
      [[250,
        130],
       "assets/images/resized/0024/7020/247020v2-max-250x250.jpg"],
      [[450,
        234],
       "assets/images/resized/0024/7020/247020v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://behaviormatrix.com/emotions-of-medical-marketing/",
    "title": "Landing Page for Pharma"}]}