{"name": "Bela Extrusion",
 "permalink": "bela-extrusion",
 "crunchbase_url": "http://www.crunchbase.com/company/bela-extrusion",
 "homepage_url": "http://www.indiamart.com/belaextrusionequipments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-spray-bath, vacuum-cum-cooling-shell, cutter-unit, tilting-unit, coiler-unit, scrap-grinder-and-loading-conveyor-for-pipe-",
 "alias_list": null,
 "email_address": "belaextrusionequipments@tradepassport.org",
 "phone_number": "9725675732",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Fri Apr 05 12:38:26 UTC 2013",
 "updated_at": "Fri Apr 05 12:38:30 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2013, we, “Bela Extrusion Equipments”, are one of the prominent names of the industry engaged in manufacturing and supplying a superior quality range of Plastic Extrusion Machinery. In addition to this, we offer Water Spray Bath, Vacuum Cum Cooling Shell, Cutter Unit, Tilting Unit, Coiler Unit, Scrap Grinder and Loading Conveyor For Pipe. Our product range includes Special Purpose Machine, Vacuum Calibration Sleeve, Haul Off Unit and Pressure Calibration Sleeve. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team of proficient \u0026amp; experienced professionals assists us in providing an excellent range of Water Spray Bath, Vacuum Cum Cooling Shell, Cutter Unit, Tilting Unit, Coiler Unit, Scrap Grinder, Loading Conveyor For Pipe and other to the customers. These professionals are selected on the basis of their knowledge, skills, expertise, educational qualification and experience. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur organisation is committed to offer quality-assured Water Spray Bath, Vacuum Cum Cooling Shell, Cutter Unit, Tilting Unit, Coiler Unit, Scrap Grinder and Loading Conveyor For Pipe and other in the market. We procure high-garde raw material as well as components from some of the trusted sources of the market to manufacture the range offered by us. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have an advanced infrastructure, which has all the facilities that are required for offering genuine quality range of Water Spray Bath, Vacuum Cum Cooling Shell, Cutter Unit, Tilting Unit, Coiler Unit, Scrap Grinder and Loading Conveyor For Pipe and other. The infrastructure is segregated into different units like designing, manufacturing, quality checking, R\u0026amp;D and others. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are known for offering excellent Water Spray Bath, Vacuum Cum Cooling Shell, Cutter Unit, Tilting Unit, Coiler Unit, Scrap Grinder and Loading Conveyor For Pipe and other as per the market demand. Our esteemed patrons can also avail customised products from us designed exactly as per the details provided by them. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8661/248661v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8661/248661v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8661/248661v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}