{"name": "Bell, Moore \u0026 Richter, S.C.",
 "permalink": "bell-gierhart-moore-s-c",
 "crunchbase_url": "http://www.crunchbase.com/company/bell-gierhart-moore-s-c",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Thu Aug 06 16:58:20 UTC 2009",
 "updated_at": "Wed Jan 06 04:08:18 UTC 2010",
 "overview": "\u003Cp\u003EBell, Moore \u0026amp; Richter, S.C. was originally founded in 1851 under the firm name of Vilas \u0026amp; Remington. The firm is a limited liability organization providing a wide range of legal services, including both general counsel and trial counsel services to individuals and the insurance industry, utilities, banks, healthcare providers, and other businesses; real estate development; estate planning; probate; taxation and family law.\u003C/p\u003E\n\n\u003Cp\u003EStatement of Practice:\u003C/p\u003E\n\n\u003Cp\u003EAccounting Liability (Defense), Administrative Law, Alternative Dispute Resolution, Appellate Practice, Business Law, Business Litigation, Business Planning, Business Torts, Child Custody, Child Support, Civil Appeals, Civil Court, Civil Litigation, Closings, Commercial Litigation, Commercial Real Estate, Contracts, Corporate, Corporate Reorganization, Divorce, Employee Benefits, Employment Law, Employment Litigation, Environmental Law, Estate Planning, Family Law, Federal Court, Finance, General Practice in State and Federal Court Litigation, Healthcare, Insurance Bad Faith, Insurance Coverage, Insurance Defense, Insurance and Securities Law, Legal Malpractice (Defense), Licensing, Marital Property Agreements, Mediation, Medical Malpractice (Defense), Mergers and Acquisitions, Municipal Law, Natural Resources, Negligence Defense, Personal Injury, Prenuptial Agreement, Probate, Product Liability, Professional Liability (Defense), Public Utility, Real Estate, State Court, Tax Planning, Tax Litigation, Taxation, Telecommunications, Trials, Trusts, Visitation Rights, Worker\u0026#8217;s Compensation, Wills.\u003C/p\u003E\n\n\u003Cp\u003EYear Established: \n1851\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Attorney",
    "person":
     {"first_name": "Nathan T.",
      "last_name": "Leong",
      "permalink": "nathan-t-leong",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Madison",
    "state_code": "WI",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}