{"name": "Bespoke Tailors London",
 "permalink": "bespoke-tailors-london",
 "crunchbase_url": "http://www.crunchbase.com/company/bespoke-tailors-london",
 "homepage_url": "http://www.apsleytailors.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bespoke-tailors-london, bespoke-suits-london, apsley-tailors, bespoke-suits, bespoke-tailoring, made-to-measure-shirts, savile-row-tailor, black-tie-suits, made-to-measure-suits, bespoke-black-tie",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Apsley Tailors  is best company",
 "created_at": "Fri Apr 05 11:57:03 UTC 2013",
 "updated_at": "Fri Apr 05 11:57:08 UTC 2013",
 "overview": "\u003Cp\u003EEvery classy gentleman wants to impress his wife or long-time girlfriend with the romantic date she thought was only possible in Hollywood movies. Perhaps you\u0026#8217;ll make her wait outside on a river boat and approach her as if it was the first time you saw her. Or maybe you\u0026#8217;ll take her to a ball and ask your queen to dance with you. Whatever the situation is you want to appear as the charming prince from her dreams. You must know what kind of black tie suite would suite you best. So, how must one choose such a garment?\u003C/p\u003E\n\n\u003Cp\u003EThere are several important factors to keep in mind when purchasing a men\u0026#8217;s suit, such as color, fabric, brand, size, and what to wear with it. First take your own measurements or have a tailor take them for you. Next decide what color your suit should be by comparing the fabric to your skin. The fabric of the suit must go with the color of your skin. Make sure you purchase a fabric that fits comfortably since you will be moving around alot in it. It is important to have a suit that fits comfortably even if you plan on losing weight.\u003C/p\u003E\n\n\u003Cp\u003EOne must pay close attention to the secondary clothing you wear with a suit. Make sure you can fit two fingers inside the waist area while wearing the pants. Your coat sleeves cannot go over the the shirt cuffs leaving about half an inch of your shirt cuff. There are many places to purchase black tie suits and one of the best bespoke tailoring areas in the UK is undoubtedly Sevile Row tailoring.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[135,
        150],
       "assets/images/resized/0024/8613/248613v2-max-150x150.jpg"],
      [[226,
        250],
       "assets/images/resized/0024/8613/248613v2-max-250x250.jpg"],
      [[380,
        420],
       "assets/images/resized/0024/8613/248613v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}