{"name": "Bestmobilesaver",
 "permalink": "bestmobilesaver",
 "crunchbase_url": "http://www.crunchbase.com/company/bestmobilesaver",
 "homepage_url": "http://www.bestmobilesaver.com/",
 "blog_url": "http://bestmobilesaver.wordpress.com/",
 "blog_feed_url": "http://bestmobilesaver.blogspot.com/",
 "twitter_username": "pushya",
 "category_code": "mobile",
 "number_of_employees": 21,
 "founded_year": 2009,
 "founded_month": 9,
 "founded_day": 25,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "free-international-call-using-0208, cheap-international-calls-from-uk-mobile",
 "alias_list": "",
 "email_address": "cheersseo@gmail.com",
 "phone_number": "",
 "description": "International Call Discounter",
 "created_at": "Fri Sep 25 07:06:24 UTC 2009",
 "updated_at": "Thu Oct 01 20:27:52 UTC 2009",
 "overview": "\u003Cp\u003EMake free international calls using 0208\u003C/p\u003E\n\n\u003Cp\u003EUse free call credit from you mobile to call any international number. Thats rights, make free international calls on your mobile phone by using your bundled minutes. \u003C/p\u003E\n\n\u003Cp\u003ECall your friends and family abroad straight from your mobile\u0026#8217;s phonebook without having the inconvenience of dialling an access number and a pin. You do not even have to change your current SIM card or download any extra software.\u003C/p\u003E\n\n\u003Cp\u003E. Are you always left over with minutes from your monthly mobile monthly calling credit plan?\n. Are you waisting money by paying double for your calls?\n. Do you want an 0208 number to call your friends \u0026amp; family internationally or your company offices abroad?\n. Do you want a service that gives you flexibilty for business and personal use?\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8230;..with Best Mobile Saver you can. This is how:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EJust register at www.bestmobilesaver.com, and tell us the destination number you wish to call.\u003C/li\u003E\n\u003Cli\u003EWe give you an 0208 number which connects directly to your destination number.\u003C/li\u003E\n\u003Cli\u003ENow you can talk internationally and use your free mobile credit\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EHow do we do it? \nSimple, we instantly build online an 0208 local number to connect to the international destination number that you want to dial. You call the 0208 number that directly connects to the international number and since 0208 numbers are free to dial on your bundled minutes, the international call is free of charge on your mobile. We can build this service for any international destination number and for any number of international telephone numbers.\u003C/p\u003E\n\n\u003Cp\u003EWhen you dial the 0208 number, you are seamlessly connected to your chosen international number. Your mobile provider charges are free, in the case of bundled minutes, or, in other cases, the charge is for a local UK call. You do not have to enter any pin number with this service.\u003C/p\u003E\n\n\u003Cp\u003EFor ease of use, the 0208 number can be put into your mobile\u0026#8217;s phonebook and listed against the name of your contact. Ideal if you make regular calls to one or more international numbers. For instance, your company may have offices abroad or you may want to keep in touch with friends and family in other countries with the convenience and cost saving of calling from your mobile for free.\u003C/p\u003E\n\n\u003Cp\u003ERegister now at www.bestmobilesaver.com to benefit straight away from Best Mobile Saver.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       64],
      "assets/images/resized/0006/0806/60806v2-max-150x150.png"],
     [[250,
       107],
      "assets/images/resized/0006/0806/60806v2-max-250x250.png"],
     [[336,
       145],
      "assets/images/resized/0006/0806/60806v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}