{"name": "BestInChennai",
 "permalink": "bestinchennai",
 "crunchbase_url": "http://www.crunchbase.com/company/bestinchennai",
 "homepage_url": "http://www.bestinchennai.com/",
 "blog_url": "http://bestinchennai.wordpress.com/",
 "blog_feed_url": "http://feeds.feedburner.com/Bestinchennai",
 "twitter_username": "bestinchennai",
 "category_code": "advertising",
 "number_of_employees": 20,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "restaurants-chennai, cinemas-chennai, spa-chennai, salon-chennai, doctors-chennai, schools-chennai, coffee-shops-chennai, movies-chennai, auditors-chennai, beauty-parlours, hotels-chennai, builders, computer-repairs--services, fitness-center",
 "alias_list": null,
 "email_address": "info@bestinchennai.com",
 "phone_number": "04424861895",
 "description": "Best local information service Chennai",
 "created_at": "Mon Apr 23 12:21:46 UTC 2012",
 "updated_at": "Wed May 02 08:58:55 UTC 2012",
 "overview": "\u003Cp\u003EBestInChennai - Chennai\u0026#8217;s Local Business Search Engine is born out of wide researches and various marketing surveys conducted over a period of time. A vast thought process has gone in to the development of this vigorous online directory. BestInChennai online directory features over thousands of products and services categorized systematically under hundreds of headings to the benefit millions of consumers in various locations.\u003C/p\u003E\n\n\u003Cp\u003EIn today’s highly competitive world, organizations across the world are looking for various paths to promote their products and services to improve their market share. Organizations have understood that in the changing circumstances, they need to adopt newer trends in order to stay ahead. Increasing the visibility of the products and services and broaden the scope of their marketing activities have become vital to the success of an organization.\u003C/p\u003E\n\n\u003Cp\u003EWhile the larger business manages to spin over the tides of the market fluctuations, it is the Small and Medium Enterprises (SMEs) that are caught churn in the changing market dynamics. At BestInChennai, We serve an extended marketing department of the SMEs and provide an opportunity to showcase their products and services effectively.\u003C/p\u003E\n\n\u003Cp\u003EInformation about your products and services in our BestInChennai - Chennai\u0026#8217;s Local Business Search Engine not only enhance your visibility but also results in providing you a aggressive advantage to enhanced your competitors.\nWe have been providing reliable and inclusive information and bridging the gap between the consumers and businesses. With a wide opportunity to choose from a variety of products and services, we help consumers find the right choice and make purchase decisions quickly. \u003C/p\u003E\n\n\u003Cp\u003EWe have various categories and advertisement options to suit every budget. Our cost effective advertising solutions not only generate good number of leads but also guarantee revenue sizable leads. We have the state of the art technology that effectively measures the response for each advertisement and generate periodic reports for evaluation.\nWe have a well qualified technical team to constantly upgrade the directory in terms of technology that assist easy navigation as well as improve the services.\u003C/p\u003E\n\n\u003Cp\u003EWe have chalked out various tactics that will help us in emerging as the leading e-market player offering a complete suite of value added services to both consumers as well as business houses.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       85],
      "assets/images/resized/0018/5481/185481v2-max-150x150.png"],
     [[250,
       142],
      "assets/images/resized/0018/5481/185481v2-max-250x250.png"],
     [[350,
       200],
      "assets/images/resized/0018/5481/185481v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "For all your Local Needs",
    "address1": "No.38, Ist Main Road, S.V.S Nagar, Valasaravakkam",
    "address2": "",
    "zip_code": "600087",
    "city": "chennai",
    "state_code": "SD",
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        73],
       "assets/images/resized/0018/5480/185480v2-max-150x150.jpg"],
      [[250,
        122],
       "assets/images/resized/0018/5480/185480v2-max-250x250.jpg"],
      [[450,
        220],
       "assets/images/resized/0018/5480/185480v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.bestinchennai.com/",
    "title": "bestinchennai"}]}