{"name": "beStylish.com",
 "permalink": "bestylish-com",
 "crunchbase_url": "http://www.crunchbase.com/company/bestylish-com",
 "homepage_url": "http://www.bestylish.com",
 "blog_url": "http://blog.bestylish.com",
 "blog_feed_url": "http://feeds.feedburner.com/bestylish",
 "twitter_username": "bestylish_com",
 "category_code": "ecommerce",
 "number_of_employees": 300,
 "founded_year": 2011,
 "founded_month": 5,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "shoes, shoes-store, online-shoes-store, footwear",
 "alias_list": null,
 "email_address": "care@bestylish.com",
 "phone_number": "1800-419-0300",
 "description": "beStylish.com: Online Shoe Store",
 "created_at": "Fri Nov 04 08:59:03 UTC 2011",
 "updated_at": "Mon Jun 25 15:45:54 UTC 2012",
 "overview": "\u003Cp\u003EBeStylish.com - India\u0026#8217;s Largest Online Shoe Store. \u003C/p\u003E\n\n\u003Cp\u003EBeStylish is an online retailer committed to delivering an exceptional shopping experience in India.\u003C/p\u003E\n\n\u003Cp\u003EIt is going to be our endeavor to bring you the best that fashion has to offer around the world. We are starting feet up and launching with shoes – a segment we feel needs an influx of quality footwear. We offer everything from regular sneakers to high-fashion shoes. Our motto – to make people pay attention to the way they dress their feet. And this love affair with shoes is only the beginning\u0026#8230; by the time we’re done with you, you’ll be a fashion aficionado like none other!\u003C/p\u003E\n\n\u003Cp\u003EBesides top brands, latest styles and exciting promotions, we offer more than 2000 styles across 50 brands for men, women and children – that’s over 50,000 shoes! And this is only the beginning!\u003C/p\u003E\n\n\u003Cp\u003EThe after-sales support is also where we\u0026#8217;ve put a lot of thought and effort. We not only want the buying process to be fun and easy but the delivery to be just as seamless. The result: a ‘hassle free’ shopping experience.\u003C/p\u003E\n\n\u003Cp\u003EOur team will ensure you receive your shoes quickly, absolutely FREE, anywhere in India. And if you\u0026#8217;re not happy with your purchase, you have 28 days to return your unused shoes for a full refund.\u003C/p\u003E\n\n\u003Cp\u003EOUR TEAM\u003C/p\u003E\n\n\u003Cp\u003EIs young, dynamic and creative. We believe in doing our best to deliver the best!\u003C/p\u003E\n\n\u003Cp\u003EWe have started operations under the umbrella of the Smile Group. The team’s Chairman is Harish Bahl, CEO and founder of Smile. Entrepreneurship runs in his blood, just like it does in the other three co-founders of BeStylish.\u003C/p\u003E\n\n\u003Cp\u003EShailen Amin is CEO and co-founder of BeStylish. He is a numbers guy and knows what it takes to make a business run successfully. Well, he is a BA in accounting from Rutgers University School of Business and a qualified CPA. Take a look at what he’s up to the last few years and you’ll know what we’re talking about. Shay, as he’s known in the industry, was the CFO for Millward Brown (a WPP Group company), responsible for Africa, Middle East \u0026amp; Asia Pacific. He also worked in WPP’s mergers \u0026amp; acquisition team for 6 years which reports directly in to WPP CEO. Initially, he was based in New York where he was one of three principals responsible for North American acquisitions and later based out of head office in London where he was responsible for rest of the world’s M\u0026amp;A. It’s no wonder he’s at the helm of affairs at BeStylish. And he’s a fantastic cook, his wife says. Feel like a barbeque? The best in town is at his house!\u003C/p\u003E\n\n\u003Cp\u003EThe second musketeer is Abhishek Lal, Director Merchandise and co-founder. He is our “shoe-guru”. Really! If there’s anything to know about shoes, he already knows it! Everything from the latest styles, who’s making them, where they are made, how they are made – he is an inexhaustive source of information when it comes to footwear. He is an alumni of Central Leather Research Institute (Leather Technology), Footwear Design \u0026amp; Development Institute and Faculty of Management Studies (MBA). He has over 14 years of cross functional work experience in the footwear industry in different areas like manufacturing, product development, range planning, retail buying and merchandising. And he’s worked at major brands like Unilever, Adidas, Puma \u0026amp; Intersport across different countries like India, Switzerland, Germany, UAE, Kuwait, Saudi Arabia \u0026amp; Africa. Before embarking on this venture Abhishek was Buying \u0026amp; Logistics Head for Intersport Middle East. Abhishek also has more than 300 pairs of shoes in his closet! And women thought they were shoe lovers!\u003C/p\u003E\n\n\u003Cp\u003EAnd last, but in no way the least is VSSK Prasad, co-founder and Director Wholesale \u0026amp; B2B. He smiles a lot, can be very blunt and loves to share a bite with whoever is eating! But when it comes to work, he’s got everything covered. If something has been said, it WILL be done! Prasad is a post graduate in sales and marketing with more than 18 years of experience in wholesale and retail. He has a solid track record of successful rollout, management and turnaround of fortunes through astute planning and execution of various activities in the market place with brands like Adidas, Nike, Fila and MTV. He is driven by passion and zeal for successfully growing and leading in ventures like BeStylish where he can utilize his strengths and experience gathered through years of consistent work growth. He’s always short on time, wanting to get ahead fast. And so he zips off in his fancy SUV - leaving behind a trail of dust and all the competition!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       46],
      "assets/images/resized/0017/1004/171004v2-max-150x150.png"],
     [[249,
       78],
      "assets/images/resized/0017/1004/171004v2-max-250x250.png"],
     [[249,
       78],
      "assets/images/resized/0017/1004/171004v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-founder and Director Wholesale \u0026 B2B",
    "person":
     {"first_name": "VSSK",
      "last_name": "Prasad",
      "permalink": "vssk-prasad",
      "image": null}},
   {"is_past": false,
    "title": "CEO and Co-founder of BeStylish",
    "person":
     {"first_name": "Shailen",
      "last_name": "Amin",
      "permalink": "shailen-amin",
      "image": null}},
   {"is_past": false,
    "title": "Director Merchandise and Co-founder",
    "person":
     {"first_name": "Abhishek",
      "last_name": "Lal",
      "permalink": "abhishek-lal",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Address:",
    "address1": "BeStylish.Com",
    "address2": "Plot No. 217,Udyog Vihar Phase 1",
    "zip_code": "",
    "city": "Gurgaon",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [{"description": "BeStylish.com, India Based Online Shoe Store Receives Investment From Mangrove Capital\r\n",
    "stoned_year": 2011,
    "stoned_month": 7,
    "stoned_day": 13,
    "source_url": "http://invest-iq.net/2011/07/mangove-invests-into-bestylish-com/",
    "source_text": null,
    "source_description": "BeStylish.com, India Based Online Shoe Store Receives Investment From Mangrove Capital ",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "beStylish.com",
      "permalink": "bestylish-com"}},
   {"description": "ru-Net Walks In Mangrove’s BeStylish Shoes And Fancy Up With Freecultr",
    "stoned_year": 2012,
    "stoned_month": 6,
    "stoned_day": 22,
    "source_url": "http://invest-iq.net/2012/06/ru-net-bestylish-freecultr/",
    "source_text": null,
    "source_description": "ru-Net Walks In Mangrove’s BeStylish Shoes And Fancy Up With Freecultr",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "beStylish.com",
      "permalink": "bestylish-com"}}],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/odyXhTuBJtc\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EbeStylish.com\u0026#8217;s TV Launch - Sexy Shoe Advertisement [Full Version] \u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[150,
        113],
       "assets/images/resized/0016/0824/160824v2-max-150x150.png"],
      [[250,
        189],
       "assets/images/resized/0016/0824/160824v2-max-250x250.png"],
      [[450,
        341],
       "assets/images/resized/0016/0824/160824v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.dnaindia.com/entertainment/report_specially-webbed-for-you_1598766",
    "title": "Specially webbed for you"},
   {"external_url": "http://www.moneycontrol.com/news-topic/rupam-ganguly-/video-bestylishcoms-tv-launch---sexy-shoe-advertisement-%5Bfull-version%5D_odyXhTuBJtc.html",
    "title": "moneycontrol.com"}]}