{"name": "Best Plast",
 "permalink": "best-plast",
 "crunchbase_url": "http://www.crunchbase.com/company/best-plast",
 "homepage_url": "http://www.indiamart.com/bestplast/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "bestplast@tradepassport.org",
 "phone_number": "9810543862",
 "description": "Manufacturer and Supplier of Plastic ,",
 "created_at": "Fri Apr 05 10:16:52 UTC 2013",
 "updated_at": "Fri Apr 05 10:16:56 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 1982, at Delhi (India), we, “Best Plast” namely \u0026#8220;Agro Plast\u0026#8221;, are highly engaged in manufacturing and supplying an outstanding range of Plastic Household Items such as Buckets, Tubs, Kitchen Tokra, Drums, Waste Paper Buckets and Unbreakable Taslas. Our exclusive range includes Best Buckets, Basic Buckets, Sumo Tubs, Ruby Tubs, Metro Tubs, etc.\u003C/p\u003E\n\n\u003Cp\u003EFactory \u0026amp; Infrastructure:\nWe are backed by high-tech manufacturing plant that spreads across a wide area of 12600 sq. ft., with an annual production capacity of 1800 tons. Moreover, we have also divided our large infrastructure into different departments like manufacturing, quality control, research \u0026amp; development and sales \u0026amp; marketing for the smooth production process. All these departments are equipped with latest machinery and superior technology controlled by our workforce.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are well-supported by our team of adroit professionals, who are highly knowledgeable and experienced in their respective field. These professionals are highly responsible for providing our customers the finest quality products. Our team works in coordination with the customers to provide the exact products, as per their requirements.\u003C/p\u003E\n\n\u003Cp\u003EQuality policy:\nAs a quality oriented entity, we are highly focused in providing customers only the finest quality products. In addition to this, we have a team of quality control professionals, who keep a close eye on the entire production process to ensure that we are providing customers only the best quality products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur clients are the base of our business and their satisfaction is the basic mantra for our success in the industry. Our presence in the industry for these many years has made it possible for us to understand the requirements of clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nPlastic Household Items such as Buckets, Tubs, Kitchen Tokra, Drums, Waste Paper Buckets and Unbreakable Taslas. Our exclusive range includes Best Buckets, Basic Buckets, Sumo Tubs, Ruby Tubs, Metro Tubs, etc. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8523/248523v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8523/248523v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8523/248523v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}