{"name": "Better Living",
 "permalink": "better-living",
 "crunchbase_url": "http://www.crunchbase.com/company/better-living",
 "homepage_url": "https://www.dispenser.com/",
 "blog_url": "https://www.dispenser.com/blog",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": 1996,
 "founded_month": 10,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "betterlivingpdts@yahoo.com",
 "phone_number": "18004873300",
 "description": "Better Living",
 "created_at": "Mon Feb 18 10:25:24 UTC 2013",
 "updated_at": "Fri Feb 22 22:42:37 UTC 2013",
 "overview": "\u003Cp\u003EBetter Living Products International Inc. is a private corporation based in Vaughan, Ontario, Canada, just north of Toronto. The company began business in 1991 and has focused solely on the manufacture and marketing of the world\u0026#8217;s finest assortment of Bathroom Organization products, featuring its signature line, The DispenserTM.\u003C/p\u003E\n\n\u003Cp\u003EThe DispenserTM is the family name for a variety of Shower Dispensers which neatly and conveniently dispense Shower Gel, Shampoo, Conditioner, Soap, Lotion and other shower liquids from single or multi-chamber Dispensers.\u003C/p\u003E\n\n\u003Cp\u003EBetter Living prides itself in offering world-leading product designs, manufacturing quality and superior customer service to successfully serve its market. With distribution to more than seventy countries and through leading retailers everywhere, Better Living products are available virtually anywhere around the world. No other company offers the product range and assortment of Dispensers that Better Living provides, in a variety of price points and styles.\u003C/p\u003E\n\n\u003Cp\u003ESince starting in business, Better Living has won a succession of awards for products, marketing, merchandising and display superiority throughout North America and beyond. Over the years, we have expanded our product offering to address the growing need for bathroom organization and products that simplify our lives. Key to these innovations is the simplicity of installation. All of our products are designed to be installed quickly and easily – many without the use of tools. The company is proud that its products are offered to consumers through the leading retail chains and specialty stores in the area of Bath, Home Improvement, Plumbing, Hardware and catalogs throughout the world.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       46],
      "assets/images/resized/0023/6642/236642v2-max-150x150.jpg"],
     [[250,
       77],
      "assets/images/resized/0023/6642/236642v2-max-250x250.jpg"],
     [[450,
       138],
      "assets/images/resized/0023/6642/236642v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "defence group.",
    "address1": "61 St. Nicholas Street,",
    "address2": "",
    "zip_code": "M3B 3K4",
    "city": "toronto",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}