{"name": "Bgh Edelstahlwerke",
 "permalink": "bgh-edelstahlwerke",
 "crunchbase_url": "http://www.crunchbase.com/company/bgh-edelstahlwerke",
 "homepage_url": "http://www.indiamart.com/bgh-edelstahlwerke-gmbh/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "bgh-edelstahlwerke-gmbh@tradepassport.org",
 "phone_number": "9849419152",
 "description": "Most special steel producers and supplie",
 "created_at": "Fri Apr 05 08:24:20 UTC 2013",
 "updated_at": "Fri Apr 05 08:24:24 UTC 2013",
 "overview": "\u003Cp\u003EBGH Edelstahlwerke Gmbh is one of the most special steel producers and suppliers to different types of industries. Our product portfolio includes high quality and durable steel products which come in a wide range of variations including tempering steel, nitriding steel, case hardening steel, non magnetic steel, surgical stainless steel, stainless steel, tool steel, valve steel and nickel based alloy.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are facilitated by an ultra-modern infrastructure that is segregated into various departments and units that helps us to produce our products in bulk.\u003C/p\u003E\n\n\u003Cp\u003ETeam \u0026amp; Manpower:\nA team of learned and experienced people make our team. Their skills and abilities support us in understanding the changes in the market and demands of the clients. This helps us in delivering the desired level of customization that we wish to deliver to our customers. Thus, our technical experts help us provide a highly flexible approach for placing purchase orders with us. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nMost modern production facilities at all BGH locations enable us to meet the high quality standards requested by our customers. This is guaranteed by exact and specification adjusted standards and working plans as well as quality controls of all order relevant characteristics. These controls take place by inspections through the workers themselves or special laboratories.\u003C/p\u003E\n\n\u003Cp\u003EManagement System:\nIn the companies of the BGH group, steel production as well as processing is very energy-intensive. Thus, energy costs have a major and increasing impact on the company’s profitability. We conduct a constant process of a continuous improvement in energy efficiency by systematical actions in line with an energy management. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8426/248426v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8426/248426v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8426/248426v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}