{"name": "bharatstudent",
 "permalink": "bharatstudent",
 "crunchbase_url": "http://www.crunchbase.com/company/bharatstudent",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Fri Feb 04 08:53:35 UTC 2011",
 "updated_at": "Thu Feb 17 01:56:18 UTC 2011",
 "overview": "\u003Cp\u003EAbout Bharatstudent.com\nBharatstudent.com is a social utility that brings together all the young Indians living across the globe. It is for every Young Indian who is a student or a non-student, fresh graduate, a working professional or an Entrepreneur, and is focused on providing comprehensive solutions for any personal and professional issues.\u003C/p\u003E\n\n\u003Cp\u003ESocial Networking\nIndia is the country with the highest number of young people in the world. Bharatstudent.com targets this demographic segment with many networks - Students in schools / colleges, Fresh graduates, Employees in corporates, Young Entrepreneurs, Groups of Artist / talented youngsters in different regions. Though each of these networks is independent, they each have inter-connectivity with other Indian networks. To join Bharatstudent.com, one has to be of Indian Origin and can join into a school or work network, or they can join a regional network. Members can grade their schools or work places, write reviews, connect with old friends, make new friends, share interests, join groups, send messages, write Blogs, share photos, watch videos and much more.\u003C/p\u003E\n\n\u003Cp\u003EGenX Zone\nGen X Zone is for people who believe in them and are at an edge over others. Gen X Zone consist of Boy Zone, girl Zone, Game Zone and live Radio.\u003C/p\u003E\n\n\u003Cp\u003ECafe Bharat\nAt Cafe Bharat is place where you can check for the latest film news, gossips, photo galleries, wallpapers, trailers and event videos. Campus TV is completely user generated content, and this is how it differs from Cafe Bharat.\u003C/p\u003E\n\n\u003Cp\u003EStudy Zone\nStudy Zone consists of two separate sections viz: study India and study abroad. Study India sections provides all the information you need about various programs in various institutes and guidance on how to apply.\u003C/p\u003E\n\n\u003Cp\u003EStudy abroad section is intended to guide the estimated 1 million Indian students aspiring to study abroad in the critical and time-consuming stage of identifying and selecting a short-list of institutes for higher education. Our online platform brings efficiency and a close sense of community of Indian Students that is scattered all around the world. The database of Indian students studying in major universities will be of great help for those who aspire to study in the US, Canada, Australia, UK and elsewhere. We guide the students in identifying schools that provide good education, provide financial assistantships, while being affordable. We also help the eligible students in securing student loans and part time jobs.\u003C/p\u003E\n\n\u003Cp\u003EServices\nApart from the all the above features bharatstudent.com provides services such as Classifieds, Greeting, and store. In Classifieds the user can look for various categories and hence can narrow down to his perusal. In the greetings section the user has the chance to select among various available greeting cards and can greet his/her friends with them. In Store the user has the option of shopping various products such as books, DVD\u0026#8217;d etc\u0026#8230; online. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}