{"name": "Bhartiya Arts",
 "permalink": "bhartiya-arts",
 "crunchbase_url": "http://www.crunchbase.com/company/bhartiya-arts",
 "homepage_url": "http://www.indiamart.com/bhartiya-arts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "canvas-paintings, oil-portraits, tanjore-paintings, marble-paintings",
 "alias_list": null,
 "email_address": "bhartiya-arts@tradepassport.org",
 "phone_number": "09953362266",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 09:32:41 UTC 2013",
 "updated_at": "Fri Apr 05 09:32:44 UTC 2013",
 "overview": "\u003Cp\u003EBhartiya Arts is a sole proprietorship based business organization, which was incorporated in the year 1990 at Jaipur in Rajasthan.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nWe are a recognized manufacturer and supplier of the market engaged in offering an exclusive collection of Oil Paintings, Canvas Paintings, Oil Portraits, Tanjore Paintings, Marble Paintings, Realistic Paintings, Stamp Paintings, Miniature Paintings, Silk Paintings, Mughal Painting, Modern Art Paintings, Tiger Paintings, Ganesh Painting, Family Painting, Lady Portraits, Gents Portraits, Flower Painting, Fruit Painting,  Rajasthani Painting, Yashoda Krishna Painting \u0026amp; various others.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nTo develop world-class products for our clients is our foremost objective. In order to deliver quality assured products for our clients, we practice Total Quality Management System (TQM) in our business operations.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have developed a state-of-the-art infrastructural building, which efficiently address the demands of our business related processes. Our infrastructure is segregated into different departments, which help us keep our business activities streamlined.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric company, we focus to render maximum level of satisfaction to our valued clients. We offer customized products to our clients, which are developed by our experts as per their specific needs and demands. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us? / Our Strengths:\nWe are able to secure an enviable position amongst the clients by supplying them international range of products at industry leading prices. Our modern production techniques and competent workforce enables us to produce best customized solutions for the clients that meet their actual needs in every aspect. Our ability to process bulk orders timely keep us ahead of our counterparts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8485/248485v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8485/248485v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8485/248485v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}