{"name": "Bharat Tools",
 "permalink": "bharat-tools",
 "crunchbase_url": "http://www.crunchbase.com/company/bharat-tools",
 "homepage_url": "http://www.indiamart.com/bharattoolsindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "bharattoolsindustries@tradepassport.org",
 "phone_number": "9231719305",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 12:10:28 UTC 2013",
 "updated_at": "Fri Apr 05 12:10:31 UTC 2013",
 "overview": "\u003Cp\u003EBharat Tools Industries has earned a great deal of experience in manufacturing and supplying a vast range of Industrial Metal Bonded Rubber Products \u0026amp; Gravity Die Casting Products such as Rubber Bellows, Rubber Rollers, Rubber Bushes, Rubber Grommets \u0026amp; Rubber Washers and many more. These rubber products are made based on M.S., S.S., Aluminium, Copper, Aluminium Bronze, Brass and Nylon. We hold expertise in those products.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur sound and contemporary infrastructure plays a vital role in our economic growth as well as in maintaining strong position in the cut throat industry. It is spread across a large plot area and aptly divided into diverse sections such as in-house designing, fabrication, storing, packaging, quality testing, sales \u0026amp; marketing, and others. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe have an exclusive team that has been trained to detect various defects found in the Industrial Rubber Products \u0026amp; Dies which have been manufactured in our units. The quality check team has been equipped with various error detecting gadgets which makes sure that the complete range of product is performance centric which is highly beneficial from the users point of view.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by an adroit team of professionals, who are highly qualified and experienced in their respective domains. We have been able to reach this enviable position in the market due to the experience and expertise of our team of engineers, technicians and other allied workers. All our professionals strive hard day and night to deliver superlative quality products and meet the requirements of the industry within the stipulated time frame.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nDue to our rich experience, we have carved a niche for ourselves in the domain delivering quality centric of industrial products. The products, offered by us, are designed with different set parameters of the industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8629/248629v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8629/248629v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8629/248629v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}