{"name": "Bhaseen Sports",
 "permalink": "bhaseen-sports",
 "crunchbase_url": "http://www.crunchbase.com/company/bhaseen-sports",
 "homepage_url": "http://www.fitnessnleisure.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@fitnessnleisure.com",
 "phone_number": "",
 "description": "Fitness and Gym Equipments",
 "created_at": "Wed Apr 03 14:45:21 UTC 2013",
 "updated_at": "Wed Apr 03 19:00:29 UTC 2013",
 "overview": "\u003Cp\u003EBhaseen Sports Pvt Ltd is incepted in the year August 1948 and Established in 1991, by our mentor, Mr. Baldev Raj Bhaseen. We offer our range of products under the brand name of Baspo. We are one of the leading manufacturers, exporters and importers of a wide range of Fitness and Gym Equipments.\u003C/p\u003E\n\n\u003Cp\u003EProducts Portfolio:\nWe are engaged in the sphere of manufacturing and exporting a wide range of Fitness \u0026amp; Spa Equipment. It includes Commercial Tread Mills, Multi Gyms, Single Stations, Steam Bath, Sauna Bath, Chill Plant, Jaccuzi and Swimming Pool. The entire range of the above mentioned equipment is manufactured with high grade raw material by using latest technology.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Designers\n    Craftsmen\n    Engineers\n    Quality experts\n   R\u0026amp;D people\n    Sales and marketing people\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are one of the leading manufacturer and exporter of wide range of high quality sports and fitness equipment in national and international market. Our spacious and sprawling manufacturing unit spread in an area of 60,000 square feet in Jalandhar enables us in meeting the needs of our clients.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nBeing an ISO 9001:2008 certified company, we are engaged in offering a comprehensive range of products to our clients. We are supported with an in built quality testing unit that is managed by a team of quality analysts. Our analysts are highly qualified and experienced who hold expertise in offering an unmatched range to our clients.  They check the quality of the products from procurement of raw materials till the end of the product.\u003C/p\u003E\n\n\u003Cp\u003EManufacturing Unit:\nWe are supported by a spacious manufacturing unit that is spread across a wide area of 60,000 square feet. This unit is equipped with advanced machinery and tools. This unit is managed by a team of highly experienced professionals who are capable of handling these machines. \u003C/p\u003E\n\n\u003Cp\u003ER \u0026amp; D:\nWe are guided by Mr. Zubin Bhaseen in all hemispheres to emerge as the sole leaders engaged in manufacturing sports and fitness equipments in India. R\u0026amp;D unit employed with us are engaged in researching and developing a wide range of innovative products to meet the demands of industry. These people are involved in researching and develop innovative products to meet the requirements of fitness and sports industry.\u003C/p\u003E\n\n\u003Cp\u003EIndustry Caters To:\nWe are a professionally managed manufacturer and exporter of sports and fitness equipments. In about six decades of our presence in market, we have been able to carve a niche for ourselves and build up a large clientele globally.  Our clientele includes people from Indian Subcontinent, South East Asia and North Europe.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7382/247382v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7382/247382v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7382/247382v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.fitnessnleisure.com/",
    "title": "Bhaseen Sports Pvt Ltd , Jalandhar"}]}