{"name": "Bhumi Sagar",
 "permalink": "bhumi-sagar",
 "crunchbase_url": "http://www.crunchbase.com/company/bhumi-sagar",
 "homepage_url": "http://www.indiamart.com/bhumisagar/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "bhumisagar@tradepassport.org",
 "phone_number": "9820224124",
 "description": "trading and exporting",
 "created_at": "Thu Apr 04 09:44:24 UTC 2013",
 "updated_at": "Thu Apr 04 09:44:26 UTC 2013",
 "overview": "\u003Cp\u003ESince our incorporation is in year 2011, we “Bhumi Sagar Exports Pvt. Ltd.” is counted as a renowned organization, engaged in trading and exporting a commendable range of Herbal Cosmetics Products, Spices and Honey. Our offered range also encompasses of Anti Rheumatic Capsule, Livo Smilin Capsules, Tenso-B Capsule, Herbal Shampoo, Herbal Hair Oil and Herbal Fairness Cream. In addition to this, we also offer Cough Syrups, Foot Crack Cream, Antifungal Cream, Cardamom, Cayenne Pepper and Chilies are few to name.\u003C/p\u003E\n\n\u003Cp\u003EOur Team;\n    Procurement agents\n    Administration personnel\n    Quality controllers\n    Marketing and sales personnel\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe understand that quality plays a vital role in the success of an organization, so we are providing our clients with qualitative range of Herbal Cosmetics Products, Spices and Honey. These products are obtained from reliable and authentic vendors, who are selected after intense market research.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe have tie-ups with the vendors from all over the world, which has enabled us to serve our patrons with remarkable range of Herbal Cosmetics Products, Spices and Honey. They have set-up a robust infrastructure facility, which is well equipped with sophisticated tools, ultra-modern machinery and latest technology.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client centric organization, we aim to cater the clients\u0026#8217; every single requirement in every possible manner by offering them with Herbal Cosmetics Products, Spices and Honey. In order to achieve maximum client satisfaction, we procure our products from certified and licensed vendors of the industry.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nDespite huge competition in the market, we have been able to be recognized as a leading Exporter Spices, Herbal Products, Cosmetic Products. We are a client centric organization and aims at catering their every single requirement in every possible manner. In order to gain their loyalty and initiate ever lasting business relations with them, we follow ethical business approach and practice high transparency while dealing.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7764/247764v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7764/247764v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7764/247764v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}