{"name": "BidCops",
 "permalink": "bidcops",
 "crunchbase_url": "http://www.crunchbase.com/company/bidcops",
 "homepage_url": "http://bidcops.com/",
 "blog_url": "http://bidcops.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "bidcops",
 "category_code": "advertising",
 "number_of_employees": 30,
 "founded_year": 2003,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "google, google-adwords, adwords, ppc, pay-per-click, pay-per-click-marketing, ppc-marketing, ppc-reporting, ppc-reporting-tool, internet-marketing, ppc-reports",
 "alias_list": null,
 "email_address": "support@bidcops.com",
 "phone_number": "0844 802 6243",
 "description": "The PPC Reporting Tool",
 "created_at": "Thu Jan 10 10:53:18 UTC 2013",
 "updated_at": "Thu Mar 07 04:16:01 UTC 2013",
 "overview": "\u003Cp\u003EBidCops is a PPC reporting tool for Google AdWords\u003C/p\u003E\n\n\u003Cp\u003EIt is designed to help PPC staff save time and money on Google AdWords. It can also help find areas to increase conversions.\u003C/p\u003E\n\n\u003Cp\u003EThe tool is 100% secure and has received approval from the Google AdWords API (Application Programming Interface) team.\u003C/p\u003E\n\n\u003Cp\u003EBidCops is also a Google AdWords Certified Partner.\u003C/p\u003E\n\n\u003Cp\u003EBidCops works with a number of popular web browsers, including IE, Safari, Opera and Firefox. It is also available as a Google Chrome app, and can be downloaded directly into the browser. \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EBidCops saves time on PPC reporting. \u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EManual PPC reports take days to compile. \u003C/p\u003E\n\n\u003Cp\u003EBidCops does this in just 30 seconds.\u003C/p\u003E\n\n\u003Cp\u003EIt scans through extensive Google AdWords accounts in less than a minute, and produces an in-depth but easy-to-understand report, focussing on 12 key PPC metrics. \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EBidCops saves money on Google AdWords. \u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EEach PPC report shows areas of wasted budget, keywords which fail to convert, and cost per acquisition by match type. \u003C/p\u003E\n\n\u003Cp\u003EBidCops highlights potential problems with a campaign’s impression share, quality score and match type keyword split, and is designed to help AdWords campaign managers quickly spot and fix signs of decline or overspend.\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EBidCops helps increase PPC conversions. \u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EThe tool provides recommendations, based on Google Best Practice and more than a decade of on-the-job PPC experience, to help paid search staff decide on the best actions to take to improve their Google advertising account.\u003C/p\u003E\n\n\u003Cp\u003EBidCops archives its reports, so PPC managers can quickly compare their paid ad performance on a month-by-month, quarter-by-quarter, or year-on-year basis.\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E100% Safe and Secure\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EApproved by Google, BidCops is a safe, secure and easy way to streamline PPC reporting tasks. \u003C/p\u003E\n\n\u003Cp\u003EThe tool links to Google AdWords accounts via an encrypted SSL server: with Google’s own stringent authentication systems ensuring all data remains completely private and confidential.\u003C/p\u003E\n\n\u003Cp\u003EThe BidCops datacentre and hosting facilities are protected by dedicated Cisco Firewalls, CCTV monitoring, electronic keycard access and 24-hour security patrols.\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EA decade of experience\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EBidCops is the new PPC reporting tool from Lichfield-based Internet marketing agency, ClickThrough Marketing. \u003C/p\u003E\n\n\u003Cp\u003EClickThrough is staffed by a number of Internet marketing experts. These include Dr Dave Chaffey, named as one of just 50 people worldwide to shape the future of marketing by the Chartered Institute of Marketers, an award-winning senior journalist, and service directors with more than a decade of experience in SEO, PPC and web development.\u003C/p\u003E\n\n\u003Cp\u003EEstablished in 2003, ClickThrough provides SEO, PPC, web development and content marketing services in the UK and abroad. Its clients include Peugeot, Dunelm Mill, ScottishPower and Halfords Autocentres.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       137],
      "assets/images/resized/0022/9021/229021v2-max-150x150.jpg"],
     [[250,
       228],
      "assets/images/resized/0022/9021/229021v2-max-250x250.jpg"],
     [[450,
       411],
      "assets/images/resized/0022/9021/229021v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "Charter House",
    "address2": "Sandford Street",
    "zip_code": "WS13 6QA",
    "city": "Lichfield",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        94],
       "assets/images/resized/0022/9020/229020v2-max-150x150.jpg"],
      [[250,
        157],
       "assets/images/resized/0022/9020/229020v2-max-250x250.jpg"],
      [[331,
        208],
       "assets/images/resized/0022/9020/229020v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}