{"name": "Bidsauce",
 "permalink": "bidsauce",
 "crunchbase_url": "http://www.crunchbase.com/company/bidsauce",
 "homepage_url": "http://bidsauce.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": 10,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bid, online-auction, auction, cheap-electronics, win",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "#1 ONLINE PENNY AUCTION",
 "created_at": "Tue Feb 22 22:20:53 UTC 2011",
 "updated_at": "Wed Feb 23 04:34:44 UTC 2011",
 "overview": "\u003Cp\u003EBidsauce is a revolutionary new online penny auction website where everything sells for pennies on the dollar.\nEstablish in 2009, Bidsauce.com is a new auction experience dedicated to providing our customers the hottest brand name electronics and hard to get items at unbelievable prices.\u003C/p\u003E\n\n\u003Cp\u003EWe offer an experience that is unsurpassed in online penny auction sites with a fun new approach to buying products. Our passion comes from a desire to create a true to life win-win situation between the consumer and ourselves.\u003C/p\u003E\n\n\u003Cp\u003EWe have dedicated, and continue to dedicate countless hours to finding the best products while creating the most user friendly environment in the industry. We are constantly developing apps for notifications, seamless transactions, express shipping options and mobile apps to help maintain this user friendly and fun environment for our guests and regular customers.\u003C/p\u003E\n\n\u003Cp\u003ESome of the features that you will find that make us more \u0026#8220;saucy\u0026#8221; then the rest is our weekly hot sauce buys, free bid refer a friend programs, bid sauce gift cards and life changing offers section.\u003C/p\u003E\n\n\u003Cp\u003EWe know that we as a company are only as good as our customers and we have dedicated ourselves and will continue to dedicate ourselves to the task of making you a loyal valued customer. We value your feedback and are always interested in new idea or critic that can make us better as a company. What products you would like to see, user friendly options you think would be helpful, let us know so we can improve your experience. Contact us at Support@Bidsauce.com\u003C/p\u003E\n\n\u003Cp\u003EBidsauce sells all the best products and all auctions start at zero dollars and increase is price by 1 penny per bid. As the timer counts down to Zero the most recent bidder WINS. If another bid is placed before the auction timer reaches zero then the timer resets to a maximum of 30 Seconds. Bidboxes are sold in 25, 50, 100, 250 and 500 and cost as little as $0.70 per bid. Stock up with bids now and start winning. Want to know more about this incredible penny auction experience and also learn about a freaky fast turbo actions watch our tutorial video.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}