{"name": "Bidzinger",
 "permalink": "bidzinger",
 "crunchbase_url": "http://www.crunchbase.com/company/bidzinger",
 "homepage_url": "http://www.bidzinger.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 5,
 "founded_year": 2008,
 "founded_month": 8,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "admin@bidzinger.com",
 "phone_number": "",
 "description": "Online Storefront Marketplace",
 "created_at": "Thu Apr 05 02:57:08 UTC 2012",
 "updated_at": "Wed Apr 11 20:53:32 UTC 2012",
 "overview": "\u003Cp\u003EHi, my name is Kathy Lester and I am CEO and Founder of Bidzinger.com(Home of the Anchor Stores) in Ellettsville, Indiana. My husband Daren and I are not new to the online buying and selling experience. We started selling on Ebay in December 2000 and grew shortly thereafter into Ebay Powersellers.\u003C/p\u003E\n\n\u003Cp\u003EThis eventually helped us start our own enterprise and thus things got so busy for us that it turned into a full-time job. It wasn\u0026#8217;t until the last few years that things began to change on Ebay(hike in fees, feedback, how to sell, etc.)that gave us the idea to start our own online marketplace but without all the ridiculous dictations. We desire for Bidzinger to bring BACK the \u0026#8216;MAGIC\u0026#8217; online auctions once had when Ebay first began.\u003C/p\u003E\n\n\u003Cp\u003EWe WELCOME the mom and pop stores, the handcrafted items and things that once made Ebay fresh and very unique. We desire to see small business people grow with us into something big like Ebay had helped us to do 8 years ago. Somebody had asked me a few years ago when we first got started, \u0026#8220;There are several auction sites out there that have started up and a lot of them are no longer around..what makes you think YOU are going to be any different?\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EWell, #1, we have put a lot of money on this website and with that thought, we have not just let this site go live without putting some of our own items on and continuously trying to build it up week by week along with other sellers that have joined with us. We have EVERY intention in becoming competitive and growing quickly!\u003C/p\u003E\n\n\u003Cp\u003E#2, we desire to also be like buyers and utilize our site just like anyone would if they owned a site or a store and that is to buy off of our own people. If we see something we could use for our business or around the house or perhaps something to purchase as a gift for someone at Christmas time, we are going to DO it! We desire to see unique sellers on our website making tons and tons of sales and doing great things with us!\u003C/p\u003E\n\n\u003Cp\u003E#3, we are going to and have been the last few months promoting and advertising Bidzinger in several different ways and things seem to be working great so far!\u003C/p\u003E\n\n\u003Cp\u003E#4, we are so sick and tired of sites like Ebay and others that think they have the right to get involved in the sellers business telling them what payments they can accept, how they need to ship, etc. We are not like that. You can accept payments HOWEVER you wish, ship to WHOMEVER you wish, and SELL to whomever you wish.\u003C/p\u003E\n\n\u003Cp\u003EThat is YOUR decision; not ours. And that\u0026#8217;s the way it always should be. Join Bidzinger and become a part of our family! Registering is FREE, listing is FREE and browsing is FREE! \u0026#8216;Why should you LINGER when there\u0026#8217;s BIDZINGER?\u0026#8217; http://www.bidzinger.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}