{"name": "Big Idea Mastermind Coach",
 "permalink": "big-idea-mastermind-coach",
 "crunchbase_url": "http://www.crunchbase.com/company/big-idea-mastermind-coach",
 "homepage_url": "http://bigideamastermindcoach.com",
 "blog_url": "http://www.facebook.com/pages/Big-Idea-Mastermind-Coaching/347990005321305?ref=hl",
 "blog_feed_url": "",
 "twitter_username": "Creator69",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "big-idea-mastermind-launch, big-idea-mastermind-login, big-idea-mastermind-video-1, big-idea-mastermind-video-2, big-idea-mastermind-online, big-idea-mastermind-forum-special-offers, about-big-idea-mastermind, big-idea-mastermind-preview, big-idea-masterm",
 "alias_list": null,
 "email_address": "bigideacoach@gmail.com",
 "phone_number": "1-617-807-0852",
 "description": "Big Idea Mastermind Coach Is",
 "created_at": "Wed Jun 12 21:46:52 UTC 2013",
 "updated_at": "Wed Jun 12 22:28:06 UTC 2013",
 "overview": "\u003Cp\u003EBasically what They\u0026#8217;re doing is building a 7-figure marketing platform from scratch and then making this giant system work with Empower Network\u0026#8217;s system and get the two to communicate and work in perfect harmony all in the background for YOU, your downline, your downline\u0026#8217;s downline, etc\u0026#8230;\nVick Strizheus, founder of Big Idea Mastermind, talks about the purpose of BIM. The main goal of their organization is to help at least 1000 people (in their first year) to make at least $5000 per month on a regular basis. This is achievable with the Big Idea Mastermind system which is a complete sales funnel with tons of training. They are here to help you realize your dreams. Vick made well over $700,000 (seven hundred thousand dollars) in his first month, crashing all kinds of records. So we can say he knows what he is talking about. If you are determined, ready to commit yourself and have a purpose, please register. He can help you brand yourself so people will chase you to join your network. This - I believe - can change your life.\u003C/p\u003E\n\n\u003Cp\u003EThis is what you have been waiting for! The floodgates are open! No hype, no bull stuff. If you have the drive and are willing to follow instructions and to put in the efforts to make at least five grand per month starting in sixty days, please click on this link below and type in your email address. This will blow your mind away! See you on the other side!\u003C/p\u003E\n\n\u003Cp\u003EWhat Is Big Idea Mastermind?\u003C/p\u003E\n\n\u003Cp\u003EAre you a frustrated network marketer? Have you been trying to make money  for months, maybe years and your results are far away from your dreams? It is not your fault and this is the time to do something about it!\u003C/p\u003E\n\n\u003Cp\u003EThis is the beginning of something great. Big Idea Mastermind offers a unique marketing system to make your networking business explode. You have never seen anything like this.\u003C/p\u003E\n\n\u003Cp\u003EYour view about network marketing is going to change for the better very soon. No hype, no nonsense, no fluff and no bull stuff.  On our site you will see an actionable step-by-step plan that will change your life. We will hold your hand. We will tell you exactly what to do.\u003C/p\u003E\n\n\u003Cp\u003EYou are about to gain access to one of the greatest mastermind groups in the history of network marketing and a one-of-a-kind automated marketing system which makes it possible for you to create a realistic mid-four digit per month income within one-to-two months and then double it in the next two. They strive to achieve this and target a one hundred percent success rate.\u003C/p\u003E\n\n\u003Cp\u003EJoin Now!!\u003C/p\u003E\n\n\u003Cp\u003EThey do not want just anyone to join us. This is not for everyone. A lot of people are just actually collectors. They keep buying courses on internet marketing without actually following through. With us, we we tell you exactly what to do – but you have to move your butt and actually take action. Nothing is going to happen until you do. Big Idea Mastermind is also commit to zero tolerance for negativity. You should understand the importance of continuous education and training based on daily action. Closely following their system is crucial. Their videos, training materials, regular webinars will make this an enjoyable journey with unique results. BIM will make a significant difference in this industry and help many people change their lives and circumstances for the better.\u003C/p\u003E\n\n\u003Cp\u003ELet’s make history  together with Big Idea Mastermind! They are changing how business is done for ever. If you have the vision and want to become a part of this movement (actually we can call it a lifestyle), all you have to do is register here. You will gain access to world class training and continuous support.\u003C/p\u003E\n\n\u003Cp\u003EStatistics say that 95% of all network marketers feel stressed out and frustrated after spending two years in the business. One of the main reasons is that most of us just hate to pick up the phone trying to convince someone. Also, by the end of the two years almost everyone would have exhausted their line of warm leads, family members and friends. So they become frustrated, hardly making any money and cannot even cover their expenses.   They also  experience the first signs of depression and feel directionless.\u003C/p\u003E\n\n\u003Cp\u003EJoin Now!!\u003C/p\u003E\n\n\u003Cp\u003ESo what are you waiting for? What do you have to lose? You will get access to our proprietary one-of-a-kind program with detailed course of action to be taken during the next thirty days – outlined exactly what to do every day! What do you choose? The run-of-the-mill old marketing strategies that zillions of others are touting or our highly effective automated system that has proven to be exceptional?\u003C/p\u003E\n\n\u003Cp\u003EGet to know our formulas to generate more leads on demand than you have ever experienced. Put thousands in your pocket regularly and build your network marketing business without ever picking up the phone or prospecting, buying leads, chasing family members and friends and being tired of getting rejected again and again. Let your leads come to you!\u003C/p\u003E\n\n\u003Cp\u003EAre You Sick and Tired of Being Sick and Tired? Register here! Click  below! \nWelcome to the Big Idea Mastermind Coach Team !!\u003C/p\u003E\n\n\u003Cp\u003EHtpp://bigideamastermindcoach.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0027/4539/274539v2-max-150x150.png"],
     [[250,
       96],
      "assets/images/resized/0027/4539/274539v2-max-250x250.png"],
     [[450,
       174],
      "assets/images/resized/0027/4539/274539v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}