{"name": "Bio-Synthesis",
 "permalink": "bio-synthesis",
 "crunchbase_url": "http://www.crunchbase.com/company/bio-synthesis",
 "homepage_url": "http://www.biosyn.com/",
 "blog_url": "http://blog.biosyn.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "custom-antibody, custom-peptide-synthesis, custom-sirna-synthesis",
 "alias_list": null,
 "email_address": "biosyn.seo@gmail.com",
 "phone_number": "1-800-227-0627",
 "description": "Life Science Products",
 "created_at": "Wed Feb 16 18:56:22 UTC 2011",
 "updated_at": "Sat Feb 19 02:13:22 UTC 2011",
 "overview": "\u003Cp\u003EBio-Synthesis, founded in 1984, is a U.S. based company whose primary emphasis is providing high quality custom products such as custom oligonucleotides, custom peptides, custom antibodies, and services for life science research, diagnostics, and therapeutic applications. BSI integrated manufacturing programs enable a seamless transition from the inception of an idea through product launch by providing their clients with a comprehensive portfolio of services that span across genomic, proteomic, and cell biology.\u003C/p\u003E\n\n\u003Cp\u003EAs a leading supplier of genomic and proteomic research products, BSI is able to offer its customers integrated solutions for custom  DNA synthesis, custom RNA synthesis, custom polyclonal antibody production, custom peptide synthesis, molecular diagnostic detection kits, DNA Real-Time PCR products, DNA microarray services and a wide range of custom DNA-based diagnostic kits and consumables.\u003C/p\u003E\n\n\u003Cp\u003EThe proteomic division is experienced in the design of peptides, both for antibody production and bioactive peptide synthesis, e.g cosmetic peptides. While the custom peptide synthesis division has the ability to produce thousands of modified or non-modified peptides per day for research applications, BSI also provides diagnostic/therapeutic GMP custom peptide\nproduction. Synthesis of  custom peptides results in quantities ranging from milligrams to multi-kilograms. The staff in the custom antibody division provide expert support in the selection of peptide antigens for target antibody production and offer convenient custom-bundled packages with a wide range of host animals. In addition, peptide, antibody and protein arrays are also amongst its expertise.\u003C/p\u003E\n\n\u003Cp\u003EBSI is a U.S. based company whose primary emphasis is on the synthesis of high quality custom products for a variety of applications and a full-service contract manufacturing organization (CMO) delivering research, development and production services for cGMP clinical batch manufacturing.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0012/2400/122400v2-max-150x150.png"],
     [[250,
       61],
      "assets/images/resized/0012/2400/122400v2-max-250x250.png"],
     [[305,
       75],
      "assets/images/resized/0012/2400/122400v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "612 East Main Street",
    "address2": "Lewisville",
    "zip_code": "75057",
    "city": "",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}