{"name": "Bizsmart Solutions India Pvt Ltd",
 "permalink": "bizsmart-solutions-india-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/bizsmart-solutions-india-pvt-ltd",
 "homepage_url": "http://www.bizsmartsol.com",
 "blog_url": "http://www.bizsmartsol.com",
 "blog_feed_url": "",
 "twitter_username": "7204451498",
 "category_code": "consulting",
 "number_of_employees": 20,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "placement-consultancy-in-bangalore, manpower-consultancy-in-bangalore, job-consultancy-in-bangalore",
 "alias_list": null,
 "email_address": "bizsmartsol@gmail.com",
 "phone_number": "7204451295",
 "description": "Manpower Consultancy",
 "created_at": "Fri May 24 13:46:35 UTC 2013",
 "updated_at": "Mon May 27 15:21:30 UTC 2013",
 "overview": "\u003Cp\u003EBizsmart  is a Bangalore based company which  has emerged as a leader in Manpower Recruitment Industry providing End to End Recruitment Solutions for all varieties of Industries.  It is one of the Leading Manpower Placement Consultancy in Bangalore. Bizsmart is backed up by a team of vibrant youngsters full of zest and driven by the urge to succeed and be the best. Bizsmart relies on its qualitative approach and industries best practices. We are a custom built firm developed by the experienced Technology Professionals for Technology Professionals.\u003C/p\u003E\n\n\u003Cp\u003EBizmart Solutions Pvt. Ltd. is a leading Indian based Job Placement Consultancy. It is the fastest growing Executive Search and Recruitment Company in India revolutionizing recruitment and temporary staffing in the region with its unparalleled functionality and quality. Bizmart Solutions offers a fast, easy, effective and cost efficient method for employers to find quality candidates and for job seekers to find the right jobs. The company is today widely regarded for providing quality people and as one of the fastest growing Job consultancy in India.\u003C/p\u003E\n\n\u003Cp\u003EOur extensive database enables us to rapidly, accurately and confidentially search for qualified applicants without the need for costly and time-consuming process.\u003C/p\u003E\n\n\u003Cp\u003EIn addition, Bizmart Solutions offers expert advice on job hunting and career development, as well as an opportunity to network with other professionals through online forums and discussions.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}