{"name": "Blackcircles.com",
 "permalink": "blackcircles-com",
 "crunchbase_url": "http://www.crunchbase.com/company/blackcircles-com",
 "homepage_url": "http://www.blackcircles.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 45,
 "founded_year": 2001,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-retail-automotive",
 "alias_list": null,
 "email_address": "mike@blackcircles.com",
 "phone_number": "0845 620 2000",
 "description": "Online Motoring Services",
 "created_at": "Sun Feb 27 20:22:01 UTC 2011",
 "updated_at": "Fri Mar 04 00:10:22 UTC 2011",
 "overview": "\u003Cp\u003EBlackcircles.com was launched in 2001 as a revolutionary new way of buying tyres and booking a car service. Through either the company website or call centre customers can choose the type of tyres they want or service they require and have the job done at their local Blackcircles.com affiliated garage, of 1200 garages most are now franchised and fully branded Blackcircles.com - Blackcircles handle everything from start to finish. \u003C/p\u003E\n\n\u003Cp\u003EIn 2011 Tesco Tyres.com was launched. A joint venture between Blackcircles.com and Tesco PLC, the worlds 2nd largest retailer. In the UK Tesco employs over 250,000 people, has over 12 millions customers and takes 1 in every 6 pounds spent on the high street. Tesco-Tyres.com will promote the service to its customers and offer clubcard points on all tyre purchases made, adding even more value to the up to 40% less than high street retail price Tesco-Tyres.com offers.\u003C/p\u003E\n\n\u003Cp\u003EBlackcircles.com is diversifying fast and is now looking towards a range of motoring products and services including the recently launched Car Servicing.\u003C/p\u003E\n\n\u003Cp\u003EInternational expansion of the core Blackcircles business and other new exciting initiatives are planned.\u003C/p\u003E\n\n\u003Cp\u003EManaging Director Mike Welch left school aged 16 to become a tyre fitter in Liverpool. He went on to launch his first tyre business while still in his teens before being head hunted by Kwik-Fit where his title was New Business and e-Commerce Development Manager.\u003C/p\u003E\n\n\u003Cp\u003EThe Chairman of Blackcircles.com is Graeme Bissett, former Group Finance Director of Kwik-Fit.\u003C/p\u003E\n\n\u003Cp\u003EMike Welch won the Shell LiveWIRE Young Entrepreneur of the Year in 2003. In 2005 Mike was named Emerging Entrepreneur of the Year in the Ernst \u0026amp; Young Awards. In 2009 Mike Welch was named BT Essence of an Entrepreneur \u0026#8216;Most Outstanding Entrepreneur\u0026#8217;. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       60],
      "assets/images/resized/0012/4201/124201v2-max-150x150.png"],
     [[200,
       80],
      "assets/images/resized/0012/4201/124201v2-max-250x250.png"],
     [[200,
       80],
      "assets/images/resized/0012/4201/124201v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}