{"name": "Blackberry Soporte",
 "permalink": "blackberry-soporte",
 "crunchbase_url": "http://www.crunchbase.com/company/blackberry-soporte",
 "homepage_url": "http://www.soporteblackberry.com.ar",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2005,
 "founded_month": 9,
 "founded_day": 14,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "soporteblackbe2@gmail.com",
 "phone_number": "",
 "description": "Soporte de Blackberry",
 "created_at": "Wed Aug 15 14:39:06 UTC 2012",
 "updated_at": "Fri Aug 17 16:23:41 UTC 2012",
 "overview": "\u003Cp\u003EWe were born with the aim of covering a technical service not implemented in the country for companies providing telephone service, as only they toil to sell the phone line and equipment, but do not serve their clients when they have problems with the equipment either by software problems, change lcd, blackberry liberaraciones or service in general. We have extensive experience in reparacione blackberry as well as the software. We help clients solve their issues with when having to install applications or software errors that do not know how to fix them. We advise and teach our clients to not repeat the mistakes that fastened his blackberry.\u003C/p\u003E\n\n\u003Cp\u003EWe can say that we are the best blackberry technical Argentina, since not only are you going with the BlackBerry repaired, but we explain in detail the problem and how to make your computer so you do not happen again. Our goal is to meet the customer service of blackberry that does not exist today in Argentina by large companies for that you optimize the functions of your blackberry and really be your smartphone. Our way of repairing a blackberry covers all repair details, trying to leave your team with the best aesthetics possible, because we know how important it is to continue taking your blackebrry as you had before, so our technical service passes blackberry internal control for completion of equipment, you take the blackberry working 100% and not have to go through different razones.Siempre checked the spare change for at least several hours before returning it.\u003C/p\u003E\n\n\u003Cp\u003EIn Argentina BB Support we are committed to service user Blackberry Argentina, since we are a team of professionals in different areas of the company and electronics engineers, business managers, human resources and graduate students. This combination makes a simple Blackberry technician to become the best company to repair blackberry and give special attention to the blackberry user that does not exist today in the country.\u003C/p\u003E\n\n\u003Cp\u003ESoftware upgrade and configuration.\nUpdating and installing applications.\nUnlocking and professional liberation.\nExcellent care and responsibility\nblackberry technical service\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}