{"name": "BlackBox-BI",
 "permalink": "blackbox-bi",
 "crunchbase_url": "http://www.crunchbase.com/company/blackbox-bi",
 "homepage_url": "http://www.blackbox-bi.com",
 "blog_url": "http://www.blackbox-bi.com/support/blogs",
 "blog_feed_url": "http://www.blackbox-bi.com/support/blogs/-/blogs/rss?displayStyle=title",
 "twitter_username": "blackbox_bi",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 2010,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-intelligence, bi, cloud, cloud-bi, reporting, analytics, etl, dashboarding",
 "alias_list": null,
 "email_address": "info@blackbox-bi.com",
 "phone_number": "",
 "description": "Cloud Business Intelligence",
 "created_at": "Wed Aug 25 07:22:15 UTC 2010",
 "updated_at": "Fri Sep 03 22:32:18 UTC 2010",
 "overview": "\u003Cp\u003EThe BlackBox-BI mission statement is; to provide easy to use affordable Business Intelligence for companies of all sizes.\u003C/p\u003E\n\n\u003Cp\u003EEasier said than done of course and we are not the only ones that want to do this. So how are we going to bring Business Intelligence to the masses? By focusing on the 4 key factors that in our eyes enable successful BI for companies.\u003C/p\u003E\n\n\u003Cp\u003EAffordability\u003C/p\u003E\n\n\u003Cp\u003EWhen the Business Intelligence solution is affordable it can be used by more members of your company thus giving more people access to critical information and allowing them to take better decisions. A lower cost of ownership further allows you to develop a more advanced business intelligence solution.\u003C/p\u003E\n\n\u003Cp\u003EWhen launching a BI project companies often spend a considerable chunk of their budget on configuring servers and software. This can easily take up to a few weeks of development and tuning. All this money could have been better spent on building reports, dashboards and analytics models that will be of benefit to your users.\u003C/p\u003E\n\n\u003Cp\u003EOnce a BI solution is up and running it will need to be maintained. This requires dedicated resources that often are not available. Ownership of BI solutions is a major problem for a lot of companies. Usually it is the role of the IT department because it touches a lot of technical subjects but functionally it is usually a bit of a grey area. We have taken care of the technical part of the solution and if you want we can do the functional side as well.\u003C/p\u003E\n\n\u003Cp\u003EEase of use\u003C/p\u003E\n\n\u003Cp\u003EWe believe Business Intelligence needs to be accessible to members in all levels of your organization. Decisions are made every day by executives as well as production staff. By using our easy to use platform these decisions will be founded on solid information instead of hunches and assumptions.\u003C/p\u003E\n\n\u003Cp\u003EPerformance\u003C/p\u003E\n\n\u003Cp\u003ETime is money, the old adagium is more valid than ever. That is why we believe a Business Intelligence platform needs to give answers to business questions quickly. We achieve exceptional performance by using hardware that is especially selected for the task at hand and software that has been designed from the ground up for analytical and reporting workloads.\u003C/p\u003E\n\n\u003Cp\u003EScalability\u003C/p\u003E\n\n\u003Cp\u003EEvery business wants to grow and we believe your BI platform needs to be able easily to grow with you. BI becomes a limiting factor. With BlackBox-BI we grow along with you. You can start out small with only a handful of users and gradually add users, data and functionality.\nThis is hard to do with traditional BI solutions as they usually get dimensioned for a certain number of users and will need to be upgraded as the number of users grows.\u003C/p\u003E\n\n\u003Cp\u003EBlackBox-BI aims would like to do things different, easier faster and cheaper. \u003C/p\u003E\n\n\u003Cp\u003EOK enough with the marketing talk. We will use these pages to explain ho we think BI can be beneficial to your company and how BlackBox-BI will help you become better decision makers. Please feel free to browse around our site and do drop us a line if you have any questions regarding our products and services.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0010/0376/100376v2-max-150x150.png"],
     [[217,
       217],
      "assets/images/resized/0010/0376/100376v2-max-250x250.png"],
     [[217,
       217],
      "assets/images/resized/0010/0376/100376v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Olav",
      "last_name": "Snoek",
      "permalink": "olav-snoek",
      "image": null}},
   {"is_past": false,
    "title": "",
    "person":
     {"first_name": "John",
      "last_name": "Stockwood",
      "permalink": "john-stockwood",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "5 rue de l'hopital saint louis",
    "address2": "",
    "zip_code": "75010",
    "city": "Paris",
    "state_code": null,
    "country_code": "FRA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[145,
        150],
       "assets/images/resized/0010/0377/100377v2-max-150x150.png"],
      [[242,
        250],
       "assets/images/resized/0010/0377/100377v2-max-250x250.png"],
      [[436,
        450],
       "assets/images/resized/0010/0377/100377v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}