{"name": "Blackcode Advertising Brighton",
 "permalink": "blackcode-advertising-brighton",
 "crunchbase_url": "http://www.crunchbase.com/company/blackcode-advertising-brighton",
 "homepage_url": "http://blackcodeadvertising.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 8,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "sales and marketing",
 "created_at": "Tue Jul 27 17:34:28 UTC 2010",
 "updated_at": "Sat Jun 02 00:48:02 UTC 2012",
 "overview": "\u003Cp\u003EBlackcode Advertising Brighton happens to be one of the fastest growing marketing company which delivers a quality service for all types of big and small companies. Based in Brighton, UK, Blackcode Advertising Brighton embarks on its dynamic and effective marketing strategies which keeps it ahead of other competitors. Its sales campaigns have always been institutional and goal oriented and delivers the maximum results for its huge client base.\u003C/p\u003E\n\n\u003Cp\u003EPowered by a team of marketing professionals, Blackcode Advertising Brighton has proved to be a firm which is a trusted name for all your marketing needs. It not only offers marketing solutions, but also provides a great working environment for its employees with great scope to develop and build a good career. \u003C/p\u003E\n\n\u003Cp\u003ELooking to expand across UK and Europe, Blackcode Advertising Brighton eyes to develop its area and stand out as a global leader in the marketing segment. Being a expanding direct marketing company, Blackcode Advertising Brighton is contracted by The Cobra Group plc who work with national and international clients. Believing in a quality customer service, Blackcode Advertising enjoys a good repute in the market. \u003C/p\u003E\n\n\u003Cp\u003EWelcome to Blackcode Advertising Brighton: Currently expanding throughout Brighton, we are one of the fastest growing sales and marketing companies in the South West. We serve our clients by helping them deliver exciting marketing and sales campaigns for local Brighton and national clients through the use of our unique marketing approach\u003C/p\u003E\n\n\u003Cp\u003EIf all you want out of life is a job, then that\u0026#8217;s what you will get \u0026#8230; if you are looking to make something out of your life: start here!\u003C/p\u003E\n\n\u003Cp\u003ESales \u0026amp; Marketing Jobs in Brighton exist, but most of them lead to a dead end. If you are looking for a challenge and a real business opportunity\u0026#8230; send us some details so we can talk with you.Blackcode Advertising Brighton works with a growing team of successful people, who deliver a quality service for clients we represent. We are currently looking for new people to develop in opportunities from product training through to our Business Development Program. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0019/3407/193407v3-max-150x150.jpg"],
     [[180,
       48],
      "assets/images/resized/0019/3407/193407v3-max-250x250.jpg"],
     [[180,
       48],
      "assets/images/resized/0019/3407/193407v3-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "head office",
    "address1": "1-6 grand parade",
    "address2": "brighton",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null},
   {"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}