{"name": "Blancspot",
 "permalink": "blancspot",
 "crunchbase_url": "http://www.crunchbase.com/company/blancspot",
 "homepage_url": "http://www.blancspot.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "blancspotmedia",
 "category_code": "games_video",
 "number_of_employees": 7,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "games, entertainment, news, activity-sharing, media-platform, social-shopping, social-news, social-gaming, social-network-for-kids",
 "alias_list": null,
 "email_address": "info@blancspot.com",
 "phone_number": "",
 "description": "Activity Sharing Platform",
 "created_at": "Fri Apr 19 17:26:52 UTC 2013",
 "updated_at": "Wed Apr 24 13:13:55 UTC 2013",
 "overview": "\u003Cp\u003EBlancspot is a technology platform for publishing, extending, monetizing and virtualizing media brands and assets. \u003C/p\u003E\n\n\u003Cp\u003EThe platform comprises a full suite of workflow and development tools from content ingest to distribution, syndication, rights exploitation and business rules application.  \u003C/p\u003E\n\n\u003Cp\u003EThe Blancspot technology platform has a functional set of APIs enabling publishers and distributors to integrate with existing digital solutions such as data harvesters, analytics packages, ecommerce and geo-location vendors, in addition to PCI solutions.\u003C/p\u003E\n\n\u003Cp\u003ESOLVING FOR DIGITAL BRANDS: The world is screen deep with rapidly evolving consumer preferences and tastes. The biggest component to managing a brand’s digital presence and therefore long-term financial growth is diversification, as exhibited by the growing number of access points to content. \u003C/p\u003E\n\n\u003Cp\u003EThe Blancspot platform effectively blends technology and content publishing with solutions integration, rights management and customer relationship channels. \u003C/p\u003E\n\n\u003Cp\u003EThe Blancspot Media platform is an entertainment platform that converts media audiences into buying audiences. Blancspot  is forming a distribution network including broad reach partners and niche communities to enable a broad range of targeting capabilities. Our focused, clutter-free, socially rich app provides an optimal user experience while ensuring our brands are center stage. From standard packages to unique and innovative Branded Channels, Blancspot offers a wide variety of powerful media monetization opportunities across internet connected devices.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Camille",
      "last_name": "LeBlanc",
      "permalink": "camille-leblanc",
      "image":
       {"available_sizes":
         [[[150,
            119],
           "assets/images/resized/0018/6358/186358v2-max-150x150.jpg"],
          [[250,
            199],
           "assets/images/resized/0018/6358/186358v2-max-250x250.jpg"],
          [[450,
            359],
           "assets/images/resized/0018/6358/186358v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003ECamille LeBlanc\u003C/p\u003E"}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}