{"name": "Blowtech Engineers",
 "permalink": "blowtech-engineers",
 "crunchbase_url": "http://www.crunchbase.com/company/blowtech-engineers",
 "homepage_url": "http://www.indiamart.com/blowtechengineers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 1997,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "centrifugal-fan, axial-fan, kitchen-exhaust-blower",
 "alias_list": null,
 "email_address": "blowtechengineers@tradepassport.org",
 "phone_number": "9824047160",
 "description": "manufacturing HVAC EQUIPMENTS",
 "created_at": "Thu Apr 04 07:07:05 UTC 2013",
 "updated_at": "Thu Apr 04 07:07:07 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1997, we, “Blowtech Engineers”, are engaged in manufacturing and supplying a wide range of Centrifugal Fans and Air Handling Equipment. The range offered by us includes Centrifugal Fan, Axial Fan, Air Handling Unit, Suction Unit, Industrial Cooling Unit, Heat Exchanger, Dust Collector and Blower. These products are manufactured using high-grade raw material and advanced machines as per the international standards and guidelines. Owing to their features such as durability, strong construction, low maintenance and high performance, these products are widely demanded by the clients.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nmanufacturing and supplying a wide range of Centrifugal Fans and Air Handling Equipment. The range offered by us includes Centrifugal Fan, Axial Fan, Air Handling Unit, Suction Unit, Industrial Cooling Unit, Heat Exchanger, Dust Collector and Blower.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have established a sophisticated infrastructure in Mumbai, Maharashtra, which is spread across a wide area. Divided into various departments, this infrastructure helps us in managing the activities of our business in a proper manner. Moreover, these departments are managed by their respective professionals, who also make sure to upgrade the machines that installed at the unit to maintain excellent rate of production of Centrifugal Fans and Air Handling Equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are very-well supported by a team of competent professionals, which assists us in manufacturing and supplying a quality approved range of Centrifugal Fans and Air Handling Equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe aim at offering a quality assured range of Centrifugal Fans and Air Handling Equipment to the clients in order to gain their complete satisfaction. For this, we manufacture these products using high-grade raw material, which is sourced from the reliable vendors of the market.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       120],
      "assets/images/resized/0024/7609/247609v2-max-150x150.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7609/247609v2-max-250x250.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7609/247609v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}