{"name": "Blue Planet Marketing",
 "permalink": "blue-planet-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/blue-planet-marketing",
 "homepage_url": "http://www.bpmktg.com",
 "blog_url": "http://bpmktg.wordpress.com",
 "blog_feed_url": "http://bpmktg.com/blog",
 "twitter_username": "blueplanetmktg",
 "category_code": "advertising",
 "number_of_employees": 1,
 "founded_year": 1989,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "marketing, digital-marketing, web-site-design, seo, sem, semm, social-media-marketing, event-planning, pr, communications",
 "alias_list": null,
 "email_address": "dave@bpmktg.com",
 "phone_number": "210-618-6566",
 "description": "PR, digital marketing, web esing, SEO",
 "created_at": "Mon May 14 13:28:50 UTC 2012",
 "updated_at": "Tue May 22 19:09:13 UTC 2012",
 "overview": "\u003Cp\u003EAt Blue Planet Marketing its’ about leadership \u0026amp; vision.\u003C/p\u003E\n\n\u003Cp\u003EWe develop enterprise-level Road Maps to help forecast over the horizon in order to ensure survival and profit.\u003C/p\u003E\n\n\u003Cp\u003EWith backgrounds in IT, operations, sales, and marketing we use these skill sets to help drive profit. Tools and processes (OD, BPE, Lean 6-Sigma, and Agile) are used to strategically plan and tactically execute plans, policies and procedures to produce desired results.\u003C/p\u003E\n\n\u003Cp\u003EExecutive level marketing, communications and public relations form the bed rock skill set for BPM.\u003C/p\u003E\n\n\u003Cp\u003EWe formulate and align Management Control Plans that include initiatives and objectives, and are threaded through your vision and mission. This approach provides the alignment necessary for each level of the organization to execute their part of the objectives. A Management Control Plan, accompanied by departmental action plans hold everyone, at every level, accountable for delivery of goals.\u003C/p\u003E\n\n\u003Cp\u003EOperationally, BPM helps design these plans through the organization departments and includes production units, IT, and sales – this is the mastery of leadership that we bring to bear on a company. The result of these efforts bring about higher margins through reduced pre-tax net expense, and top line growth.\u003C/p\u003E\n\n\u003Cp\u003EUsing Customer Lifecycle Management, Public Relations, advertising, interactive marketing, and traditional marketing strategies we increase brand awareness and position products and services.\u003C/p\u003E\n\n\u003Cp\u003EWe begin by researching and evaluating programs, and design campaigns and product positioning success in order to revise pricing decisions that optimize volume, quality, frequency and production goals.\u003C/p\u003E\n\n\u003Cp\u003EOur goal is to meet and exceed profit objectives that increase macro stream revenue, increase margins, and reduce expense – the result is increased pre-tax income and greater shareholder wealth – the bottom line.\u003C/p\u003E\n\n\u003Cp\u003EOur Specialties:\u003C/p\u003E\n\n\u003Cp\u003EBusiness Process Engineering, unified resource processes, unified language modeling, senior leadership training, team building, facilitating and accelerating trust. Skills in BPE, organizational design (OD), change management, strategic planning, 6-Sigma, project management focusing on ROI, budgets and forecasts, marketing \u0026amp; sales, and operations.\u003C/p\u003E\n\n\u003Cp\u003EAbility to align the business model, objectives, mission and vision using strategies that sync up with the KPIs and appropriate metrics.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Principle",
    "person":
     {"first_name": "Dave",
      "last_name": "Howell, M.S.",
      "permalink": "dave-howell-m-s",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Website design, SEO",
    "is_past": false,
    "provider":
     {"name": "Sent Concepts",
      "permalink": "sent-concepts",
      "image":
       {"available_sizes":
         [[[150,
            148],
           "assets/images/resized/0020/3910/203910v2-max-150x150.jpg"],
          [[250,
            247],
           "assets/images/resized/0020/3910/203910v2-max-250x250.jpg"],
          [[295,
            292],
           "assets/images/resized/0020/3910/203910v2-max-450x450.jpg"]],
        "attribution": null}}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Company Headquaters",
    "address1": "8411 Feather Trl",
    "address2": "",
    "zip_code": "78023",
    "city": "Helotes",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}