{"name": "BML Insulation",
 "permalink": "bml-insulation",
 "crunchbase_url": "http://www.crunchbase.com/company/bml-insulation",
 "homepage_url": "http://www.indiamart.com/bmlinsulationengineers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "bmlinsulationengineers@tradepassport.org",
 "phone_number": "08377801179",
 "description": "supplier \u0026 trader ",
 "created_at": "Thu Apr 04 14:41:45 UTC 2013",
 "updated_at": "Thu Apr 04 14:41:47 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1986, we “BML Insulation Engineers” are a foremost supplier and trader of a quality assured range of Insulation Materials, Waterproofing Coating and Epoxy Painting Services. Along with this, we are also engaged in offering reliable \u0026amp; client centric Painting, Coating and Insulation Services. Variegated services that we offer to our clients include Industrial Insulation Services, Insulation Services, Thermal Insulation Services, Ducting Insulation Services, Cold Insulation Services, Hot Insulation Services, Tank Insulation Services and Polyurethane PUF Insulation.\u003C/p\u003E\n\n\u003Cp\u003EOur Professionals:\nWe have employed skilled and efficient professionals in our team in order to carry out various business activities in a timely and effective manner. Stringent selection policy enables us to employ skilled procurement agents, quality controllers, technicians, storage personnel and sales \u0026amp; marketing executives.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe house a state-of-the-art infrastructure, which is well-equipped with the latest technologies and sophisticated machinery. This facility enables us to accomplish the bulkiest of orders from the valued customers within the given time frame. \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\nBeing a leading trader and service provider, we ensure that our products and services meet the unique demands of our clients. Thus, we follow quality centric policies at different levels of our business activities. Quality controllers at our premise ensure that the procured products are designed \u0026amp; developed in compliance with the industry standards by our vendors.\u003C/p\u003E\n\n\u003Cp\u003EOur Vendors:\nWe have associated ourselves with some of the leading vendors in the domain in order to procure and offer a quality assured range of Insulation Material, Waterproofing Coatings and Epoxy Paintings.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7993/247993v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7993/247993v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7993/247993v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}