{"name": "Bob's Watches",
 "permalink": "bobs-watches-2",
 "crunchbase_url": "http://www.crunchbase.com/company/bobs-watches-2",
 "homepage_url": "http://www.bobswatches.com",
 "blog_url": "http://www.bobswatches.com/rolex-watches/blog",
 "blog_feed_url": "http://www.bobswatches.com/rolex-watches/feed",
 "twitter_username": "Bobrolexwatches",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 1999,
 "founded_month": 6,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rolex-watches, pre-owned-rolex, rolex-datejust, rolex-daytona, used-rolex, rolex-submariner",
 "alias_list": null,
 "email_address": "sales@bobswatches.com",
 "phone_number": "800-494-3708",
 "description": "Pre-Owned Rolex Watches",
 "created_at": "Tue Sep 04 14:58:57 UTC 2012",
 "updated_at": "Tue May 14 21:33:14 UTC 2013",
 "overview": "\u003Cp\u003EBob’s Watches is the World’s First and only Pre-Owned Rolex Exchange where consumers can buy, sell, and trade used Rolex watches at true fair market value.  We openly publish the current buy and sell values for each Rolex model allowing us to serve as an online marketplace for buyers and sellers looking, quite simply, to get the best deal.  We are devoted exclusively to only used Rolex watches and pride ourselves in obtaining the very best results possible for our customers.  Our business philosophy is built on trust and integrity and in a very short time we have become the leading online destination for used Rolex watches. And unlike other online watch companies, Bob’s carries an actual inventory of watches.  Every watch on our site is in stock ready for sale.\n Customer Service Is Our Main Mission\u003C/p\u003E\n\n\u003Cp\u003EUnlike many companies in search of maximizing a profit, our primary goal at Bob’s Watches is to create a trusted source to buy and sell pre-owned Rolex watches.  Ensuring a positive experience for you is our primary mission.  All of our certified, authentic Rolex watches have been carefully serviced and restored to mint condition. And while our business has grown rapidly over the past years, we hold strong to our commitment of offering the highest quality customer service.  Bob’s Watches is accredited by the Better Business Bureau with an A+ rating.\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003ESellers:  Rolex Sellers have just one simple goal:  to receive a fair price for their watch from a trusted buyer who will pay them in a timely manner. Since we post our buy and sell prices openly on the site, sellers can be assured they are getting full market value. Payment is wired the same day. \nBuyers:  All buyers are looking to purchase a genuine Rolex from a trusted reseller at the best price. To that end, we encourage our buyers to shop us on Google shopping to discover how good our pricing really is.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EMission Statement \u0026amp; Service Culture\u003C/p\u003E\n\n\u003Cp\u003EAdmired but not easily replicated, Bob’s is firmly grounded in our founding principles – in who we are and what our mission is.  Our goals and principles are guided by our devotion to creating the most trusted name in Pre-owned Rolex watches.  Bob’s Watches is based in Huntington Beach, California.  For more information, please call (800) 494-3708. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       69],
      "assets/images/resized/0026/2333/262333v1-max-150x150.png"],
     [[181,
       84],
      "assets/images/resized/0026/2333/262333v1-max-250x250.png"],
     [[181,
       84],
      "assets/images/resized/0026/2333/262333v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Greg",
      "last_name": "Greiner",
      "permalink": "greg-greiner",
      "image": null}},
   {"is_past": false,
    "title": "Chief Rolex Guru",
    "person":
     {"first_name": "Paul",
      "last_name": "Altieri",
      "permalink": "paul-altieri",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "15176 Goldenwest Street",
    "address2": "",
    "zip_code": "92683",
    "city": "Huntington Beach",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}