{"name": "Bombadil Publishing",
 "permalink": "bombadil-publishing",
 "crunchbase_url": "http://www.crunchbase.com/company/bombadil-publishing",
 "homepage_url": "http://www.bombadilpublishing.com",
 "blog_url": "http://www.bombadilpublishing.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 12,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "youth-to-youth-publishing, young-authors, poets, novelists, authors",
 "alias_list": null,
 "email_address": "marianne@bombadilpublishing.com",
 "phone_number": "",
 "description": "youth to youth publishing house",
 "created_at": "Thu Apr 23 10:54:03 UTC 2009",
 "updated_at": "Wed Nov 09 01:22:04 UTC 2011",
 "overview": "\u003Cp\u003EBombadil Publishing, a bright new light in a traditional world, is a youth-to-youth publisher, publishing the stories and delivering the messages that young people choose to read.\u003C/p\u003E\n\n\u003Cp\u003EThe success of Bombadil Publishing clearly shows that young people read more than ever and want to have a greater say in and influence over what they read. And it is their say, their dreams and their thoughts that sell books.\u003C/p\u003E\n\n\u003Cp\u003EArmed with a new freedom of expression, there seems to be no stopping the young authors and readers; they have created new avenues for marketing, new ways of getting their dreams heard, even new genres. Fairasy is one such new genre. It bridges the gap between fairy tales and fantasy, a softer and kinder form of storytelling.\u003C/p\u003E\n\n\u003Cp\u003EYoung people, from all corners of the world, have welcomed Bombadil Publishing\u0026#8217;s new approach to publishing, and have helped transform the small Swedish company into a fast growing international organisation. To keep up with the increasing demand for books and influx of authors joining the network, Bombadil Publishing is establishing its concept around the world by means of franchising. In November 2009 alone Bombadil Publishing expanded into 11 countries, including USA, UK, Mexico and Spain. In October 2010, there are Bombadil Authors in 94 countries, 22 titles published in Swedish(by Swedish authors), 10 titles in English(Mainly by Indian, UK and US authors), 14 titles in Spanish (by Latin American authors) and thousands more manuscripts in progress.\u003C/p\u003E\n\n\u003Cp\u003EBombadil Publishing is not only different in its choice of subjects, but also in the production and selling processes. The authors, who receive generous royalties, are involved from idea submission to finished product, ensuring that the books truly represent their stories, dreams and visions; the authors are also involved in the design process and marketing, giving them the added bonus of learning enterprise skills. The authors are also involved in selling, though the books are naturally sold via the webshop and selected traditional outlets as well.\u003C/p\u003E\n\n\u003Cp\u003EBy providing a global outlet for young people who want to read and write new and, for them, relevant books, Bombadil Publishing allows young people to retain their identity and individualistic approach to life while interacting with and growing from one of the world\u0026#8217;s oldest and most traditional industries. A specially designed IT platform gives authors and readers the possibility to interact, shaping the future of books, a future that is bright and beautiful, full of fresh energy and new opportunities.\u003C/p\u003E\n\n\u003Cp\u003EYouth-2-Youth publishing - rejuvenating an old tradition\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       56],
      "assets/images/resized/0004/2374/42374v2-max-150x150.png"],
     [[250,
       93],
      "assets/images/resized/0004/2374/42374v2-max-250x250.png"],
     [[350,
       131],
      "assets/images/resized/0004/2374/42374v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Bombadil Publishing R\u0026D ",
    "address1": "Ordman House",
    "address2": "31 Arden Close",
    "zip_code": "BS32 8AX",
    "city": "Bradley Stoke Bristol",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 59.5068147,
    "longitude": 14.9716018}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.prnewswire.com/mnr/bombadilpublishing/36189/",
    "title": ""}]}