{"name": "Boole Server",
 "permalink": "boole-server-2",
 "crunchbase_url": "http://www.crunchbase.com/company/boole-server-2",
 "homepage_url": "http://www.booleserver.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "booleserver",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "encryption, dlp, drm, security, confidential-data, sharing, audit, auditing, protection, data-leakage, data-rights-management",
 "alias_list": null,
 "email_address": "sales@booleserver.com",
 "phone_number": "+39 02 8738 3213",
 "description": "Security \u0026 sharing platform",
 "created_at": "Tue Nov 20 15:51:19 UTC 2012",
 "updated_at": "Wed Nov 21 08:34:24 UTC 2012",
 "overview": "\u003Cp\u003EBoole Server is an Independent Software Vendor in the data protection and sharing field.\u003C/p\u003E\n\n\u003Cp\u003EBoole Server is an innovative, secure and scalable system designed to persistently (at rest, in transit and in use) safeguard any sensitive data through military-grade encryption and protection, while allowing them to be shared with / accessed by whom (both internal and external users), how (any device, incl. iPhone and iPad) and when (incl. offline) needed. In particular, Boole Server data-centric technology allows to apply dynamic and granular DRM and policy enforcement.\u003C/p\u003E\n\n\u003Cp\u003EBoole Server is a multi-award winning solution, including the 2012 SC Awards for Best Encryption solution and Best DLP solution, White Bull Awards and Gartner Cool Vendor.\u003C/p\u003E\n\n\u003Cp\u003EHeadquartered in Milan (Italy) with offices in 6 countries, Boole Server is currently distributed in over 30 countries through a fast growing partners’ network.\u003C/p\u003E\n\n\u003Cp\u003EBoole Server boasts a vast portfolio of blue chip customers worldwide with tens of thousands of users across the most diverse industries.\u003C/p\u003E\n\n\u003Cp\u003EPlease visit our website www.booleserver.com for more information. In particular, a 2 minutes video as well as various available online documents will provide you with a great summary overview of our solution’s capabilities. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.gartner.com/id=1353119",
    "title": "Boole Server named Cool Vendor by leading analyst firm Gartner Inc."},
   {"external_url": "http://www.scawardseurope.com/2012-winners",
    "title": "Boole Server is a winner at the SCMagazine 2012 Awards for best Encryption and DLP solution"}]}