{"name": "Boost Social Media",
 "permalink": "boost-social-media",
 "crunchbase_url": "http://www.crunchbase.com/company/boost-social-media",
 "homepage_url": "http://boostsocialmedia.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "boostsocialmed",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "buy-facebook-fans, get-facebook-fans, buy-facebook-likes, facebook, geo-targeted-fans, geo-targeted-facebook-likes, geo-targeted-google-1s, buy-twitter-followers, followers, tweet-adder, get-twitter-followers--get-followers, google-plus, google-1, buy-you",
 "alias_list": null,
 "email_address": "sales@boostsocialmedia.net",
 "phone_number": "",
 "description": "Buy Social Media Fans",
 "created_at": "Mon Jun 25 02:20:06 UTC 2012",
 "updated_at": "Mon Jun 25 20:49:40 UTC 2012",
 "overview": "\u003Cp\u003EBoost Social Media is a unique, innovative Social Media Marketing company. Through Boost Social Media, you can generate new 100% real targeted followers/fans/views in a single order for your Facebook, Twitter, Google+, Pinterest and even your YouTube accounts. \u003C/p\u003E\n\n\u003Cp\u003EThe benefit of ordering with Boost Social Media is that they will direct genuine, real followers to your account. There are no bots, proxies, or follow-back links utilized. Rather they lean on our massive network to broadcast your individual or company’s social media account to millions of online users. This ensures that you will only receive real likes,views and followers. Furthermore, your audience can be USA targeted or Globally Targeted. All marketing strategies used by BSM are 100% legal and safe. Your account will not be deactivated because of increased activity. They don’t require any of your personal information, like passwords. Rather, they just require your social media url and a secure payment via paypal to get your project started. Of course, they offer a 100% money back guarantee on orders that are not completed. Rest assured, however, that BSM has always completed every order and has thousands of satisfied customers throughout the world (some very famous artists, musicians, actors, and public figures…but they do not share customer details with anybody!). This is your online source to buy likes, get followers, buy you tube views, buy google plus one votes, and buy pinterest followers. Furthermore, if you want to join the BSM team by reselling their services, you may do so by contacting their sales department.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0019/7039/197039v2-max-150x150.png"],
     [[250,
       40],
      "assets/images/resized/0019/7039/197039v2-max-250x250.png"],
     [[450,
       73],
      "assets/images/resized/0019/7039/197039v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://boostsocialmedia.net/whybsm",
    "title": "Why Buy from BSM?"}]}