{"name": "Borneosoft",
 "permalink": "borneosoft",
 "crunchbase_url": "http://www.crunchbase.com/company/borneosoft",
 "homepage_url": "http://www.borneosoft.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "borneosoft",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "crm-hosted-crm-web-based-sales-automation-sales-contact-calendar-chart",
 "alias_list": null,
 "email_address": "support@borneosoft.com",
 "phone_number": "",
 "description": "Easy to use, web based CRM",
 "created_at": "Wed Oct 28 00:47:47 UTC 2009",
 "updated_at": "Sat Dec 17 06:47:40 UTC 2011",
 "overview": "\u003Cp\u003EEasy to use, web based CRM solution for contact, calendar and sales management.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EContact Management\nBorneosoft CRM uses indexing technology similar to the one used by popular web search engine. Searching any contact, calendar or any sales data is as fast as searching in web search engine. The search engine accepts queries as a simple text. Words may be phrases that are delimited by quotation marks (\u0026#8220;) to find exact match. They may also be field terms such as firstname:john. Field terms can be combined to form more advanced search such as firstname:john lastname:doe to search contacts with first name john or last name doe. If the search result must  have the specified field term, a plus sign (+) prefix is added to the field term.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EIn addition to personal information, important dates can be stored in contact details. Personalized email can be sent to contact few days before the date. Or, email reminder about the dates can be sent to you. All is done automatically for you.\u003C/p\u003E\n\n\u003Cp\u003EContact photos may also be added to the contact details. Important documents can also be attached to the contact details.\u003C/p\u003E\n\n\u003Cp\u003EContacts can be attached to Leads or Opportunities. Contacts can also be included as participants in an event. Quotations use contacts\u0026#8217; details to fill up the recipients\u0026#8217; detail. You use the email address in the contact when you select recipients for your emails.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ECalendar Management\nCalendar management includes event and task management. Scheduled events can be created either as a one-off event or recurring event. The recurring events can be scheduled as daily, weekly, monthly or yearly events.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EMany types of event scheduling are provided for you to conveniently schedule your events or meetings. You can create a daily event that happens every x days or every weekday. Weekly event can happen at any day (or days) of the week for every x week. Monthly event can be set as \u0026#8220;The day x of every y month\u0026#8221;. Monthly event can also be set as \u0026#8220;The (first, second, third, fourth, last) (day, weekday, weekend day, Sunday-Saturday) of every x month\u0026#8221;. Yearly event can be set as \u0026#8220;Every (January, February, \u0026#8230;, December) x-th\u0026#8221;. It can also be set as \u0026#8220;The (first, second, third, fourth, last) (day, weekday, weekend day, Sunday-Saturday) of (January, February, \u0026#8230;, December).\u003C/p\u003E\n\n\u003Cp\u003EFor every scheduled event, you can set the starting date and how the schedule ends. The schedule can run continuously, i.e., no ending, run for x times, or it can end on certain date. You can also set an email reminder to be sent at certain point of time.\u003C/p\u003E\n\n\u003Cp\u003EYou can invite participants from your contacts or users in your company to attend a meeting or an event. Email invitation will be sent automatically to all participant at set date and time. The participants will have the opportunity to indicate their attendance by clicking a URL link in the email they receive. The response is automatically captured and displayed for your convenience.\u003C/p\u003E\n\n\u003Cp\u003EIn addition of viewing the events as a list, the list can be viewed in day view, working days view, week view, month view or year view.\u003C/p\u003E\n\n\u003Cp\u003EEvents can be created as part of Leads or Opportunities. Documents related to an event can be easily attached to the event details.\u003C/p\u003E\n\n\u003Cp\u003EYou can record your tasks and set the email reminder to be sent at certain point of time. The email reminder can be sent at some interval before or after the start date or the due date of the task. Or, it can be sent on a specific date. The email reminder can be sent for a number of times when necessary. Documents related to a task can be easily attached to the task details.\u003C/p\u003E\n\n\u003Cp\u003ECharts related to the tasks can be generated easily. The charts are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Aggregated number of days spent for all tasks for each task priority (low, normal, or high). The result is represented as bar chart or pie chart.\n* Aggregated number of days spent for all tasks for each task status (not started, in progress, completed, waiting for someone else, or deferred). The result is represented as bar chart or pie chart.\n* Number of tasks for each task status or priority.\n* Number of tasks for each task status or priority by month or by day. The result is represented in time series.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EThe charts are in PNG format that can be saved and embedded in document easily.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ESales Management\nSales Lead can be created to initiate the sales process. Contacts can be added to a lead. If necessary, the role of the contact in the lead (contact person, decision maker, etc.) can be specified. You can then set its status (prospecting, qualified, or disqualified) and rating (hot, warm, or cold). The industry type of the lead and the source where the lead comes from can also be set.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EEvents such as meetings or appointments and tasks can be added to the lead. Documents and notes can also be included in the lead with ease.\u003C/p\u003E\n\n\u003Cp\u003EWhen the lead is qualified, the lead can be converted to opportunity. The opportunity will retain the contacts and their role in the lead.\nCharts to measure some of the lead\u0026#8217;s attribute can be generated easily in PNG format. The charts are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Lead conversion by month.\n* Aggregated number of days spent for all leads for each lead status (prospecting, qualified, or disqualified). The result is represented as bar chart or pie chart.\n* Number of leads for each status, rating, industry type, or source. The result is represented as bar chart or pie chart.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EIn addition to lead list view, contacts in the lead can also be shown in the expanded list, making it easier to find the contacts for the lead.\u003C/p\u003E\n\n\u003Cp\u003EYou can search the lead using any field of the lead. Searching can also be done to find contacts in the lead. For example, entering \u0026#8220;decision maker\u0026#8221; in the search phrase will find all contacts in the lead that have role as decision maker. It\u0026#8217;s that easy.\u003C/p\u003E\n\n\u003Cp\u003ESales process is captured in Opportunity. Sales stage can be set as the sales progresses. Each sales stage has a corresponding probability for winning the sales. The sales stages, with the probability in the bracket, are: Qualified (10%), Needs Assessment (20%), Solution Evaluation (30%), Proposal (50%), Purchasing Decision (70%), Refine Solution (80%), Verbal Agreement (90%), Purchase Order (100%), Lost (0%), Canceled (0%), and Suspended (0%). The probability of each stage can be set manually when necessary.\u003C/p\u003E\n\n\u003Cp\u003EThe expected revenue can be entered manually or it can be calculated automatically from the total price of the included products. The estimated revenue is calculated automatically by multiplying the expected revenue and the probability. The sales forecast can be made from the sum of estimated revenue from all opportunity. A chart can be generated to show the sales forecast over time.\u003C/p\u003E\n\n\u003Cp\u003EYou can also set its rating (hot, warm, or cold) and the source where the opportunity comes from. These two properties are copied from the lead when the lead is converted to an opportunity.\u003C/p\u003E\n\n\u003Cp\u003EProducts pricing can be set in the opportunity. It allows product discount, adding margin, or setting volume based pricing. Quotation can be generated at any point of time with the line items extracted from the included products.\u003C/p\u003E\n\n\u003Cp\u003EEvents such as meetings or appointments, tasks, documents and notes can be added to the opportunity. This opportunity related information can easily be found and viewed in the opportunity details. In addition, company details about the suppliers, manufacturers, or even the competitors can be easily added to the opportunity details.\u003C/p\u003E\n\n\u003Cp\u003ECharts related to opportunity can be generated to get an overview of the sales process and its performance. Charts related to individual opportunity are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Expected and estimated revenue over time.\n* Sales stage Gantt Chart.\n* Working days or calendar days spent on each sales stage.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ECharts related to all opportunities are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Aggregated number of days spent for all opportunities for each sales stage.\n* Number of opportunities for each source, rating, or sales stage. The result is represented as bar chart or pie chart.\n* Number of opportunities for each sales stage by month or by day. The result is represented in time series.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Col\u003E\n\u003Cli\u003EProduct Management\nProduct details accept pricing information such as unit price or cost, discount, margin, mark-up, or fixed price. In addition, it also allows volume-based pricing.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EIf needed, product availability can be tracked by entering the stock number into product details. As products are added to opportunity, the availability will be reduced accordingly.\u003C/p\u003E\n\n\u003Cp\u003EPricing information can be locked such that users (sales personnel) can not change the product pricing. Otherwise, users can change the product discount, margin, mark-up or fixed price.\u003C/p\u003E\n\n\u003Cp\u003ESupplier and manufacturer of the product can also be entered into product details.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EAuto Creation of Quotation\nQuotation can be easily generated any time from an opportunity. Quotation uses the products included in the opportunity as its line items. In addition to pricing information, line items also have some settings that controls the generated quotation. Line item can be set as an optional item or not visible in the generated quotation. Line item has also some adjustment such as extra charge (fixed amount or percentage of line item sub total), discount, or handling charge. The adjustment can be shown or made not visible in the generated quotation. Each line item\u0026#8217;s delivery date can also be set if necessary.\nIn addition to product line items, comments, sub total or accumulated sub total can also be inserted into the quotation. Sub total or accumulated sub total will be calculated automatically.\nOther information in the quotation such as the recipient of the quotation, can be easily extracted from the data that is already available in the opportunity.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EQuotation can be generated as PDF file with ease and it is automatically stored for future reference.\u003C/p\u003E\n\n\u003Cp\u003EThe quotation format can be changed by editing its style-sheet. Changes can be made to individual quotation or to company quotation style-sheet.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003ECharts\nCharts are provided as bar chart, pie chart, Gantt chart or time series. For the time series chart, the time interval can be set to built-in intervals according to the financial year of the selected country. The built-in intervals are:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003ECurrent, Last, or Next Fiscal Year (annually or quarterly)\u003C/li\u003E\n\u003Cli\u003ELast or Next 5 Fiscal Year (annually or quarterly)\u003C/li\u003E\n\u003Cli\u003ECurrent, Last, or Next Fiscal Quarter\u003C/li\u003E\n\u003Cli\u003ELast or Next 4 Fiscal Quarter\u003C/li\u003E\n\u003C/ul\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EBesides the built-in interval, user can set the interval to any dates. The charts are in PNG format that can be saved and embedded in document easily.\u003C/p\u003E\n\n\u003Cp\u003EChart related to the company is number of company for each industry.\nCharts related to the tasks are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Aggregated number of days spent for all tasks for each task priority (low, normal, or high). The result is represented as bar chart or pie chart.\n* Aggregated number of days spent for all tasks for each task status (not started, in progress, completed, waiting for someone else, or deferred). The result is represented as bar chart or pie chart.\n* Number of tasks for each task status or priority.\n* Number of tasks for each task status or priority by month or by day. The result is represented in time series.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ECharts to measure some of the lead\u0026#8217;s attribute are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Lead conversion by month.\n* Aggregated number of days spent for all leads for each lead status (prospecting, qualified, or disqualified). The result is represented as bar chart or pie chart.\n* Number of leads for each status, rating, industry type, or source. The result is represented as bar chart or pie chart.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ECharts related to opportunity can be generated to get an overview of the sales process and its performance. Charts related to individual opportunity are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Expected and estimated revenue over time.\n* Sales stage Gantt Chart.\n* Working days or calendar days spent on each sales stage.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ECharts related to all opportunities are:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Aggregated number of days spent for all opportunities for each sales stage.\n* Number of opportunities for each source, rating, or sales stage. The result is represented as bar chart or pie chart.\n* Number of opportunities for each sales stage by month or by day. The result is represented in time series.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Col\u003E\n\u003Cli\u003ETeam Management\nData can be shared among the users in the same company by creating teams. Each user in the team has a role as a member, a manager or both. Different permission can be set for member or manager role. Different permission can also be set for different applications.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EThe manager can see the performance of his/her sales team easily using the aggregate data of all the users in the team.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EMail, Notes and Document\nBorneosoft Mail supports Rich Text Web Based email editor. It features anti virus and anti spam engine that reduce unsolicited emails in your inbox. Searching inside the email contents is supported. Search query can be a simple text or a phrase. Words may be phrases that are delimited by quotation marks (\u0026#8220;) to find exact match. They may also be field terms such as subject:meeting. Field terms can be combined to form more advanced search such as +subject:meeting +sendername:john to search email from John about the meeting.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EDocuments or other emails can be easily attached to the email.\u003C/p\u003E\n\n\u003Cp\u003ENotes also supports Rich Text Web Based editor. Notes can be attached to Lead or Opportunity.\u003C/p\u003E\n\n\u003Cp\u003EDocuments can be attached to email, event, task, company details, contact, lead, opportunity, account and product. Documents can be put into public folder allowing your customers to download the documents without logging on. There is also public folder that your customer can download documents with ease.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EBlog\nCommunicating your products and services is absolutely essential for your business\u0026#8217;s success. Borneosoft Blog allows you to discover the powerful possibilities blogging offers your business. It can impact your bottom line and it can bring in customers and affect mindshare.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EVisibility is very important in marketing. Making people aware of your products and services has to be done effectively and efficiently. Blogging will help you to create a global message to which individual customer will respond. It allows you to share your products features, functions and benefits to your customers or would be customers. From their comments you can gather feedback and make sure that your product offering meet the needs of your customers.\u003C/p\u003E\n\n\u003Cp\u003EBorneosoft Blog (BorneoBlog) is easy to use and is part of our offering without extra cost.\u003C/p\u003E\n\n\u003Cp\u003EBorneoBlog supports rich text editing of your blog. You can publish it immediately or you can publish it at certain date and time. You can allow comment to be entered by viewer and you can also limit the number of days the comment is allowed to be entered. All comments are moderated. You can easily approve the comments, delete them or flag the comments as spams.\u003C/p\u003E\n\n\u003Cp\u003ETo make your blog more expressive, BorneoBlog  allows you to upload media files such images or podcasts. You can easily add the media files into your blog.\u003C/p\u003E\n\n\u003Cp\u003EBorneoBlog also tells you where your weblog\u0026#8217;s hits are coming each day. BorneoBlog also makes it easy to maintain a blogroll, that is, a list of your favorite weblogs and web sites that is displayed in the sidebar of your weblog. BorneoBlog  includes support for podcasting, a way to distribute files through your weblog\u0026#8217;s newsfeed. Feed is also supported. A feed is an XML representation of the most recent entries, comments or other data. Folks can subscribe to your feed to be alerted of new weblog entries and comments posted. BorneoBlog supports both RSS and Atom formats for feeds.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0006/3946/63946v4-max-150x150.png"],
     [[180,
       40],
      "assets/images/resized/0006/3946/63946v4-max-250x250.png"],
     [[180,
       40],
      "assets/images/resized/0006/3946/63946v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        82],
       "assets/images/resized/0006/3945/63945v2-max-150x150.png"],
      [[250,
        137],
       "assets/images/resized/0006/3945/63945v2-max-250x250.png"],
      [[450,
        247],
       "assets/images/resized/0006/3945/63945v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}