{"name": "Bosley Medical Beverly Hills",
 "permalink": "bosley-medical-beverly-hills",
 "crunchbase_url": "http://www.crunchbase.com/company/bosley-medical-beverly-hills",
 "homepage_url": "http://www.bosleymedicalbeverlyhills.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hair-transplant, hair-restoration, bosley-medical",
 "alias_list": null,
 "email_address": "bosleymedical123@gmail.com",
 "phone_number": "(800) 474-1254",
 "description": "Bosley Medical",
 "created_at": "Wed Oct 10 09:47:18 UTC 2012",
 "updated_at": "Wed Apr 03 17:21:36 UTC 2013",
 "overview": "\u003Cp\u003EBosley Medical is an international hair restoration company. Since 1974, it has catered to patients from around the world that suffer from hair loss and balding. With state-of-the-art facilities, and an experienced team of committed medical experts and staff, Bosley Medical is a pioneer in the field of hair restoration treatment.\nFounded by Dr. L. Lee Bosley (M.D.) in 1974, Bosley Medical has always taken an innovative approach to hair restoration. Under the guidance of Dr. Bosley, Bosley Medical has performed over 230,000 hair restoration procedures on people who have suffered from progressive baldness and hair loss.  Each patient has their personal hair restoration counselor who answers all patient questions and concerns, as well provides all the information regarding a hair transplantation procedure, including typical recovery time, cost, and financing options. With over 38 years of experience, Bosley has carved a niche of its own in the medical field, and is the most experienced hair restoration expert across the globe. \nThe corporate headquarters of Bosley Medical is located in Beverly Hills, Los Angeles, just a stone’s throw from the well-known Rodeo Drive and Hollywood.  Being in the heart of Los Angeles, Bosley’s Los Angeles headquarters is affiliated with famous hotels, restaurants and points of attractions, where patients arriving from across the world can spend time. This location serves as the headquarters for both the international hair restoration company, as well as the local regional surgical office for Southern California. A team of well-trained staff of medical assistants and nurses look after each patient with equal care and attention. There are penthouses facilities available in the headquarters, offering world-class patient care. Bosley provides treatment in facilities using the latest technologies in a comfortable environment.  There are four resident board-certified surgeons in this location, who have treated celebrities from the worlds of entertainment, politics and sports.\nBosley has offices in all over the world, including the United States, Canada, Mexico, Shanghai and Singapore.  The treatment at each location is a proper blend of excellent medical services and personalized care for patients. While the hair restoration technique is unique for each location, the uniformity of the surgical results is at the same high quality for all regional offices.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       23],
      "assets/images/resized/0021/4992/214992v2-max-150x150.png"],
     [[250,
       38],
      "assets/images/resized/0021/4992/214992v2-max-250x250.png"],
     [[336,
       52],
      "assets/images/resized/0021/4992/214992v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}