{"name": "Bosley Medical Dallas",
 "permalink": "bosley-medical-dallas",
 "crunchbase_url": "http://www.crunchbase.com/company/bosley-medical-dallas",
 "homepage_url": "http://www.bosleymedicaldallas.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "BosleyMedical",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hair-loss-treatment, hair-loss-restoration, hair-loss-solutions, hair-transplantation",
 "alias_list": null,
 "email_address": "",
 "phone_number": "214-559-4447",
 "description": "Bosley is a leader in hair loss solution",
 "created_at": "Fri Dec 28 07:37:04 UTC 2012",
 "updated_at": "Mon Apr 15 12:06:28 UTC 2013",
 "overview": "\u003Cp\u003EBosley is a leading provider of hair restoration and transplantation solutions across the world.  The team of hair experts, along with the assistance of a well-trained staff, uses the latest state-of-the-art techniques to yield the most natural looking hair transplant and hair restoration results.   Bosley has almost 39 years of experience in hair restoration and hair transplantation. The team at Bosley has performed over 230,000 hair restoration procedures on men and women, from more than 60 different nations. Headquartered in Los Angeles, its offices are located all over the world, including Canada, Mexico, China and Singapore.\nBosley Medical Dallas, located in one of the most popular areas of Texas, treats its patients for balding and thinning hair. Hotels in the area have partnerships with Bosley’s Dallas clinic for lodging and accommodation. \nWhen determining the best hair restoration plan for individual patients, the factors Bosley takes into consideration are: patient age, facial structure, existing hairline, quality of hair and long-term effective results for respective hair-texture.  Just like every Bosley office located across the world, the staff provides personalized services to each patient.  Through an advanced methodology known as follicular unit transplantation and the increasingly popular follicular unit extraction, the patient is treated on the basis of availability of donor area of hair, which can be transplanted to create a whole new hairline. Hair transplantation is a natural process that utilizes patient’s own hair, where the hair growth is permanent and immune to further genetic loss.  Hair transplantation, by FUT or FUE methods, is the only known permanent and most effective treatment for hereditary hair-loss and thinning. Countless reviews of Bosley hair restoration procedures have positive results. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0022/7185/227185v2-max-150x150.jpg"],
     [[250,
       66],
      "assets/images/resized/0022/7185/227185v2-max-250x250.jpg"],
     [[450,
       119],
      "assets/images/resized/0022/7185/227185v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Bosley Medical Dallas",
    "address1": "5949 Sherry Lane, Suite 1150",
    "address2": "",
    "zip_code": "75225",
    "city": "Dallas",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.bosleymedicaldallas.com/",
    "title": "Bosley Medical Dallas"}]}