{"name": "Boston New Tech Meetup",
 "permalink": "boston-new-tech-meetup",
 "crunchbase_url": "http://www.crunchbase.com/company/boston-new-tech-meetup",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Sun Apr 21 14:32:00 UTC 2013",
 "updated_at": "Fri Jun 07 03:45:18 UTC 2013",
 "overview": "\u003Cp\u003EBoston New Technology is a forum for entrepreneurs, developers and technology enthusiasts to present and discover new technology products, get feedback from early adopters, form partnerships, share ideas and get inspiration to start new ventures. We facilitate and promote networking and collaboration among innovators, investors and supporters from all around New England and beyond.\u003C/p\u003E\n\n\u003Cp\u003EWe showcase what\u0026#8217;s new and cool with startups and technology from the Boston area. Our presenters demonstrate their technology and then take questions from the audience. Network with the Boston startup community, including executives, marketers, designers, developers and technology enthusiasts! Our free events usually offer dinner and beverages.\u003C/p\u003E\n\n\u003Cp\u003ESee local startups and associated hacker types in action! Marvel at the latest in cool technology! Watch some slide decks and pass around a mic to ask questions!\u003C/p\u003E\n\n\u003Cp\u003EWe mostly showcase early stage companies as presenters, but sometimes have more established companies with new tech products. We\u0026#8217;re aiming to give them exposure and traction to a tech-savvy public, as well as potential clients, employees, or even investors. We\u0026#8217;d also like to encourage community-building among local tech practitioners and provide inspiration and networking opportunities in a fun and informal way.\u003C/p\u003E\n\n\u003Cp\u003EWe have 3,700+ members who are primarily Boston-area professionals of all ages, with most between 22 and 50 years old. Most members are entrepreneurs, startup employees and others who work in technology and/or provide services to technology companies.\u003C/p\u003E\n\n\u003Cp\u003EWe seek sponsors and presenters!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Organizer, Director",
    "person":
     {"first_name": "Vivjan",
      "last_name": "Myrto",
      "permalink": "vivjan-myrto",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}