{"name": "Box Office Brands",
 "permalink": "box-office-brands",
 "crunchbase_url": "http://www.crunchbase.com/company/box-office-brands",
 "homepage_url": "http://www.boxofficebrands.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 15,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "product-placement, entertainment-advertising, marketing",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Product Placement and Brand Integration ",
 "created_at": "Thu Feb 17 21:57:23 UTC 2011",
 "updated_at": "Sat Feb 19 02:15:38 UTC 2011",
 "overview": "\u003Cp\u003EBox Office Brands is an affordable online portal that connects marketers with content producers to facilitate brand integration and product placement deals.  \u003C/p\u003E\n\n\u003Cp\u003EBox Office Brands takes the hassle and headache out of product placement and brand integration deals by bringing both parties to one collaborative location online, at an affordable price.  Companies may post an unlimited number of proposed sponsorship deals and content producers may quickly and efficiently browse, search and find opportunities that meet their specific criteria.   Both parties may post profiles and take advantage of our sophisticated online collaborative tools.  \u003C/p\u003E\n\n\u003Cp\u003EWhile product placements are highly beneficial to both marketers and content producers, these transactions traditionally require significant resources to accomplish, as discovering opportunities to evaluating, negotiating and implementing opportunities once found, has been a time and resource intense endeavor for both brands and content producers. \u003C/p\u003E\n\n\u003Cp\u003EBox Office Brands does the leg work in attracting and retaining brands and content producers to ensure the portal has value to all members.  Our members no longer spend valuable time and resources hunting down high quality product placement or brand integration transactions and are instead able to focus on their core business or project.    \u003C/p\u003E\n\n\u003Cp\u003EWe provide great value for our marketers and content producers.  Unlike our competitors, who charge hundreds of dollars per month per user or thousands of dollars per project,  we offer our service to content producers for free and to marketers for a nominal annual or monthly fee.    \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0012/2662/122662v2-max-150x150.png"],
     [[250,
       62],
      "assets/images/resized/0012/2662/122662v2-max-250x250.png"],
     [[280,
       70],
      "assets/images/resized/0012/2662/122662v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}