{"name": "Boxby",
 "permalink": "boxby",
 "crunchbase_url": "http://www.crunchbase.com/company/boxby",
 "homepage_url": "http://www.boxby.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "boxby",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "alistair-patterson, sandra-patterson, shipping, transport-services, ebay, transport, parcel, courier, van-services, uk, ebay-uk, uship",
 "alias_list": null,
 "email_address": "admin@boxby.co.uk",
 "phone_number": "+44 01465 715444",
 "description": "UK-based courier services",
 "created_at": "Mon Jun 21 17:28:33 UTC 2010",
 "updated_at": "Mon Jun 21 20:51:00 UTC 2010",
 "overview": "\u003Cp\u003EBoxby is a UK-based online shipping marketplace that connects customers with couriers and parcel carriers.\u003C/p\u003E\n\n\u003Cp\u003EBoxby works with over 2500 courier and parcel companies all over the UK to provide direct quotes for customer shipments. When customers register with Boxby.co.uk, they can submit transport jobs and receive dozens of competitive quotes for their business. Boxby is an excellent resource for eBay auction sellers and winners\u0026#8211; whether the item is large or small.\u003C/p\u003E\n\n\u003Cp\u003EBoxby is the inspiration of Alistair and Sandra Patterson, who have been in the antiques and furniture business for more than 20 years.\u003C/p\u003E\n\n\u003Cp\u003EFor many years, Alistair and Sandra Patterson traded successfully on the internet as Lochryan Furniture Store, selling through their own web site and on eBay. The items sold in nearly all instances were too large, too valuable or too heavy to post, so Alistair and Sandra started their own delivery business. Their delivery service grew quickly as they found other eBay traders who had a similar demand.\u003C/p\u003E\n\n\u003Cp\u003EThe delivery service they created was different from other couriers in a number of ways. Firstly, in most instances customers were not looking for the quickest delivery, but often the most affordable. Many items delivered for eBay traders were items that had been purchased at very reasonable prices, and the last thing that either the buyer or the seller wanted was a hefty delivery charge. Secondly, most eBay buyers and sellers worked, and they didn\u0026#8217;t want to take a day off work to be home for a delivery. And thirdly, they wanted someone who could carry their item safely and reliably, properly strapped and secured in the van, and carried by people experienced in moving furniture and heavy items.\u003C/p\u003E\n\n\u003Cp\u003EThe Pattersons looked at customers\u0026#8217; needs from the viewpoint of the self-employed van operator. Changing economic factors and dramatic increases in UK fuel charges highlighted that it was uneconomical to drive empty vans around the country.\u003C/p\u003E\n\n\u003Cp\u003EBoxby directly addresses the demand for deliveries that don\u0026#8217;t fit in a box. Futhermore, Boxby also provides a valuable resource for couriers and van services that must maximize the use of their vans. Putting the two groups together is the ideal solution\u0026#8211; this is what Boxby does.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       98],
      "assets/images/resized/0009/1281/91281v1-max-150x150.png"],
     [[210,
       138],
      "assets/images/resized/0009/1281/91281v1-max-250x250.png"],
     [[210,
       138],
      "assets/images/resized/0009/1281/91281v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition":
  {"price_amount": null,
   "price_currency_code": "USD",
   "term_code": null,
   "source_url": "http://techcrunch.com/2010/06/22/uship-acquires-uk-courier-marketplace-boxby/",
   "source_description": "UShip Acquires UK Courier Marketplace Boxby",
   "acquired_year": 2010,
   "acquired_month": 6,
   "acquired_day": 22,
   "acquiring_company":
    {"name": "uShip",
     "permalink": "uship",
     "image":
      {"available_sizes":
        [[[120,
           75],
          "assets/images/resized/0000/2035/2035v1-max-150x150.png"],
         [[120,
           75],
          "assets/images/resized/0000/2035/2035v1-max-250x250.png"],
         [[120,
           75],
          "assets/images/resized/0000/2035/2035v1-max-450x450.png"]],
       "attribution": null}}},
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "93 Torcy Drive",
    "address2": "Girvan",
    "zip_code": "KA26 0EU",
    "city": "Ayrshire",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}