{"name": "Brand Wagon",
 "permalink": "brand-wagon",
 "crunchbase_url": "http://www.crunchbase.com/company/brand-wagon",
 "homepage_url": "http://www.indiamart.com/brandwagon/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-cards, pamphlets, catalogs",
 "alias_list": null,
 "email_address": "brandwagon@tradepassport.org",
 "phone_number": "9810555367 ",
 "description": "supplier of an excellent quality array o",
 "created_at": "Fri May 03 08:05:13 UTC 2013",
 "updated_at": "Mon May 06 05:46:15 UTC 2013",
 "overview": "\u003Cp\u003EIt is said that one life is not enough for those with a spirit of winning. At BRAND WAGON every customer is special. We know that within you there is an individual who has unique demands, hopes and dreams. Someone who is one of a kind. That is why we offer you personalized solutions to meet with your unique business needs. Explore the true potential with BRAND WAGON with the state-of-art technology that is superior in its class; you can get unparalleled services right on time. We realize your needs and understand you and your priorities.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nPrinted Products\nPhoto Lab Solutions\nCorporate Gifts\nThree D Stickers\u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nHaving behind us the producing masses of innovative ideas to provide creative products. Brand Wagon brings you the largest range of products for all your needs of printing, marketing and brand promotion so that you can select products of your choice and requests a quote with utmost ease and comfort.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nIt is said that one life is not enough for those with a spirit of winning. At BRAND WAGON every customer is special. We know that within you there is an individual who has unique needs, hopes \u0026amp; dreams. Someone who is one of a kind. That is why we offer you personalized solutions to meet unique your unique business needs.  Explore the true potential with BRAND WAGON with the state-of-art technology that is superior in its class; you can get unparalleled services right on time.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a diligent team of professionals who help in manufacturing and supplying superior quality range of corporate gifts and printed products. Our professionals help us in manufacturing premium quality range of products as per the exact requirements of our clients. Further, our team members are well-aware of current technological advancement, which helps us to manufacture our product range as per the international quality standards.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}