{"name": "Brand Unique",
 "permalink": "brand-unique",
 "crunchbase_url": "http://www.crunchbase.com/company/brand-unique",
 "homepage_url": "http://www.indiamart.com/brandunique/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "brandunique@tradepassport.org",
 "phone_number": "9789819802",
 "description": "manufacturer, exporter and supplier",
 "created_at": "Fri Apr 05 16:18:08 UTC 2013",
 "updated_at": "Fri Apr 05 16:18:10 UTC 2013",
 "overview": "\u003Cp\u003EBeing an esteemed organization, Brand Unique is engaged in manufacturing, exporting and supplying of Knitted T-Shirts, Men\u0026#8217;s T-Shirts, Kids Wear, Bath Robes, Leggings, Hospital Pillows, Table Cloths, Aprons, Pillow Cases, Duvets, Cushions, Curtains, Jute Bags, Gift Bags, Hand Bags, Soft Toys, Flowers and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality has always been the top priority for our organization and that has helped us to evolve as one of the authentic, manufacturer, supplier and exporter of top notch quality products. Stringent quality parameters are followed at every stage of production from manufacturing to packaging.  We have installed advanced testing facilities to check the product range on varied parameters and to assure the delivery of quality tested products. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a sophisticated infrastructural facility that spreads over a large area and allows us to boast about our high production capacity.  Our infrastructure comprises weaving \u0026amp; tufting, dyeing \u0026amp; processing and stitching department that ensure trouble free functioning of all the operations. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nSince inception, we have been striving extremely hard to work towards the attainment of complete customer satisfaction. Our dexterous team comprises skilled professionals who have rich experience in their area domain and are committed towards the production of aesthetic and quality approved products. We offer customized solutions to our customers, thereby securing maximum customer benefits and reaping heavy profits.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are amongst the prominent manufacturers, exporters and suppliers of a consortium of products that are in conformation with the industry standards. Our quality driven approach and ethical business policies have made us to earn the valuable trust and the confidence of the customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       142],
      "assets/images/resized/0024/8886/248886v2-max-150x150.jpg"],
     [[190,
       180],
      "assets/images/resized/0024/8886/248886v2-max-250x250.jpg"],
     [[190,
       180],
      "assets/images/resized/0024/8886/248886v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}