{"name": "BRD Impex",
 "permalink": "brd-impex",
 "crunchbase_url": "http://www.crunchbase.com/company/brd-impex",
 "homepage_url": "http://www.indiamart.com/brdimpex/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "brdimpex@tradepassport.org",
 "phone_number": "9926880551",
 "description": "Manufacturers and suppliers ,",
 "created_at": "Fri Apr 05 12:19:13 UTC 2013",
 "updated_at": "Fri Apr 05 12:19:17 UTC 2013",
 "overview": "\u003Cp\u003EPlastic is a very versatile material, which can be molded and recycled easily. It is strong and durable, with additional properties such as high resistance for water and oil. So, we, \u0026#8220;BRD Impex\u0026#8221;, Trader, Manufacturer, Buyer and Seller high quality granules of various polymers. Owing to our vast expertise and dedication, we have become one of the leading manufacturers, traders and suppliers of the same. Our range of products include Pet Bottle Scrap Bale, LDPE Film Scrap, Pet Bottle Grade Resin 0.8 IV, Plastic Virgin Granules, Pet Flakes Hot Wash, Pet Flakes Unwash, Plastic Reprocess Granules, Mill Scale and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a diligent team of professionals, which is the driving force of our organization. It comprises of a qualified and experienced team of professionals who are well-versed with the process. They are committed towards offering the optimum quality products to our clients and also make sure that the range is delivered within the stipulated time frame. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality is the first and foremost aim of our company and therefore, we mainly focus on the quality of our entire range of products. In order to meet the various demands and needs of our esteemed clients, we procure the entire range from reliable vendors. Furthermore, our skilled quality experts properly test the range for various parameters to make sure a outstanding range of products.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a spacious state-of-the art-infrastructure and one of the largest manufacturing units in the country equipped with latest machinery and other equipments. We have a team of experienced professionals engaged in manufacturing of this products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nEver since our inception, we have laid utmost emphasis in attaining utmost satisfaction of the clients and establishing strong rapport with them. To attain the same, we ensure that clients receive products that are free from any kind of other material and accurate in weight. It is due to our ethical business practices and various other aspects that have helped us in becoming preferred choice of the patrons.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nPet Bottle Scrap Bale, LDPE Film Scrap, Pet Bottle Grade Resin 0.8 IV, Plastic Virgin Granules, Pet Flakes Hot Wash, Pet Flakes Unwash, Plastic Reprocess Granules, Mill Scale and many more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8640/248640v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8640/248640v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8640/248640v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}