{"name": "Bright Star Corporation",
 "permalink": "bright-star-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/bright-star-corporation",
 "homepage_url": "http://www.rmcbd.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "MohdAbdurRahma",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": 2008,
 "founded_month": 10,
 "founded_day": 12,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "defendable, reliable-and-always-with-you",
 "alias_list": null,
 "email_address": "bstarbd@gmail.com",
 "phone_number": "01713085971",
 "description": "",
 "created_at": "Sun Feb 27 13:44:08 UTC 2011",
 "updated_at": "Thu Mar 03 20:04:58 UTC 2011",
 "overview": "\u003Cp\u003EHome\u003C/p\u003E\n\n\u003Cp\u003EBright Star Corporation Ltd is well established, highly progressive and professionally managed company. Bright Star Corporation Ltd has been established in 2000 in Dhaka City, as a sole proprietorship, it\u0026#8217;s developed as partnership in 2008 and now we are serving to our valuable customers with two offices and three Royal showrooms in Peoples Republic of Bangladesh. The company brings its vast expertise to the Bangladesh with its wide range of products. Bright Star emphasis on top quality management makes it distinctly different from its competitors. The Management team is headed by Mr. Mohd. Abdur Rahman owing to his extensive experience, he possesses and instinctive awareness of pulse of the markets domestic and worldwide.\u003C/p\u003E\n\n\u003Cp\u003EBright Star Corporation Ltd is headquartered in Dhaka, Bangladesh and its current and planned activities extend throughout the Asian, Gulf countries the Middle East ,African and European countries.\u003C/p\u003E\n\n\u003Cp\u003EBright Star Corporation Ltd is well-known to offer products and high quality luxurious apartment with the best price / performance, reliable quality and admirable after-sales service as our mission is \u0026#8220;TO BE BETTER RATHER THAN BIGGER\u0026#8221;.\nOur Current Scope of Activities Include :\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EGeneral Trading in Globally as Exporter \u0026amp;amp; Importer and indenter with domestic trade.\nComputer accessories and Laptop.\nWireless internet service with Wi Fi HotSpot technology.\nExport Import of Garments items and Fabrics.\nImport Medical Products, Textiles,Carpet, Light Industrial products, products etc.\nLeather goods, Finished \u0026amp;amp; crust Leather.\nRaw Cotton ,Cotton yarn.\nProperty development, High Rise Buildings and Highly Luxurious Apartment.\nCommercial agencies and representation of reputed international companies worldwide.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EOur principle is to meet customers\u0026#8217; demand on product and price entirely. Great majority of customers are highly satisfied with our prices and super fast service. We have confidence to make our customers to have more benefits than other competitors could do.\u003C/p\u003E\n\n\u003Cp\u003EWe are capable of meeting all your needs, as we are backed and supported by professional experience and relations with many companies all over the globe and their agents in Bangladesh. We are a bridge between customers and suppliers facilitating good working relationships and mutual gain within the international world of supply and demand. Bright Star Corporation Ltd also connects with the full range of customers\u0026#8217; needs for good communication and efficient services from financial institutions, market analysis and trend monitoring. As an independent organization Bright Star Corporation Ltd can integrate and customize transactions between producers, buyers, sellers, and their support systems. We believe that our competitive advantage comes from our technological advance and our dynamic strategy. We are maintaining, as well, good relations with many shipping agencies and companies to deliver all your needs by sea or air in a quick and prompt manner.\u003C/p\u003E\n\n\u003Cp\u003EWe perform all our deals with dedication in a professional, competitive and loyalty manner.\u003C/p\u003E\n\n\u003Cp\u003EFinally, we welcome you to our website. Should you need further information regarding our full lines of different seasons, quotes \u0026amp; samples, lead-time and terms, please feel free to contact us.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[67,
       67],
      "assets/images/resized/0012/4170/124170v2-max-150x150.jpg"],
     [[67,
       67],
      "assets/images/resized/0012/4170/124170v2-max-250x250.jpg"],
     [[67,
       67],
      "assets/images/resized/0012/4170/124170v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}