{"name": "Bristol Studios",
 "permalink": "bristol-studios",
 "crunchbase_url": "http://www.crunchbase.com/company/bristol-studios",
 "homepage_url": "http://www.bristolstudios.com",
 "blog_url": "http://bristolstudios.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "bristol_studios",
 "category_code": "education",
 "number_of_employees": 15,
 "founded_year": 1986,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "recording-studio, artist-development, voice-lessons, voice-studio, management-company, bristol-studios, bristol-entertainment, bristol-voice-studios, bristol-recording-studios",
 "alias_list": null,
 "email_address": "info@bristolstudios.com",
 "phone_number": "617-247-8689",
 "description": "Recording and Voice Studio",
 "created_at": "Mon Jan 02 20:54:01 UTC 2012",
 "updated_at": "Tue Jan 03 13:34:49 UTC 2012",
 "overview": "\u003Cp\u003EBristol Entertainment is an Artist Development/Management Company located in the Back Bay in Boston with a new location Bristol Metro West in Worcester. Bristol Entertainment/Bristol Recording Studios is a busy, high performance studio known for its friendly and experienced staff. Services include: artist development, voice and performance training, dance classes, artist management and more.\u003C/p\u003E\n\n\u003Cp\u003ENew England\u0026#8217;s top Artist Development Company; Bristol has a 25 year history of helping artists acquire the skills and tools necessary to achieve their goals in the music industry. Bristol offers a unique and extensive list of services and training programs in all areas of vocal performance, artist and music career development which can’t be found anywhere else. The Bristol method of voice instruction is one of the few programs in the world that teaches the Pop/R\u0026amp;B/Rock Method designed for all forms of popular singing. This method offers all the tools used by today\u0026#8217;s top contemporary singers. Our exceptional staff provides artists with the essential skills to take them directly from standing on the sidelines to performing in the spotlight. Our focus is to equip the artist with the necessary tools to guarantee a lifelong career in the music industry. \u003C/p\u003E\n\n\u003Cp\u003EBristol\u0026#8217;s team has developed artists for Sony, DefJam/Mercury, Warner and Universal Records and has worked with some of the most influential producers and artists in the business including : Jada (Universal Motown), RedOne (New Kids On The Block, Michael Jackson), Yo Yo Ma (Sony), The Dropkick Murphys (Warner), New Kids On The Block (Interscope), Akon (Lady Gaga, Jada), Wyclef Jean, Swizz Beatz (Jay-Z, Alicia Keys), JR Rotem (Rihanna, Sean Kingston), Danja Handz, Madd Scientist,(Beyonce, Leona Lewis) Toby Gad (Beyonce, Fergie), The Insomniax and more. Bristol also offers private and group classes in audio recording and production and audio internships.\u003C/p\u003E\n\n\u003Cp\u003ECall the Boston location at 617.247.8689 for more information\nOr call the Worcester location at 774.275.0564 for info on Voice Lessons at Bristol Metro West!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "owner/senior producer",
    "person":
     {"first_name": "Ric",
      "last_name": "Poulin",
      "permalink": "ric-poulin",
      "image": null}},
   {"is_past": false,
    "title": "owner",
    "person":
     {"first_name": "Laura",
      "last_name": "Poulin",
      "permalink": "laura-poulin",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "back bay",
    "address1": "169 Massachusetts Ave",
    "address2": "",
    "zip_code": "02115",
    "city": "Boston",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}