{"name": "Brooklyn Lawyers Guide",
 "permalink": "brooklyn-lawyers-guide",
 "crunchbase_url": "http://www.crunchbase.com/company/brooklyn-lawyers-guide",
 "homepage_url": "http://www.brooklynlawyersguide.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "legal",
 "number_of_employees": 14,
 "founded_year": 2005,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "brooklyn, lawyer, lawyers, attorney, attorneys, law-firms",
 "alias_list": null,
 "email_address": "MediaOneNY@gmail.com",
 "phone_number": "718-423-2219",
 "description": "online guide to Brooklyn Lawyers",
 "created_at": "Sat Jan 22 06:05:19 UTC 2011",
 "updated_at": "Mon Jul 02 18:02:09 UTC 2012",
 "overview": "\u003Cp\u003EThis web site was specifically designed so that you are never more than \u0026#8220;one click\u0026#8221; away from finding the answer to your search.\u003C/p\u003E\n\n\u003Cp\u003EThis Brooklyn Lawyers Guide is your solution to finding the best Brooklyn attorney for your case. \u003C/p\u003E\n\n\u003Cp\u003EWhen You Need Legal Advice, We can help you choose a Brooklyn Lawyer\nwho\u0026#8217;s just right for your situation!\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EHelping you find the right Brooklyn Attorney\nThe categories in the column on the left will help you find a Brooklyn lawyer with expertise in virtually every area of law.  Simply scroll down through the list, find the area of law that you need help with, then click on the link and you will find a attorney who can help you\u0026#8230;one who can be just right for your case.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EThe Brooklyn Lawyers that advertise on this site\u0026#8230;\ntend to be some of the more talented Brooklyn attorneys and firms available in the New York Metro area, \u0026#8220;click\u0026#8221; on any one of their ads or sponsored listings and go directly to their web site where you\u0026#8217;ll find more detailed information. \nThese ads could be the answer to your search.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ESearch for Brooklyn Lawyers for your case\nIf you know the name of the attorney or law firm that you are looking for, \u0026#8220;click\u0026#8221; on the Directory of Brooklyn Lawyers tab and you will find them there.  It offers you the latest, most up-to-date and accurate database of law firms and attorneys in the Brooklyn area.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EA Guide to Finding the Right Brooklyn Lawyer\nIf you need advice and or a guide to help you find an attorney that is right for your case, \u0026#8220;click\u0026#8221; on the How to Find the Right Brooklyn Lawyer tab. \u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EIt will help you:\nKnow when you need to hire a lawyer.\nFind an attorney you can afford.\nFind an attorney who actually specializes in cases like yours.\nKnow what you should expect from your lawyer and what your lawyer should expect from you.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003ELearn More About The Practice Areas for Each of our Brooklyn Attorneys\nIf you need a more detailed explanation about each of the Fields of Law to which attorneys concentrate their practice, \u0026#8220;click\u0026#8221; on the Lawyers Specialty Guides tab and you will find help there.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EAdditional Resources to help you find the right Brooklyn Attorney for your legal needs Look through the tabs Client\u0026#8217;s Rights and Responsibilities and Helpful Legal Terms, they do provide quite useful and helpful information.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EWhen you have made your decision and hired an attorney, please let them know that you found them in the Brooklyn Lawyers Guide.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}