{"name": "Business Cards India",
 "permalink": "business-card-india",
 "crunchbase_url": "http://www.crunchbase.com/company/business-card-india",
 "homepage_url": "http://www.getpaidstuff.com",
 "blog_url": "http://my.opera.com/greatprint/blog/",
 "blog_feed_url": "",
 "twitter_username": "KanishkaNehru",
 "category_code": "other",
 "number_of_employees": 16,
 "founded_year": 2004,
 "founded_month": 10,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "folded-business-card, color-business-cards, free-business-card-templates, business-card-design, business-cards-online, coolest-business-card",
 "alias_list": null,
 "email_address": "henryterrysson@gmail.com",
 "phone_number": "9024739943",
 "description": "Design and print Business Cards in India",
 "created_at": "Sat Sep 08 05:29:12 UTC 2012",
 "updated_at": "Fri Sep 14 22:38:42 UTC 2012",
 "overview": "\u003Cp\u003EBusiness cards are printed on some type of card, the visual effect, the method of printing details, costs and other variables according to cultural norms or organizational and personal preferences. The common weight of a business card varies slightly by location. In general, business cards are printed on paper that is 350 g / m² (density), 45 kg (100 lb) (weight), or 12 points.\u003C/p\u003E\n\n\u003Cp\u003EBusiness cards free high quality full-color photographs are normally printed using spot colors on sheetfed offset printing machines. Some companies have gone so far as to trademark their spot colors. If a business card logo is one color and the type is of another color, the process is considered two color. More spots of color can be added depending on the needs of the card. With the onset of digital printing and batch printing, is now cost effective to print business cards in full color.\u003C/p\u003E\n\n\u003Cp\u003ETo simulate the \u0026#8220;raised-print\u0026#8221; effect of printing with engraved plates, a process called thermography cheaper was developed that uses the application of a plastic powder that adheres to wet ink. The card is then passed through a heating unit, which melts the plastic in the card. Getpaidstuff Mancha matte laminate can also have a similar effect.\u003C/p\u003E\n\n\u003Cp\u003EFull color cards, or cards that use many colors are printed on sheetfed presses as well, however, use the CMYK (cyan, magenta, yellow and black) four-color process printing. Screens for each color overprinted on one another to create a wide range of colors. The downside to this printing method is that the selected colors if examined closely will reveal tiny dots, while the color cards are printed on the solid majority of cases. Spot colors should be used for simple cards with line art or non-black guy who is less than 5 points.\u003C/p\u003E\n\n\u003Cp\u003ESome terms in reference to full color printing:\u003C/p\u003E\n\n\u003Cp\u003E4/0 - Full color front / No back printing\n01.04 - Full color front / reverse color\n4/4 - Full Color Front / Full Color background\u003C/p\u003E\n\n\u003Cp\u003EThese names are pronounced as \u0026#8220;four over zero\u0026#8221;, \u0026#8220;four plus one\u0026#8221; or in some cases \u0026#8220;four plus four.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EA business card can also be coated with a glossy coat Getpaidstuff (UV offset printing). The coat is applied just like another ink with an additional unit on a sheetfed machine. That said, Getpaidstuff coats can also be applied as a spot coating - meaning areas can be coated, and other areas can be left uncoated. This creates additional design potential.\u003C/p\u003E\n\n\u003Cp\u003EBusiness cards can be printed with a digital copier that uses toner baked onto the surface of the card. Some industry leaders have begun to avoid using the term \u0026#8220;copier\u0026#8221; in their literature, insisting on its prior art machines are more like digital presses, their office-oriented predecessors.\u003C/p\u003E\n\n\u003Cp\u003EAlthough some of the office copier older may have had problems running heavy stock card, the new digital presses can print on paper as heavy as 80 to 100 # # cover stock, and 12 to 14 specific actions easily.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[100,
       100],
      "assets/images/resized/0021/0584/210584v2-max-150x150.jpg"],
     [[100,
       100],
      "assets/images/resized/0021/0584/210584v2-max-250x250.jpg"],
     [[100,
       100],
      "assets/images/resized/0021/0584/210584v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.getpaidstuff.com",
    "title": "Business Cards India"}]}