{"name": "Buvanagiri Handloooms",
 "permalink": "buvanagiri-handloooms",
 "crunchbase_url": "http://www.crunchbase.com/company/buvanagiri-handloooms",
 "homepage_url": "http://www.indiamart.com/buvanagirihandlooms/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "printed-salwar-suits, butta-sarees, jacquard-sarees, embroidered-cotton-suits, churidar-printed-cotton-suits",
 "alias_list": null,
 "email_address": "buvanagirihandlooms@tradepassport.org",
 "phone_number": "9790818019",
 "description": "We are engaged in manufacturing ,",
 "created_at": "Thu Apr 04 13:50:09 UTC 2013",
 "updated_at": "Thu Apr 04 13:50:11 UTC 2013",
 "overview": "\u003Cp\u003EBuvanagiri Handlooms was established as a partnership firm in the year 1993 and is engaged in manufacturing and supplying a large gamut of Sarees that includes Silk Cotton Sarees, Poly Cotton Sarees, Cotton Salwar Suits, Poly Cotton Salwar Suits, Printed Salwar Suits, Butta Sarees, Jacquard Sarees, Embroidered Cotton Suits, Churidar Printed Cotton Suits, Net Saress \u0026amp; Embroidered Sarees. Based in Tamil Nadu, India the firm is functional under the leadership of our mentor Mr. Hema Kumar (Manager).\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are backed by a state-of-the-art infrastructural facility that is equipped with all the latest machines, tools and equipments. Every machine and equipment available in our production unit is repaired at regular intervals to make sure that the functional efficiency of these remains better. The production unit is spacious and enables us to carry out the operations related to design and development of the sarees and the salwar suits manufactured by us. Production facilities available with us include steam generators and machines for stitching and cutting.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality conscious firm, we aim at maintaining the standards of our products that suits to the requirements of national and international market. The raw materials used in making of the dress materials designed by us are high in quality and skin friendly. Each and every product offered by us are cut with care and stitched finely to guarantee durability in terms of stitches along with the latest design standards. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nA group of people with huge potential and abilities to match up with the expectations of the company as well as market makes our team. People who make our team are professionally qualified and are well aware of the changes that the market has seen in the past and can think beyond the time to understand the changes and demands of the clients. Our team comprises designers, stitching experts, quality controllers and packaging people. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nSilk Cotton Sarees, Poly Cotton Sarees, Cotton Salwar Suits, Poly Cotton Salwar Suits, Printed Salwar Suits, Butta Sarees, Jacquard Sarees, Embroidered Cotton Suits, Churidar Printed Cotton Suits, Net Saress \u0026amp; Embroidered Sarees. Based in Tamil Nadu, India the firm is functional under the leadership of our mentor Mr. Hema Kumar (Manager).\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       114],
      "assets/images/resized/0024/7939/247939v2-max-150x150.jpg"],
     [[235,
       180],
      "assets/images/resized/0024/7939/247939v2-max-250x250.jpg"],
     [[235,
       180],
      "assets/images/resized/0024/7939/247939v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}