{"name": "Buwens African Imports",
 "permalink": "buwens-african-imports",
 "crunchbase_url": "http://www.crunchbase.com/company/buwens-african-imports",
 "homepage_url": "http://buwensafricanimports.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 1981,
 "founded_month": 3,
 "founded_day": 23,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "african-jewellery, kente-accessories, african-arts",
 "alias_list": null,
 "email_address": "buwensafricanimports@gmail.com",
 "phone_number": "",
 "description": "Buwens African Imports specializes in th",
 "created_at": "Tue May 14 09:15:30 UTC 2013",
 "updated_at": "Wed May 15 13:16:04 UTC 2013",
 "overview": "\u003Cp\u003EBuwen’s African Imports, a for profit Speciality specializing in the selling of Ethnic products some hand-made by me, Rachel Buwen Johnson such as mudcloth coats, hats \u0026amp;,dresses, lava lava, Puletasi and muumuu (Samoa and Hawaii clothing), others authentic African clothes imported from Mali, Nigeria, Ghana, Mali, Senegal and other African countries obtained from supplies, including authentic African Ceremonial Masts are carried in the store to make available the rich cultural products of Africans and Pacific Islanders. In spite of the fact that we are on Amazon, Ebay, Craiglist, and other search engines as well as the World Wide Web, we are serving only the continental U.S. as of now. Besides selling these products, Mrs. Rachel Buwen Johnson, a native of Liberia and the Sole Proprietor of Buwen’s African Imports, also sponsors cultural enrichment activities at schools, churches, and Kansas City Annual Enrichment Festival as part of the organization endeavors; promoting African Cultural. Buwens promotes the business and African culture by participating in speaking at schools and churches promoting African cultures and sponsoring cultural activities such as the Kansas City Ethnic Enrichment Festival held annually, and cultural activities at Bruce Watkins Cultural Center where she displayed Authentic African Ceremonial Masks, etc.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}