{"name": "Buydealz",
 "permalink": "buydealz",
 "crunchbase_url": "http://www.crunchbase.com/company/buydealz",
 "homepage_url": "http://www.buydealz.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "deals, coupons",
 "alias_list": null,
 "email_address": "vijay@buydealz.com",
 "phone_number": "4087996618",
 "description": "Buydealz is a User-driven Social Network",
 "created_at": "Tue Mar 26 22:52:34 UTC 2013",
 "updated_at": "Tue Mar 26 22:52:37 UTC 2013",
 "overview": "\u003Cp\u003EBuydealz is a User-driven Social Networking Cloud deal sharing site with an objective to focus on consumers’ needs bringing a platform to mingle and share information to give a great shopping experience. With unique and diverse offerings each day, we inspire members to discover everything from weekend excursions to one-of-a kind shopping experiences and much more. The company has full-time staff dedicated to finding deals, coupons and Events to serve each and every member who have joined our community. Our layout is easy to scan; you won\u0026#8217;t miss any of the products on our site. Comparing across products, prices, and storing information and helps to quickly access all the ratings and reviews you need to make a confident buying decision.  Using Buydealz shoppers can find the right product, at the right price, every time. \u003C/p\u003E\n\n\u003Cp\u003EWe connect customers by offering an experience to follow one another in real time with their shopping destiny. Through following the members profile and sharing the information with people interested in their products and services they intend to grow their network. This helps users to gather real-time market intelligence and feedback, and build relationships between customers, merchants and influencers. Our website provides an easy portal to add deals for users - everything they need to sell their deals/coupons online and also we offer to share 10$ services, Buy \u0026amp; Sell their products. In adding administration area users can add new coupons, deals or events, organizing their products information and much more. Users can post and sell virtually anything through our site from books to electronics.\u003C/p\u003E\n\n\u003Cp\u003EBuydealz introduces a new Deal Comparison Tool (BDCT), helps users to search more than 150 Merchants with real time product attributes in no time. It filters users search in all Product attributes including the name/title of a product, the description, an image link, a condition (new/used/refurbished), a product code like a UPC, EAN, or ISBN, a category, the brand and manufacturer, It guarantees users to choose their product with lowest total price including Tax + Shipping charge from set of selected products from merchant. Buydealz provides more merchant data and best deal than other deal comparison. Each product that is included in user search consists of one year graph with details and product reviews.\u003C/p\u003E\n\n\u003Cp\u003EBuydealz adopts Cloud computing technology as it is definitely the wave of the future. The flexibility of the Buydealz site is to respond quickly to changing needs makes it a very economically viable business computing choice. Buydealz  will be Managed Service Provider (MSP) looking at hosting and managing Customers and Advertisers own managed backup service. The advantage to any cloud computing solution is that IT is centrally located. Traditionally, IT has to be all over company grounds putting out fires and going to individual work stations that are having issues.  Buydealz offers cloud service that upgrades all deal, coupons and event that are only need to be done at one location and, as needs change, only one place gets the change. Our system can also handle as many users come on board, more memory and processor speed can be increased through our cloud services.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       112],
      "assets/images/resized/0024/5785/245785v2-max-150x150.png"],
     [[250,
       187],
      "assets/images/resized/0024/5785/245785v2-max-250x250.png"],
     [[450,
       337],
      "assets/images/resized/0024/5785/245785v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "buydealz",
    "address1": "1684 DECOTO RD ,SUITE 250",
    "address2": "",
    "zip_code": "94587",
    "city": "UNION CITY",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}