{"name": "BWC Management \u0026 Consulting",
 "permalink": "bwc-management-consulting",
 "crunchbase_url": "http://www.crunchbase.com/company/bwc-management-consulting",
 "homepage_url": "http://www.bwcmanagement.co.uk/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bwc-management--consulting, top-quality-wines, bordeaux",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "provides advice on buying top wines",
 "created_at": "Tue Dec 11 16:11:43 UTC 2012",
 "updated_at": "Thu Feb 07 04:04:50 UTC 2013",
 "overview": "\u003Cp\u003EBWC Management \u0026amp; Consulting Partners provides advice on buying top quality wines that are suitable for investment purposes as well as general enjoyment. They understand the wine market and are up to date on current drinking trends and storage techniques, as well as being connected with the finest wine châteaux in Bordeaux. Through their knowledge and experience, they take advantage of the imbalance within the wine market to recommend wines that are sure to appreciate in price and yield handsome profits. Like other markets, such as fine art, antiques or luxury goods, investment in fine wine is set to benefit nicely from the growing demand of high quality products worldwide. The best wine for these purposes come from the Bordeaux region in southern France, which has a history of producing the finest and most sought after wines in the world. And as any investment goes, the value of the wine increases as its ready supply diminishes. \u003C/p\u003E\n\n\u003Cp\u003EWine Selection for Medium Term Investment\u003C/p\u003E\n\n\u003Cp\u003EWith the many different types of wines that are produced each year in every corner of the world, it is vitally important to understand the qualities and benefits of each vintage before considering as an investment. BWC Management \u0026amp; Consulting Partners studies the market and tracks trends so they can properly advise their clients. Typically, to limit risk, they go with first growth Bordeaux from one of the top châteaux in the region. On average, there are more than 700 million bottles of Bordeaux produced each year, but they vary wildly in quality and price ranging from the simple wines suitable for the everyday table to the most prestigious and expensive vintages in the world. First growth wines are known to be of fine quality and can be purchased as a safe investment. With professional advice from BWC Management \u0026amp; Consulting Partners, the same can be said for En Premeur wines, which are sold while still in the barrel. Because the true value of these wines is revealed only years later, they are referred to as wine futures. While cheaper to buy, it is not possible to know 100% how the wines will mature, but the experienced advisors take all the factors into account before recommending investment at the En Premeur stage.  Once the best wine has been chosen to fulfill the customer\u0026#8217;s financial needs, BWC Management \u0026amp; Consulting Partners handles the transportation, bonded storage, periodic valuations and eventual sale of the wine.\u003C/p\u003E\n\n\u003Cp\u003EHow Wine Holds up Against Traditional Investments\u003C/p\u003E\n\n\u003Cp\u003EThe purchase of wine as an alternative form of investment has been steadily increasing in the past decade, as more traditional types of investment have experienced decline. No longer are property and stocks automatically considered prime holdings in a strong portfolio. With an eye out for alternative investments that are more profitable, fine quality wines have proven to be an excellent commodity that can produce substantial returns.   As Bordeaux has become known as a microclimate for good investment over the past ten years, BWC Management \u0026amp; Consulting Partners have seen profits exceeding one hundred percent. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0022/4882/224882v4-max-150x150.jpg"],
     [[164,
       101],
      "assets/images/resized/0022/4882/224882v4-max-250x250.jpg"],
     [[164,
       101],
      "assets/images/resized/0022/4882/224882v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.bwcmanagementandconsulting.co.uk/",
    "title": "What is BWC Management \u0026 Consulting"},
   {"external_url": "http://bwcmanagement.co.uk/aboutus.html",
    "title": "About BWC Management \u0026 Consulting"}]}