{"name": "C.R.P. Fashion",
 "permalink": "c-r-p-fashion",
 "crunchbase_url": "http://www.crunchbase.com/company/c-r-p-fashion",
 "homepage_url": "http://www.indiamart.com/crpfashion/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "crpfashion@tradepassport.org",
 "phone_number": "9843737333",
 "description": "manufacturer, exporter and supplier ",
 "created_at": "Thu Apr 04 11:13:39 UTC 2013",
 "updated_at": "Thu Apr 04 11:13:41 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in the year 1997 at Tiruppur, C.R.P. Fashion, has become one of the most sought-after manufacturers, suppliers and exporters of Kids T-Shirts, Kids Hoodies, Women\u0026#8217;s Tops, Women\u0026#8217;s Tanks Tops, Men\u0026#8217;s T-Shirts, Men\u0026#8217;s Polo T-Shirts, Men\u0026#8217;s Long Sleeve T-Shirts, Men\u0026#8217;s Hoodies and Men\u0026#8217;s Sweatshirts.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality assurance is the hallmark of our company and that has helped us establish a strong foothold in both national and international market. Stringent quality measures are carried out at every step from manufacturing to packaging, setting us apart from our competitors. All the business operations are performed under the stern supervision of our experienced quality controllers, facilitating the production of impeccable quality products.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a sophisticated facility that is well equipped and sprawls over a large area. Our facility is segregated into various departments that are interconnected to one another, maintaining proper communication amongst the workforce to enable smooth and hassle free functioning of all the business operations. All the finished products are systematically stocked in our capacious warehouse as per international standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a dexterous team of experts that has a very rich experience in the industry and is committed towards the production of top notch quality products that derive complete customer satisfaction. We are never reluctant to coordinate with our valuable customers, providing them the best solution that builds a bridge of mutual success. This has helped us establish a strong bonding with our customers which, vindicates through ever growing list of satisfied customers.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nBeing a prominent manufacturer, supplier and exporter of a consortium of elegantly designed products, we have achieved a remarkable position in the industry. We offer supreme quality products at very nominal prices.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7842/247842v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7842/247842v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7842/247842v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}