{"name": "Cabot Heritage",
 "permalink": "caabot-heritage",
 "crunchbase_url": "http://www.crunchbase.com/company/caabot-heritage",
 "homepage_url": "http://www.cabot.net",
 "blog_url": "http://www.iconoclast-investor.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 1970,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "customerservice@cabot.net",
 "phone_number": "978-745-2660",
 "description": "Online Investing Newsletter Publications",
 "created_at": "Thu Jan 17 21:18:38 UTC 2013",
 "updated_at": "Tue Jan 22 05:51:20 UTC 2013",
 "overview": "\u003Cp\u003ECabot Heritage\u0026#8217;s investing newsletters clearly present stock market advice from experts, covering a range of investments.\u003C/p\u003E\n\n\u003Cp\u003EThe newsletters include the Cabot Wealth Advisory, a free newsletter that delivers independent investment advice on how to build long-lasting wealth.\u003C/p\u003E\n\n\u003Cp\u003EThere are several paid options, suitable for a range of investing systems and styles.\u003C/p\u003E\n\n\u003Cp\u003ECabot Market Letter is the flagship investment advisory. Published since 1970, it is recommended for all investors seeking to grow their wealth.\u003C/p\u003E\n\n\u003Cp\u003EDesigned for experienced investors, Cabot Top Ten Trader is geared to fast profits in stocks that are under accumulation now.\u003C/p\u003E\n\n\u003Cp\u003ECabot Stock of the Month is a way to get a taste of four Cabot publications while you build a diversified portfolio of growth stocks, value stocks, momentum stocks, and emerging markets stocks.\u003C/p\u003E\n\n\u003Cp\u003ECabot Benjamin Graham Value Letter uses the methods developed by the father of value investing, Benjamin Graham and popularized by Warren Buffet.\u003C/p\u003E\n\n\u003Cp\u003ECabot China \u0026amp; Emerging Markets Report focuses on the emerging markets economies, with special attention paid to the BRIC (Brazil, Russia, India and China) investment landscape.\u003C/p\u003E\n\n\u003Cp\u003ECabot Small-Cap Confidential is a limited-circulation advisory for investors seeking profit opportunities in high-potential small company stocks. \u003C/p\u003E\n\n\u003Cp\u003ECabot ETF Investing System uses fundamental analysis to systematically identify sectors that are positioned to outperform the overall market, then applies a market timing component to minimize losses in bear markets and maximize gains in bull markets.\u003C/p\u003E\n\n\u003Cp\u003ECabot Options Trader recommends straight puts and calls so you can make gains with minimal investment, and recommends covered calls so you can protect your current equity holdings while eking out modest gains. \u003C/p\u003E\n\n\u003Cp\u003EDick Davis Investment Digest is culled from the best minds on Wall Street, reviewing hundreds of financial newsletters and institutional research publications.\u003C/p\u003E\n\n\u003Cp\u003EAt Dick Davis Dividend Digest, hundreds of financial newsletters are read cover to cover to present the most attractive dividend-paying stocks, municipal and corporate bonds, mutual funds, exchange-traded funds (ETFs) and REITS.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[115,
       115],
      "assets/images/resized/0023/0301/230301v2-max-150x150.png"],
     [[115,
       115],
      "assets/images/resized/0023/0301/230301v2-max-250x250.png"],
     [[115,
       115],
      "assets/images/resized/0023/0301/230301v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "176 North Street",
    "address2": "",
    "zip_code": "01970",
    "city": "Salem",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": 42.530007,
    "longitude": -70.9058699}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}