{"name": "Calabria Technology",
 "permalink": "calabria-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/calabria-technology",
 "homepage_url": "http://www.calabriatechnology.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "info@calabriatechnology.com",
 "phone_number": "916.817.1414",
 "description": "",
 "created_at": "Tue Jun 04 19:46:19 UTC 2013",
 "updated_at": "Tue Jun 04 19:46:19 UTC 2013",
 "overview": "\u003Cp\u003ECalabria Technology is a California based technology consulting and IT Professional Services Company. We design, develop, and implement custom websites, web services, enterprise and mobile applications, database management and emerging technology solutions with a core focus on project management, technical expertise, and integration of information technology. Since our inception, Calabria Technology has developed a solid reputation as a valued, quality-driven technology partner servicing organizations worldwide. We pride ourselves in providing end-to-end, industry-specific technology solutions tuned precisely to meet the needs of today’s complex, secure, and transaction-driven requirements. Through our core focus of innovative technology solutions we are committed to providing value to our customers through creative, secure, cost-effective solutions.\u003C/p\u003E\n\n\u003Cp\u003EWe have built websites from simple to extreme. Our technology development and design teams are proficient in web development including Linux, Apache, MySQL, PHP, Java, JavaScript, WordPress, Joomla, Ruby on Rails, .Net, CSS, Flash and other web 2.0 technology platforms. We have built websites with links to Facebook, Twitter and other social media sites, and websites which process secure credit card transactions and online commerce. In many cases we have built mobile applications syncing to the website to manage online transaction processing. We have built websites with a secure database server to manage data, transactions, commerce, and links to PayPal, credit card or 3rd-party payment transaction services. Many of the websites we build have Content Management Systems (CMS) back end for easy real time edits and simple content management.\u003C/p\u003E\n\n\u003Cp\u003EWe have built mobile applications for IPhone, IPad, Blackberry, Android, Palm, Nokia, Symbian, Java and Windows mobile platforms. We also can port an application from one mobile platform to another. We have built mobile apps with links to Facebook, Twitter and other social media sites, and apps that manage web services to process mobile or online credit card transactions. We have no limits when it comes to creative design, application development and functionality. Our mobile app design team will work with your application vision team to create the perfect app. If needed, we can sync your mobile application, website and content management system (CMS) with your secure database server to manage data, transactions, commerce, and links to a payment gateway for secure Cloud Computing.\u003C/p\u003E\n\n\u003Cp\u003EWe have no limits when it comes to creative design, application development, and functionality.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "2901 Merriam Lane ",
    "address2": "",
    "zip_code": "95762",
    "city": "El Dorado Hills",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}