{"name": "California Special Needs Law Group",
 "permalink": "california-special-needs-law-group",
 "crunchbase_url": "http://www.crunchbase.com/company/california-special-needs-law-group",
 "homepage_url": "http://www.csnlg.com",
 "blog_url": "http://www.csnlg.com/blog",
 "blog_feed_url": "http://www.csnlg.com/blog/feed/",
 "twitter_username": "CSNLG",
 "category_code": "legal",
 "number_of_employees": 10,
 "founded_year": 1999,
 "founded_month": 5,
 "founded_day": 17,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "special-need-law-services, special-education-law, special-need-services",
 "alias_list": null,
 "email_address": "risaacs@csnlg.com",
 "phone_number": "8889000744",
 "description": "A Professional Law Corporation",
 "created_at": "Thu May 30 19:37:59 UTC 2013",
 "updated_at": "Fri May 31 20:09:49 UTC 2013",
 "overview": "\u003Cp\u003EWe assist families in their struggles to obtain the appropriate education and related services required for their child to progress in school, at home and in the community. As your attorney, we will help you navigate the complex arena of federal and state laws which provide certain protections and guarantees to your child.\u003C/p\u003E\n\n\u003Cp\u003EWith this goal in mind we have developed a law firm guided by three very important principles:\u003C/p\u003E\n\n\u003Cp\u003EProvide excellent legal services;\nBuild solid and trusting relationships with our clients; and\nProvide “affordable” and “low cost” legal counseling and representation.\u003C/p\u003E\n\n\u003Cp\u003EIt is our job as special education attorneys/advocates to become your personal education consultant guiding you through the process of obtaining the appropriate services for your child. This includes, when possible, working collaboratively alongside your child’s school district and/or regional center. As your attorney it is our job to give you the advice, recommendations and support you need to secure the appropriate educational program for your child. We will keep the school district accountable to all applicable federal and state laws through strong advocacy at individualized education program (IEP) meetings, the filing of compliance complaints with the California Department of Education (CDE), filing a due process complaint with the Office of Administrative Hearings (OAH) and, when necessary, appeals in federal court.\u003C/p\u003E\n\n\u003Cp\u003EIn the end, we hope that our representation helps our clients improve their advocacy and negotiation skills so they can better represent their child in future dealings with their school district and regional center. However, we will always be here to take the lead when our clients need us or to answer any questions that may suddenly arise.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "CSNLG Law Firm",
    "address1": "1901 Newport Blvd. Suite 350",
    "address2": "",
    "zip_code": "92627",
    "city": "Costa Mesa",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}