{"name": "California Attorney Jobs",
 "permalink": "california-attorney-jobs",
 "crunchbase_url": "http://www.crunchbase.com/company/california-attorney-jobs",
 "homepage_url": "http://www.californiaattorneyjobs.com/",
 "blog_url": "",
 "blog_feed_url": "http://www.californiaattorneyjobs.com/jobsrss.php",
 "twitter_username": "",
 "category_code": "legal",
 "number_of_employees": 200,
 "founded_year": 2000,
 "founded_month": 6,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "california-attorney-jobs, attorney-jobs-in-california, california-law-jobs, california-legal-jobs, legal-employment-job-board-in-california",
 "alias_list": null,
 "email_address": "rogerc@californiaattorneyjobs.com",
 "phone_number": "626-243-1801",
 "description": "Attorney Jobs in California",
 "created_at": "Sat May 12 10:49:52 UTC 2012",
 "updated_at": "Wed May 23 14:12:48 UTC 2012",
 "overview": "\u003Cp\u003ECalifornia Attorney Jobs had been established specifically for legal employment in California. It is a next generation employment search solution designed for professionals looking for attorney jobs in California. Delivering a quality user experience, ease of use, control and convenience to job seekers is our primary goal.\u003C/p\u003E\n\n\u003Cp\u003EOur database is one of the most extensive and comprehensive in the industry today. It is continuously updated with new legal openings and better opportunities to ensure that you will have the best legal jobs in California jobs at your fingertips. Jobs can be easily searched for with keywords, job titles and/or location. Rather than trying to work your way around the search engine, we ensure that the search engine will adapt to your needs.\u003C/p\u003E\n\n\u003Cp\u003EOur powerful search engine ensures that jobs would be perfectly matched to your skill sets, experience and qualifications. Missed relevant legal job opportunities are a thing of the past. Our technology is geared towards ensuring that your legal job search in California will be fast and effortless. Other than offering some of the best jobs for attorneys in California, we also bring useful resources and industry updates to job seekers to ensure that they would always be on top of what’s new in this niche.\u003C/p\u003E\n\n\u003Cp\u003ETo ensure that job seekers have the best possible experience with us, California Attorney Jobs has recruited some of the most talented and experienced professionals to assist you with your job search. Whether you have a query on how to use the search engine or you need the latest industry information, you can rely on these professionals to provide you timely, efficient assistance. Our team includes legal advisors, recruiters, software personnel and talented customer service professionals.\u003C/p\u003E\n\n\u003Cp\u003EWith California Attorney Jobs you will always be equipped with resources, tools and all the assistance you need to find the best attorney jobs in California. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0018/9452/189452v2-max-150x150.png"],
     [[250,
       51],
      "assets/images/resized/0018/9452/189452v2-max-250x250.png"],
     [[293,
       60],
      "assets/images/resized/0018/9452/189452v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "California Attorney Jobs",
    "address1": "202 S Lake Ave",
    "address2": "Unit 250",
    "zip_code": "91101",
    "city": "Pasadena",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}