{"name": "Callsome Solutions",
 "permalink": "callsome-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/callsome-solutions",
 "homepage_url": "http://www.callflakes.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "eranaviv",
 "category_code": "mobile",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 6,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile, android, apps, googleplay, smartcall, callfollowup--callaction, facebook, callerid, social",
 "alias_list": null,
 "email_address": "zach.sivan@callsome.com",
 "phone_number": "",
 "description": "Mobile apps ",
 "created_at": "Mon Oct 15 16:13:54 UTC 2012",
 "updated_at": "Wed Dec 12 07:08:55 UTC 2012",
 "overview": "\u003Cp\u003ECallsome Solutions is the provider of CallFlakes\nCallFlakes an Android app enhancing the top 2 activities of your mobile phone: phone calls and text messages.\u003C/p\u003E\n\n\u003Cp\u003EFacebook Caller ID:\u003C/p\u003E\n\n\u003Cp\u003EAs you make or receive a call to or from a Facebook friend CallFlakes will present you the Facebook wall of that friend and let you get recent updates of what your friends have been up to before you start the conversation. Same happens when you receive a text message from your Facebook friends.\nIn order to connect the app to Facebook all you have to do is click on the “Connect with Facebook” button when prompt upon opening the app and login to Facebook with your Facebook login details. This action will start a short process that syncs your phone’s address book with your Facebook friends and then display your friends most recent updates, including pictures, likes and links, whenever you call them or whenever they call and text you.\u003C/p\u003E\n\n\u003Cp\u003ESmart Call Follow Up\u003C/p\u003E\n\n\u003Cp\u003ECallFlakes further provides you with smart productivity tools to follow-up with all your calls and text messages and these tools apply to any of your calls and text messages – not only those from Facebook friends.\nAs you terminate a phone call CallFlakes immediately turns on its productivity board and easily lets you make all typical follow up actions after a call such as sending an email, setting a meeting, setting a reminder, calling back, texting back or searching the web for objectives discussed in your call.\nWhen you receive a text message CallFlakes presents to you the content of the message and provides you with a productivity board that lets you reply or call the sender in one click, set a meeting or a reminder as a response to the message and search the web for objectives related to the message.\u003C/p\u003E\n\n\u003Cp\u003ERewards:\u003C/p\u003E\n\n\u003Cp\u003ECallFlakes is also a rewarding app and it is connected to the Beintoo app reward program. As you use the CallFlakes productivity board you aggregate the Beintoo virtual currency dollars which you can then redeem against free coupons and other goodies from companies like Gap, Zappos, Groupon and many others.\u003C/p\u003E\n\n\u003Cp\u003ESimple and Free:\u003C/p\u003E\n\n\u003Cp\u003ECallFlakes is very simple to install and it does not require any technical expertise. One click is required to install the app and another click to connect the app to Facebook for the optional Facebook caller ID features. Thereafter the app turns itself on automatically for every event that applies to the Facebook caller ID and productivity board features.\nCallFlakes is a free app supported by advertising. Please visit our advertisers and help us improve our apps and services.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "New York",
    "address1": "808 Columbus Ave",
    "address2": "#20A",
    "zip_code": "10025",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": 40.79467,
    "longitude": -73.966654}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}