{"name": "CallMultiplier",
 "permalink": "callmultiplier",
 "crunchbase_url": "http://www.crunchbase.com/company/callmultiplier",
 "homepage_url": "http://www.callmultiplier.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "public_relations",
 "number_of_employees": 13,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "automated-phone-tree, automated-call-tree, automated-voice-messaging, automated-text-messaging, voice-broadcast-service, call-blast, robocall-service, automated-calling-service, mass-text-messaging",
 "alias_list": null,
 "email_address": "Support@CallMultiplier.com",
 "phone_number": "(877) 225-5025",
 "description": "Automated Voice \u0026 Text Messaging Service",
 "created_at": "Mon Jan 14 18:22:04 UTC 2013",
 "updated_at": "Thu Jan 17 07:54:13 UTC 2013",
 "overview": "\u003Cp\u003ECallMultiplier provides money saving, fast, easy, and dependable phone tree automated calling, texting and voice message delivery of important messages to any size group.\u003C/p\u003E\n\n\u003Cp\u003EDo you need to communicate an important message to a large group of people?  Instead of making endless, repetitive phone calls or activating complicated phone trees, you can count on CallMultiplier.  Their easy-to-use voice and text message broadcasting service quickly delivers your message automatically to everyone in your group. Record your voice or text message one time and it’s “multiplied” instantly, effortlessly and accurately. \u003C/p\u003E\n\n\u003Cp\u003ECallMultiplier is the ideal solution for communicating schedule changes, practice times and locations, customer and emergency notifications, upcoming events, cancellations, fundraising campaigns and meeting reminders. \u003C/p\u003E\n\n\u003Cp\u003ECallMultiplier saves you time, money and stress.  Whether you need to reach 20, 200 or 20,000 individuals, they get your news and notifications to the right people at the right time, by voice or text.  Their satisfied customers include sports teams, businesses, religious groups, schools, staffing companies, clubs and civic groups throughout the United States and Canada.\u003C/p\u003E\n\n\u003Cp\u003EPackages start at less than seven dollars per month for unlimited usage and there are no contracts, long-term commitments or setup fees.  Their friendly and knowledgeable customer service professionals are available 24/7 to provide free training and assistance to ensure that you get the most out of their service.  You are never on your own; they are always available and happy to help!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       29],
      "assets/images/resized/0022/9647/229647v2-max-150x150.png"],
     [[250,
       48],
      "assets/images/resized/0022/9647/229647v2-max-250x250.png"],
     [[307,
       60],
      "assets/images/resized/0022/9647/229647v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}