{"name": "Camelot Castle Hotel",
 "permalink": "camelot-castle-hotel",
 "crunchbase_url": "http://www.crunchbase.com/company/camelot-castle-hotel",
 "homepage_url": "http://www.camelot-castle-hotel.co.uk",
 "blog_url": "http://camelotcastlehotel.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "CamelotCastleHo",
 "category_code": "other",
 "number_of_employees": 20,
 "founded_year": 1999,
 "founded_month": 10,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "camelot-castle, vacation, travel, john-mappin, irina-mappin, ted-stourton",
 "alias_list": null,
 "email_address": "",
 "phone_number": "01840 770 202",
 "description": "A Legendary Vacation Spot",
 "created_at": "Thu Sep 13 06:30:45 UTC 2012",
 "updated_at": "Mon Oct 22 16:52:10 UTC 2012",
 "overview": "\u003Cp\u003EFormerly known as King Arthur’s Hotel, the Camelot Castle Hotel is fondly referred to as the ‘Diamond of Cornwall’. When experiencing the breathtaking view and the 10 carat service, this moniker is very appropriate.\u003C/p\u003E\n\n\u003Cp\u003EFor longer than a decade now, hosts John and Irina Mappin and renowned artist Ted Stourton have been providing the ideal location for creative freedom and fantastic relaxation. Being avid lovers of art and artists John and Irina Mappin along with their co-owner who is also a flourishing artist, Ted Stourton provide a luxuriously bucolic location that caters to just about every taste. Whether you are an established or budding artist or just a person who needs to dust some cobwebs off their soul and kick back a while, Camelot Castle Hotel is an uplifting and inspirational spot that will crawl right into your heart to rest for the longest of times.\u003C/p\u003E\n\n\u003Cp\u003EMajestically positioned on a hill overlooking the Atlantic, this extraordinary building has been welcoming visitors from all over the world for over a century. From film stars to other extraordinary, ordinary people, all are welcomed with equal warmth at the Camelot Castle Hotel. Sir Winston Churchill was a guest at the hotel, as was Ava Gardner, JB Priestly and Sir Laurence Olivier. Recently, Nicholas Cage dropped by for a visit and Kate Winslet used to own a cottage on grounds.  When Camelot Castle Hotel hosts an event, they focus on details to make things really special for guests. When a birthday of the President of Kazakhstan was celebrated at the hotel, a huge cake in the shape and colours of Kazakhstan flag was made in honour of the President.\u003C/p\u003E\n\n\u003Cp\u003EAs with all prime holiday destinations, Cornwall becomes a very busy place in the holiday season. The last thing you need is to leave the hustle and bustle of everyday life for more commotion and queues. A holiday is time out from having to rush around. Being away from the busy and trafficked areas, Camelot Castle Hotel offers blissful tranquillity without complete solitude. This is a place where visitors will only encounter like-minded individuals that value their brief respite from demanding lives. \u003C/p\u003E\n\n\u003Cp\u003ECamelot Castle Hotel sports a beach just down the hill, which is out-of-the-way to the general public and therefore awards reasonable privacy. With the Atlantic at your doorstep and a fresh sea breeze as attainable as taking a breath, it is no wonder Camelot Castle Hotel is hailed as a hot-spot for artistic revelation. This inspirational place has been home to many artists with the exciting resident artist programmes on offer by the owners whereby artists are offered breathing space in which they can create without the interruptions of daily life. The spectacular surrounding natural beauty and accessible attractions make Camelot Castle Hotel an even more all-round destination. Should you wish to have the odd night out, or family day trip, there is a large range of attractions nearby. The top eco visitor attraction, the Eden project is one such attraction where you have no option but be entertained with a massive variety of activities for the whole family or even just having a delicious locally sourced meal. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[106,
       150],
      "assets/images/resized/0021/5736/215736v2-max-150x150.jpg"],
     [[177,
       250],
      "assets/images/resized/0021/5736/215736v2-max-250x250.jpg"],
     [[200,
       282],
      "assets/images/resized/0021/5736/215736v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Owner",
    "person":
     {"first_name": "John",
      "last_name": "Mappin",
      "permalink": "john-mappin",
      "image":
       {"available_sizes":
         [[[150,
            84],
           "assets/images/resized/0011/3652/113652v2-max-150x150.jpg"],
          [[250,
            140],
           "assets/images/resized/0011/3652/113652v2-max-250x250.jpg"],
          [[400,
            225],
           "assets/images/resized/0011/3652/113652v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "Co-Owner",
    "person":
     {"first_name": "Ted",
      "last_name": "Stourton",
      "permalink": "ted-stourton",
      "image":
       {"available_sizes":
         [[[120,
            150],
           "assets/images/resized/0021/5734/215734v2-max-150x150.jpg"],
          [[200,
            250],
           "assets/images/resized/0021/5734/215734v2-max-250x250.jpg"],
          [[201,
            251],
           "assets/images/resized/0021/5734/215734v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/Dptxa9Jtz00\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EThe Legendary and Mythological Camelot Castle Hotel\u003C/p\u003E"},
   {"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/Xks7Rz_rcEo\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003ECamelot Castle Hotel\u0026#8217;s \u0026#8220;The Light Box\u0026#8221;\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.ourcornwall.co.uk/boscastle/hotels/camelot-castle-hotel",
    "title": "Our Cornwall - Camelot Castle Hotel"},
   {"external_url": "http://www.prweb.com/releases/2012/7/prweb9745830.htm",
    "title": "Camelot Castle Press Release"}]}