{"name": "Camfield Engineers",
 "permalink": "camfield-engineers",
 "crunchbase_url": "http://www.crunchbase.com/company/camfield-engineers",
 "homepage_url": "http://www.indiamart.com/camfieldengineers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cams--cam-indexing-systems-that-serves-the-requirements-of-many-oem-customers-from-bottling, canning",
 "alias_list": null,
 "email_address": "camfieldengineers@tradepassport.org",
 "phone_number": "9820097188",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Fri Apr 05 12:32:37 UTC 2013",
 "updated_at": "Fri Apr 05 12:32:41 UTC 2013",
 "overview": "\u003Cp\u003EWe are a technically proficient An ISO 9001:2008 certified company, actively engaged in manufacturing and export of Cams \u0026amp; Cam Indexing Systems that serves the requirements of many OEM customers from Bottling, Canning, Pharmaceuticals, Packaging, Printing and Automation Industry. Ever since our establishment in the year 1995, we have developed our expertise in manufacturing of Cams such as Drum Cams, Face Cams, Plate Cams and Grooved Plate Cams and indexing systems in different technical configurations as desired by the client. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality being the prime importance at our organization, we leave no stone unturned towards assuring the same. We make sure that all the products at our end are manufactured in compliance with the ISO standards ensuring stringent quality check at all the levels. Our team of quality analysts ensure that careful checks are done of varied parameters like accuracy, lubrication, high load capacity and many more to make sure there is no defect in the performance of the products.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nA fine tuned infrastructure form the backbone of any successful organization. Today, Camfield Engineers, gives the credit of the position it enjoys in the industry, to its state-of-the-art infrastructure that is well installed with high-end machines and equipment. \u003C/p\u003E\n\n\u003Cp\u003EResearch and Development:\nWe have a sound research and development wing established at our company that is constantly working round the clock to enhance product quality. Further, we also take steps to conduct research and identify the market needs and hence developing a superior product line. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nCams \u0026amp; Cam Indexing Systems that serves the requirements of many OEM customers from Bottling, Canning, Pharmaceuticals, Packaging, Printing and Automation Industry. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8656/248656v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8656/248656v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8656/248656v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}