{"name": "Canopus Research",
 "permalink": "canopus-research",
 "crunchbase_url": "http://www.crunchbase.com/company/canopus-research",
 "homepage_url": "http://www.canopusresearch.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "consulting",
 "number_of_employees": 7,
 "founded_year": 1982,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-networking-virtual-reality-vr-worlds-second-life-web-2-0",
 "alias_list": null,
 "email_address": "wfz@canopusresearch.com",
 "phone_number": "781-934-9800",
 "description": null,
 "created_at": "Wed Dec 10 23:45:01 UTC 2008",
 "updated_at": "Sat Dec 13 14:32:48 UTC 2008",
 "overview": "\u003Cp\u003ECanopus Research Inc., founded in 1982 by Canopus Research President, William F. Zachmann, and incorporated in 2002, provides information technology consulting services to a broad range of corporate and individual clients.  Canopus Research Inc. primarily provides strategic information technology industry market research, analysis, consulting and development services.\u003C/p\u003E\n\n\u003Cp\u003ECanopus Research is your ideal source for strategic market, industry, and technology research and analysis on the IT industry and on information technologies generally: computers, hardware, software, networks, Web services, and the Internet.  Canopus Research serves IT vendors, users, and the financial community.  \u003C/p\u003E\n\n\u003Cp\u003ERecent focus areas for Canopus Research Inc. include Web 2.0 social networking, virtualization, and 3D virtual reality worlds.  (Canopus Research Inc. maintains an office in Second Life run by Arifi Saeed, Research Director, SL).\u003C/p\u003E\n\n\u003Cp\u003EExamples of the type of services Canopus Research Inc. provides include:\u003C/p\u003E\n\n\u003Cp\u003EAssessment of business plans for startup firms.\u003C/p\u003E\n\n\u003Cp\u003EEvaluation of product marketing plans for established vendors.\u003C/p\u003E\n\n\u003Cp\u003EExpert third-party review of company plans and prospects for private and/or venture capital investors.\u003C/p\u003E\n\n\u003Cp\u003EIndependent review of IT plans, strategies, systems and practices for large user organizations.\u003C/p\u003E\n\n\u003Cp\u003ECustom market analysis and survey design for IT software, hardware, and services vendors.\u003C/p\u003E\n\n\u003Cp\u003EProfessional assistance developing product marketing strategies, plans, and materials.\u003C/p\u003E\n\n\u003Cp\u003ECompetitive product analysis and market strategy development.\u003C/p\u003E\n\n\u003Cp\u003EUser organizations rely on Canopus Research for competent, expert assistance in formulating IT strategies, planning, developing, and deploying state-of-the-art information systems and Web sites.  Canopus Research brings a wide range of research and analysis expertise to corporations and individuals.  Additional capabilities include system development, programming, technical writing, and related services.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       127],
      "assets/images/resized/0003/1514/31514v2-max-150x150.jpg"],
     [[120,
       127],
      "assets/images/resized/0003/1514/31514v2-max-250x250.jpg"],
     [[120,
       127],
      "assets/images/resized/0003/1514/31514v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "160 Standish Street",
    "address2": "P.O. Box 2805",
    "zip_code": "02331-2805",
    "city": "Duxbury",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": 42.017019,
    "longitude": -70.681383}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}