{"name": "Capital Fortune",
 "permalink": "capital-fortune",
 "crunchbase_url": "http://www.crunchbase.com/company/capital-fortune",
 "homepage_url": "http://www.capitalfortune.com",
 "blog_url": "http://www.capitalfortune.com/blog",
 "blog_feed_url": "http://www.capitalfortune.com/blog",
 "twitter_username": "capitalfortune",
 "category_code": "consulting",
 "number_of_employees": 12,
 "founded_year": 2006,
 "founded_month": 7,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "london--mortgage--brokers, mortgages",
 "alias_list": null,
 "email_address": "info@capitalfortune.com",
 "phone_number": "08453630430",
 "description": "London Mortgage Brokers",
 "created_at": "Sat Dec 01 17:39:47 UTC 2012",
 "updated_at": "Mon Dec 03 07:46:20 UTC 2012",
 "overview": "\u003Cp\u003ELondon Mortgage Brokers offering whole of market mortgage and protection advice nationally.\u003C/p\u003E\n\n\u003Cp\u003ELondon Mortgage Brokers Capital Fortune are award winning whole of market mortgage brokers based in the City of London. We offer finance on UK residential and Buy To Let mortgages and a suite of bespoke insurance products, both for individuals, families and companies. As a mortgage broker, we are not tied to any one lender such as a High Street bank and are able to search suitable and affordable funding, nationally available.\u003C/p\u003E\n\n\u003Cp\u003ETypically, we best assist clients with none standard requirements and those we successfully help, generally face difficulty in the mortgage market, requiring expert guidance from a nationally recognised, mortgage broker team. As expected, we offer all the \u0026#8216;standard\u0026#8217; mainstream products most mortgage advisers offer, but more importantly, we place cases of a complex and specialist nature such as those with difficult income streams, unusual properties, foreign nationals, UK ex pats, British forces overseas, foreign diplomats, contractors, the self employed and more mature clients seeking pensioner mortgages.\u003C/p\u003E\n\n\u003Cp\u003EClients we successfully work with, regularly tell us they appreciate us not only finding them the right financial deal, but actually securing the right product. The promise of a mortgage to us is not the same as actually delivering a formal mortgage offer in the exact same terms.  In a nutshell, that’s where we differ at Capital Fortune. Our promise is our guarantee and many of our client testimonials confirm our ability to help.\u003C/p\u003E\n\n\u003Cp\u003EWe have an established reputation for under-promising and over-delivering and your Capital Fortune mortgage brokers will be regularly on hand, not just through the process, but afterwards, sometimes, when you may need your mortgage broker most.\u003C/p\u003E\n\n\u003Cp\u003EWe have long term relationships with nearly all the major UK lenders and have built strong trusted connections with underwriters at both a local and national level. Many of the individual underwriters, prove the key to the success of each case and whilst advertised lending criteria is made available, the discretion of an underwriter is more often paramount. Our national mortgage search, using advanced tools, unlike any used by comparision sites, will include the High Street, but also considers an array of local, regional lending providers and a number of private banks both here in the UK and offshore.\u003C/p\u003E\n\n\u003Cp\u003EWe seek to ensure the best possible results for those who choose to use us.\u003C/p\u003E\n\n\u003Cp\u003EWe appreciate we are not right for everyone and clients we successfully work with appreciate not everyone is right for us to help. There are a range of other mortgage brokers in the UK but we hope that on searching through our mortgage website, viewing our transparency, which provides a number of potential products and rates, that you will obtain a clear sense of how we operate and how we will look to  assist you obtain the most affordable and suitable deal.\u003C/p\u003E\n\n\u003Cp\u003EOur mortgages are here for all to see and if general information is all you need, we wish you well. However, if you need the assistance of our broker team, you know we are here to help.\u003C/p\u003E\n\n\u003Cp\u003EBest Value Mortgages Tool\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}