{"name": "CapoCreative",
 "permalink": "capocreative",
 "crunchbase_url": "http://www.crunchbase.com/company/capocreative",
 "homepage_url": "http://www.capocreative.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "capocreative",
 "category_code": "consulting",
 "number_of_employees": 1,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-media, coronado, san-diego, online-reputation, web-design, websites, web-development, branding, logo-design, facebook, twitter, yelp, foursquare, youtube, google, seo, search-engine-optimization, marketing",
 "alias_list": "",
 "email_address": "scott@capocreative.com",
 "phone_number": "775-742-8502",
 "description": "Online Reputation Management",
 "created_at": "Fri Mar 18 20:43:00 UTC 2011",
 "updated_at": "Sat Mar 17 09:32:27 UTC 2012",
 "overview": "\u003Cp\u003ESpecializing in Online Reputation Management, we create a unique online network which allows you to connect with your audience like never before. We help you stay on top of the ever-changing landscape and even manage your interaction, leaving you with more time and ultimately more business. \u003C/p\u003E\n\n\u003Cp\u003EOnline Reputation:\nCapoCreative will organize your brand\u0026#8217;s online reputation. When this powerful medium is used effectively, you can build a powerful and engaged community helping you define your audience and ultimately grow your brand. Finding success using the web begins with understanding that the communities you build are your biggest fans and biggest critics. Running your social media platforms must be done with care. Your listings must resonate with your audience with consistent branding and information. You want to encourage feedback, constructive criticism can help you define your goals and make you better at what you do. Learning the wants and needs of your clients can greatly influence the future of your company. With so many platforms to choose from, it can be daunting to set off on that maiden voyage. Let CapoCreative help you navigate the Web 2.0.\u003C/p\u003E\n\n\u003Cp\u003ESEO:\nThese days, when we are looking for a service or need questions answered, we turn to search engines. The modern day Yellow Pages and Encyclopedia of our day. Just because you spent a bucket of money on a pretty website, doesn\u0026#8217;t mean that a single person will go to it. The mantra for the web should be build it and they won\u0026#8217;t come. You have to invest time and/or money to market your website to internet users and search engines. We call this search engine optimization. Search engines can direct potential clients to your doorstep. CapoCreative effectively blends an in-depth understanding of web analytics, public relations and social media optimization to direct the conversation in your favor. We customize your experience to ensure maximum ROI by utilizing PPC advertising, keyword analysis, and about 200 other factors which go into achieving maximum search engine rankings. The graphic artists at CapoCreative have been handpicked to blend modern marketing experience with effective visual design, providing the most effective foundation to your organization\u0026#8217;s brand. We take a fresh and unique approach specific to your organization for maximum impact.\u003C/p\u003E\n\n\u003Cp\u003EBranding:\nWe start with who you are, what you do, why you do it, where, when and how. Then we establish what you want to achieve. We evaluate your competition to find out what is going on around you and what sets you apart. Finally we take a look at your target market. We find out who your audience is, where they are, how they participate and what they are looking for. Your custom branding is built to maintain consistency throughout your organization\u0026#8217;s web presence, maximizing your exposure. We will tailor these brands to accommodate your social media needs, keeping you ahead of the game.\u003C/p\u003E\n\n\u003Cp\u003EWeb Design \u0026amp; Development:\nCapoCreative has partnered with Clustr Media to deliver real web solutions for real business objectives without the hassles, obligations, run-around and BS. No glitz. No whiz-bang, cluttered up, flashy stuff. We focus on clean, stylish, and most importantly, usable sites that present your best business and brand image online. If you\u0026#8217;re serious about your business and how it is represented on the web, don\u0026#8217;t put it in the hands of someone who \u0026#8220;plays\u0026#8221;Â\u009d on the web. We make sure your web identity reflects your business and your goals, and we\u0026#8217;ll do it with eye catching design and proven usability experience.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[132,
       150],
      "assets/images/resized/0012/8491/128491v7-max-150x150.jpg"],
     [[209,
       237],
      "assets/images/resized/0012/8491/128491v7-max-250x250.jpg"],
     [[209,
       237],
      "assets/images/resized/0012/8491/128491v7-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "522 Lander St.",
    "address2": "",
    "zip_code": "89509",
    "city": "Reno",
    "state_code": "NV",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}