{"name": "Carbon Guerrilla",
 "permalink": "carbon-guerrilla",
 "crunchbase_url": "http://www.crunchbase.com/company/carbon-guerrilla",
 "homepage_url": "http://www.carbonguerrilla.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Guerrillatweet",
 "category_code": "cleantech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "carbon-accounting, carbon-reduction-software, crc-compliance, carbon-consulting, reduce-carbon-emissions",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Online Carbon Accounting Software",
 "created_at": "Thu Jul 15 08:19:51 UTC 2010",
 "updated_at": "Fri Jul 16 22:27:13 UTC 2010",
 "overview": "\u003Cp\u003ECarbon Guerrilla offer online carbon accounting backed up by professional environmental consultants. \nFor complete compliance in the UK\u0026#8217;s Carbon Reduction Commitment energy efficiency scheme (CRC or now CRCEES). Carbon Guerrilla offer complete carbon accounting service from data collection, data\nentry and complete reporting tools. \nInexpensive, easy to use - complete control of your carbon emissions. \nThe software will enable your organisation to be completely CRC compliant. \nCarbon Guerrilla\u0026#8217;s software also follows the international standards for voluntary reporting - ISO 14064 and Bilane Carbone. \u003C/p\u003E\n\n\u003Cp\u003ECarbon Guerrilla offer organisations help and assistance to start reporting and managing their carbon emissions. It will cover both voluntary carbon reporting and legislation led carbon compliance. \nAt the current time CRCEES is on many organisations minds. \nCG will help you:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ERegister or make declaration for CRC. Deadlines for registration end on 30th September 2010. \u003C/li\u003E\n\u003Cli\u003EAdvise on Early Action Measures to help improve your position in the published league tables. \u003C/li\u003E\n\u003Cli\u003EHelp your organisation find access to the relevant data and assist uploading it into the CG software. \u003C/li\u003E\n\u003Cli\u003EShow how CG can be used as a business management tool - giving your organisation a real return on investment. \u003C/li\u003E\n\u003Cli\u003EManage and issue reports for compliance and ultimately reduce your carbon emissions. \u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ECarbon Guerrilla provide a cloud based carbon accounting tool. Giving companies full control over their Carbon Management strategy. Full CRCEES or Voluntary carbon reporting. This software is much more than a carbon footprint calculator, it is a business management tool. It shows where real cost savings can be seen across an organisation - giving real return on investment. \nCarbon Guerrilla is easy to use and inexpensive to implement backed up by very experienced environmental consultants. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       21],
      "assets/images/resized/0009/3570/93570v2-max-150x150.jpg"],
     [[250,
       35],
      "assets/images/resized/0009/3570/93570v2-max-250x250.jpg"],
     [[450,
       63],
      "assets/images/resized/0009/3570/93570v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}