{"name": "Cardia",
 "permalink": "cardia",
 "crunchbase_url": "http://www.crunchbase.com/company/cardia",
 "homepage_url": "http://cardiainc.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "CardiaInc",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": 1998,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "1 651.691.4100 ",
 "description": "",
 "created_at": "Tue May 28 03:47:25 UTC 2013",
 "updated_at": "Tue May 28 03:47:25 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in 1998, Cardia, Inc. is an innovative company engaged in developing, manufacturing and marketing transcatheter septal occluders. To date we have closed over 15,000 septal defects worldwide.\u003C/p\u003E\n\n\u003Cp\u003EUltrasept, our latest family of products, serves as our 7th generation of septal closure devices. The dual articulating sails allow for easy deployment of the devices and create a super low profile within the atria. Ultrasept devices boast a simple, hands-free loading feature and are fully retrievable before and after release. Ultrasept products include double-round devices for the percutaneous closure of both PFO’s (Patent Foramen Ovale) and ASD’s (Atrial Septal Defect).\u003C/p\u003E\n\n\u003Cp\u003EA septal occluder is a cardiac implant that fixes a cardiac defect commonly referred to as a “hole in the heart.\u0026#8221; Our devices are delivered through a catheter by an interventional cardiologist and only take about 30 minutes to implant. Many patients are admitted to the hospital in the morning and return home that afternoon or the next day without the lengthy recovery periods often needed after open-heart surgery.\u003C/p\u003E\n\n\u003Cp\u003EThe market for our septal occluder products revolves around the need to close or fix a number of both pediatric and adult cardiac defects. The PFO (Patent Foramen Ovale) defect appears to occur in approximately 25% of the adult population. Most people have no symptoms and therefore require no treatment; however, it is now believed that about 250,000-1,000,000 cases worldwide per year may require closure. These people initially experience a cryptogenic stroke and upon follow up with their neurologist are revealed to have a PFO defect. If the defect is not closed, these patients are subject to repeated strokes.\u003C/p\u003E\n\n\u003Cp\u003ESimilarly, ASD’s (Atrial Septal Defect) appear in approximately 100,000-150,000 cases per year worldwide. Over time, if the defect is left unrepaired, serious cardiac problems can arise.\u003C/p\u003E\n\n\u003Cp\u003EAnother possible application for the Ultrasept PFO devices is with regards to the relationship between PFO’s and migraine headaches. Presently it is known that approximately 50% of all migraine sufferers have a PFO. Clinical Studies are currently underway to confirm this relationship of PFO’s and migraine headaches.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0026/7815/267815v1-max-150x150.png"],
     [[250,
       81],
      "assets/images/resized/0026/7815/267815v1-max-250x250.png"],
     [[410,
       134],
      "assets/images/resized/0026/7815/267815v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$400k",
 "funding_rounds":
  [{"round_code": "debt_round",
    "source_url": "http://www.sec.gov/Archives/edgar/data/1074459/000136211813000036/xslFormDX01/primary_doc.xml",
    "source_description": "SEC",
    "raised_amount": 400005.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 5,
    "funded_day": 7,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "2900 Lone Oak Parkway ",
    "address2": "Suite 130 ",
    "zip_code": "55121 ",
    "city": "Eagan",
    "state_code": "MN",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        96],
       "assets/images/resized/0026/7814/267814v1-max-150x150.png"],
      [[250,
        161],
       "assets/images/resized/0026/7814/267814v1-max-250x250.png"],
      [[450,
        290],
       "assets/images/resized/0026/7814/267814v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}