{"name": "CareXtend",
 "permalink": "carextend",
 "crunchbase_url": "http://www.crunchbase.com/company/carextend",
 "homepage_url": "http://www.carextend.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "CareXtend",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "healthcare, health, wellness, illinois, marketplace",
 "alias_list": null,
 "email_address": "support@carextend.com",
 "phone_number": "888-689-9926",
 "description": "Health and wellness marketplace",
 "created_at": "Thu Jul 19 15:25:17 UTC 2012",
 "updated_at": "Thu May 30 15:21:43 UTC 2013",
 "overview": "\u003Cp\u003ECareXtend is an easy one-stop online health and wellness marketplace where consumers can purchase affordable products and services not typically covered by traditional health plans. The website, www.CareXtend.com, launched in Illinois on Monday, July 16, 2012.\u003C/p\u003E\n\n\u003Cp\u003ECareXtend is changing the face of the healthcare industry. With just a few clicks, consumers can browse based on their zip code or care need to find great offers on healthcare related products and services. The site delivers a personalized experience with an easy display of all past purchases, ability to customize views, quick access to account information, and a snapshot of estimated savings from purchases. CareXtend is not a deal of the day site; its offers remain active for an extended period of time to give consumers affordable access to the care they need, when they need it.\u003C/p\u003E\n\n\u003Cp\u003ECareXtend users will spend less on a broad range of healthcare offerings such as dental, chiropractic care, acupuncture, dermatology, cosmetic surgery, vision including Lasik, hearing, adult and childhood nutrition and weight loss, travel immunizations, podiatry, autism therapies, and over-the-counter medicines. CareXtend provides health and wellness offerings in the following three categories:\u003C/p\u003E\n\n\u003Cp\u003E-Care Vouchers give users a great one-time savings on services at a 20-60% discounted rate (e.g. acupuncture, skin care, nutrition/weight loss and foot care).\u003C/p\u003E\n\n\u003Cp\u003E-Discount Programs provide users with exclusive pricing for recurring products and services throughout the year (e.g. dental, vision, over-the-counter medications and hearing). \u003C/p\u003E\n\n\u003Cp\u003E-Subscription Services offer consumers and their families access to services that help manage and improve their health (e.g. 24-hour nursing, funeral planning, senior care search services, health related financial advice and health/lifestyle coaching). \u003C/p\u003E\n\n\u003Cp\u003EFor consumers who contribute to a Health Savings Account (HSA) or Flexible Spending Account (FSA), CareXtend identifies those products and services that are eligible for a deduction from these accounts.\u003C/p\u003E\n\n\u003Cp\u003EAccording to the Consumer Expenditure Survey 2010, Americans spend nearly $220 billion every year on products and services not covered by health insurance. Even with a good health plan, an average individual spends nearly $2,000 per year while a family can spend upwards of $3,500. The current marketplace for health and wellness products and services is highly fragmented giving consumers limited resources to reduce their spending.\u003C/p\u003E\n\n\u003Cp\u003E“Many consumers are faced with high deductibles and large out-of-pocket expenses for non-covered services with limited online resources to help mitigate the costs,” says Marc Pierce, CEO of CareXtend. “CareXtend is the solution and will revolutionize the way people go about purchasing health and wellness products and services. We are confident CareXtend will be a success and plan to expand to 15 states in the next two years.”\u003C/p\u003E\n\n\u003Cp\u003EThe recent passing of the Patient Protection and Affordable Care Act (PPACA) only further illuminates the need for CareXtend. Under this legislation, Americans are required to carry health insurance by 2014 or pay a penalty. For Americans who decide to obtain coverage, many will choose a high deductible plan and will face significant out-of-pocket healthcare expenses. For those who decide to forego health insurance and pay the mandated tax, they will still need access to affordable care. In addition, the creation of online exchanges, where individuals and employers will go to shop for health insurance, will exponentially increase the number of consumers shopping online for health and wellness products and services. \u003C/p\u003E\n\n\u003Cp\u003ECareXtend exclusively offers health and wellness products and services, and partners with reputable healthcare providers that hold valid state licenses and comply with HIPAA requirements. \u003C/p\u003E\n\n\u003Cp\u003ETo learn more about CareXtend, please visit www.CareXtend.com. \u003C/p\u003E\n\n\u003Cp\u003EABOUT CAREXTEND\nCareXtend is a one-stop online health and wellness marketplace that provides affordable access to products and services not covered by traditional health plans.\u003C/p\u003E\n\n\u003Cp\u003EFor more information, please visit www.CareXtend.com or follow CareXtend on Facebook or Twitter (@CareXtend).\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       127],
      "assets/images/resized/0020/1908/201908v2-max-150x150.jpg"],
     [[250,
       212],
      "assets/images/resized/0020/1908/201908v2-max-250x250.jpg"],
     [[450,
       383],
      "assets/images/resized/0020/1908/201908v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$1.21M",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "http://www.sec.gov/Archives/edgar/data/1573870/000157387013000001/xslFormDX01/primary_doc.xml",
    "source_description": "SEC",
    "raised_amount": 1210332.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 4,
    "funded_day": 12,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}