{"name": "CareerMonk",
 "permalink": "careermonk",
 "crunchbase_url": "http://www.crunchbase.com/company/careermonk",
 "homepage_url": "http://www.CareerMonk.com",
 "blog_url": "http://www.careermonk.com/?qa=feed/questions.rss",
 "blog_feed_url": "http://www.careermonk.com/?qa=feed/questions.rss",
 "twitter_username": "careermonk",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": 11,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "interview-questions, self-publishing",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "SelfPublishing: Interview Questions and ",
 "created_at": "Tue Oct 02 08:41:42 UTC 2012",
 "updated_at": "Mon Oct 15 19:11:11 UTC 2012",
 "overview": "\u003Cp\u003EAbout Us\u003C/p\u003E\n\n\u003Cp\u003ECareerMonk.com is owned and operated by CareerMonk Publications and it is a Hyderabad based start-up founded in November 2010 and started its functioning from June 2011. The company aims to make publishing accessible to all by leveraging technology. It offers a print on demand backed publishing platform which can be used by individual authors for publishing their books in print at little or no upfront investment. The platform includes various publishing tools, services and an online store to sell the books.\u003C/p\u003E\n\n\u003Cp\u003EThrough our services, you can sell books with small fraction of the cost of traditional manufacturing, while maintaining more control over your materials. We make it simple to distribute your books, music, and video through Internet retail outlets, your own website, and other bookstores, retailers, libraries, and academic institutions.\nAbout the Author/Founder\u003C/p\u003E\n\n\u003Cp\u003ENarasimha Karumanchi was the Senior Software Developer at Amazon Corporation, India. Most recently he worked for IBM Labs, Hyderabad and prior to that he served for Mentor Graphics and Microsoft, Hyderabad. He received his B-TECH. in Computer Science from JNT University and his M-Tech. in Computer Science from IIT Bombay. He has experience in teaching data structures and algorithms at various training centers and colleges.\nAdviser\u003C/p\u003E\n\n\u003Cp\u003ESatya Krishna Ganni is a Serial Technology Entrepreneur. He did undergraduate in BE Mechanical Engineering from JNTU and a Dual Masters in Mechanical and Computer Science Engineering from University of Illinois, Chicago and is very passionate about Technology and Entrepreneurship.In his Entrepreneurial career he launched 6 Companies, some of the prominent ones being WebPDM, Sematrica, Adaptive3D, LearnSocial etc and is currently working on his next start up. He is an Angel Investor, Adviser to few start ups and is based Full time in Hyderabad.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       52],
      "assets/images/resized/0021/3810/213810v3-max-150x150.png"],
     [[250,
       86],
      "assets/images/resized/0021/3810/213810v3-max-250x250.png"],
     [[450,
       156],
      "assets/images/resized/0021/3810/213810v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}