{"name": "Carmack Moving and Storage Online",
 "permalink": "carmack-moving-and-storage-online",
 "crunchbase_url": "http://www.crunchbase.com/company/carmack-moving-and-storage-online",
 "homepage_url": "http://carmackmovingandstorage.com",
 "blog_url": "http://carmackmovingandstorageblog.com",
 "blog_feed_url": "",
 "twitter_username": "CarmackMove",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1957,
 "founded_month": 9,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "carmack-moving-and-storage, carmackmovingandstorage, rob-carmack, robert-carmack",
 "alias_list": null,
 "email_address": "carmackmovingandstorageonline@gmail.com",
 "phone_number": "(703)378-1616",
 "description": "Carmack Moving and Storage Online",
 "created_at": "Sun Jun 02 17:32:25 UTC 2013",
 "updated_at": "Mon Jun 03 14:53:58 UTC 2013",
 "overview": "\u003Cp\u003ECarmack Moving and Storage is Fairfax County, Virginia’s premiere moving and storage provider, bringing over 28 year’s experience to area residents. With a fully trained staff and state of the art equipment, the team of professionals at Carmack Moving and Storage is ready to tackle any sized move whether in town or around the globe.  \u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage | Moving Services\u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage offers top quality relocation services for residential and commercial clients. The group utilizes a vast network of equipment and the industry’s most courteous labor professionals for each and every job. \u003C/p\u003E\n\n\u003Cp\u003EEvery expert mover at Carmack Moving and Storage has been expressly trained to work efficiently and effectively to ensure a smooth transition. And, Carmack Moving and Storage takes special care with heirlooms and other treasured items. The group is especially skilled and equipped to handle antique vehicles and musical equipment.\u003C/p\u003E\n\n\u003Cp\u003EStorage Options\u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage goes to great lengths to ensure that each crate, box, or free-standing object is marked and inventoried, ensuring their accessibility. With these steps in place, Carmack Moving and Storage can promise a stress-free storage experience. They have a clean, temperature controlled storage facility, with competitive rates and above average customer service. \u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage only uses the best materials when palletizing their clients’ precious personal items. With Carmack Moving and Storage’s dedicated record keeping department, constantly monitored grounds, and neatly palletized facility, customers are guaranteed the best storage experience they will ever have. \u003C/p\u003E\n\n\u003Cp\u003EStaging Services\u003C/p\u003E\n\n\u003Cp\u003ERealtors and home sellers can take advantage of home staging services presented by Carmack Moving and Storage. Staging services include a free crate and one month of free storage for your crate while your home is on the market. \u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage | Additional Services\u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage offers expert packing and unpacking services. They can transport furniture, antiques, and other valuable items to their storage facility or directly to the client’s destination. In addition to local moves, Carmack Moving and Storage also offers interstate hauling.\u003C/p\u003E\n\n\u003Cp\u003EValuation is provided for each move, which covers damage or loss due to company negligence. Carmack Moving and Storage has a very low claims rate but does suggest purchasing additional valuation to protect against travel related mishaps. Carmack Moving and Storage can facilitate this transaction and will happily help determine an appropriate dollar amount of coverage needed based on the weight of your shipment.\u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage provides a Bill of Lading for each project. This document serves as a receipt and clearly outlines Carmack Moving and Storage’s responsibilities and serves to protect the client – many service providers simply quote the job and end their paper trail.  The terms and conditions of your contract will be provided for your review prior to your move date.\u003C/p\u003E\n\n\u003Cp\u003EAdditional products and services may be available through prior arrangement with Carmack Moving and Storage.\u003C/p\u003E\n\n\u003Cp\u003ECosts\u003C/p\u003E\n\n\u003Cp\u003EJobs are priced either hourly or per project, based on cargo weight. Carmack Moving and Storage provides free estimates.\u003C/p\u003E\n\n\u003Cp\u003EAbout Carmack Moving and Storage\u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage has been growing since Rob Carmack got behind the wheel of his first moving truck in 1985. Since then, Carmack Moving and Storage has been proving residents of Northern Virginia, and the entire metro area, the most reliable and professional relocation services available. Rob takes the time to personally connect with each staff member, ensuring they understand his values of reliability and responsibility. \u003C/p\u003E\n\n\u003Cp\u003ECarmack Moving and Storage is a family-oriented company and strives for 100% satisfaction.\u003C/p\u003E\n\n\u003Cp\u003ETo contact Carmack Moving and Storage for a free, no obligation quote, call them at 703.378.1616 or toll-free at 866.627.4420. You may also email their administrative staff at info@carmackmoving.com. For home staging services, call Julia Silva at 703.378.1616.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0027/0314/270314v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0027/0314/270314v2-max-250x250.jpg"],
     [[300,
       300],
      "assets/images/resized/0027/0314/270314v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/pages/Carmack-Moving-and-Storage/402093043210275",
    "title": "Carmack Moving and Storage"},
   {"external_url": "https://plus.google.com/111740597034981072515/posts",
    "title": "Carmack Moving and Storage"},
   {"external_url": "http://www.merchantcircle.com/business/Carmack.Moving.and.Storage.Centreville.VA.703-378-1616",
    "title": "Carmack Moving and Storage"},
   {"external_url": "http://www.linkedin.com/company/carmack-moving-and-storage",
    "title": "Carmack Moving and Storage"},
   {"external_url": "https://twitter.com/CarmackMove",
    "title": "Carmack Moving and Storage"},
   {"external_url": "http://www.myspace.com/carmackmovingandstorage",
    "title": "Carmack Moving and Storage"},
   {"external_url": "http://www.lookuppage.com/users/carmackmovingandstorage/",
    "title": "Carmack Moving and Storage"},
   {"external_url": "http://www.youtube.com/user/CarmackMoveStore",
    "title": "Carmack Moving and Storage"}]}