{"name": "Castordor",
 "permalink": "castordor",
 "crunchbase_url": "http://www.crunchbase.com/company/castordor",
 "homepage_url": "http://www.goldenbeavergameservers.com",
 "blog_url": "http://www.goldenbeavergameservers.com",
 "blog_feed_url": "",
 "twitter_username": "GoldenBeaverGS",
 "category_code": "network_hosting",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "teamspeak-3-hosting-service, ts3-server, voice-server-provider, counter-strike-hosting, css-server, tf2-server, fps-game-host, gaming-hosting-service, game-servers, ventrilo-server-hosting, ventrilo-host",
 "alias_list": null,
 "email_address": "contact@goldenbeavergameservers.com",
 "phone_number": "",
 "description": "Voice server provider",
 "created_at": "Tue Feb 26 23:19:51 UTC 2013",
 "updated_at": "Wed Feb 27 06:27:46 UTC 2013",
 "overview": "\u003Cp\u003ECheap Teamspeak 3 hosting service, TS3 host, voice server provider, FPS game host, Counter Strike hosting, TF2 server, vent host, CSS server, web hosting.\u003C/p\u003E\n\n\u003Cp\u003EOUR MISSION\u003C/p\u003E\n\n\u003Cp\u003EWe want to provide low ping game hosting and fast voice servers at the lowest prices possible for those on a budget, our philosophy is to offer the same quality as the big leading providers because the quality and low prices can co-exist in this industry. Our goal is to take care of our clients equipment while they are playing their favorite games because we are network administrators or programmers and we love computers and technology. We want every customer to be a happy customer, then we are offering a 5 days refund policy on all our products!\u003C/p\u003E\n\n\u003Cp\u003ETECHNOLOGY\u003C/p\u003E\n\n\u003Cp\u003EGBGS’s servers are currently hosted in St. Louis, MO. In secure data centers equipped with a wide range of security, power management, cooling and network access equipment. Power regulation systems, diesel generators and air conditioning systems are vital aspects of the facilities. All these infrastructures are totally controlled and managed 365 days a year, 7 days a week, and 24 hours a day by a team of hosting infrastructures experts.\u003C/p\u003E\n\n\u003Cp\u003EABOUT OUR COMPANY\u003C/p\u003E\n\n\u003Cp\u003EGoldenBeaverGameServers.com is a small voice server provider and game hosting provider. We offer cheap Teamspeak 3 server hosting, Counter Strike: Source, Team Fortress 2 as well as other game hosting services. We are gamers since the first online games and as we also work in the computer industry, we decided to put the knowledge that we have gained over the years in the gamers community. It is important for us to run our business as a hobby and more for enjoyment than for profit.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/8580/238580v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0023/8580/238580v2-max-250x250.png"],
     [[250,
       250],
      "assets/images/resized/0023/8580/238580v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}