{"name": "Catalyst Resources",
 "permalink": "catalyst-resources",
 "crunchbase_url": "http://www.crunchbase.com/company/catalyst-resources",
 "homepage_url": "http://www.catalystresources.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "saas, interface-design",
 "alias_list": null,
 "email_address": "info@catalystresources.com",
 "phone_number": "1.800.313.7874",
 "description": null,
 "created_at": "Fri Jun 27 23:57:51 UTC 2008",
 "updated_at": "Wed Jul 14 16:40:47 UTC 2010",
 "overview": "\u003Cp\u003ECatalyst provides user interface and application design.  Catalyst has chosen to specialize in the unique UI demands of four markets: Financial Services, SaaS, Rapid Application Design, and RIA and AJAX Application Design.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[149,
       71],
      "assets/images/resized/0002/1206/21206v1-max-150x150.png"],
     [[149,
       71],
      "assets/images/resized/0002/1206/21206v1-max-250x250.png"],
     [[149,
       71],
      "assets/images/resized/0002/1206/21206v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Silicon Valley Office",
    "address1": "1700 South El Camino Real",
    "address2": "Suite 404",
    "zip_code": "94402",
    "city": "San Mateo",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.552137,
    "longitude": -122.314156},
   {"description": "Washington DC Office",
    "address1": "2300 M St NW",
    "address2": "Suite 800",
    "zip_code": "20037",
    "city": "Washington",
    "state_code": "DC",
    "country_code": "USA",
    "latitude": 40.75604,
    "longitude": -73.986941}],
 "milestones":
  [{"description": "Catalyst Goes Green and Reaps the Benefits",
    "stoned_year": 2008,
    "stoned_month": 6,
    "stoned_day": 27,
    "source_url": "http://www.catalystresources.com/saas-blog/detail/going_green_using_saas_and_rias/",
    "source_text": "Several years ago, we developed a web collaboration application, primarily for use by our own distributed teams and a few select clients.  This application allowed us to share project files, and coordinate team activities online. One immediate benefit was that it cut down on the volume of email back-and-forths.  All documents that required review or approval were simply posted online in a team or project workspace. This also made it feasible for employees to telecommute.\r\n\r\nIn the last year or so, we have been making an active effort as a company (and individuals) to go green and reduce our impact on the environment. We are working to be certified by the City as a green business, doing the standard reduce/recycle/reuse things including using CLFs, buying recycle paper, composting, using low-toxic cleaners, encouraging public transportation, etc.\r\n\r\nAs part of this green effort, we started tracking how our our web collaboration solution was reducing our carbon footprint by replacing the need for air travel and local commuting. The initial results, based on just our own staff and a few clients, were so encouraging that we decided to enhance the web collaboration solution and provide it to our entire client base.\r\n\r\nWe knew that our clients would be intellectually supportive of a green initiative. But reality was that they were already familiar and comfortable with email, face-to-face meetings and hard copy documents. If we were going to be successful at getting them to adopt web collaboration as a preferred way of doing business with Catalyst, we would have to provide a better user experience and enhanced productivity as compared to the incumbent solution.\r\n\r\nWe redesigned the application as a multi-tenant SaaS giving each client their own team space, with 24-hour, anywhere access.  We also developed a user-validated RIA interface that minimizes the training requirements, provides high performance, and is natural to use. Clients can configure their team space to incorporate their own branding, as well as their own industry-related terms and language.\r\n\r\nWe deployed this to seven clients located throughout the US, as well as our own employees. Then we tracked our travel, monthly expenses and billable hours compared to previous months.\r\n\r\nAfter implementing the new SaaS RIA web collaboration solution, Catalyst was able to reduce business travel and commuting across seven clients to achieve an average CO2 reduction of 21,000+ lbs per month. (roughly the amount produced by 3 US households in one year). In addition, in one month alone, Catalyst saved 70% in travel costs and increased billable activities by 20%.",
    "source_description": "Going Green (and increasing profitability) using SaaS and RIAs",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Catalyst Resources",
      "permalink": "catalyst-resources"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}