{"name": "CECL",
 "permalink": "cecl",
 "crunchbase_url": "http://www.crunchbase.com/company/cecl",
 "homepage_url": "http://www.cecl.in",
 "blog_url": "http://www.cecl.in/cecl.in/outreach/newsletter.html",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@cecl.in",
 "phone_number": "",
 "description": "Wind Energy consultants of over 25 years",
 "created_at": "Thu May 30 13:01:50 UTC 2013",
 "updated_at": "Fri May 31 20:31:53 UTC 2013",
 "overview": "\u003Cp\u003EConsolidated Energy Consultants Ltd (CECL) is a major wind energy consultant in India providing comprehensive Technical Services exclusively to the emerging field of Renewable Energy Sources with core area being conversion of Wind Energy to produce pollution-free electricity. CECL has been associated with Wind Energy Programme in India from day one.\u003C/p\u003E\n\n\u003Cp\u003ECECL has been actively associated as a prime wind energy consultant with formulation of policies, implementation of Demonstration Projects, preparation of Master Plans, study of Investment potential etc. for the entire panorama related with Wind Power generation for large size grid connected generators to wind-diesel hybrid system and even smallest stand-alone battery charger.\u003C/p\u003E\n\n\u003Cp\u003EDuring over two decades, the CECL has provided various consultancy services for wind energy projects from conceptualization to implementation as also on formulation of strategic plans to over 125 organisations involved in harnessing wind power.\u003C/p\u003E\n\n\u003Cp\u003ECECL has been associated with formulation and implementation of wind energy projects virtually for all the State Nodal Agencies in the windy states – ANERT Kerala, GEDA Gujarat, KREDL Karnataka, Lakshadweep Administration, MEDA Maharashtra, MPUVN Madhya Pradesh, NEDA Uttar Pradesh, NEDCAP Andhra Pradesh, OREDA Orissa, REDA Rajasthan, TNEB Tamil Nadu and WBREDA West Bengal. On request from MEDA CECL also prepared a strategic plan to promote Wind Power Programme in the state of Maharashtra and made a presentation to Maharashtra Electricity Regulatory Commission (MERC).\u003C/p\u003E\n\n\u003Cp\u003ECECL has published Directories on Indian Wind Power ever since 2001 to 2012 annually which provide comprehensive information at one place, pertaining to wind power in India.\u003C/p\u003E\n\n\u003Cp\u003ECECL has a strong engineering base of highly experienced engineers and wind energy experts of various disciplines (Civil, Electrical, Mechanical) at various levels. Total experience of engineering staff is more than 400 man-years. Some of the engineers have more than 40 years of experience in their field. In addition to this, total experience of engineers of M.P. Windfarms is more than 250 man-years. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       118],
      "assets/images/resized/0026/9250/269250v2-max-150x150.jpg"],
     [[250,
       197],
      "assets/images/resized/0026/9250/269250v2-max-250x250.jpg"],
     [[262,
       207],
      "assets/images/resized/0026/9250/269250v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "CECL ",
    "address1": "Energy Tower', 64 - B Sector, Kasturba Nagar, ",
    "address2": " INDIA",
    "zip_code": "462023. ",
    "city": "BHOPAL. ",
    "state_code": null,
    "country_code": "IND",
    "latitude": 23.2307803,
    "longitude": 77.4400774}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.cecl.in",
    "title": ""}]}