{"name": "Celestial Inspirations",
 "permalink": "celestial-inspirations",
 "crunchbase_url": "http://www.crunchbase.com/company/celestial-inspirations",
 "homepage_url": "http://www.indiamart.com/celestial-inspirations/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "feng-shui, yantra, kavach, amulets-and-gemstones",
 "alias_list": null,
 "email_address": "celestial-inspirations@tradepassport.org",
 "phone_number": "09953358639",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 06:57:07 UTC 2013",
 "updated_at": "Fri Apr 05 06:57:14 UTC 2013",
 "overview": "\u003Cp\u003ECelestial Inspirations is a sole proprietorship firm, established in the year 2001. The company starts its business as Astrology Services Provider and moved into sourcing of FengShui products, Yantra, Amulets, Lockets (energied) and Gemstones. Today Celestial Inspirations is an establisehed name as supplier, trader and distributor of an outstanding array of products in-Feng Shui, Yantra, Kavach, Amulets and Gemstones and premium Astrology Service. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nToday Celestial Inspirations is an establisehed name as supplier, trader and distributor of an outstanding array of products in-Feng Shui, Yantra, Kavach, Amulets and Gemstones and premium Astrology Service.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nBeing a quality and client centric firm, we are focused towards offering better quality products to the clients. Thus, we source our range from the recognized and trustworthy vendors of industry, whom we have selected after stern market research. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nTo streamline our all business operations and meet the specific requirements of clients efficiently, we have hired highly talented and experienced team of professionals. They all are selected according to their market experience, efficiency as well as knowledge of the respective field. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality is considered as the most significant element, which decides the progress range of an organization.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client centric firm, thus efficiently meeting their ever rising demands by providing range according to their expectations. To ably meet their demands, our experts work in close proximity with the clients to understand their desires and then meet those demands in a best possible manner.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0024/8355/248355v2-max-150x150.jpg"],
     [[250,
       98],
      "assets/images/resized/0024/8355/248355v2-max-250x250.jpg"],
     [[255,
       100],
      "assets/images/resized/0024/8355/248355v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}