{"name": "cellbusters partner program",
 "permalink": "cellbusters-partner-program",
 "crunchbase_url": "http://www.crunchbase.com/company/cellbusters-partner-program",
 "homepage_url": "http://www.cellbusters.com",
 "blog_url": "http://www.cellbusters.com",
 "blog_feed_url": "http://www.cellbusters.com",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cell-phone-detection, cell-phone-detector",
 "alias_list": null,
 "email_address": "",
 "phone_number": "866-402-3977",
 "description": "Detect and prevent Cell Phone use ",
 "created_at": "Fri Apr 13 01:59:54 UTC 2012",
 "updated_at": "Sat Apr 14 20:19:45 UTC 2012",
 "overview": "\u003Cp\u003EWith the global rise of technological innovation, the race to come out with more innovative and result-oriented gadgets has found many active participants. Especially, when it comes to protection, the market is flooded with a multitude of gadgets, all claiming to supersede the rests. Two of the most talked about protection gadgets in this regard include the Cell Phone Detector and the Cell Phone action Detector, respectively. Both of them are readily available in the marketplace at inexpensive price points depending on the functions they offer. You can buy the one that fits your specifications in the best possible manner.\nBrief overview\u003Cbr/\u003E\nThese equipments have excelled in their functioning and are steadily catching the bus of the best electronics. Developed and made with a technically secure Cell Phone Detector routine, a Cell Phone Detector comes in useful when you want to monitor the existence of a cellular in the location. A Cell Phone action Detector   on the other hand, is of great assistance in keeping the intruders at bay. In the subsequent note, both of these gadgets have been describe in detail. To start with, let us begin with a Cell Phone Detector.\nWhat is a Cell Phone Detector\nBroadly speaking, a Cell Phone Detector is created to Cell Phone Detection means feeling the actions such as texting, calling, SMS and MMS, being performed in a Cell Phone within a specified variety. It is an easy to use useful cellular phone, sometimes also called as sniffer or pocket-size cellular indication Detector. A number of Cell Phone Detector manufacturers have sprouted in the industry, each offering some or the other exceptional functions in their products. You can choose the one as per your own specifications.\nHow a Cell Phone Detector works\nCell Phone Detection is not an easy Process; Cell Phone Detector can feel the use of an activated Cell Phone within the variety of around one and a half meters. The Cell Phone Detector routine has been created to perfection so that it may be able to monitor the appearance of a Cell Phone and all its actions, including SMS, movie transmissions, incoming phone calls as well as outgoing phone calls. It is silent able to function properly even if the Cell Phone under surveillance is on silent mode. As soon as the Detector senses the RF indication signals from a Cell Phone located somewhere in its location, it starts raising a beep alarm which continues till the signal indication is not ceased.\nUses of Cell Phone detector \nEach of the Cell Phone Detector has been created to serve distinct purposes at home, in schools and colleges and other locations. Some of their uses are mentioned below:\n• A Cell Phone Detector could be used by school and college administrations to monitor certain non-permissible actions by the learners in the classroom, mostly during tests and examinations. The learners often leverage the capabilities of their extremely functional cellular phones to exchange the academic notes through phone calls, SMS, MMS and in other forms. With the help of the specialized Cell Phone Detector routine, this system finds the indication of any such information between the cellular phones kept within a specified variety.\n• At locations where the cellular phones are not allowed at all, a Cell Phone Detector once again is of much use. It could easily feel the use of a Cell Phone inside the restricted area, being taken either deliberately or deliberately. The locations under consideration could be examination halls, conference rooms, operation theaters, police stations and more.\n• The company owners and entrepreneurs can also use the Cell Phone Detector to help them monitor the actions being performed in the cellular phones of their employees. This could help them to know if there is some illegal exchange of sensitive information to and from the company premises in the form of text, image, audio or videos being transmitted via cellular phones. The Detector system being incorporated in the Cell Phone takes care of that significantly. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}