{"name": "Cellgsmservice",
 "permalink": "cellgsmservice",
 "crunchbase_url": "http://www.crunchbase.com/company/cellgsmservice",
 "homepage_url": "http://www.cellgsmservice.ro/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "cellgsmservice",
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cellgsmservice",
 "alias_list": null,
 "email_address": "cell_gsm@yahoo.com",
 "phone_number": "",
 "description": "CellGSMservice - service GSM",
 "created_at": "Mon Nov 29 11:33:38 UTC 2010",
 "updated_at": "Tue Feb 26 05:46:24 UTC 2013",
 "overview": "\u003Cp\u003ECellgsmservice - www.cellgsmservice.ro - Service-ul ales pentru repararea propriului telefon este foarte important. Un service GSM de calitate trebuie sa fie acreditat, cu un personal specializat si experimentat. In ziua de azi, gasim din ce in ce mai multe service-uri care incearca sa capete clienti, fara sa fie recunoscuti pentru seriozitate, eficienta si profesionalism. Acestia sunt dispusi sa apeleze la orice metode, chiar si sa denigreze concurenta directa.\u003C/p\u003E\n\n\u003Cp\u003EDaca aveti un iPhone stricat si trebuie să rezolvati problemele aparute, poate sa fie destul de dificil sa gasiti cele mai bune resurse. Luarea deciziei corecte pentru modul de a remedia problemele aparute la un iPhone este primul pas pentru realizarea cu succes a reparatiilor necesare. Analizarea corecta a situatiei telefonului inainte de a incerca sa remediem problemele iPhone-ului este al doilea pas. Există multi factori care trebuie să fie examinati inainte de a putea remedia problemele unui iPhone.\u003C/p\u003E\n\n\u003Cp\u003EDecat sa incercati dumneavoastra sa reparati o defectiune a telefonului, mai bine il duceti la persoane specializate, deoarece un necunoscator, indiferent cat de mica e problema aparuta, poate deteriora si mai mult telefonul, fiind ulterior mult mai greu de reparat. Un service autorizat Apple iPhone este cel mai in masura sa va remedieze problemele pe care le aveti cu telefonul preferat si va pot da sfaturi, acolo unde considerati ca aveti nevoie. Cellgsmservice vine in intampinarea dumneavoatra cu solutii complete de reparatii si service iPhone.\u003C/p\u003E\n\n\u003Cp\u003EDaca s-a intamplat sa scapati un iPhone din buzunar, din mana sau copilul dumneavoastra s-a jucat putin mai serios cu el, in mod sigur s-a intamplat sa se si sparga ecranul. In general cam asta se intampla cu un astfel de telefon. Sau mai bine zis in general se pot creea probleme cu ecran sau chiar display-ul. Datorita faptului ca toata aceasta noua tehnlogie se bazeaza pe touch screen, poate fi si extrem de sensibila.\nCellgsmservice va ajuta in tot felul de probleme legate de gadgetul dumneavoastra si fie ca vorbiti de probleme de hardware sau de software nu este o necunoscuta pentru noi. Echipa noastra formata din ingineri cunoscatori de microelectronica, pot verifica imediat si remedia problema in cel mai scurt timp. Datorita faptului ca noi am luat langa noi numai personal calificat in domeniu, puteti fi siguri ca plecati acasa cu gadgetul dumneavoastra fara problema cu care ati venit in prealabil.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0011/5667/115667v4-max-150x150.png"],
     [[250,
       43],
      "assets/images/resized/0011/5667/115667v4-max-250x250.png"],
     [[450,
       79],
      "assets/images/resized/0011/5667/115667v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Cellgsmservice",
    "person":
     {"first_name": "Adrian",
      "last_name": "Cellcenter",
      "permalink": "adrian-cellcenter",
      "image":
       {"available_sizes":
         [[[125,
            125],
           "assets/images/resized/0011/2100/112100v2-max-150x150.jpg"],
          [[125,
            125],
           "assets/images/resized/0011/2100/112100v2-max-250x250.jpg"],
          [[125,
            125],
           "assets/images/resized/0011/2100/112100v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/bmlAfueCFk4\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003ECellgsmservice - www.cellgsmservice.ro - Service-ul ales pentru repararea propriului telefon este foarte important. Un service GSM de calitate trebuie sa fie acreditat, cu un personal specializat si experimentat. In ziua de azi, gasim din ce in ce mai m\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}