{"name": "Celtrixa",
 "permalink": "celtrixa",
 "crunchbase_url": "http://www.crunchbase.com/company/celtrixa",
 "homepage_url": "http://www.celtrixa.tv/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 1000,
 "founded_year": 2010,
 "founded_month": 12,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Visibly Reduces Stretch Marks",
 "created_at": "Wed Nov 21 06:01:20 UTC 2012",
 "updated_at": "Wed Nov 21 08:14:17 UTC 2012",
 "overview": "\u003Cp\u003ECeltrixa is a scientifically advanced topical lotion containing a proprietary blend of powerful ingredients to even out skin tone and help reduce the appearance of stretch marks. It keeps skin moisturized, boosts skin\u0026#8217;s elasticity, and protects against future stretch marks.  \u003C/p\u003E\n\n\u003Cp\u003EThe clinically proven ingredients in Celtrixa make it really effective. The two key ingredients are Regu Stretch and O.D.A White. \u003C/p\u003E\n\n\u003Cp\u003EStudies on Regu Stretch show that it can visibly reduce the appearance of the length, width, and color of stretch marks. An efficacy study was carried on Regu Stretch, where 85 percent of the women participants reported a decrease in the width and color of the stretch marks. Around 74 per cent of these users also noticed an increase in skin softness and suppleness. This self-evaluation study was carried out on 18 women over a 84 day period. \u003C/p\u003E\n\n\u003Cp\u003EAn user participation study of 21 women over 8 week period was carried out to understand the effects of O.D.A White. At the end of the study, 90 per cent of users had visibly brighter skin. \nWhat do these ingredients do? \u003C/p\u003E\n\n\u003Cp\u003ERegu Stretch hydrates and keeps skin supple. It also prevents new stretch marks from forming. O.D.A. White is a brightening agent that can visibly brighten the appearance of skin in just about two weeks. \u003C/p\u003E\n\n\u003Cp\u003ECeltrixa is safe and paraben free. It does not have any side effects, short or long-term. Use it regularly as directed and you can see the results within two weeks. For optimal results, use it for a minimum of three months.  \u003C/p\u003E\n\n\u003Cp\u003EFor best results while using Celtrixa, maintain a healthy, active lifestyle. Take a balanced diet coupled with regular cardiovascular exercise and strength training. Give up smoking to maintain skin quality and delay the onset of wrinkles. \u003C/p\u003E\n\n\u003Cp\u003ECeltrixa is available as part of a 30 Try It Before You Buy It Risk Free Trial Offer with money back guarantee. First time customers users can avail this risk free offer and get a month\u0026#8217;s supply of the product by paying the shipping and processing costs. They get two tubes of Celtrixa to try risk free for 30 days. If they like the results, and want to continue using it, they do not have to do anything else. If they are not completely satisfied, they can call Customer Service to arrange for a return of the product, and return the product even if the containers are empty. However, this has to be within 30 days for a full refund of the product purchase price less shipping and processing. This risk free trial comes with a Celtrixa Microdermabrasion Stick, absolutely free.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       59],
      "assets/images/resized/0022/1374/221374v2-max-150x150.png"],
     [[237,
       94],
      "assets/images/resized/0022/1374/221374v2-max-250x250.png"],
     [[237,
       94],
      "assets/images/resized/0022/1374/221374v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "http://www.tryceltrixa.com/",
    "is_past": false,
    "provider":
     {"name": "Try Celtrixa",
      "permalink": "try-celtrixa",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}