{"name": "CENTROG",
 "permalink": "centrog",
 "crunchbase_url": "http://www.crunchbase.com/company/centrog",
 "homepage_url": "http://www.centrog.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 20,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software-engineering, -net, mvc, javaj2ee, php, mobile, crm, erp",
 "alias_list": null,
 "email_address": "mihajlo@centrog.com",
 "phone_number": "",
 "description": "",
 "created_at": "Wed Apr 10 13:35:06 UTC 2013",
 "updated_at": "Wed Apr 10 13:39:29 UTC 2013",
 "overview": "\u003Cp\u003ECentrog is one of Macedonia’s top IT Services and System Integration companies with special focus on consulting, education, trainings and development, headquartered in Skopje, Macedonia. Our team pride on our 8 years of experience in the System Integration, Development and Consulting with history of traceable success. We specialize in semantic and organic strategic plans to provide System Integration, website and application engineering, in-depth consulting and education, all tailored to fit the budgets of our clients in order to support them with best cost/benefit solutions.\u003C/p\u003E\n\n\u003Cp\u003EOur goal is to assist small, medium and enterprise companies to develop, grow, connect and enhance their productivity, professionalism and overall corporate value.\u003C/p\u003E\n\n\u003Cp\u003EOur Mission at CENTROG to be opportunistic on the quest to become technological one-stop-shop where our clients walk in, lay out their technological problems and requirements, and walk out with solution.\u003C/p\u003E\n\n\u003Cp\u003EWe endeavor to provide high quality value for money services in order to enable our clients to reach their full corporate potential. The tailoring of our mission had in mind close synergic cooperation with our clients in order to develop strategies that will upgrade and evolve their business.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision at CENTROG to simplify technology all in manner to help our customers digest it, unleash innovation and overcome complexity.\u003C/p\u003E\n\n\u003Cp\u003EOur Values at CENTROG are built on the belief that every mission requires detailed and strategic approach in order to understand the way towards success. We embed our values in every aspect of our services:\u003C/p\u003E\n\n\u003Cp\u003ESimplify: Speed information, service and project delivery with integrated strategy and detailed approach.\u003C/p\u003E\n\n\u003Cp\u003EStandardize: Reduce cost, time and process cycles all in order to provide standard with unmatchable performance and quality.\u003C/p\u003E\n\n\u003Cp\u003EAutomate: Improve operational efficiency with technology, consulting and best practices.\u003C/p\u003E\n\n\u003Cp\u003EAdapt: In this ever changing world adaptation is essential in order to achieve sustainable results.\u003C/p\u003E\n\n\u003Cp\u003ECollaborate: We create and develop logical and enduring relations with our clients, enabling us to reach their business goals and maximize their ROI.\u003C/p\u003E\n\n\u003Cp\u003EDedicate: Single-minded focus to do whatever it takes bringing out our proactive and resourceful approach.\u003C/p\u003E\n\n\u003Cp\u003EOver-perform: Over-deliver on our services to clients, thriving on perfect and maximized value over simple contractual promises.\u003C/p\u003E\n\n\u003Cp\u003EIntegrate: Mold all our services together in order to deliver one-stop-shop i.e. the pillar of our success. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0025/0263/250263v2-max-150x150.png"],
     [[224,
       50],
      "assets/images/resized/0025/0263/250263v2-max-250x250.png"],
     [[224,
       50],
      "assets/images/resized/0025/0263/250263v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Centrog Headquarters",
    "address1": "bul. Ilinden 3/46",
    "address2": "",
    "zip_code": "1000",
    "city": "Skopje",
    "state_code": null,
    "country_code": "MKD",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}