{"name": "Certicon",
 "permalink": "certicon",
 "crunchbase_url": "http://www.crunchbase.com/company/certicon",
 "homepage_url": "http://www.certiconglobal.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 120,
 "founded_year": 1996,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "decision-support, prediction-algorithms, planning, scheduling, modeling, simulation, analytical-data-management, multi-agent-systems, software-development, software-verification, software-testing, machine-perception, data-mining, image-recognition",
 "alias_list": null,
 "email_address": "vladimir.kozak@certiconglobal.com",
 "phone_number": "",
 "description": "software engineering",
 "created_at": "Fri Jun 24 19:37:11 UTC 2011",
 "updated_at": "Sat Mar 31 22:22:22 UTC 2012",
 "overview": "\u003Cp\u003ECerticon provides technology transfer, software development outsourcing and applied research solutions.\u003C/p\u003E\n\n\u003Cp\u003ECertiCon\u0026#8217;s solutions comprise the full spectrum of services and solutions in software development and quality-assurance verification testing. Our experience in the fields of medical and mission-critical applications and high-tech industrial applications enables us to harness the best practices and solutions for the clients. CertiCon designs, develops, rapid-prototypes and deploys sophisticated software solutions. Our projects and solutions cross medical and industrial domains by leveraging state-of-the-art methodologies and technologies.\u003C/p\u003E\n\n\u003Cp\u003ESoftware Development, Testing and Verification\u003C/p\u003E\n\n\u003Cp\u003ERecognized as a leader in software engineering, CertiCon is able to provide software solutions that are designed and built specifically for the medical devices, automotive diagnostics, defense, telcos and financial services industries, with a focus on ultimate quality outputs, unsurpassed reliabilty and expertise. As a long-term co-sourcing partner of a premium US medical device manufacturer, CertiCon guarantees and proves the ability to perform at the highest quality level, while maintaining project flexibility.\nSoftware Development Full Life Cycle\nApplied R\u0026amp;D in Software Engineering and Artificial Intelligence\u003C/p\u003E\n\n\u003Cp\u003ECertiCon closely cooperates with top research labs at several universities: Gerstner Lab, Czech Technical University in Prague, the Christian Doppler CD-Flex Labor and Vienna University of Technology. These world-class organizations provide us with access to their newest technology research results.\u003C/p\u003E\n\n\u003Cp\u003EMedical Device Software Engineering\u003C/p\u003E\n\n\u003Cp\u003EWhile medical devices generate large quantities of data, extracting useful and reliable information from the data can be problematic. This is where CertiCon steps in, takes the concept, harnessing appropriate logic/artificial intelligence, and delivers the product design with all required documentation within the shortest ramp-up time. The end-result with a CertiCon designed medical device is a product which will greatly facilitate and improve the decision making abilities of the healthcare professional users.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       65],
      "assets/images/resized/0014/1187/141187v2-max-150x150.jpg"],
     [[250,
       109],
      "assets/images/resized/0014/1187/141187v2-max-250x250.jpg"],
     [[450,
       197],
      "assets/images/resized/0014/1187/141187v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Vladimir",
      "last_name": "Marik",
      "permalink": "vladimir-marik",
      "image": null}},
   {"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Vladimir",
      "last_name": "Kozak",
      "permalink": "vladimir-kozak",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Prague Headquarters",
    "address1": "Vaclavska 12",
    "address2": "",
    "zip_code": "12000",
    "city": "Prague",
    "state_code": null,
    "country_code": "CZE",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        110],
       "assets/images/resized/0014/1186/141186v2-max-150x150.jpg"],
      [[250,
        184],
       "assets/images/resized/0014/1186/141186v2-max-250x250.jpg"],
      [[450,
        332],
       "assets/images/resized/0014/1186/141186v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}