{"name": "ChainDrugStore.net",
 "permalink": "chaindrugstore-net",
 "crunchbase_url": "http://www.crunchbase.com/company/chaindrugstore-net",
 "homepage_url": "https://www.chaindrugstore.net/welcome_center.aspx",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2000,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "pharmacy, online-drug-store",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Pharmacy Online Communication Network",
 "created_at": "Wed Mar 31 22:02:37 UTC 2010",
 "updated_at": "Wed Mar 31 22:03:19 UTC 2010",
 "overview": "\u003Cp\u003EChainDrugStore.net is the network for manufacturers, wholesalers and payers who need to analyze, understand and manage their pharmacy activity to achieve increased profitability and business efficiencies. The company works with more than 300 manufacturers, wholesalers and managed care organizations to positively impact pharmacy purchasing, dispensing, reimbursement and contracting strategy through secure online communications, analytics and proprietary business intelligence tools.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0008/2590/82590v1-max-150x150.png"],
     [[250,
       61],
      "assets/images/resized/0008/2590/82590v1-max-250x250.png"],
     [[397,
       97],
      "assets/images/resized/0008/2590/82590v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "421 King Street ",
    "address2": "Suite 301 ",
    "zip_code": "22314",
    "city": "Alexandria",
    "state_code": "VA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [{"description": "Partnership with PharmMD",
    "stoned_year": 2010,
    "stoned_month": 3,
    "stoned_day": 31,
    "source_url": "http://www.freshnews.com/news/305444/pharmmd-and-chaindrugstorenet-announce-new-partnership",
    "source_text": "NASHVILLE, Tenn., March 31 /PRNewswire/ -- PharmMD (www.pharmmd.com), the nation's Medication Therapy Management (MTM) industry quality leader, along with ChainDrugStore.net, the leading communication and information aggregating service for the retail pharmacy industry, announces a new exclusive partnership that will launch in mid 2010.\r\n\r\n\"We are excited about offering additional value-added opportunities and services to the useful information already provided through ChainDrugStore.net. With the new Health Reform demands we offer better access to the much needed medication experts around the country,\" said Todd Grover, CEO of ChainDrugStore.net.\r\n\r\nThis new venture will give PharmMD access to ChainDrugStore.net's network of 40,000 plus pharmacists, establishing PharmMD even further as the nation's quality leader in MTM. In return, PharmMD gives CDS.net's vast network of pharmacists the opportunity to join PMD's elite team providing the expertise that results in quality MTM affecting hundreds of thousands of lives.\r\n\r\n\"Both the marketplace and the Health Reform bill are demanding that we address the appropriate use of medication and develop tools to combat misuse, errors and adverse reactions,\" said Bo Bartholomew, PharmMD's President and CEO. \"We believe there is tremendous opportunity for medication therapy management (MTM) to control medical and drug spending while also limiting the downstream healthcare costs created by medication errors or drug interactions. We are pleased to work with pharmacists through ChainDrugStore.net on this important initiative.\"\r\n\r\nPharmMD works to optimize medication use and directly improve overall healthcare costs by connecting health-plan members, patients, and beneficiaries to skilled pharmacists and prescribers. These specialized medication experts provide beneficiaries with a level of quality care that changes the traditional view of how pharmacists relate to patients and their medications. Based on their ability to provide efficient and effective clinical services, participating pharmacists are guaranteed a consistent number of referrals from PharmMD.\r\n\r\nPharmacists wishing to join PharmMD's MTM network are encouraged to complete an application by going to www.pharmmd.com or www.CDS.net.\r\n\r\nAbout PharmMD:\r\n\r\nPharmMD is the quality leader in Medication Therapy Management Solutions. Based in Brentwood, Tenn., PharmMD works with employers, health plans and payers, to prevent medication related health problems through the application of the best pharmacist and physician knowledge using their proprietary MTM software. Founded in 2006, PharmMD improves coordination and communication among physicians, pharmacists, payers and beneficiaries by analyzing and integrating pharmacy and medical claims information and clinical decision making. Because PharmMD focuses exclusively on MTM, the company is able to analyze both aggregate and patient-specific data to identify trends and conflicts to positively impact patient health and contain costs.",
    "source_description": "PHARMMD AND CHAINDRUGSTORE.NET ANNOUNCE NEW PARTNERSHIP  ",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "ChainDrugStore.net",
      "permalink": "chaindrugstore-net"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}