{"name": "Chamunda Engineering Works",
 "permalink": "chamunda-engineering-works",
 "crunchbase_url": "http://www.crunchbase.com/company/chamunda-engineering-works",
 "homepage_url": "http://www.indiamart.com/chamundaengineering-ahmedabad/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "chamundaengineering-ahmedabad@tradepassport.org",
 "phone_number": "9925062973",
 "description": "",
 "created_at": "Thu Apr 04 15:47:58 UTC 2013",
 "updated_at": "Thu Apr 04 15:48:01 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1996, we, “Chamunda Engineering Works” are coveted and experienced manufacturers and suppliers of a wide range of Industrial Machine \u0026amp; Spare Parts.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have hired for our firm a team of efficient professionals who have been trained as per our work process. Competent enough and highly dedicated towards their work, these professionals work in a coordinated manner to achieve the organizational goal. Working in tandem with the client specifications and demands, these professionals have been taught to maintain a client centric approach and gain business for the firm while maintaining the trust of the customers.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nSince our inception itself, we have gathered ample of knowledge and expertise for manufacturing a qualitative range of these machines. Quality has always been our prime motive and we have adhered to it with all means. We have made it our prime objective to provide our customers with the best quality products.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nIn order to easily accommodate and carry out our production process, we have established a fully equipped and sophisticated infrastructure. Capacious and sprawling enough, the infrastructure has been well divided and categorized in to various units where in we carry out various processes\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur company caters to a huge client base today due to the coveted and consistent efforts to our team. We have designed and developed all these machines and factory equipment for easing the production process of various patrons of ours. Our clients have been in consistent demand of our products for its comprehensive factors of easy operations and cost effectiveness in comparison to other conventional types. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8046/248046v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8046/248046v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8046/248046v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}