{"name": "Cheap Vacuum Cleaners Online",
 "permalink": "cheap-vacuum-cleaners-online",
 "crunchbase_url": "http://www.crunchbase.com/company/cheap-vacuum-cleaners-online",
 "homepage_url": "http://www.cheapvacuumcleanersonline.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 1,
 "founded_year": 2012,
 "founded_month": 6,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "vacuum-cleaner, cheap, cheapest, hoover, vax, dyson, online, bargain, retail, sales",
 "alias_list": null,
 "email_address": "thevacshack@ymail.com",
 "phone_number": "",
 "description": "Cheap Vacuum Cleaners Online",
 "created_at": "Tue Jun 05 15:09:56 UTC 2012",
 "updated_at": "Sat Jun 09 17:12:00 UTC 2012",
 "overview": "\u003Cp\u003ECleaning Up on the Internet -\nA Business That Sucks\u003C/p\u003E\n\n\u003Cp\u003EA brand new internet based business is set to clean up with vacuum cleaner sales online.\u003C/p\u003E\n\n\u003Cp\u003EThe founder of the company has had an interest in vacuum cleaners since an early age and could often be found in electrical shops picking up all the latest literature which inevitably ended up being cut up for scrap books. Later in life he started a collection of vintage vacuum cleaners – mostly recollections of his childhood. The latest chapter in the story is the formation of an exciting website offering machines at heavily discounted prices.\u003C/p\u003E\n\n\u003Cp\u003EThe innovative company Cheapvacuumcleanersonline.co.uk boasts premium quality machines at an affordable price. Company Founder Glen Twamley said “I am very pleased to be to be showcasing all these cleaners on one website location, and in a way that’s easy for the online consumer to search and shop for these products. Everything we carry is from the leading manufacturers, often with as much as 50 percent off”. He went on to say “we also offer free delivery throughout the United Kingdom”.\u003C/p\u003E\n\n\u003Cp\u003EHaving worked in retail himself, Mr. Twamley knows only too well how little product training some store staff receive on the goods they are supposed to be selling. This results in customer’s questions not be answered accurately, and sometimes the mis-selling of products. He prides himself in being able to say “Vacuum cleaners are our business. We sell nothing else”.\u003C/p\u003E\n\n\u003Cp\u003ERetail buying becomes much less of a chore when everything you need is online 24 hours a day, 7 days a week. Anyone who wants to save money on their next vacuum cleaner can just drop by their website and view all the bargains at the click of a button.\u003C/p\u003E\n\n\u003Cp\u003ECheap Vacuum Cleaners Online has its headquarters in Taunton, Somerset, and if a vacuum cleaner is what you are looking for, you can be sure to find it on the new website.\u003C/p\u003E\n\n\u003Cp\u003EFor more information, visit www.cheapvacuumcleanersonline.co.uk\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       93],
      "assets/images/resized/0019/4007/194007v2-max-150x150.png"],
     [[241,
       151],
      "assets/images/resized/0019/4007/194007v2-max-250x250.png"],
     [[241,
       151],
      "assets/images/resized/0019/4007/194007v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}