{"name": "CheapGurus",
 "permalink": "cheapgurus",
 "crunchbase_url": "http://www.crunchbase.com/company/cheapgurus",
 "homepage_url": "http://www.CheapGurus.com",
 "blog_url": "http://www.cheapgurus.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 14,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it-training, it-certification, training-institutes, learn-technology, training-programs, it-trainers, new-skill-learning, learn-new-technology",
 "alias_list": null,
 "email_address": "admin@cheapGurus.com",
 "phone_number": "",
 "description": "Listing of  Best IT Trainers and Courses",
 "created_at": "Mon Nov 12 22:36:03 UTC 2012",
 "updated_at": "Wed Nov 14 05:07:55 UTC 2012",
 "overview": "\u003Cp\u003ECheapGurus.com is the largest listing site for IT Trainers and Training Programs and it is designed to bridge gap between IT Learners and Trainers.\u003C/p\u003E\n\n\u003Cp\u003EIt is not uncommon to see IT professionals in constant quest to learn new technologies, software, or applications either to progress at their current job or to make switch into more lucrative jobs. With the rapid changes in the technologies, one has to keep learning new things to keep their expertise status in their respective fields. Their quest to acquire required skill starts with Google search or classifieds section of popular sites. Within no time they get confused with the questions like how to choose the best training program for me? Who is reliable and can I trust this trainer? Is this training course suitable for me?\u003C/p\u003E\n\n\u003Cp\u003ETill today there is no website to help IT Learners to find the best trainers for their learning needs. CheapGurus.com is designed to help these learners and also to bring IT trainers closer to them. In the site, Learners can search or browse by category of training programs and review feedbacks given by other students.  Then learners can make educated choice and choose the best trainer or training programs for their needs. \u003C/p\u003E\n\n\u003Cp\u003EOn the other hand, CheapGurus.com offers a free social platform for IT trainers and Training institutes to publish their training courses and to showcase their expertise. Also IT trainers can build their online reputation and social branding by asking their current and past students to review about their programs.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder \u0026 CEO",
    "person":
     {"first_name": "Sekhar",
      "last_name": "Pal",
      "permalink": "sekhar-pal",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        96],
       "assets/images/resized/0022/0120/220120v2-max-150x150.png"],
      [[250,
        160],
       "assets/images/resized/0022/0120/220120v2-max-250x250.png"],
      [[450,
        288],
       "assets/images/resized/0022/0120/220120v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}