{"name": "Cheap Best Hosting",
 "permalink": "cheap-best-hosting",
 "crunchbase_url": "http://www.crunchbase.com/company/cheap-best-hosting",
 "homepage_url": "http://www.cheapbesthost.com",
 "blog_url": "http://www.blog.cheapbesthost.com",
 "blog_feed_url": "http://feeds.feedburner.com/CheapBestHostingBlog",
 "twitter_username": "BestCheapHostin",
 "category_code": "network_hosting",
 "number_of_employees": 15,
 "founded_year": 2009,
 "founded_month": 7,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "admin@cheapbesthost.com",
 "phone_number": "6281268633662",
 "description": "Provides website hosting services",
 "created_at": "Sat Feb 02 09:52:10 UTC 2013",
 "updated_at": "Sun Feb 03 06:54:26 UTC 2013",
 "overview": "\u003Cp\u003ECheap Best Hosting a privately held web hosting company specialized in web hosting services. Our mission is to give outstanding customer support and a fast and reliable network with many features at an affordable price. We will not sacrifice network reliability for financial gain. We place performance before profit, and continually monitor all our servers performance and loads.\u003C/p\u003E\n\n\u003Cp\u003ECheap Best Hosting provides Web Hosting services, Reseller Hosting, Virtual Private servers (VPS), Dedicated servers and Web design. In addition we also provide Domain registration services with a price that is very affordable and competitive.\u003C/p\u003E\n\n\u003Cp\u003ENetwork Information\u003C/p\u003E\n\n\u003Cp\u003EOur Network offers low latency, high throughput, redundancy, uptime and the reliability you would come to expect from a Top Tier provider. With our hub in Dallas, TX, Atlanta GA, and Sheatle WA, USA. Our network performs at swift speeds, reaching your customers efficiently regardless of their location. Guaranteed by our SLA for 99.99% uptime our network will get you as close to the cloud as you can be. This is done thanks to multiple Gigabit links to various carriers, as well as Internap\u0026#8217;s Flow Control Platform (FCP.\u003C/p\u003E\n\n\u003Cp\u003EThe Network Operations Center utilizes the CentOS Linux operating system on the majority of servers present. CentOS Linux is a highly configurable system, and well known for speed and stability. CentOS Linux servers have been documented to remain operating for up to one year at a time without even requiring a reboot. The Apache Web Server nicely compliments the CentOS Linux Operating System. Server operating system, with Internet Information Server Web Server. Microsoft Windows 2003/2008 Server provides a system that simplifies database, application, and visual effect programming. Cheap Best Hosting also supports FreeBSD, Fedora, Ubuntu, Debian operating systems. CPanel, Plesk, DirectAdmin, Virtualizor, OpenVZ, \u0026amp; Virtuozzo control panels compliment the default operatins systems\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0023/3142/233142v2-max-150x150.png"],
     [[250,
       60],
      "assets/images/resized/0023/3142/233142v2-max-250x250.png"],
     [[276,
       67],
      "assets/images/resized/0023/3142/233142v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}