{"name": "Check-in for Good",
 "permalink": "check-in-for-good",
 "crunchbase_url": "http://www.crunchbase.com/company/check-in-for-good",
 "homepage_url": "http://www.checkinforgood.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "checkinforgood",
 "category_code": "advertising",
 "number_of_employees": 6,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile, location, fundraising, social, peer-to-peer, advertising",
 "alias_list": null,
 "email_address": "info@checkinforgood.com",
 "phone_number": "919-438-1288",
 "description": "Check-in Fundraising; Pay-per-Visit ",
 "created_at": "Mon Jul 02 00:20:37 UTC 2012",
 "updated_at": "Thu Apr 25 03:03:00 UTC 2013",
 "overview": "\u003Cp\u003EMore organizations than ever before require funds to operate, to expand, and to deliver impactful programming to the people who need assistance the most.  Advances in social, mobile and location-based technology allow groups to organize, communicate and participate in new ways, such as bridging the gap between fundraising causes, social networks and retail businesses. \u003C/p\u003E\n\n\u003Cp\u003ECollectives empower social concerns (causes). These groups can influence behavior and drive traffic, individually and collectively. Check-in for Good is a fundraising and awareness service for causes and a traffic driver to retail businesses. It is a location-based mobile solution connecting individuals and their social networks with companies in order to (1) simplify cause fundraising and (2) generate new customers for local businesses. Check-in for Good is a system of online and mobile tools that leverages the power of groups through emerging mobile, social and location-based technology. The system services three actor types, businesses, causes and individuals, and does so with the following goals in mind: \nBusinesses: Goal is to gain new customers and a turnkey social marketing system.\nCauses: Goal is to generate new and sustained funds and awareness.\nIndividuals: Goal is to allow people to support the causes important to them, the businesses who support their local causes and to help them save money. \u003C/p\u003E\n\n\u003Cp\u003EWhere most new technologies are disruptive, Check-in For Good actually takes the disruption out of fundraising and allows you to actively support your cause by doing what you would normally do - go out to dinner, the grocery store, the dry cleaner or hundreds of other businesses a user visits every day.  \u003C/p\u003E\n\n\u003Cp\u003EHow does Check-in For Good work?  A group that wants to raise money - a non-profit, school, or sport team - signs up for free at CheckinForGood.com. Then, the group asks businesses to make a micro-donation whenever someone from the group physically visits that business. Members of the organization are provided a free smartphone app to check-in. When they do, they raise money for their cause.\u003C/p\u003E\n\n\u003Cp\u003EFor a business, Check-in For Good represents a new form of advertising – pay per visit. Modeled after the success of the online pay-per-click model, where businesses only pay in the event of a user action, the pay-per-visit model only cost the business in the event of an actual visit to their business, producing a highly effective return on their investment. There are no fees for a business to sign up for Check-in For Good or for adding as many causes as they would like to support.  The only time a donation is made is when a customer is standing in their store – doing what many traditional forms of advertising can not ensure, delivering the customer that proverbial last mile.  The business has control of how much they would like to pay per check-in (similar to PPC), what causes they would like to support and even to set the donation limit per month. \u003C/p\u003E\n\n\u003Cp\u003EThe Check-in for Good pay per visit model also allows the business to cultivate relationships in their communities in several new ways. Foremost, Check-in for Good offers a turn-key social marketing campaign for businesses, delivered through the social media mentions of their customers who check in. With Facebook and Twitter users averaging approximately 130 friends or followers, the volume of positive community impressions for a participating business can scale into the hundreds of thousands of controlled “positive only” impressions delivered peer-to-peer directly from their customers. \u003C/p\u003E\n\n\u003Cp\u003EThe Check-in for Good action based eco-system brings a level of precision and simplicity to businesses managing location based check-ins and other location based customer engagement. Whether it is business controls, taxation, non-profit integration, even social mention tracking, Check-in for Good is loaded with tools and resources empowering businesses to better control the on-site relationships with their customers. The continuing emergence of NFC enabled phones will only accelerate and heighten that level of precision. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[128,
       128],
      "assets/images/resized/0019/8245/198245v2-max-150x150.jpg"],
     [[128,
       128],
      "assets/images/resized/0019/8245/198245v2-max-250x250.jpg"],
     [[128,
       128],
      "assets/images/resized/0019/8245/198245v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "Legal",
    "is_past": false,
    "provider":
     {"name": "Loeb \u0026 Loeb",
      "permalink": "loeb-loeb",
      "image": null}},
   {"title": "Legal",
    "is_past": false,
    "provider":
     {"name": "Flynn IP Law",
      "permalink": "flynn-ip-law",
      "image": null}},
   {"title": "Legal",
    "is_past": false,
    "provider":
     {"name": "Carlton Fields",
      "permalink": "carlton-fields",
      "image": null}},
   {"title": "Legal",
    "is_past": false,
    "provider":
     {"name": "Thompson Dorfman Sweatman LLP",
      "permalink": "thompson-dorfman-sweatman-llp",
      "image": null}},
   {"title": "Legal",
    "is_past": false,
    "provider":
     {"name": "Darren Heitner, Esq",
      "permalink": "darren-heitner-esq",
      "image": null}},
   {"title": "Legal",
    "is_past": false,
    "provider":
     {"name": "James O'Connell",
      "permalink": "james-oconnell",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "http://www.youtube.com/watch?v=B1LIOn6a3Qs\u0026list=PL0EA304667231BF0A\u0026index=1\u0026feature=plpp_video",
    "description": "\u003Cp\u003ECheck-in for Good Overview \u003C/p\u003E"},
   {"embed_code": "http://youtu.be/B1LIOn6a3Qs",
    "description": "\u003Cp\u003EOverview- Check-in for Good\u003C/p\u003E"},
   {"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/B1LIOn6a3Qs\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EOverview- Check-in for Good\u003C/p\u003E"},
   {"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/X6gDTj5MbqI\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EUsing the App - Check-in for Good\u003C/p\u003E"},
   {"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/NRCQfHmJDac\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EFor Business - Check-in for Good\u003C/p\u003E"},
   {"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/CaI45ISoOz0\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EChange the way you fundraise with Check-in for Good!\u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[100,
        150],
       "assets/images/resized/0020/0131/200131v2-max-150x150.png"],
      [[166,
        250],
       "assets/images/resized/0020/0131/200131v2-max-250x250.png"],
      [[300,
        450],
       "assets/images/resized/0020/0131/200131v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[100,
        150],
       "assets/images/resized/0020/0132/200132v2-max-150x150.png"],
      [[166,
        250],
       "assets/images/resized/0020/0132/200132v2-max-250x250.png"],
      [[300,
        450],
       "assets/images/resized/0020/0132/200132v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://checkinforgood.com/page/about_us",
    "title": "About Us"},
   {"external_url": "http://www.youtube.com/checkinforgood",
    "title": "Videos"}]}