{"name": "Chicago Tech Academy",
 "permalink": "chicago-tech-academy",
 "crunchbase_url": "http://www.crunchbase.com/company/chicago-tech-academy",
 "homepage_url": "http://www.chitech.org",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "chitechacademy",
 "category_code": "education",
 "number_of_employees": 40,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "entrepreneurship-education",
 "alias_list": null,
 "email_address": "mhancock@chicagotechacademy.org",
 "phone_number": "7735347755",
 "description": "Chicago's Startup High School",
 "created_at": "Mon May 07 21:03:04 UTC 2012",
 "updated_at": "Thu May 10 20:37:49 UTC 2012",
 "overview": "\u003Cp\u003EChicago Tech Academy is a public high school dedicated to educating the next generation of entrepreneurial leaders in technology and beyond. Students travel from across Chicago for 2 tech classes a day, a dedicated one-to-one mentor from companies like Groupon and Microsoft, and clubs like Robotics and the Computer Competition Team. \u003C/p\u003E\n\n\u003Cp\u003EThe number of high-schoolers that pursue science, technology, and engineering is not high enough to fill the job openings within Chicago’s growing technology sector. In 2008, Mayor Daley recognized the workforce need and challenged us to create a public school that would match students with the right curriculum, teaching approach and connections to industry to inspire a new generation of technology leaders.\u003C/p\u003E\n\n\u003Cp\u003EUnlike other successful urban high schools, Chicago Tech Academy doesn’t impose barriers like location, money, or skill level on acceptance. We seek students that are motivated by the power of technology and excited about special opportunities to build critical relationships within their desired field.\u003C/p\u003E\n\n\u003Cp\u003EOutside of standard subjects like math and reading, students take 2 technology classes per day, learning everything from mobile app development to project management. By the time they’re seniors, students are able to work on a team consulting clients on their development and design needs. Many students are being held to a higher academic standard than they have been their entire life, and it’s working; ChiTech students show 2-5 times more academic growth in a year than the average CPS student.\u003C/p\u003E\n\n\u003Cp\u003EStudents are also paired with a dedicated, one-to-one mentor as part of Generation Tech Mentoring. Mentors guide career exploration and set high expectations for students. Students learn how to think and act like a professional from their mentor. \u003C/p\u003E\n\n\u003Cp\u003EWe’re in our third year and looking forward to graduating our first class in 2013. We’re currently in the process of scaling up Generation Tech Mentoring and launching ChiTech Labs, an innovative partnership model that gives students resume-building experience through joint projects that create value for our partner companies.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0018/8279/188279v2-max-150x150.jpg"],
     [[250,
       62],
      "assets/images/resized/0018/8279/188279v2-max-250x250.jpg"],
     [[450,
       112],
      "assets/images/resized/0018/8279/188279v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}