{"name": "Chicago Style SEO",
 "permalink": "chicago-style-seo",
 "crunchbase_url": "http://www.crunchbase.com/company/chicago-style-seo",
 "homepage_url": "http://www.chicagostyleseo.com/",
 "blog_url": "http://www.chicagostyleseo.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": 4,
 "founded_year": 2009,
 "founded_month": 5,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "searchengineoptimization, seo, sem, ppc, adwords, emailmarketing, conversionoptimization, websiteusabilitytesting",
 "alias_list": null,
 "email_address": "info@chicagostyleseo.com",
 "phone_number": "",
 "description": "SEO Internet marketing company",
 "created_at": "Thu Jan 28 21:59:17 UTC 2010",
 "updated_at": "Fri Jan 29 20:04:45 UTC 2010",
 "overview": "\u003Cp\u003EChicago Style SEO is a comprehensive internet marketing company specializing in analytics, paid placement, search engine optimization and brand strategy.\nThe basis of any online campaign, analytics provides the ability to benchmark and test the effectiveness of all strategies. The first thing Chicago Style SEO does with any client is set up Google Analytics or review existing set ups. We set up advanced data filters that allow us to weed out the irrelevant information and segment the rest. We recommend letting the new setup collect at least 1-2 weeks worth of data to provide a good benchmark for the initiatives to come.\u003C/p\u003E\n\n\u003Cp\u003EDuring the initial benchmarking phase, Chicago Style SEO will do extensive research to find appropriate keywords for your website and business. We highly recommend starting out with a full Google Adwords campaign to test which keywords convert to customers and test the ad copy that resonates and gets click throughs.\u003C/p\u003E\n\n\u003Cp\u003EWhile the paid placement campaign runs, Chicago Style SEO will give your website a thorough review and report with recommended changes and improvements. During this period, we also take an in depth look at your main competition to determine strengths and weaknesses (to emulate and exploit, respectively). Finally, we will provide comprehensive link building assessment that becomes the road map for new initiatives.\u003C/p\u003E\n\n\u003Cp\u003EOnce the pay-per-click campaign has gathered enough data, we can make a strong determination of the keywords that we will focus on for organic search engine optimization. At this point, we fine tune your website with these keyword phrases in mind and begin the link building campaign.\u003C/p\u003E\n\n\u003Cp\u003EA truly comprehensive approach to SEO includes measures to monitor and protect your brand and keep existing customers happy. Chicago Style SEO will help you connect with customers and prospects on the major social media outlets. We will show you how to use user-generated content to create preemptive listings to protect your brand name. Keeping an ear to the web, we will monitor conversations about your company to give you our expert insite on how to take advantage of positive situations and diffuse negatives before they get out of hand.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       73],
      "assets/images/resized/0007/5304/75304v2-max-150x150.jpg"],
     [[250,
       122],
      "assets/images/resized/0007/5304/75304v2-max-250x250.jpg"],
     [[332,
       163],
      "assets/images/resized/0007/5304/75304v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Partner",
    "person":
     {"first_name": "Rod",
      "last_name": "Holmes",
      "permalink": "rod-holmes",
      "image": null}},
   {"is_past": false,
    "title": "Partner",
    "person":
     {"first_name": "Ben",
      "last_name": "Robinson",
      "permalink": "ben-robinson",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Web Hosting",
    "is_past": false,
    "provider":
     {"name": "Hostway",
      "permalink": "hostway-2",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "2020 Lincoln Park West",
    "address2": "#3",
    "zip_code": "60614",
    "city": "Chicago",
    "state_code": "IL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        108],
       "assets/images/resized/0007/5303/75303v2-max-150x150.png"],
      [[250,
        181],
       "assets/images/resized/0007/5303/75303v2-max-250x250.png"],
      [[450,
        326],
       "assets/images/resized/0007/5303/75303v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}