{"name": "Chimanlal Sons",
 "permalink": "chimanlal-sons",
 "crunchbase_url": "http://www.crunchbase.com/company/chimanlal-sons",
 "homepage_url": "http://www.indiamart.com/chimanlalsons/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "chimanlalsons@tradepassport.org",
 "phone_number": "+(91)-(22)-23427590/23447896",
 "description": "manufacturer, supplier, trader",
 "created_at": "Thu Apr 04 08:16:22 UTC 2013",
 "updated_at": "Thu Apr 04 08:16:24 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2003, we, “Chimanlal \u0026amp; Sons”, are one of the recognized organization of the industry successfully engaged in manufacturing, supplying, trading and exporting a wide assortment of Garment Accessories. Our offered range consists of Garment Elastics, Fancy Elastics Designer Elastics, Designer Buttons, Jeans Button Rivets, Twill Tapes, Colored Twill Tapes, Velvet Ribbons and many more items. This range is designed and crafted using high-grade yarns, fabrics and other allied accessories sourced from the trustworthy vendors of the industry, in adherence with the international quality parameters and prevailing market trends.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\u003C/p\u003E\n\n\u003Cp\u003EYarn Died Twill Tapes\nYarn Dyed Satin Tapes\nYarn Dyed Velvet Tapes\nFabric Belts\nDesigner Buttons\nMetal Rivets\nShank Buttons\nSnap Buttons\nMetal Buttons\nGarment Elastics\nFabric Laces\nDesigner Necks\nPVC Packaging Boxes \u0026amp; Pouches\nLadies Accessories\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\u003C/p\u003E\n\n\u003Cp\u003EWe have succeeded in creating a great niche in the industry, with the enormous support of our deft team of professionals who are considered as the backbone of our organization. Our team comprises of highly talented, skilled and creative team of designers and craftsmen and other professionals, who work in completed synchronization to accomplish all their assigned tasks with perfection with in the assigned time-frame.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\u003C/p\u003E\n\n\u003Cp\u003EWe are blessed with a sophisticated infrastructure facility, which sprawls over a vast area of land located at Mumbai, Maharashtra. Our entire infrastructure is well-equipped with latest tool and equipments and advanced technologies, keeping par with the changing market trends. We have segregated our facility into various individual departments to manage all the activities in a streamlined manner.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\u003C/p\u003E\n\n\u003Cp\u003EBeing an quality conscious organization, we pay utmost importance to the quality of our offered range and also ensure that we are serving our clients with a flawless and an unparalleled range of Garment Accessories.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\u003C/p\u003E\n\n\u003Cp\u003ESince our inception, our organization is aimed at satisfying our clients and hence, we pay great importance towards serving our clients as par their specific requirements. We have employed a highly skilled and creative team, who design all the products as par the prevailing market trends and keeping in mind the variegated requirements of our clients in their mind. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/7670/247670v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/7670/247670v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/7670/247670v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}