{"name": "ChinaBuye Business",
 "permalink": "chinabuye-business",
 "crunchbase_url": "http://www.crunchbase.com/company/chinabuye-business",
 "homepage_url": "http://www.chinabuye.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2009,
 "founded_month": 8,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gadgets, online-shop, china-shop, free-shipping",
 "alias_list": null,
 "email_address": "admin@chinabuye.com",
 "phone_number": "",
 "description": "Online China Gadgets Shop",
 "created_at": "Sat May 04 06:34:04 UTC 2013",
 "updated_at": "Mon May 06 05:59:38 UTC 2013",
 "overview": "\u003Cp\u003EChina Wholesale \u0026amp; Dropship\nIdeal Price:\u003C/p\u003E\n\n\u003Cp\u003EChinaBuye.com is created to narrow down the price gap between factory and end users. Our price is always lower than that of eBay and other China competitors. Meanwhile, we don\u0026#8217;t have MOQ limit. You can order one piece as a start! Our product covers from cool electronic gadgets, accessories to various cheap electronics, such as Video Game Accessories, China Phones, LED Lighting gadgets, Computer gadgets, Networking, Car Accessories gadgets, EL T Shirts, Security electronic gadget and other cool gadgets.\nWholesale \u0026amp; Drop Ship:\u003C/p\u003E\n\n\u003Cp\u003EAs the best Chinese online store in Hong Kong, ChinaBuye.com is a wholesale and dropship website to provide wholesale and drop shipping service all over the world. As a professional China drop ship supplier, we are in dropship business for many years. We are serving many dropshippers from different countries in the world. We have four member tiers to satisfy different dropshippper\u0026#8217;s requirments: General Customer, Silver VIP, Golden VIP and Diamond VIP. Different tier has different discount, you can always buy electronics with cheapest from ChinaBuye.com if Diamond VIP applies to you.\nQuality \u0026amp; Warranty:\u003C/p\u003E\n\n\u003Cp\u003EAll products or gadgets in our company are brand new and of top quality. We offer you a wide range selection of China electronics gadgets which are well tested before shipping. There is absolutely no fake, closeout, second-hand product in our shipment. All China gadgets are fully one year warranted. You can just keep confident to buy from China now.\nSafe Payment:\u003C/p\u003E\n\n\u003Cp\u003EIt is safe to buy China cheap gadgets now. We accept PayPal! It\u0026#8217;s easier and safer! 30 days money back guarantee.\nFree Shipping:\u003C/p\u003E\n\n\u003Cp\u003EWe provide free shipping for world-wide customers with airmail. More shipping options are also available for fast shipping. So you can buy gadgets from China without worrying about the high shipping cost.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       38],
      "assets/images/resized/0025/8562/258562v2-max-150x150.png"],
     [[225,
       57],
      "assets/images/resized/0025/8562/258562v2-max-250x250.png"],
     [[225,
       57],
      "assets/images/resized/0025/8562/258562v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "HUANGHOU ROAD #7",
    "address2": "",
    "zip_code": "",
    "city": "HONGKONG",
    "state_code": null,
    "country_code": "HKG",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}