{"name": "Chinar Cashmere",
 "permalink": "chinar-cashmere",
 "crunchbase_url": "http://www.crunchbase.com/company/chinar-cashmere",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "chinarcashmere@tradepassport.org",
 "phone_number": "9444034878",
 "description": "exporting, trading and supplying",
 "created_at": "Thu May 02 14:48:37 UTC 2013",
 "updated_at": "Mon May 06 05:41:23 UTC 2013",
 "overview": "\u003Cp\u003EChinar Cashmere Handlooms \u0026amp; Carpets came into being in the year 1998 and carved a niche in exporting, trading and supplying a wide range of Silk Shawls, Bed Spreads, Designer Jewellery, Walnut Wood Furniture, Silk Scarves and many more.  Our product range comprises Wool Pashmina Shawls, Printed Pashmina Shawls, Silk Pashmina Shawls, Hand Woven Pashmina Shawls, Designer Pashmina Shawls, Embroidery Cushion Covers, Brocaded Cushion Covers, Red Velvet Cushion Covers, Wool Carpets, Textured Carpets, Embroidered Bed Spreads, Wool Bed Spreads.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOur experienced vendors have enabled us to serve our clients with best quality products. They ensure that quality-oriented and best product range is delivered to us. Market surveys and researches are carried out by us on regular basis, in order to select the best vendors of the industry, having excellent industrial knowledge and experience. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur aim is to serve our clients with best quality products, which comply with the norms and standards prescribed by the concerned authorities. Our quality controllers make sure that the products are tested on prescribed quality parameters, before they have been purchased or delivered to the clients. As the competition is increasing day by day and in order to withstand the competition, we ensure that our patrons are efficiently served. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team proves to be our biggest asset and a strongest pillar, which has enabled us to meet the customer’s needs in an efficient manner. Our professionals interact with the clients and try to serve them in the way they want. We train our professionals on regular basis, so that they can understand the changes taking place in industry and revert to them accordingly. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur industrial expertise and knowledge has enabled us to serve our customers in an efficient manner and to render complete satisfaction to them. We make our range available at reasonable prices, keeping the budgetary constraints of customer’s in mind.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0025/7699/257699v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0025/7699/257699v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0025/7699/257699v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}