{"name": "China Ziyang Technology Company",
 "permalink": "china-ziyang-technology-company",
 "crunchbase_url": "http://www.crunchbase.com/company/china-ziyang-technology-company",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Thu Jun 30 21:15:01 UTC 2011",
 "updated_at": "Thu Jun 30 22:11:34 UTC 2011",
 "overview": "\u003Cp\u003EZiyang Technology Company, Limited is a Hong Kong Based holding company with a wholly owned subsidiary, Ziyang Ceramics Company, Limited (\u0026#8220;Ziyang Ceramics\u0026#8221;), based in Zhucheng City, Shandong Province, China. Ziyang Ceramics was established on January 26, 2006, with $7.7 million registered capital and had total assets of approximately $26.5 million as of March 31, 2011. \u003C/p\u003E\n\n\u003Cp\u003EZiyang Ceramics is engaged in the manufacturing and distribution of porcelain tiles used for interior residential and commercial flooring primarily in Eastern and Central China. Ziyang Ceramics operates its production and distribution facility on approximately 1.8 million square feet of land that includes facilities covering an area of 775,000 square feet. Ziyang Ceramics has 492 employees and operates two production lines which produce three main ceramic product types in more than 50 different size and color combinations. The company sells its products through a distribution network of more than 150 distributors across 10 provinces concentrating on major second and third tier cities.\u003C/p\u003E\n\n\u003Cp\u003EIn 2010, on a pro forma basis, Ziyang Ceramics generated revenue of $31.1 million with net income of approximately $7.3 million and experienced top and bottom line growth in excess of 44% compared to 2009. Management expects to grow its internal operations at a rate of at least 20% annually for the foreseeable future. In addition to expanding its own facilities, management intends to make opportunistic acquisitions to add capacity and expand its product offerings in an effort to become one of the leading manufacturers and suppliers of high quality porcelain tiles in China.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition":
  {"price_amount": null,
   "price_currency_code": "USD",
   "term_code": null,
   "source_url": "http://www.marketwire.com/press-release/china-america-holdings-definitive-agreement-acquire-china-ziyang-technology-company-otcbb-caah-1533530.htm",
   "source_description": "China America Holdings in Definitive Agreement to Acquire China Ziyang Technology Company, Limited as Wholly Owned Subsidiary",
   "acquired_year": 2011,
   "acquired_month": 6,
   "acquired_day": 30,
   "acquiring_company":
    {"name": "China America Holdings Inc.",
     "permalink": "china-america-holdings-inc",
     "image": null}},
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}