{"name": "China Minmetals",
 "permalink": "china-minmetals",
 "crunchbase_url": "http://www.crunchbase.com/company/china-minmetals",
 "homepage_url": "http://www.indiamart.com/chinaminmetals/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "chinaminmetals@tradepassport.org",
 "phone_number": "9971382666",
 "description": "providing high-quality services globally",
 "created_at": "Thu Apr 04 16:08:52 UTC 2013",
 "updated_at": "Thu Apr 04 16:08:56 UTC 2013",
 "overview": "\u003Cp\u003EChina Minemtals Corporation is an international metals and mining corporation committed to providing high-quality services globally, adhering to a development philosophy of “cherishing limited resources and pursue boundless development”. It primarily engages in exploration, mining, smelting, processing and trading for metals and minerals, and is also engaged in finance, real estate, and mining and metallurgic technology, with business scope covering 26 nations and regions in the world.\u003C/p\u003E\n\n\u003Cp\u003EMetallurgical Raw Material Supply:\nMainly undertaken by Raw Materials Business Division and Ferroalloys Business Division. Main business includes import \u0026amp; export, direct purchasing and sale, and commission trade.\u003C/p\u003E\n\n\u003Cp\u003ESteel Manufacturing:\nMinmetals Yingkou Medium Plate Co.,Ltd (MYMP) is engaged in steel manufacturing and medium and thick steel plate processing. It possesses complete sets of modern processing facilities for steel production, including sintering, pellet-making, iron smelting, casting, steel smelting, continuous casting, and steel rolling\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client centric company, we are engaged in offering a comprehensive range of products to our clients. We customize all our products to suit the specifications and requirements of our clients. With our team of experts we offer the best quality products at the most competitive prices in the market to all our esteemed clients. We accept easy modes of payments to our clients to offer hassle free transaction to our clients.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality is the foremost aspect of our business and never compromises at any stage of production of our Metal products. Our range of these products is tested by our quality analysts from procurement of raw materials to till the completion of the products. We check the quality of our range of products on various parameters to offer defect free range to our clients. Moreover, owing to this attribute, we have established a credible market place for our company and gained tremendous client satisfaction levels.\u003C/p\u003E\n\n\u003Cp\u003ETeam:\nWe have a group of members in which we have engineer, designers and our R\u0026amp;d team, which constantly research on designs and new technology . Following are members which comprises our workforce:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EDesigners\nManagers\nEngineers\nTechnocrats\nAdministrators\nQuality controllers\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003E.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8065/248065v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8065/248065v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8065/248065v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}