{"name": "China Telcom",
 "permalink": "china-telcom",
 "crunchbase_url": "http://www.crunchbase.com/company/china-telcom",
 "homepage_url": "http://en.chinatelecom.com.cn",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": 2002,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "China Telecommunicatons Company",
 "created_at": "Thu Mar 21 17:29:00 UTC 2013",
 "updated_at": "Thu Mar 21 18:09:32 UTC 2013",
 "overview": "\u003Cp\u003EChina Telecommunications Corporation (China Telecom) is an extra-large State-owned telecom operator in China, Global Partner of World Expo 2010 Shanghai, and was selected into the Top 500 Global Corporations for many consecutive years. China Telecom mainly provides the integrated information services including the fixed-line telephone, mobile service, Internet connection and applications services. By the end of 2009, China Telecom owns 194 million fixed-line telephone subscribers, 62.36 million mobile (CDMA) subscribers, and 61.75 million broadband customers. The total asset of China Telecom is 632.2 billion yuan. There are 670 thousands employees in total in China Telecom.\u003C/p\u003E\n\n\u003Cp\u003EChina Telecom was ratified as the Class-A Enterprise for four consecutive years. China Telecom was awarded as the “CDMA Global Operator Leadership” by CDG (CDMA Development Group). China Telecom was rated respectively as the “World Most Admired Enterprise”, “Best Fixed-Line Telephone Company in Asia”, “Best Telecom Company in China”, “Most Potential Company in China”, “Best Company in Telecom Business”, “Best Managed Company”, “Best Enterprise Governance” by the international famed magazines. Also, China Telecom was awarded with the titles of the “Social Responsibility Model of the Significant Value Company” and the “Special Big Prize for the Chinese Enterprise Social Responsibility”, etc.\u003C/p\u003E\n\n\u003Cp\u003EChina Telecom has subsidiary companies in 31 provinces (municipal and autonomous regions) and branches in the Americas, Europe, Hong Kong and Marco, and its communications network covering the whole country of China and reaching every corner of the world. China Telecom built the world biggest CDMA 3G network, with its earliest commercial services in China, having many branded products such as “Tianyi”, “My e Home”, “BizNavigator”, “Best Tone”, being capable of providing all telecom services and multiple convergent services and sales channels. China Telecom has two holding companies, “China Telecom Corporation Limited” and “China Communications Services Corporation Limited”. Both of them were listed on the Hong Kong Stock Exchanges, New York Stock Exchanges in 2002 and in Hong Kong Stock Exchanges in 2006 respectively. Therefore, the operation structure of main business and sideline business came into being with both companies listed on the public stock market.\nSince the year of 2004 when China Telecom made the strategic decision for transformation from the traditional basic telecom operator to an integrated information services provider, China Telecom is developing in a steady and healthy manner by promoting the integrated information services and other non-voice service, and by intensifying the precise management and optimal resource allocations. Especially after the telecom system restructure in 2008, and obtaining the mobile business license and 3G service license in 2009, China Telecom realized the good beginning of development. By the end of 2009, the total revenue reached 242.896 billion yuan (incl. initial installation fees), 9.77% increase over the previous year, and the non-voice services weight was increased to 52.8%, 6.8% increase over the previous year.\u003C/p\u003E\n\n\u003Cp\u003EWhile exploring the value increase of the enterprise, China Telecom conscientiously implement its responsibility as an enterprise by upholding the concept of co-existence and harmonious unity between the corporate development and social development, between the environment protection and the relevant parties who have interests with us. China Telecom is implementing its social responsibilities in providing working opportunities for the public and making contributions to the public welfare and undertaking the tasks of assisting the poor in the Tibet Region. China Telecom also takes action to reduce the energy and the consumptions, to implement the sharing policy to avoid wastes and duplication investment for the protection of the “ecology environment of the Industry”. China Telecom successfully completed the guaranteed telecommunications services for the earthquake rescue and relief operations and the Beijing Olympic Games. As the main force of the informatization construction in the country, China Telecom focuses on the R\u0026amp;D and promotes the informatization applications to provide the brand new multiple services, multiple network and multiple terminals and the extension of the value chain in order to bring the benefits of the informatization to all the cycles of the industry and the public as well. China Telecom provided specific informatization solutions to more than 20 industries and a large number of the enterprises.\u003C/p\u003E\n\n\u003Cp\u003EChina Telecom established the application \u0026amp; promotion centre and the key laboratory for the Internet of Things in Wuxi, Jiangsu province. China Telecom conscientiously fulfilled its obligation for the universal service in serving the “New Three Fs Policy” (meaning concerns for the village, peasants, agriculture), continuing the projects of the “telephone installation in every village” and the model projects of the informatization in all villages and townships. China Telecom has provided the public with the integrated information services related with food, clothing, housing, transport, and daily necessities, etc., and made proper contributions in providing the information life to the public by driving up the convergence of the informatization and industrialization, and the rural informatization construction.\u003C/p\u003E\n\n\u003Cp\u003EOn the new road ahead, China Telecom will grasp the 3G development, mobile Internet and the Internet of Things, and further study and implement the Scientific Outlook on the Development, deepen its strategy of focusing on the customers, insist on the corporate transformation and movement to the new development mode, make structure adjustments, intensify the precise management in order to create a new situation in the efficient development on a large scale and break through in the informatization services and make more and more contributions to the national economic development and social informatization construction. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       68],
      "assets/images/resized/0024/4427/244427v2-max-150x150.png"],
     [[223,
       102],
      "assets/images/resized/0024/4427/244427v2-max-250x250.png"],
     [[223,
       102],
      "assets/images/resized/0024/4427/244427v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Chairman \u0026 CEO",
    "person":
     {"first_name": "Wang",
      "last_name": "Xiaochu",
      "permalink": "wang-xiaochu-2",
      "image": null}},
   {"is_past": false,
    "title": "Chairman \u0026 CEO",
    "person":
     {"first_name": "Wang",
      "last_name": "Xiaochu",
      "permalink": "wang-xiaochu",
      "image": null}},
   {"is_past": false,
    "title": "President \u0026 CFO",
    "person":
     {"first_name": "Shang",
      "last_name": "Bing",
      "permalink": "shang-bing",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Beijing",
    "state_code": null,
    "country_code": "CHN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo":
  {"valuation_amount": null,
   "valuation_currency_code": "USD",
   "pub_year": 2002,
   "pub_month": 11,
   "pub_day": 22,
   "stock_symbol": "NYSE:CHA"},
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}