{"name": "Choiceful.com",
 "permalink": "choiceful-com",
 "crunchbase_url": "http://www.crunchbase.com/company/choiceful-com",
 "homepage_url": "http://www.choiceful.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 100,
 "founded_year": 2005,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "choiceful-com, choiceful, e-commerce, marketplace, technology, internet",
 "alias_list": null,
 "email_address": "info@choiceful.com",
 "phone_number": "",
 "description": "Global Online Marketplace",
 "created_at": "Sun Sep 02 07:08:28 UTC 2012",
 "updated_at": "Thu Sep 06 22:28:21 UTC 2012",
 "overview": "\u003Cp\u003EChoiceful.com is a new concept in the global e-marketplace. It is the brainchild of a group of technology and marketing veterans with a broad experience base in selling on the high street and online. After carefully studying - and in some case having worked for - the giant e-commerce stores, Choiceful.com\u0026#8217;s founders realised that small business owners were at something of a disadvantage in the online marketplace and set out to improve the business model for them. They were also determined to improve the shopping experience for buyers and sellers alike, whether businesses or consumers. \u003C/p\u003E\n\n\u003Cp\u003EThe website structure is tailored to business needs. SMEs can choose the number of countries in which they wish to sell - currently anywhere between 1 and 24, but this will grow to 50 countries worldwide. The whole point of e-commerce is that it does not much matter where buyers and sellers are located, but this can make it difficult for the owners of small businesses to compete on price and manage the logistics of international shipping. By allowing its sellers to choose the countries in which they want to sell, the seller retains control and will not be overwhelmed by going fully global before the business can manage the logistics. Choiceful.com automates the process of listing products, uploading inventories and matching prices. These features mean that these tasks demand little of smaller businesses that want to sell globally, but would otherwise not have the time or manpower to do so.\u003C/p\u003E\n\n\u003Cp\u003EChoiceful.com does not itself engage in selling and does not compete with its sellers as other marketplaces do. More than that, Choiceful.com keeps its fees low. It takes a 5% flat fee from sellers, whether they sell goods to the value of $10 or $1 million. There is an extremely low transaction fee on each sale - this too is flat. Sellers do not have to pay a monthly subscription fee and there are no extra costs. This policy helps smaller businesses keep control of their selling costs so they can better enjoy the incredible growth in e-commerce.\u003C/p\u003E\n\n\u003Cp\u003EMany features of face-to-face trade are incorporated into the Choiceful.com selling model. For example, if a user cannot find the product at a suitable price, they can use the Make Me An Offer™ application to negotiate a better price or a quantity discount. Sellers can choose whether or not to respond to the price request. Businesses do need to have the means to dynamically adjust pricing to clear stock or because a competitor has done so. For sellers in other marketplaces, this can mean manual monitoring and updating or buying an app to make the changes on their behalf. Choiceful.com does it all automatically and at no extra cost for sellers who choose to use this feature.\u003C/p\u003E\n\n\u003Cp\u003EBy keeping communication lines open with its users via email and chat, Choiceful.com adds to and enhances its website and its product catalog. Choiceful.com is making its website the premium online shopping mall, with services and lifestyle elements to be added for the ultimate in online choice.\u003C/p\u003E\n\n\u003Cp\u003EAbout Choiceful.com \u003C/p\u003E\n\n\u003Cp\u003EChoiceful.com is a new concept in the global e-commerce marketplace of 100 million users. It\u0026#8217;s all about choice and enhancing the user experience. Shopping on Choiceful.com is a simple, cost-effective experience for business and individual sellers. Choiceful.com is also a more enjoyable one for business and consumer buyers who will find a range of 20 million products arranged by department. It focuses particularly on small and medium-size businesses, who can immediately sell in up to 24 countries, with expansion planned to 50 countries worldwide. Choiceful.com is the brainchild of a group of technology and marketing veterans, who now bring the best of wholesale and retail shopping to the Internet. To try out our marketplace for yourself, visit Choiceful.com.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "98104",
    "city": "Seattle",
    "state_code": "WA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.choiceful.org/",
    "title": "Choiceful.com on LookupPage"},
   {"external_url": "http://www.choiceful.biz/",
    "title": "Choiceful.com - Online Marketplace"},
   {"external_url": "http://choicefulcom.tumblr.com/",
    "title": "Choiceful.com on Tumblr"},
   {"external_url": "http://www.visualcv.com/choiceful",
    "title": "Choiceful.com - Fair Competition to Marketplaces"},
   {"external_url": "http://choicefulcom.wordpress.com/",
    "title": "Choiceful.com on Wordpress"},
   {"external_url": "http://uk.linkedin.com/in/choiceful",
    "title": "Choiceful.com on LinkedIn"}]}