{"name": "Chooos",
 "permalink": "chooos",
 "crunchbase_url": "http://www.crunchbase.com/company/chooos",
 "homepage_url": "http://chooos.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Chooos_",
 "category_code": "ecommerce",
 "number_of_employees": 3,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-shopping",
 "alias_list": null,
 "email_address": "matvienko.pavel.v@gmail.com",
 "phone_number": "+380503947265",
 "description": "universal online shopping platform ",
 "created_at": "Mon May 20 08:06:29 UTC 2013",
 "updated_at": "Tue May 21 03:55:44 UTC 2013",
 "overview": "\u003Cp\u003EWhat is Chooos?\u003C/p\u003E\n\n\u003Cp\u003EChooos is universal online shopping platform for social commerce. This new service helps people to find things they like in one click and of course we do care about business.\nJust picture\nThere are billions of Internet users all over the world  and most of them, same as you are social. Every day we discover our social timeline and follow our friends, funny \u0026amp; cute things, brands, favourite food or restourant.  Why we do it?  Because we like it!\u003Cbr/\u003E\nNow everybody likes nike, coca colla, pizza or boo and we like it  because we realy want it!. Do you want to play with that guy? Yes!\nThe  problem is,  when we face online store we fail to keep all likes in our mind or just can’t find them. \nIt SUCKS!  Where is my  beautifull pink self made pillow, my good new red italy lather shoes, my incredible hend made grass flip-flops that i dream about.\nSo  forget about search! Chooos has already chosen all  things that you are holding in your mind.  Just with one click you get offers  that match your interest with extra delivery. Amazing! Sign up and enjoy your shopping.   \u003C/p\u003E\n\n\u003Cp\u003EBut on other side there are millions of online and local stores which dream about loyal customers, unique visitors who keep coming back to their store, and of course they want to get it without spending a lot of money on advertising. The problem is, that  online  advertising is  extremely expensive and stores can nothing to do.\nHow we help them? Chooos scans users preferences \u0026amp; location from their social accounts and gives them all things they likes every day  in real life.\nSo if you have your online or local business sign up on chooos.com upload the products  and get your extra target audience without advertising. Just do it\u003C/p\u003E\n\n\u003Cp\u003EChooos is beautifull, Chooos is crazy powerfull, it’s magical, It is all  your dreams on the one site - that’s allready a revolution and it’s only just began.\nSupport us to make our world easer! \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       149],
      "assets/images/resized/0026/4315/264315v2-max-150x150.jpg"],
     [[250,
       249],
      "assets/images/resized/0026/4315/264315v2-max-250x250.jpg"],
     [[450,
       449],
      "assets/images/resized/0026/4315/264315v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "https://vimeo.com/66451734",
    "description": "\u003Cp\u003EMovie\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}