{"name": "Christmas Vacations",
 "permalink": "christmas-vacations",
 "crunchbase_url": "http://www.crunchbase.com/company/christmas-vacations",
 "homepage_url": "http://Vacations-Chrsitmas.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 8,
 "founded_year": 2007,
 "founded_month": 1,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "christmas, vacations, travel, holidays, christmas-vacations, christmas-vacation-packages, xmas, chrsitmas-holidays",
 "alias_list": null,
 "email_address": "travelerxmas@yahoo.com",
 "phone_number": "212-454-2045",
 "description": "A Christmas Vacation Travel Agency",
 "created_at": "Thu Sep 24 08:33:09 UTC 2009",
 "updated_at": "Fri Sep 25 07:08:07 UTC 2009",
 "overview": "\u003Cp\u003EChristmas is the most widely celebrated festival around the world .Our website provides information on the various Xmas destinations around the world .We will continue to add more destinations in the coming time. \u003C/p\u003E\n\n\u003Cp\u003EChristmas is the time to get together ,some celebrate it with family and friends .Traditionally it is celebrated at home ,but the trend of going out on vacation to the destinations where Christmas Celebrations are famous ,is growing day by day.\u003C/p\u003E\n\n\u003Cp\u003EThere are so many places that offer attractive vacation deals and packages for the tourists around this festive season.There are hotels that offer discount if you travel along with your family. You can also travel in the groups of 8 or more to get even more discounts.\u003C/p\u003E\n\n\u003Cp\u003EOur website provided information on Vacation ideas that can help you discover new ways to celebrate Christmas this season. You can goto an exotic Island and celebrate where there is plenty of sunshine and white sand .Some prefer to goto hill stations and enjoy the festival in the snow.\u003C/p\u003E\n\n\u003Cp\u003EMany prefer travel to spend their holidays on Cruises on the calm sea with music ,wine and dance to make their Xmas an enjoyable event.\u003C/p\u003E\n\n\u003Cp\u003EThere are many travel agencies , hotels and airliners that offer great deals to make your Christmas very special. If you do advance booking for a trip during this season then chances are that you would get the best and the cheapest deals .This gives you an opportunity to save money that you can spend in the best possible way to enjoy. There are some hotels and resorts that have special exotic arrangements to make your Christmas memorable.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[126,
       102],
      "assets/images/resized/0006/0685/60685v2-max-150x150.jpg"],
     [[126,
       102],
      "assets/images/resized/0006/0685/60685v2-max-250x250.jpg"],
     [[126,
       102],
      "assets/images/resized/0006/0685/60685v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}