{"name": "CHSI Technologies",
 "permalink": "chsi-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/chsi-technologies",
 "homepage_url": "http://www.chsitech.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "chsitech",
 "category_code": "enterprise",
 "number_of_employees": 21,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "risk-management, policy-administration, las--vegas",
 "alias_list": null,
 "email_address": "info@chsitech.com",
 "phone_number": "702-736-4415",
 "description": "Risk Management Cloud Software",
 "created_at": "Wed Sep 05 20:34:30 UTC 2012",
 "updated_at": "Sun Sep 09 19:18:35 UTC 2012",
 "overview": "\u003Cp\u003ECHSI Technologies is a company comprised of like-minded people who are passionate about creating, and being part of, something extraordinary. Our vision is to be \u0026#8220;The Leader in SaaS Delivered Management Solutions\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003ECHSI\u0026#8217;s team enjoys tackling complex problems and delivering innovative SaaS solutions to underserved markets. Our mission is to level the playing field for small and mid-market companies by providing access to the highest quality ecommerce technologies at the most affordable investment price in the marketplace. Our near term success has been attributed to identifying these underserved markets and deploying our technology along with disruptive strategies that provide true value to the clients we serve.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to level the playing field for small and mid-market companies by providing access to the highest quality cloud based technologies at the most affordable investment price in the marketplace.\u003C/p\u003E\n\n\u003Cp\u003ECHSI Technologies is now the leading developer of cloud-based enterprise practice management systems for small insurance companies, Self-Insured Groups, Joint Powers Authorities, Municipal Pools, Captives, Individual Self-Insured companies and various types of Risk Retention Groups. \u003C/p\u003E\n\n\u003Cp\u003EToday, CHSI Technologies’ patent-pending products, Connections Management System, Evaluate, and MetaVision WarBoard, are being used by companies in California, Illinois, Utah, Nevada, Arizona, Michigan and Florida. The company is strategically positioned for continued growth with the same spirit and passion which began in 2010. The name was chosen to communicate the company\u0026#8217;s passion, spirit, and values for which it stands: commitment, honesty, service, innovation.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       75],
      "assets/images/resized/0020/9909/209909v2-max-150x150.png"],
     [[250,
       125],
      "assets/images/resized/0020/9909/209909v2-max-250x250.png"],
     [[400,
       200],
      "assets/images/resized/0020/9909/209909v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}