{"name": "CityVolt",
 "permalink": "cityvolt",
 "crunchbase_url": "http://www.crunchbase.com/company/cityvolt",
 "homepage_url": "http://www.cityvolt.org",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "cityvolt",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 7,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "battery-exchange-stations-electric-scooters-electric-vehicles-clean-transportation-clean-tech-clean-technologies-green-taiwan-taipei-greater-china",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+886929418646",
 "description": "Gas Station For The Electric Generation",
 "created_at": "Mon Jun 20 11:26:45 UTC 2011",
 "updated_at": "Wed Jun 22 17:43:46 UTC 2011",
 "overview": "\u003Cp\u003ECityVolt is a network operator for battery exchange stations used by electric two-wheelers. We\u0026#8217;re based in Taipei (Taiwan) where we work with local OEMs to develop the gas stations of tomorrow. We target the upcoming tidal wave of electric two-wheelers (465 millions to be sold worldwide between 2010 and 2016 according to market research)\u003C/p\u003E\n\n\u003Cp\u003EHere is more about CityVolt in a Q\u0026amp;A format:\u003C/p\u003E\n\n\u003Cp\u003EWhat are the main functions and applications of your technology?\nWe work on developing a network of battery exchange stations for electric scooters where we act as a network operator. The stations play the same role as gas stations do with gas scooters. Users ride for a while, and when they need to refill stop by a station where they swap their depleted batteries with a pair of fresh one. This gives them an autonomy of 60 to 100km. \nWe also leverage our batteries to use them in two additional non-transportation related business unit. One of them being what we call the \u0026#8220;intelligent dashboard\u0026#8221; which is an LCD screen replacing the dashboard and running from hardware contained in the battery to provide media-rich connected services.\u003C/p\u003E\n\n\u003Cp\u003EWho are the final users of your technology?\u003Cbr/\u003E\nPrimarily it\u0026#8217;s the public at large: People who ride electric scooters, electric bicycle, electric motorcycle\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EWhat quantified benefits do you provide to such final users?\u003Cbr/\u003E\nClean transportation at below market price. We essentially give scooters away for free when users sign a two years contract. We also provide them with GPS services on their scooter\u0026#8217;s dashboard.\u003C/p\u003E\n\n\u003Cp\u003EWhat are the main advantages of your technology compared to existing ones in the same application scope?\nThe existing technology is the internal combustion engine. Our technology is cleaner, quieter, cheaper, and can be powered with a large range of power sources.\nIf we consider the existing technology as electric vehicles with integrated batteries, our technology is cheaper to purchase, faster to recharge, has a virtually infinite range, and bring extra services to end users.\u003C/p\u003E\n\n\u003Cp\u003EWhat\u0026#8217;s your specific market target?\nCurrently our market at large is the 14.8 millions scooters that are registered in Taiwan. More specifically we target the large majority of scooters that are used exclusively within a city where a network like ours make sense.\u003C/p\u003E\n\n\u003Cp\u003EWho are your primary target customers? \nTarget customers are young, 58% male, use their scooter around 15km a day or less (national average in TW), and have purchased a gas scooter with a engine that is 125cc or less in size.\u003C/p\u003E\n\n\u003Cp\u003EWho are you direct competitors? (Please mention the strongest of them)\nIsuda: An electric scooter manufacturer that wants to branch out in operating battery exchange stations\u003C/p\u003E\n\n\u003Cp\u003EWho are you indirect competitors? \nKymco, SYM, and the gas stations chains (CPC\u0026#8230;)\u003C/p\u003E\n\n\u003Cp\u003EWhat\u0026#8217;s your differentiation strategy towards your competition?\nWith direct competitor: Performance and service, with an emphasis on scale so as to develop higher quality product.\nWith indirect competitor: Purchase price, cost of ownership, and agreement, with extra services provided on the dashboard.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Edouard",
      "last_name": "Roquette",
      "permalink": "edouard-roquette",
      "image": null}},
   {"is_past": false,
    "title": "co-founder",
    "person":
     {"first_name": "Bruno",
      "last_name": "Koegler",
      "permalink": "bruno-koegler",
      "image":
       {"available_sizes":
         [[[124,
            150],
           "assets/images/resized/0021/2725/212725v2-max-150x150.jpg"],
          [[207,
            250],
           "assets/images/resized/0021/2725/212725v2-max-250x250.jpg"],
          [[305,
            367],
           "assets/images/resized/0021/2725/212725v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [{"competitor":
     {"name": "Isuda",
      "permalink": "isuda",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}