{"name": "ClarionAgro Products",
 "permalink": "clarionagro-products",
 "crunchbase_url": "http://www.crunchbase.com/company/clarionagro-products",
 "homepage_url": "http://www.indiamart.com/clarionagroproducts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "clarionagroproducts@tradepassport.org",
 "phone_number": "9885155500",
 "description": "Manufacturing and Supplying",
 "created_at": "Thu Apr 04 10:56:19 UTC 2013",
 "updated_at": "Thu Apr 04 10:56:22 UTC 2013",
 "overview": "\u003Cp\u003EClarion Agro Products is a part of the Gupta Group of Companies, which has been a prominent name in the Indian foods markets for over four and a half decades. Leveraging this considerable expertise and experience, Clarion Agro Products is all set carve a distinct niche for itself in the market and in the consumer\u0026#8217;s heart with their brands-Jasmine \u0026amp; Taaza Fresh. The company specializes in manufacturing and supplying a range of Atta Flour, Wheat Bran, Rawa Flour and Maida Flour.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur company is supported by highly advanced and state-of-the-art infrastructural facility, equipped with requisite amenities for systematic execution of all business operations. It comprises varied departments and each department is provided with upgraded technology and adequate resources to develop products according to needs of clients. Provision of upgrading machinery helps us in achieving bulk orders and set targets successfully. \u003C/p\u003E\n\n\u003Cp\u003ELatest Technology For Better Products:\nOur state-of-the-art manufacturing facility, spread across 4 acres, has the distinction of being the fine fully automated plant in Andhra Pradesh and is rated as one of the best in the country by experts. It has a production capacity of 10,000 mt per month \u0026amp; has 22000 an HACCP certification for added reassurance.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nAs a machine is only as good as the person operating it, we have painstakingly built up a team of qualified and experienced professionals who are passionate about producing a product that\u0026#8217;s second to none. To ensure that their skill-sets are continuously guarded, training is provided on a regular basis.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nSince we have an uncompromising attitude towards quality, an eagle-eye is kept on each step of the entire manufacturing process-right from handpicking the perfect wheat to the packaging of the final products. The highest standards of hygiene are consistently maintained while strict systems constantly monitor purity and freshness.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nTimely delivery and unbeatable quality of our range has enabled us in acquiring desired position in the industry. Furthermore, we ably reach to maximum clientele and serve to their diverse needs efficiently, just because of our wide distribution network.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7827/247827v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7827/247827v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7827/247827v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}