{"name": "Clarity Consulting",
 "permalink": "clarity-consulting",
 "crunchbase_url": "http://www.crunchbase.com/company/clarity-consulting",
 "homepage_url": "http://www.claritycon.com/",
 "blog_url": "http://blogs.claritycon.com/",
 "blog_feed_url": "",
 "twitter_username": "claritycon",
 "category_code": "consulting",
 "number_of_employees": 80,
 "founded_year": 1994,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "custom-software-development, user-interaction-design, wpf, windows-phone-7, silverlight, c, vb-net, asp-net, mvc, jquery, surface, tablet-devices, pos-systems, wcf-services, complex-system-integration, windows-azure",
 "alias_list": null,
 "email_address": "info@claritycon.com",
 "phone_number": "3128633100",
 "description": "",
 "created_at": "Wed Jun 27 16:25:07 UTC 2012",
 "updated_at": "Wed Jun 27 21:49:31 UTC 2012",
 "overview": "\u003Cp\u003EClear thinking in business technology starts with Clarity. We deliver cutting-edge software solutions that improve productivity, increase efficiency, reduce risk and maximize IT investment value.\u003C/p\u003E\n\n\u003Cp\u003EOur consultants are flexible, innovative and strategic. Their knowledge and expertise allow them to implement solutions faster, resulting in an accelerated delivery schedule and a lower project cost. We deliver results quickly so that our clients can immediately realize the benefits.\u003C/p\u003E\n\n\u003Cp\u003EWe strongly believe in the value of using smaller consultant teams comprised of versatile technologists on every project. This successful business practice offers a lower cost, more flexibility, better communication, improved efficiency and overall consistency. Our consultants are able to successfully take on many roles - from programmer to project manager - giving them a thorough understanding of the client, the project and the solution.\u003C/p\u003E\n\n\u003Cp\u003EOur in-depth understanding and comprehensive knowledge of all major business technologies makes us sharper. We are committed to developing, customizing and implementing the best technology solutions that deliver maximum results, and we do it on budget.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0019/7696/197696v2-max-150x150.png"],
     [[250,
       62],
      "assets/images/resized/0019/7696/197696v2-max-250x250.png"],
     [[258,
       64],
      "assets/images/resized/0019/7696/197696v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}