{"name": "ClickPay Services",
 "permalink": "clickpay-services",
 "crunchbase_url": "http://www.crunchbase.com/company/clickpay-services",
 "homepage_url": "http://clickpay.com/",
 "blog_url": "http://clickpay.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "real-estate, multi-housing, electronic-payment",
 "alias_list": null,
 "email_address": "sales@clickpay.com",
 "phone_number": "1.800.533.7901",
 "description": "Electronic rent payment platform ",
 "created_at": "Wed Sep 12 16:54:14 UTC 2012",
 "updated_at": "Thu Oct 04 13:24:57 UTC 2012",
 "overview": "\u003Cp\u003EClickPay Services Inc. is a provider of electronic payment solutions for the multi-housing industry nationwide.\u003C/p\u003E\n\n\u003Cp\u003EOffering three platforms — ClickPayRent, ClickPayDues and ClickPayPark — ClickPay Services Inc. provides fully integrated payment processing services and software to accelerate the financial performance of its customers by reducing operating costs, creating operational efficiencies and boosting resident satisfaction by offering an expected amenity.\u003C/p\u003E\n\n\u003Cp\u003EClickPayRent provides residential property owners and property managers with a platform that allows residents to process rent payments, application fees and security deposits online; ClickPayDues provides condominium associations and managers with a platform for collecting homeowner’s association fees, clubhouse rental, special assessments and other fees; and ClickPayPark provides parking garage owners and operators with a turnkey point-of-sale platform that enables them to process credit, debit and e-check payments from both transient and monthly parking customers.\u003C/p\u003E\n\n\u003Cp\u003EAccording to the company’s website, ClickPay “works just like a paper check you receive in the mail, without the piles of envelopes, deposit slips, jammed scanners, trips to the bank and error-prone manual data entry in your property management software.”\u003C/p\u003E\n\n\u003Cp\u003EKey features of ClickPay Services Inc.’s platforms include the ability to offers tenants the flexibility to pay online or by phone, mobile phone, iPad or tablet; the ability to accept debit and credit cards, including American Express; the ability to accept e-check/ACH payments; a web portal that enables clients to administrate payments, run reports and communicate with tenants; the ability for clients to integrate their rent toll, stop file and transaction activity from current accounting or property management software; and the ability to send tenants automated e-mail payment reminders and electronic receipts.\u003C/p\u003E\n\n\u003Cp\u003EHeadquartered in New York City, ClickPay Services Inc. was founded in 2008 by CEO Steven Van Praagh, a business communications and Internet entrepreneur for more than 15 years; President Tom Kiernan, a successful digital media entrepreneur, payment processing expert and sales leader; and Executive Vice President Steven Kamhi, a residential property developer in New York City for more than 10 years.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Steven",
      "last_name": "Kamhi",
      "permalink": "steven-kamhi",
      "image": null}},
   {"is_past": false,
    "title": "Founder and CEO",
    "person":
     {"first_name": "Steven",
      "last_name": "Van Praagh",
      "permalink": "steven-van-praagh",
      "image": null}},
   {"is_past": false,
    "title": "Founder and President",
    "person":
     {"first_name": "Tom",
      "last_name": "Kiernan",
      "permalink": "tom-kiernan",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "New Jersey Office",
    "address1": "475 Kinderkamack Road",
    "address2": "",
    "zip_code": "07649",
    "city": "Oradell",
    "state_code": "NJ",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "NYC Office",
    "address1": "424 W. 33rd Street",
    "address2": "",
    "zip_code": "10001",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}