{"name": "Clickscape",
 "permalink": "clickscape",
 "crunchbase_url": "http://www.crunchbase.com/company/clickscape",
 "homepage_url": "http://clickscape.com",
 "blog_url": "http://clickscape.com/real-estate",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "atlanta-real-estate, online-real-estate, atlanta-homes-for-sale-services",
 "alias_list": null,
 "email_address": "david.lightburn@clickscape.com",
 "phone_number": "404.814.0012",
 "description": "Atlanta Real Estate Services",
 "created_at": "Wed Apr 08 15:53:23 UTC 2009",
 "updated_at": "Fri Apr 10 15:48:22 UTC 2009",
 "overview": "\u003Cp\u003EClickscape.com is the location for selling real estate online in Atlanta. In addition to being a knowledge base for Atlanta real estate information, Clickscape provides sellers with a platform to list and sell their homes for free. The idea behind Clickscape is the belief that given the proper tools and information, anyone can sell a home. They aim to provide that experience to all of their visitors. Clickscape does this by streamlining market data and processes to make the seemingly complicated process of selling or buying a home simple. Clickscape is real estate made easy.\u003C/p\u003E\n\n\u003Cp\u003EValue: Clickscape offers a platform for sellers to list and sell their homes using the MLS systems and online advertising outlets\u003C/p\u003E\n\n\u003Cp\u003ESimplicity: Clickscape provides a quick, simple, and easy listing process to list your home online.\u003C/p\u003E\n\n\u003Cp\u003ESocial Media: They incorporate social media into the home selling process to give their sellers as much exposure as possible.\u003C/p\u003E\n\n\u003Cp\u003EInnovation: Clickscape promises that if a tool or advertising outlet is proven to be important in the home selling process, then they will provide it to you at no charge, whenever possible.\u003C/p\u003E\n\n\u003Cp\u003ENo Cost or Obligation: There are no upfront fees or any withdrawal fees if you choose to take your home off the market.\u003C/p\u003E\n\n\u003Cp\u003EExposure: They offer sellers an opportunity to reach millions of potential buyers through their online advertising outlets and inclusion in the MLS systems.\u003C/p\u003E\n\n\u003Cp\u003EHassle-free: Clickscape provides a hassle-free environment with no insistence on price reductions or upselling. They will be as involved as you would like for them to be in the home selling process.\u003C/p\u003E\n\n\u003Cp\u003EConvenient: They make the process of searching for a home simple and straightforward by providing buyers with a powerful search engine to search all available homes on Atlanta real estate market and surrounding areas.\u003C/p\u003E\n\n\u003Cp\u003EService: Clickscape provides friendly, personable service to all visitors and clients.\u003C/p\u003E\n\n\u003Cp\u003EClear Communication: They communicate directly and simply with their visitors with no sales-speak, marketing \u0026#8220;gobbledygook,\u0026#8221; or gimmicks.\u003C/p\u003E\n\n\u003Cp\u003EFeedback Welcome: They welcome your feedback and suggestions and realize that they don\u0026#8217;t have all the answers.\u003C/p\u003E\n\n\u003Cp\u003EAccessible Information: Clickscape makes all their real estate data readily available to clients and visitors without hassle.\u003C/p\u003E\n\n\u003Cp\u003ETransparency: Clickscape offers transparency of our costs and business model to all visitors.\u003C/p\u003E\n\n\u003Cp\u003EReadable: They make all our listing information easy to read with no ALL CAPS HOME DESCRIPTIONS.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       63],
      "assets/images/resized/0004/0562/40562v2-max-150x150.jpg"],
     [[218,
       93],
      "assets/images/resized/0004/0562/40562v2-max-250x250.jpg"],
     [[218,
       93],
      "assets/images/resized/0004/0562/40562v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "David",
      "last_name": "Cumings",
      "permalink": "david-cumings",
      "image": null}},
   {"is_past": false,
    "title": "President",
    "person":
     {"first_name": "David",
      "last_name": "Lightburn",
      "permalink": "david-lightburn",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "950 East Paces Ferry Rd",
    "address2": "Suite 3300",
    "zip_code": "30326",
    "city": "Atlanta",
    "state_code": "GA",
    "country_code": "USA",
    "latitude": 33.84662,
    "longitude": -84.3565171}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}