{"name": "Clipping Path",
 "permalink": "clipping-path",
 "crunchbase_url": "http://www.crunchbase.com/company/clipping-path",
 "homepage_url": "http://www.clippingpathservice360.com",
 "blog_url": "http://www.clippingpathservice360.com/blog",
 "blog_feed_url": "",
 "twitter_username": "clippingpaths7",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2007,
 "founded_month": 11,
 "founded_day": 20,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "clipping-path-services, clipping-path-provider, clipping-path-service-provider, clipping-path-company, clipping-service, clipping-path-india, image-clipping-path, image-clipping-path-india, image-clipping-path-services, image-clipping-path-outsourcing, cl",
 "alias_list": null,
 "email_address": "saniadelhi13@gmail.com",
 "phone_number": "91 114110078",
 "description": "We provide cost-effective.",
 "created_at": "Thu Apr 11 05:40:34 UTC 2013",
 "updated_at": "Thu Apr 11 05:40:40 UTC 2013",
 "overview": "\u003Cp\u003ECPS is a clipping path service provider and photo editing company. We provide cost-effective hand drawn clipping path. Our other services are: photo restoration and image manipulation services. CPS360 with industry specific solutions like, Image cropping, Re-sizing and Website image optimization for Online Stores/Shops.CPS360 with industry \nspecific solutions like, Image cropping, Re-sizing and Website image optimization for Online Stores/Shops. \nNeck montage adding, Mirror shadow, Original Shadow, Drop Shadow, Shadow/Reflection Removal, Color correction or Retouching for product / model shoots.\u003C/p\u003E\n\n\u003Cp\u003ECPS360 has years of professional experience in clipping path at competitive price. Minimize your operational costs and maximize your benefits by outsourcing your clipping path services to CPS360! Our proven management skills and our ability to integrate technology with business processes make us the natural choice as your outsourcing partner. India has a virtual 12-hour time zone difference with major markets for IT-enabled Services, it enables us to send back your work next morning when you in office. \u003C/p\u003E\n\n\u003Cp\u003EWe are the best clipping path provider in our domain. We have State-of-the-Art offshore graphic studio providing clipping path from India. Our other services, you can check out, image editing and image background removal, among others. Do check out our other expertise aside from clipping path.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       53],
      "assets/images/resized/0025/0517/250517v2-max-150x150.jpg"],
     [[250,
       88],
      "assets/images/resized/0025/0517/250517v2-max-250x250.jpg"],
     [[450,
       159],
      "assets/images/resized/0025/0517/250517v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}