{"name": "Cloud9express",
 "permalink": "cloud9express",
 "crunchbase_url": "http://www.crunchbase.com/company/cloud9express",
 "homepage_url": "http://cloud9express.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Cloud9express",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "smb-market, cloud-application, software-as-a-service",
 "alias_list": null,
 "email_address": "",
 "phone_number": "913-481-8749",
 "description": "The \"Orbitz\" for shipping.",
 "created_at": "Thu Mar 22 21:33:43 UTC 2012",
 "updated_at": "Thu Aug 02 22:44:10 UTC 2012",
 "overview": "\u003Cp\u003ECloud9express brings immediate transportation savings to over 400,000 SMB’s with a download and go ERP integration from the cloud.\u003C/p\u003E\n\n\u003Cp\u003EOver 400,000 Small to Medium Businesses are searching for ways to save operating and transportation dollars to meet budget numbers without making large investments in supply chain projects. This market is completely underserved. \u003C/p\u003E\n\n\u003Cp\u003ECloud9express is a unique enterprise quality shipping software solution because we’ve eliminated all the barriers of traditional supply chain projects to unleash huge Customer savings opportunities for a modest subscription fee. Our easy download and go approach to Cloud integration uses a patent pending method of connecting ERP systems to Cloud9express without the need for IT intervention in an hour or less. The Customer can make a decision to save money on transportation and start saving the same day which drives our transactional business model. \u003C/p\u003E\n\n\u003Cp\u003ECloud9express is a team of seasoned veterans that have automated hundreds of warehouses in the SMB marketplace. Cloud9express’ enterprise product has automated shipping in over 70 warehouses in both B2B and B2C applications with 200 – 30,000 shipments/day at each site. We will leverage the Cloud9express shipping system and on-demand integration platform to become the standard for automated B2B commerce through innovation, ease of use, and at an attractive price point.\u003C/p\u003E\n\n\u003Cp\u003EWe provide a simple deployment (hours not weeks), easy to use, very low cost way to find the least cost shipping method for Customer orders.  Our download and go approach to integration connects ERP systems to Cloud applications and is patent pending.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[128,
       127],
      "assets/images/resized/0018/0664/180664v2-max-150x150.png"],
     [[128,
       127],
      "assets/images/resized/0018/0664/180664v2-max-250x250.png"],
     [[128,
       127],
      "assets/images/resized/0018/0664/180664v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}