{"name": "CloudOptix",
 "permalink": "cloudoptix",
 "crunchbase_url": "http://www.crunchbase.com/company/cloudoptix",
 "homepage_url": "http://www.meghaware.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Megha_Ware",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": 5,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cloud, software, storage, personal-cloud, public-cloud, private-cloud, privacy, availability, low-cost, cloud-in-a-box, digital-locker, data-protection, device-synchronization, communications, collaboration, social-networking, content-distribution",
 "alias_list": null,
 "email_address": "info@meghaware.com",
 "phone_number": "508-532-0044",
 "description": "Personal Cloud Computing",
 "created_at": "Tue Jan 29 11:13:33 UTC 2013",
 "updated_at": "Wed Feb 06 23:35:34 UTC 2013",
 "overview": "\u003Cp\u003ECloudOptix (CO) has developed a personal cloud computing software product called CloudTop, that can be downloaded from their website onto personal computers, notebooks, tablets and smart phones.\u003C/p\u003E\n\n\u003Cp\u003ETo ensure privacy and access at the lowest possible cost, CloudTop offers users a comprehensive suite of data storing, sharing and communication cloud apps that use enterprise-class security to access inexpensive public “pay-as-you-go” cloud storage or private “cloud-in-a-box” storage.\u003C/p\u003E\n\n\u003Cp\u003EWith a CloudTop users can login to their public cloud storage  accounts (Amazon S3, Microsoft Azure, Google Storage, HP Storage, Rackspace Cloud Files, AT\u0026amp;T Synaptics, Nirvanix Storage) and/or private cloud-in-a-box (EMC Atmos, OpenStack Swift, MeghaWare Appliance) to auto slice into secure cloud workspaces and communication channels - for digital lockers, data backups, collaboration and several other use cases.\u003C/p\u003E\n\n\u003Cp\u003ESmall business and professional users will find at least one secure cloud app to store or backup their data, or find one to synchronize files, contacts, calendars or notes across their PCs, Tablets or Smart Phones - as well as directly click to view or edit them with the appropriate device-installed apps. \u003C/p\u003E\n\n\u003Cp\u003EOr choose a cloud app for creating a private work, play or social network and with a free invitee app link invite others to share files, post or pin content; email, instant message, collaborate or socialize in absolute privacy – as well as stay connected with them via public social networks, email, IM, etc.\u003C/p\u003E\n\n\u003Cp\u003EAll CloudTop transactions are secured with vendor independent AES-256 encryption, including data stored on any MeghaWare cloud appliances used for local storage or caching - not using third party encryption or servers ensures data privacy from loss or theft and availability during service outages.\u003C/p\u003E\n\n\u003Cp\u003EWith support for pay-as-you-go accounts and one-click migration or deletion, CloudTop users can shop around for free storage offers and the lowest monthly subscription fees from 7 industry leading providers – rent at will for pennies per month ($0 if unused) and save by paying per GB (used). \u003C/p\u003E\n\n\u003Cp\u003EWith support for cloud-in-a-box caching and storing, monthly subscription fees can be driven down to the bone or completely eliminated. Also, savings dramatically go up with the number of free invitee apps used, when compared to fees charged for every user by other cloud or traditional app vendors.\u003C/p\u003E\n\n\u003Cp\u003EIndustry veterans Shawn Nagar and Leo Salazar came up with the idea of MeghaWare - personal cloud computing software - in early 2009, drawing on their experience in designing high performance computers (at DEC), creating a storage-networking company (acquired by EMC) and a storage-virtualization company (acquired by VMware). Ashish Nagar joined the founding team in January 2010, to head product engineering in India.  \u003C/p\u003E\n\n\u003Cp\u003EMeghaWare is a registered trademark and brand name for CO\u0026#8217;s cloud computing family of software products. CloudTop is a registered trademark and brand name of their flagship product. \u003C/p\u003E\n\n\u003Cp\u003ECO is a privately held software company founded in May, 2009. Primarily focused on the front-end of cloud computing, it has developed virtual cloud computing software. Sold as the MeghaWare CloudTop, it offers users their own suite of cloud computing applications and a personal cloud created from virtually connecting their public and private cloud storage accounts.\u003C/p\u003E\n\n\u003Cp\u003EThey are headquartered in Boca Raton, FL. They have R\u0026amp;D centers in Massachusetts, Texas and California. Their Product Engineering and Technical Support offices are located in India.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/2307/232307v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0023/2307/232307v2-max-250x250.jpg"],
     [[450,
       450],
      "assets/images/resized/0023/2307/232307v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/mDCvIR12elo\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EMeghaWare Work, Play \u0026amp; Socialize\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}