{"name": "Cloudware Hosting",
 "permalink": "cloudware-hosting",
 "crunchbase_url": "http://www.crunchbase.com/company/cloudware-hosting",
 "homepage_url": "http://cloudwarecity.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "cloudwarecity",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 4,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-applications, app-store, cloudware, cloud-computing, web-2-0, subscriptions, billing, authentication, saas, web-software, web-developers-resource, web-subscriptions, recurring-billing, membership-sites",
 "alias_list": null,
 "email_address": "info@cloudwarecity.com",
 "phone_number": "",
 "description": "Easiest Web Subscription App Store",
 "created_at": "Sun Oct 24 19:09:50 UTC 2010",
 "updated_at": "Tue Aug 09 17:14:37 UTC 2011",
 "overview": "\u003Cp\u003ECloudware Hosting Ltd is a growing business offering services to make it easy to offer subscriptions to web apps, services and content websites.\u003C/p\u003E\n\n\u003Cp\u003EBy outsourcing sales and marketing, subscriptions, authentication and monitoring systems to Cloudware Hosting Ltd, through the Cloudware City site, members (both businesses and individuals) can save time and money by swiftly clearing the barriers of getting their products generating online recurring revenue through subscriptions and can instead concentrate on doing what they do best, developing the great Internet Cloud software, content and services that are fast becoming a growing trend.\u003C/p\u003E\n\n\u003Cp\u003ECloudware City is designed to provide website owners subscriptions and recurring billing to their sites, and can plug into popular web content management systems like Joomla and WordPress. \u003C/p\u003E\n\n\u003Cp\u003EWhilst there are plenty of individual solutions (for payment, subscriptions billing, account management and more) to piece and integrate together to form a subscriptions based website, Cloudware City is the only place to find all under one system with a API.\u003C/p\u003E\n\n\u003Cp\u003EThe paid for membership service offers the following mechanisms to web software developers (Vendors):\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EReselling subscriptions to application/service/content sites to end users in the Web App Store.\u003C/li\u003E\n\u003Cli\u003ERecurring subscriptions billing and management\u003C/li\u003E\n\u003Cli\u003EAuthentication and validation of subscription user base to ensure only valid, subscribed users gain access to content through the unique Website Authentication API.\u003C/li\u003E\n\u003Cli\u003EInclusive Marketing of web applications/online services.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EThis and other great opportunities are offered for a low fee, leaving vendors to reap the rewards of their products being made available through Cloudware City, in the cloud.\u003C/p\u003E\n\n\u003Cp\u003EListing itself is free of charge, so as long as vendors continue to comply with the legal and acceptable use policies, they can list as many products as wished. \u003C/p\u003E\n\n\u003Cp\u003ECloud Computing, Web 2.0 for the masses. \u003C/p\u003E\n\n\u003Cp\u003EThe Founder and CEO, Keith Hall previously held the role of Vice President/Director of IT and Infrastructure for a global, UK based plc, and having 20+ years background in IT is well experienced in design, operations, strategy, troubleshooting, budgetary and financial management of IT and telecommunications based businesses with a strong managed services slant. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[100,
       59],
      "assets/images/resized/0010/7068/107068v5-max-150x150.png"],
     [[100,
       59],
      "assets/images/resized/0010/7068/107068v5-max-250x250.png"],
     [[100,
       59],
      "assets/images/resized/0010/7068/107068v5-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO / Founder",
    "person":
     {"first_name": "Keith",
      "last_name": "Hall",
      "permalink": "keith-hall",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}