{"name": "Cloudfinity",
 "permalink": "cloudfinity",
 "crunchbase_url": "http://www.crunchbase.com/company/cloudfinity",
 "homepage_url": "http://www.cloudfinity.co",
 "blog_url": "http://blog.cloudfinity.co",
 "blog_feed_url": "",
 "twitter_username": "cloudfinityco",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cloud-storage, cloud-management",
 "alias_list": null,
 "email_address": "hq@cloudfinity.co",
 "phone_number": "",
 "description": "Unifying personal cloud storage",
 "created_at": "Tue Nov 06 14:29:37 UTC 2012",
 "updated_at": "Wed Nov 07 06:29:03 UTC 2012",
 "overview": "\u003Cp\u003ECloudfinity - unify all your cloud storage accounts.  The easiest way to access your files in the cloud.\u003C/p\u003E\n\n\u003Cp\u003ECloudfinity is an application that unifies and integrates your cloud storage and local space into a single, managed and search-able virtual drive, running on the web,  iOS, Android devices and any desktop.\u003C/p\u003E\n\n\u003Cp\u003ECloudfinity unifies “Instantly” multiple cloud accounts together with all available local space into a single virtual storage and provides a multitude of services and features like:\u003C/p\u003E\n\n\u003Cp\u003E1.Location transparency\nYou can forget about having to remember where you put your files, on which cloud storage provider.\u003C/p\u003E\n\n\u003Cp\u003E2.Instant Search\nYou can instantly search for any file in this unified space.  \u003C/p\u003E\n\n\u003Cp\u003E3.Numerous Views\nYou can always define a custom view or use the default views provided within the application.\u003C/p\u003E\n\n\u003Cp\u003E4.Categories\nYou can create custom categories for individual files so you can access your files more easily.\u003C/p\u003E\n\n\u003Cp\u003E5.Tags\nLike categories, You can assign tags to your files. These tags will allow you to automatically view your images as slide shows or your audio files with the same tags to be played as play list.\u003C/p\u003E\n\n\u003Cp\u003E6.Cloud/Storage Management\nYou can add and remove cloud accounts and local storage (e.g. a MicroSDCard) at anytime.  The application will transparently add the new resources and synchronize them in the Virtual Drive.\u003C/p\u003E\n\n\u003Cp\u003E7.Cloud Account Cancellation\nYou can mark for removal any cloud account and Cloudfinity will move all the files from that account to the available space in the virtual storage.\u003C/p\u003E\n\n\u003Cp\u003E8.Synchronization\nYou can synchronize your local files within this unified virtual drive with one touch.\nFor those moments when you don’t have Internet access or don’t want to use your data plan/3g connection, remote files can be copied to the local storage with one touch as well.\u003C/p\u003E\n\n\u003Cp\u003E9.Sharing\nYou can share all your files residing in Cloudfinity with all your friends.  Cloudfinity will provide default sharing options (SMS, Facebook , Twitter, email, print integration)\u003C/p\u003E\n\n\u003Cp\u003E10.Statistics\nYou can have access to resource statistics like: generated traffic, free space, resources by type, most accessed resources, shared files. All on Cloudfinity.\u003C/p\u003E\n\n\u003Cp\u003E11.Modules\nYou can manage most common resource types like: images, music, videos and documents.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       85],
      "assets/images/resized/0021/9039/219039v2-max-150x150.jpg"],
     [[250,
       143],
      "assets/images/resized/0021/9039/219039v2-max-250x250.jpg"],
     [[450,
       257],
      "assets/images/resized/0021/9039/219039v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "founder",
    "person":
     {"first_name": "Stefan",
      "last_name": "Neagu",
      "permalink": "stefan-neagu",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}