{"name": "Clover Advertising",
 "permalink": "clover-advertising",
 "crunchbase_url": "http://www.crunchbase.com/company/clover-advertising",
 "homepage_url": "http://www.gr8-opportunities.com/clover-advertising-ltd-bristol.htm",
 "blog_url": "http://cloveradvertisingltd.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "cloveradv",
 "category_code": "consulting",
 "number_of_employees": 60,
 "founded_year": 2004,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "clover-advertising, direct-marketing",
 "alias_list": null,
 "email_address": "cloveradvertisingcompany@gmail.com",
 "phone_number": "0117 329 4282",
 "description": "Clover Advertising Ltd -Direct Marketing",
 "created_at": "Mon Apr 22 06:49:30 UTC 2013",
 "updated_at": "Mon Apr 29 15:42:31 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in 2007, Clover Advertising is an outsourced sales and marketing company working with some of the UKs most recognisable brands. By delivering the highest level of sales with the best representation, Clover has a dedicated team of professionals who work hard to achieve all agreed targets and to make sure the clients keep on returning.\u003C/p\u003E\n\n\u003Cp\u003EThroughout the last 6 years the organisation has expanded into many areas of the UK and throughout Europe. Currently our Head Office is based in Bristol City Centre as well as Liege, Belgium. In order for the company to continue on its expansion plan, we are always looking for the next people to join our team. Visit us directly at www.cloveradvertising.com where you can apply with any queries directly to the company.\u003C/p\u003E\n\n\u003Cp\u003EThe success rate of the contracted clients represented by Clover Advertising has always been on an increasing rate. The sustainably increasing rate of growth has strengthened the relationship with the prospective clients. The growing team of successful people has the know-how to turn every challenging market conditions into favourable business environment that would automatically increase more and more business opportunities. From working in a motivated and enjoyable environment, our team is happy to help with all enquires and to provide solutions for both customers and clients alike.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}