{"name": "Codagenix, Inc.",
 "permalink": "codagenix-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/codagenix-inc",
 "homepage_url": "http://codagenix.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": 4,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "synthetic-biology, vaccine, biotechnology, immunology, gene-expression, viruses",
 "alias_list": null,
 "email_address": "coleman@codagenix.com",
 "phone_number": "5164485073",
 "description": "Synthetic Vaccine Design",
 "created_at": "Sun Aug 26 19:48:19 UTC 2012",
 "updated_at": "Thu Aug 30 19:51:19 UTC 2012",
 "overview": "\u003Cp\u003ECodagenix Inc. utilizes our breakthrough platform technology termed SAVE to construct live-attenuated viral vaccines against multiple targets. All live-attenuated vaccines that are currently used in the clinic were developed using a trial-and-error based method developed in the 1880s, pre-dating the discovery of the DNA double helix.  Codagenix presents a breakthrough approach to live-attenuated vaccine design- were no longer would a vaccine developer blindly passage their target virus to construct a vaccine.  The SAVE platform relies on synthetic biology and the “re-designing” of a target virus’s entire genome to yield a vaccine strain (Coleman JR. Science 2008; Muller SM. Nature Biotechnology 2010).  This customization process uses software-based algorithms to ‘re-code’ the genome of a target virus.  This genomic ‘re-coding’ results in a virus that is antigenically 100% identical (i.e. looks exactly like the wild-type, virulent strain) but possesses a genome that renders it attenuated in the host.  The proteins of the SAVE-designed vaccine strain are one hundred percent identical to the virulent strain and as a result animals vaccinated with SAVE-designed vaccines develop a robust and protective immune response.   SAVE is a platform technology that has had preliminary success constructing vaccine candidates for multiple, unrelated targets viruses.  SAVE is an up-stream approach to vaccine construction.  The science behind the SAVE ‘re-design’ targets a fundamental process of all viruses and thus it is viewed as platform that could yield a pipeline of candidate vaccine strains against multiple targets that include: Influenza A virus, Dengue Virus, Respiratory Syncytial virus, poliovirus, and others.\u003C/p\u003E\n\n\u003Cp\u003EThe first candidate virus in our pipeline is a live-attenuated Influenza A virus vaccine (LAIV), particularly the seasonal 2009 H1N1 Influenza A virus (referred to as “swine flu”).  This candidate of our pipeline has been initially supported by a small business grant for $551,000 from the NIH that is eligible for $3.5 million based on success.  Despite the availability of seasonal vaccines, Influenza still has a substantial impact on human health.  Based on our approach and preclinical findings, Codagenix has the view that once in the market a SAVE-designed LAIV will prove superior to currently available seasonal flu vaccines.  Aside from Influenza spreading around the world in seasonal epidemics, killing thousands of people annually, there is also a fear of a pandemic arising from an avian H5N1strain.  An additional view of Codagenix is that SAVE can offer a rapid design of a highly immunogenic, anti-H5N1 vaccine should the need arise. The majority of seasonal Influenza A vaccines currently in the market at present are mostly composed of inactivated (killed) virus particles that can result in a inadequate immune response.  There is an ever-growing demand in the market for influenza vaccines, thus an improved LAIV could capture significant market share of what is estimated to be a $6 billion market. In the US this market has been growing with compound annual growth rate (CAGR) of 19% and it is projected to retain a CAGR of 9% until 2015, at which the total market value would reach $15 billion. \u003C/p\u003E\n\n\u003Cp\u003EThe current business plan of Codagenix has two focuses – to prepare our LAIV for clinical testing and to further demonstrate that SAVE is a platform technology for vaccine development by expanding our pre-clinical pipeline to include other targets such as Dengue virus and RSV. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       20],
      "assets/images/resized/0020/8224/208224v2-max-150x150.jpg"],
     [[250,
       34],
      "assets/images/resized/0020/8224/208224v2-max-250x250.jpg"],
     [[450,
       62],
      "assets/images/resized/0020/8224/208224v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$600k",
 "funding_rounds":
  [{"round_code": "grant",
    "source_url": "",
    "source_description": "NIH - STTR",
    "raised_amount": 600000.0,
    "raised_currency_code": "USD",
    "funded_year": 2012,
    "funded_month": 7,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "25-108 Health Sciences Dr",
    "address2": "",
    "zip_code": "11794",
    "city": "Stony Brook",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}