{"name": "CodeSoc",
 "permalink": "codesoc",
 "crunchbase_url": "http://www.crunchbase.com/company/codesoc",
 "homepage_url": "http://www.codesoc.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "codesoc",
 "category_code": "web",
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "programmer, designer, coder, social, social-network, freelancer, freelancing, profile, professional",
 "alias_list": null,
 "email_address": "admin@codesoc.com",
 "phone_number": "",
 "description": "programmers and designers get connected",
 "created_at": "Thu Dec 13 14:51:43 UTC 2012",
 "updated_at": "Wed Dec 19 05:11:02 UTC 2012",
 "overview": "\u003Cp\u003ECodeSoc connects the programmers and designers from the world of coding.\u003C/p\u003E\n\n\u003Cp\u003ECodeSoc is a social platform where coders get connected through their activity, groups, blogs, forums and portfolio items. There was no place on the web for coders (programmers and designers) and IT companies, where they can get connected socially. Till today, it was hard for coders to get connected with other coders and companies worldwide. Hardly, they could get connected through their blog’s contact forms, some forum sites and other social-networking sites.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;So we decided to give them a social place on the web, where they can do all these things to get connected with each other.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EAnother reason behind introducing CodeSoc is, we wanted to introduce a new way for IT companies to hire freelancers (coders, designers, content writers, SEO persons) based on their presence on the web, their activities and sharing of knowledge on the web, their work samples on the web.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;See, how are we do this?\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EIn CodeSoc, profile gives an overview of a user. We allow every user to create their own profile.\u003C/p\u003E\n\n\u003Cp\u003EGroups can be created by every user based on their coding interests or their skills. Users can join the groups of their coding interests and the skills they have. They can subscribe to group to get its activity summery in emails. Users can share updates, stories, news and more in the groups they have joined. This way, group members stay connected with each other.\u003C/p\u003E\n\n\u003Cp\u003EForums can be used for all users to start a discussion on any topic related to coding world. Every user can start a forum topic to start a discussion on it or to know the views of other coders on CodeSoc. Forum topics are group specific in CodeSoc.\u003C/p\u003E\n\n\u003Cp\u003EBlogs are the must part of coders’ life. Great coders always keep themselves busy with reading blog posts, articles, tutorials and much more. There are many coders who love sharing their knowledge on the web. So we decided to give them a place, where they can have their own blogs to share their knowledge on a social platform. Coders will be able to create their own wordpress blogs on CodeSoc with awesome themes and useful plugins to do more on the web. So this way, there is no need to have separate blog domain and hosting. There is no need to share just a link of your blog on other social sites; you take it with your CodeSoc account.\u003C/p\u003E\n\n\u003Cp\u003EPortfolio shows the work samples and projects that a coder has developed. Every coder will be able to add their work samples and projects that they have developed with their knowledge and logical mind. The companies and recruits will be able to see coders’ work and experience with coding.\u003C/p\u003E\n\n\u003Cp\u003EActivity includes the summary of all above things. Do you want to analyze a coder? Then just have a look at the coder’s activity on CodeSoc. You will have a complete review of a coder’s career as an employee or as a freelancer.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;So… coders can join CodeSoc to represent their everything related to coding… companies can join CodeSoc to get a best coder or freelancer for them…\u0026#8221;\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/6017/226017v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0022/6017/226017v2-max-250x250.png"],
     [[260,
       260],
      "assets/images/resized/0022/6017/226017v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder, CEO",
    "person":
     {"first_name": "Bhumi",
      "last_name": "Lakum",
      "permalink": "bhumi-lakum",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "Geeklist",
      "permalink": "geeklist",
      "image":
       {"available_sizes":
         [[[150,
            125],
           "assets/images/resized/0013/8689/138689v4-max-150x150.png"],
          [[250,
            209],
           "assets/images/resized/0013/8689/138689v4-max-250x250.png"],
          [[450,
            376],
           "assets/images/resized/0013/8689/138689v4-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "Coderwall",
      "permalink": "coderwall",
      "image":
       {"available_sizes":
         [[[150,
            39],
           "assets/images/resized/0017/6016/176016v1-max-150x150.png"],
          [[154,
            41],
           "assets/images/resized/0017/6016/176016v1-max-250x250.png"],
          [[154,
            41],
           "assets/images/resized/0017/6016/176016v1-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[131,
        150],
       "assets/images/resized/0022/5240/225240v2-max-150x150.png"],
      [[218,
        250],
       "assets/images/resized/0022/5240/225240v2-max-250x250.png"],
      [[393,
        450],
       "assets/images/resized/0022/5240/225240v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}