{"name": "Cognitor",
 "permalink": "cognitor",
 "crunchbase_url": "http://www.crunchbase.com/company/cognitor",
 "homepage_url": "http://www.cognitor.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 1995,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "service-management, knowledge-management, social-search, social-recommendations, field-service, mobile-applications, crm",
 "alias_list": null,
 "email_address": "info@cognitor.com",
 "phone_number": "3122537660",
 "description": "",
 "created_at": "Sun Jul 20 00:06:34 UTC 2008",
 "updated_at": "Mon Jan 28 03:45:54 UTC 2013",
 "overview": "\u003Cp\u003ECognitor provides solutions for customer management, designed to enhance the customer experience from sales to service.  Cognitor\u0026#8217;s solutions enable organizations to more precisely deliver information and knowledge throughout the sales or service cycle so each customer interaction is optimized.  Cognitor\u0026#8217;s Solutions can dramatically change the outcome of each situation by learning what all prior experiences have been so that the next engagement is optimized for the highest levels of sales or service.\u003C/p\u003E\n\n\u003Cp\u003EDuring the sales process, independent of whether it is on a web ecommerce site or in the field, Cognitor enhances knowledge delivery through its new social search and recommendations tool powered by Baynote and Cognitor\u0026#8217;s Intelligent Knowledge Management System. Cognitor\u0026#8217;s new mobile application product can rapidly deploy to any mobile field device instantaneously the latest information on new products, content, pricing, or competitive information so the right content can be provided during the most critical point of the sales process.\u003C/p\u003E\n\n\u003Cp\u003ECognitor\u0026#8217;s Agile Service Management Suite will enhance the customer service experience independent of whether the channel is through the call center, field, repair, or web self-service site. Cognitor\u0026#8217;s ENQUIRE Knowledge Management System will support your service operation to management and deliver timely support knowledge and information rapidly learning what customers have found useful in the past.  Cognitor\u0026#8217;s OneView and Pro*Act intelligently monitor service operations and provide the highest levels of service across all channels and provide real time notification of critical conditions and actions to be taken.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0002/2396/22396v2-max-150x150.png"],
     [[250,
       69],
      "assets/images/resized/0002/2396/22396v2-max-250x250.png"],
     [[450,
       124],
      "assets/images/resized/0002/2396/22396v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Headquarters",
    "address1": "233 South Wacker Drive",
    "address2": "84 Floor",
    "zip_code": "60606",
    "city": "Chicago",
    "state_code": "IL",
    "country_code": "USA",
    "latitude": 41.886477,
    "longitude": -87.643119}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}