{"name": "colossal infrastructure",
 "permalink": "colossal-infrastructure",
 "crunchbase_url": "http://www.crunchbase.com/company/colossal-infrastructure",
 "homepage_url": "http://www.indiamart.com/colossalinfrastructure/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "colossalinfrastructure@tradepassport.org",
 "phone_number": "8963044554",
 "description": "trader, service provider and supplier",
 "created_at": "Fri Apr 05 07:34:19 UTC 2013",
 "updated_at": "Fri Apr 05 07:34:23 UTC 2013",
 "overview": "\u003Cp\u003EOur private limited company was incorporated in the year 2012 in the name of Colossal Infrastructural Equipments Pvt.Ltd. at Bassi RIICO Industrial Area, Jaipur, Rajasthan, India. The director, Mr. Shiv Charan Meena has shown exemplary business skills to lead the company unto prosperity.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nThe firm is facilitated with ultra modern infrastructure and installation of very sophisticated machinery and equipments and high precision tools. The workmen are encouraged to skilfully perform the activity of manufacturing, assembling and finishing the products. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team of extremely dedicated and highly qualified and experienced professionals is best in industry to manage the affairs very efficiently at all stages of fabrications and engineering of products supplied by us.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOur company has built up a vast and authentic vendor base. Under the watchful eyes of the directors, only those vendors have been chosen those who have an excellent market reputation for using quality ingredients at all times and as well making use of the latest processing techniques while developing the products.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur workmanship of products and fine finish has always found the clients satisfaction and have therefore are inclined for continued business dealings with us. Client satisfaction remains our prime objective.\u003C/p\u003E\n\n\u003Cp\u003EConsultation \u0026amp; Project Management:\nUsing our specialist knowledge we will meet with you, discuss your needs to gain an understanding of your requirements and advise you on the safest, most time efficient and cost effective scaffolding solution. We aim to work with you throughout your project to ensure time deadlines are met and budgets not exceeded.\u003C/p\u003E\n\n\u003Cp\u003ERestoration and Conservation:\nCOLOSSAL Infrastructure Equipment has worked with many building conservation and restoration companies to provide bespoke, specialist access scaffolding within fragile historic buildings. The utmost care is taken within these sensitive surroundings to ensure important maintenance and preservation work can be carried out.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8391/248391v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8391/248391v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8391/248391v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}