{"name": "Comatek",
 "permalink": "comatek",
 "crunchbase_url": "http://www.crunchbase.com/company/comatek",
 "homepage_url": "http://www.comatek.fr",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "collaborative-management-technologies-enterprise-innovation",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Collaborative Management Technologies",
 "created_at": "Thu Jul 16 15:01:52 UTC 2009",
 "updated_at": "Tue Feb 21 16:34:50 UTC 2012",
 "overview": "\u003Cp\u003EMain product of Comatek company is  PhiÂ²Back\nPhiÂ²Back (to pronounce Â«Â FeedBackÂ Â») is meant to companies willing to empower their employees, and to set up an intelligent, dynamic and  collaborative management using a Web2.0 based solution.\n PhiÂ²Back is a technology (neural engine based expert system) resulting from studies in the EFM (Enterprise Feedback Management) field. And more precisely , it stands as one of the first ones EIRM products (Entreprise Internal Relationship Management), one advanced EFM concept.\n PhiÂ²Back allows companies to optimize their management, to decrease their turn-over, and to increase the value of their competences.\n PhiÂ²Back leans on a strong adherence from Managers Boards, Human Resources, Managers and employees themselves. It therefore makes an essential complement to any other existing collaborative management tool.\n PhiÂ²Back reports thanks to a set of relevant indicators an instant picture of the company life from social, technical and professional standpoints, and thanks to its complete integration within the information system, this is achieved regardless of the software tools or operating systems used.\n PhiÂ²Back measures (polls interfaced with forums) adherence level to innovative ideas, which thrive from the inside future development axis.\n PhiÂ²Back strength resides in its intra-professional appreciation within the company, and through promising ideas than can be submitted by the employees using the product.\n PhiÂ²Back targets companies over 100 people owning an information system embarking (or about to embark) on a development of their human competences and well aware of Web2.0 specificities. All sectors of the market are concerned.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0005/3154/53154v4-max-150x150.png"],
     [[250,
       73],
      "assets/images/resized/0005/3154/53154v4-max-250x250.png"],
     [[450,
       131],
      "assets/images/resized/0005/3154/53154v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Patrick",
      "last_name": "POIRAUD",
      "permalink": "patrick-poiraud",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}