{"name": "Commonwealth Games 2010 come in Delhi with in 12 days",
 "permalink": "commonwealth-games-2010-come-in-delhi-with-in-12-days",
 "crunchbase_url": "http://www.crunchbase.com/company/commonwealth-games-2010-come-in-delhi-with-in-12-days",
 "homepage_url": "http://www.thecommonwealthgames.co.in/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "ewizardservices",
 "category_code": "games_video",
 "number_of_employees": 1,
 "founded_year": 2010,
 "founded_month": 9,
 "founded_day": 21,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "commonwealth-games-2010-delhi, common-wealth-games-2010-delhi",
 "alias_list": null,
 "email_address": "paramp@ewizardglobal.com",
 "phone_number": "01294179498",
 "description": "The common wealth Games website provides",
 "created_at": "Mon Sep 20 08:03:41 UTC 2010",
 "updated_at": "Sat Oct 02 05:53:23 UTC 2010",
 "overview": "\u003Cp\u003E\u0026lt;a href=\u0026quot;http://www.thecommonwealthgames.co.in/\u0026quot;\u0026gt;Commonwealth Games 2010 Delhi\u0026lt;/a\u0026gt; is a very prestigious event for our country as this is for the first time that CWG are held in India. Prior to this India got the privilege to host Asian games in 1951 and 1982.\u003C/p\u003E\n\n\u003Cp\u003ECommon Wealth Games will be held in Delhi from 3rd October to 14th October.  This is one of the largest multi-sport events, and it is the nineteenth edition of Common Wealth Games that our country is hosting in October 2010. This is for the second time that such an event is organised in Asia.  A theme song is prepared by Mr. A.R Rehman for the same. \u003C/p\u003E\n\n\u003Cp\u003ECOMMONWEALTH GAMES HOTELS\nFor the accommodation of the tourists who will be coming to our country during the games, there are a number of hotels which can serve the purpose. There are hotels which are near the airport if tourists want to opt for it. There are 5 star luxury hotels as well has hotels that have rooms available at a cheaper price. It entirely depends on the choice and the budget of the tourist what they want to go for.\u003C/p\u003E\n\n\u003Cp\u003EThere are many cwg venues that have been newly constructed or have been renovated for different game events. One such venue which is the most important venue of all is Jawaharlal Nehru Stadium. This venue is important as the opening and the closing ceremony of the games will be hosted here along with other event like Athletics, Lawn bowls and Weightlifting.\u003C/p\u003E\n\n\u003Cp\u003EOther commonwealth game venues are:\nNational Stadium : Venue for Hockey \nIndira Gandhi Indoor Stadium complex: Venue for indoor games like Cycling, Gymnastics and Wrestling.\nKarni Singh Range: Venue for shooting.\nThyagaraja Nagar Sports Complex: Venue for events related to Netbal\nNDMC Indoor Stadium: Event like boxing will be held here.\nSiri Fort Sports Complex: Venue for events like Badminton and Squash \nYamuna Sports Complex: Table tennis events are going to be held in this complex.\nUniversity Sports Complex: Events for Aquatics and Rugby 7s are going to be held in this complex.\u003C/p\u003E\n\n\u003Cp\u003EFor any other detail related to commonwealth games 2010 you can always visit the link for cwg latest news given below.\nG-43, Vardhmaan Mall,\nFaridabad-121005 (Haryana)\nPh. 01294179498\nWeb- http://thecommonwealthgames.co.in\nEmail ID:- paramp@ewizardglobal.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}