{"name": "Commerce India",
 "permalink": "commerce-india",
 "crunchbase_url": "http://www.crunchbase.com/company/commerce-india",
 "homepage_url": "http://www.indiamart.com/commerceindia/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "commerceindia@tradepassport.org",
 "phone_number": "9843012267",
 "description": "Wholesale Merchants of branded ,",
 "created_at": "Fri Apr 05 09:19:35 UTC 2013",
 "updated_at": "Fri Apr 05 09:19:38 UTC 2013",
 "overview": "\u003Cp\u003EWe as a company came in existence in the year 2009, as a partnership firm. Commerce India has grown as a company and helped the industry realize our potential. From strength to strength we have posted our success stories; thereby we introduce ourselves as one of the best known trader, supplier \u0026amp; distributor of herbal health care products, baby care herbal products, hair, care herbal products, cosmetic products, herbal weight loss products and more.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nThe quality managers are well trained on each and every aspect of the product functionality so that these are tested as per the varied condition. They take part in regular conclaves, seminars and knowledge sharing platforms where in they are updated about the current advancements. These help to garner rich experience and produce high quality products.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe have a large vendor base, which helps us to cater to large market base. Apart from this the vendors are equally qualified to work within set of parameters, and delivering high quality products. Our vendors are in tune with the quality and production facility so this gives us an edge work swiftly and take bigger strides towards success.\u003C/p\u003E\n\n\u003Cp\u003ECustomer Satisfaction:\nWe constantly work towards achieving the highest level of client satisfaction. During the production process, the client role is very important, that helps them to have their say. Based on their input and our technical expertise we combine together to excel with our products.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nbaby care herbal products, hair, care herbal products, cosmetic products, herbal weight loss products and more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8475/248475v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8475/248475v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8475/248475v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}