{"name": "Compass Van Lines",
 "permalink": "compass-van-lines",
 "crunchbase_url": "http://www.crunchbase.com/company/compass-van-lines",
 "homepage_url": "http://www.compassvanlines.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "movers-in-texas, fort-lauderdale, miami-movers, movers-in-orlando, movers-in-florida, movers-in-tampa-florida, movers-in-orlando-florida, movers-orlando, florida-movers, apartment-movers-orlando, , movers-in-miami-florida, movers-in-miami, movers-to-flori",
 "alias_list": null,
 "email_address": "info@compassvanlines.com",
 "phone_number": "866-446-6202",
 "description": "moving and storage",
 "created_at": "Mon Jan 03 18:54:43 UTC 2011",
 "updated_at": "Mon Jan 03 21:05:20 UTC 2011",
 "overview": "\u003Cp\u003EWe at Compass Van Lines are proud to be the best in the business. Our trained and experienced crews, our highly skilled drivers and our relocation consultants are carefully selected so you can be sure that you will get the best service we can offer. www.compassvanlines.com\nAs a full service moving and storage company we provide for all your moving needs in one complete package that is named Compass Van lines. With special services such as hoisting and fine art moving to name a few, we are proud to be the moving company that will do everything needed to complete your move. With Compass Van Lines, you have the freedom to choose from many levels of services, or maybe you want to stay in our storage for a period; you can also choose from many levels of packing. You can select the way we calculate your moving cost. Get a free quote today!! Yes, you decide how we will charge you, whether it\u0026#8217;s by volume or by weight we are proud to let you choose. Compass Van Lines is a member in all the major moving and business associations such as the Better Business Bureau and AMSA and we are proud of our record throughout the years. With service anywhere in the world we have you covered 24 hours a day, all year round. For more information please visit the website www.compassvanlines.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0011/6079/116079v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0011/6079/116079v2-max-250x250.jpg"],
     [[287,
       287],
      "assets/images/resized/0011/6079/116079v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}