{"name": "Compound Stock Earnings",
 "permalink": "compound-stock-earnings",
 "crunchbase_url": "http://www.crunchbase.com/company/compound-stock-earnings",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1991,
 "founded_month": 11,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Stock Earnings",
 "created_at": "Fri Jul 20 13:21:08 UTC 2012",
 "updated_at": "Tue Jul 24 18:42:09 UTC 2012",
 "overview": "\u003Cp\u003ECompound Stock Earnings first opened its doors in 1999. Former bank owner and investment broker Joseph Hooper founded this company. His mission is to teach the average investor about the merits of covered calls. If properly used, this technique can create a steady monthly income from a stock investment. \u003C/p\u003E\n\n\u003Cp\u003EHooper wants investors to have an effective yet safe and conservative way to manage their money. Hooper believes in the power of covered calls. That’s why his company is devoted to nearly exclusively teaching this investment strategy. Hooper wants his clients to know that they can trust his knowledge. Here is some information about the man behind the company:\u003C/p\u003E\n\n\u003Cp\u003E• Hooper was a respected bank owner and successful banker before he founded his company.\n• Hooper practices what he preaches. He created his own wealth using the covered calls technique.\n• Hooper is now an expert in this technique. In fact, he is often invited to share his knowledge on radio talk shows. He has even written a book about covered calls.\u003C/p\u003E\n\n\u003Cp\u003EJoseph Hooper is the backbone of Compound Stock Earnings. He wants to help others reach the same financial success he is now experiencing. He can help the average investor create a winning stock portfolio.\u003C/p\u003E\n\n\u003Cp\u003EWhat Compound Stock Earnings Offers\u003C/p\u003E\n\n\u003Cp\u003EThe company published a book which provides a wealth of information about covered calls. It’s for people who are considering using this investment technique. The book is called Covered Calls and LEAPS: A Wealth Option. Here are some other products and services the company offers:\u003C/p\u003E\n\n\u003Cp\u003E• Free Subscription to Compound Stock Cow Earnings Report\nThis report is a weekly compilation of the communications that company has had with its clients throughout the week. It consists of questions and comments from clients all around the world. This allows investors to read about the successes of other clients.\u003C/p\u003E\n\n\u003Cp\u003E• Covered Call Tool Box\nSubscriptions to the covered call tool box are offered to clients who have bought the company’s book. This tool box outlines the company’s guidelines for managing, finding, and analyzing covered calls and LEAPS positions. All of the information is provided in real time. \u003C/p\u003E\n\n\u003Cp\u003E• Two Day Intensive Seminar\nHooper and his team also offer a comprehensive two day intensive seminar. This service is available to clients throughout the world. The seminar provides greater details about the information that is presented in the company’s book. The purpose of the seminar is to learn how to apply the information they learned from the book.\u003C/p\u003E\n\n\u003Cp\u003EThese are just some of the ways the company helps investors make wise decisions. The company aims to take the mystery out of successful investing.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}