{"name": "Conceivian",
 "permalink": "conceivian-2",
 "crunchbase_url": "http://www.crunchbase.com/company/conceivian-2",
 "homepage_url": "http://www.conceivian.com",
 "blog_url": "http://www.conceivian.com/blog",
 "blog_feed_url": "",
 "twitter_username": "conceivian",
 "category_code": "consulting",
 "number_of_employees": 6,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "consulting, product-development, startup-incubator",
 "alias_list": null,
 "email_address": "saqib@conceivian.com",
 "phone_number": "877-297-0493",
 "description": "Web and Mobile Product Development",
 "created_at": "Mon Mar 26 10:28:29 UTC 2012",
 "updated_at": "Tue Mar 27 23:52:53 UTC 2012",
 "overview": "\u003Cp\u003EWe create fantastically awesome web and mobile experiences…\u003C/p\u003E\n\n\u003Cp\u003EYou’re in good hands with Conceivian. \nWe build web and mobile software the way it should be built: by a small team of dedicated professionals with all the expertise necessary to take your project from initial idea to Internet greatness.\u003C/p\u003E\n\n\u003Cp\u003EThe Conceivian Team reflects the entire spectrum of expertise necessary to create amazing user experiences — from graphic design and user interface to viral marketing and strategy to advanced programming and even artificial intelligence (if necessary).\u003C/p\u003E\n\n\u003Cp\u003EAnd every single member of the team is a senior-level professional at the top of his or her field because when it comes to your business we don’t take chances and we don’t cut corners and we make sure it’s built fantastically awesome right from the very start.\u003C/p\u003E\n\n\u003Cp\u003EFor you this means you will end up with an end product that is not only magnitudes better, more stable and more user friendly but, with such high caliber professionals, you can also rest assured your project will be delivered on time and on budget. In fact, we guarantee it. \u003C/p\u003E\n\n\u003Cp\u003EOur team will work with you to take your idea, even if it is just a sketch on a napkin, and walk you through our specialized process to turn your vision into something you, and your customers, will love.\u003C/p\u003E\n\n\u003Cp\u003ESometimes the process is straightforward, sometimes it will push our limits and sometimes it will make us push the limits of technology. No matter what, we will not stop until we create something that for you, and your customers, is fantastically awesome.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       42],
      "assets/images/resized/0018/1087/181087v2-max-150x150.png"],
     [[250,
       70],
      "assets/images/resized/0018/1087/181087v2-max-250x250.png"],
     [[450,
       127],
      "assets/images/resized/0018/1087/181087v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}