{"name": "Concept Travel Pvt. Ltd.",
 "permalink": "concept-travel-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/concept-travel-pvt-ltd",
 "homepage_url": "http://www.concepttravel.in/",
 "blog_url": "http://blog.concepttravel.in/",
 "blog_feed_url": "http://blog.concepttravel.in/index.php/feed",
 "twitter_username": "concepttravel",
 "category_code": null,
 "number_of_employees": 120,
 "founded_year": 2008,
 "founded_month": 6,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "concepttravel",
 "alias_list": null,
 "email_address": "info@concepttravel.in",
 "phone_number": "9971839845",
 "description": "",
 "created_at": "Sat Aug 06 06:49:20 UTC 2011",
 "updated_at": "Tue Sep 04 10:38:41 UTC 2012",
 "overview": "\u003Cp\u003EConcept Travel is an online travel portal that helps travelers by providing various travel solutions. The product offering of Concept Travel consists of customized vacation packages, hotel bookings, airline tickets, railway tickets and car rentals. Concept Travel offers the best deals on flights, hotels and holiday packages across India and other popular travel destinations (Sri Lanka, Maldives, Mauritius, Nepal, Hong Kong, Malaysia, Bali, Dubai, Singapore etc) across the world.\u003C/p\u003E\n\n\u003Cp\u003EIn just five years of our existence, we have created a unique niche for ourselves as one of the leading inbound travel companies. We offer personalized services to our clients, so as to ensure their complete satisfaction. The long list of our repeat clientele bears testimony to the fact that we walk extra mile to ensure a happy and roller coaster stay for our guests. \u003C/p\u003E\n\n\u003Cp\u003EAs a responsible travel company, Concept Travel lays great emphasis on responsible and mindful travel that calls for protecting the local environment and culture. We have always believed that there is a moral responsibility on travelers to make sure that the local environment, culture and heritage are not adversely affected. We also strive towards making positive contribution to the local ethos, customs and community, ensuring a rewarding, inspiring and positive travel experience. \u003C/p\u003E\n\n\u003Cp\u003EConcept Travel\u0026#8217;s staff is a mix of youth and experience that includes travel, marketing, sales, technology and writing/editing professionals. With a dedicated workforce of more than 60 zealous individuals, we strive 24x7 to provide the best of both, pre and post-sale customer service. Helping you explore the world is not just our business but passion!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0014/8132/148132v4-max-150x150.jpg"],
     [[250,
       62],
      "assets/images/resized/0014/8132/148132v4-max-250x250.jpg"],
     [[285,
       71],
      "assets/images/resized/0014/8132/148132v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}