{"name": "Consignpro",
 "permalink": "consignpro",
 "crunchbase_url": "http://www.crunchbase.com/company/consignpro",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 1996,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "consignproinc@yahoo.com",
 "phone_number": "",
 "description": "Software Company",
 "created_at": "Fri Apr 13 13:50:02 UTC 2012",
 "updated_at": "Sun Apr 15 01:03:47 UTC 2012",
 "overview": "\u003Cp\u003EFounded in 1996, ConsignPro has helped over 3,000 resale establishments automate their business. At Visual Horizons Software, we have constructed a point-of-sale system that is customizable, manageable, and convenient. \u003C/p\u003E\n\n\u003Cp\u003EBrian Wilson founded visual Horizons Software. The resale business holds personal value for him. He first developed our consignment-specific software for his mother’s resale shop. Since then, it has risen to best-seller status. \u003C/p\u003E\n\n\u003Cp\u003EOur resale software business now includes hardware distribution, credit card processing, label supplies, training materials, website design, and Internet accounts. The National Association of Resale and Thrift Shops (NARTS) lists us as a member, cementing our leadership in the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur resale software holds the potential for a variety of applications. It can be used for a consignment store or mall, art gallery, or used book store. We can help you track inventory, make sales, pay consignors, and keep employee information. \u003C/p\u003E\n\n\u003Cp\u003EConsignPro’s Software Solutions\u003C/p\u003E\n\n\u003Cp\u003EOur resale software holds the potential for a variety of applications. Whatever the use, its features are designed to keep your business running smoothly. Some of hundreds of great features include:\n• Security\u003C/p\u003E\n\n\u003Cp\u003EOur log-in screen prevents unauthorized access to your POS system. Employees create a password, and you can assign them a permission level. This means that they have as much or as little access to the point-of-sale software as you decide.\u003C/p\u003E\n\n\u003Cp\u003EYou can also track who is logging in and out of the system and when. We track any suspect behavior for you, reducing theft.\u003C/p\u003E\n\n\u003Cp\u003E• POS Hardware\u003C/p\u003E\n\n\u003Cp\u003EWe offer several packages with purchase of our software. These can include several easily integrated pieces of hardware. Scan guns, receipt printers, and cash drawers are designed to pair with the software you purchase. Our support team will help you install the hardware you buy from us.\u003C/p\u003E\n\n\u003Cp\u003E• Customer Tracking\u003C/p\u003E\n\n\u003Cp\u003EOnce your business is established, our software can even help it grow. Our customer tracking feature tracks consignors as well as customers. This means that you can tailor marketing campaigns to target your most loyal customers. We even offer a customer rewards feature that can give them a discount, if you choose.\u003C/p\u003E\n\n\u003Cp\u003EConsignPro software has come highly recommended by all of our customers. Reviews on softwareadvice.com have rated us 4.9/5.0 in ease-of-use, functionality, quality, and customer support. ConsignPro considers all of its customers unpaid references, and invites prospective customers to contact them. ConsignPro provides the most for your money, ensuring a resale business’s success.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}