{"name": "ConsultADD",
 "permalink": "consultadd",
 "crunchbase_url": "http://www.crunchbase.com/company/consultadd",
 "homepage_url": "http://www.consultadd.com",
 "blog_url": "http://www.consultadd.com",
 "blog_feed_url": "",
 "twitter_username": "consultadd",
 "category_code": "consulting",
 "number_of_employees": 50,
 "founded_year": 2008,
 "founded_month": 1,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "consultadd",
 "alias_list": null,
 "email_address": "hellen@consultadd.com",
 "phone_number": "8889585233",
 "description": "Customer Friendly Consulting",
 "created_at": "Sat Oct 06 01:54:04 UTC 2012",
 "updated_at": "Wed Dec 12 07:00:56 UTC 2012",
 "overview": "\u003Cp\u003ECustomer Friendly Consulting.\u003C/p\u003E\n\n\u003Cp\u003EConsultADD Inc. (“ConsultADD”) is a company established in 2008. We are focused on bulk data management and data analysis.    We are an authorized reseller (both application and technology), training provider and Oracle golden partner, responsible for three main channels for the Oracle Data Integrator (an Oracle flagship product for bulk data management). First, we are an Independent Software Vendor and Original Equipment Manufacturer, providing development/demo licenses; tool kits; support services; pre-integrated open platforms; and education. Second, we are a reseller/value added reseller (VAR), providing discounts to resell; incentive plans such as rebates; and selling cost-effective complete stack/unparalleled product portfolios.  Third, we provide System Integrator (Implement, Integrate, and Consulting) services by providing education and training; support such as upgrades and patches; recognition on referrals; tool kits; and development/demo licensees.\u003C/p\u003E\n\n\u003Cp\u003EIn 2011, ConsultADD developed OrMAN (Oracle Data Integration-Risk Management) which provides customized implementation solutions for Oracle Data Integrator (ODI). OrMAN caters to the constant and ever increasing problem of managing data movement.  We offer two main services to customers. First, we offer a Proof of Concept/Prototype service for a fixed price within the range of $15,000 to $50,000. The Proof of Concept/Prototype includes developing and customizing a scalable Oracle data integrator solution by gathering requirements, developing plans and prototypes, and in depth discussions with the customers. Overall, ConsultADD will spend about 30-40 hours working on the Proof of Concept/Prototype for the customer.  If the Proof of Concept is accepted by the customer, the customer has the option to further engage ConsultADD to develop the product in-house to be used by the customer in their Data Center.  The fees for this service are within the range of $150,000 - $300,000, depending on the time limitations and complexity. \u003C/p\u003E\n\n\u003Cp\u003ELast year, ConsultADD received five (5) contracts totaling over half a million dollars.  We successfully completed engagements with Amplifi Commerce, a major eCommerce agency, for $15,000 and Chico’s FAS, a major retail store, for $15,000.  We have ongoing, multi-year engagements with several well-known customers including: PNC Bank, the 5th largest bank in the United States for services totaling $300,000; HP/USDA (United States Department of Agriculture) for services totaling $100,000; Reed Elsevier, a major publisher in science, medical, legal, risk and business sectors, for services totaling $100,000; First Data; Swiss Reinsurance Company Ltd.; Federal Home Loan Bank of Indianapolis, a government-sponsored regional bank; and Bank New York Mellon.  We had a very profitable first year with revenues of $160,000.  We are continuing to develop OrMAN and we have over twenty customers interested in purchasing OrMAN.  We have a solid sales team working to increase our sales and expand our business. \nConsultADD is a rapidly growing business and we are able to offer services to customers who are unique and require specific technical challenges because of our vast industry experiences and exposure. We have established relationships with various customers who accept ConsultADD as their preferred vendor for Oracle Data Integrator, Oracle Business Intelligence and other products which compliment Oracle Data Integrator.  ConsultADD receives new customers through various channels. We receive many referrals as part of the Oracle Network and recognition as an Oracle Golden Partner. We also receive contracts from customer referrals, various Oracle events, Technical Niche Projects, and Oracle Golden Partner Network.  We also participate in Oracle Open World, Oracle Developer Networks, Oracle Vendors Summit, and other major conferences, shows, and events which also provide us with major exposure in the industry.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0021/4457/214457v2-max-150x150.png"],
     [[250,
       68],
      "assets/images/resized/0021/4457/214457v2-max-250x250.png"],
     [[384,
       105],
      "assets/images/resized/0021/4457/214457v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Quarters",
    "address1": "155 Morgan St",
    "address2": "",
    "zip_code": "07302",
    "city": "Jersey City",
    "state_code": "NJ",
    "country_code": "USA",
    "latitude": 40.7199843,
    "longitude": -74.0401095},
   {"description": "301 grant st.",
    "address1": "suite 4300",
    "address2": "",
    "zip_code": "15219",
    "city": "pittsburgh",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}