{"name": "Contractor Gorilla",
 "permalink": "contractor-gorilla",
 "crunchbase_url": "http://www.crunchbase.com/company/contractor-gorilla",
 "homepage_url": "http://contractorgorilla.com",
 "blog_url": "http://contractorgorilla.com/category/blog/",
 "blog_feed_url": "http://contractorgorilla.com/feed/",
 "twitter_username": "Contractor_G",
 "category_code": "software",
 "number_of_employees": 8,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design, contractor-websites, construction-web-design, ppc-marketing, search-engine-optimization",
 "alias_list": null,
 "email_address": "aaron@contractorgorilla.com",
 "phone_number": "(818) 252-9329",
 "description": "Amazing websites for contractors.",
 "created_at": "Wed Feb 13 22:45:10 UTC 2013",
 "updated_at": "Thu Feb 14 05:59:55 UTC 2013",
 "overview": "\u003Cp\u003EContractor Gorilla makes amazing websites for construction contractors. Their website services are unique and they come up with a custom solution for all their contractor websites. They focus on creating a web solution that can deliver results. What you WON’T get at Contractor Gorilla is a generic templated website, a one size fits all website, keyword stuffed web pages and bad design.\u003C/p\u003E\n\n\u003Cp\u003EIDENTITY: This is the core of your online marketing and will guide the strategy from your logo to your letterhead. When we work on creating your identity/persona, we look at your ideal customer, your company objectives and other aspects related to your business. When we\u0026#8217;ve finished creating your identity, you’ll have a strong vision for the look and feel of your contractor website.\u003C/p\u003E\n\n\u003Cp\u003EDESIGN: Appearance greatly influences peoples perceptions, and we use this proven model when designing websites. Our websites our deigned with function and usability at the forefront. The goal is to make a lasting impression on your website visitors. Good design is something people remember. It excites website visitors and stimulates their mind. Your website should help visitors visualize how your services can meet their needs.\u003C/p\u003E\n\n\u003Cp\u003EFUNCTION: Your website needs to inspire confidence in your company and if it doesn\u0026#8217;t function how it should visitors will get frustrated. We make sure that all media loads correct, there’s no broken links and every click works the way it should. We test websites on all common browsers and make sure it looks good on mobile and tablets.\u003C/p\u003E\n\n\u003Cp\u003ECONTENT: Have you ever heard the saying “content is king”? This is something we strongly believe in and work on when creating your website. Content can be created in many forms but for contractors having the basics is essential. We recommend photo galleries of work, how-to articles, testimonials and blogging about relevant topics.\u003C/p\u003E\n\n\u003Cp\u003EMARKETING: Now that you\u0026#8217;ve created an amazing identity, have an engaging website with valuable content, it’s time to be found. People aren\u0026#8217;t going to start visiting your website just because it’s online. We can help you explore different marketing options and develop a strategy that meets your budget.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/5738/235738v2-max-150x150.png"],
     [[180,
       180],
      "assets/images/resized/0023/5738/235738v2-max-250x250.png"],
     [[180,
       180],
      "assets/images/resized/0023/5738/235738v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "US Office",
    "address1": "11856 Balboa Blvd",
    "address2": "",
    "zip_code": "91344",
    "city": "Granada Hills",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}