{"name": "Contractors Northridge",
 "permalink": "contractors-northridge",
 "crunchbase_url": "http://www.crunchbase.com/company/contractors-northridge",
 "homepage_url": "http://contractorsnorthridge.com/",
 "blog_url": "http://contractorsnorthridge.weebly.com/",
 "blog_feed_url": "http://contractorsnorthridge.xanga.com/",
 "twitter_username": "BuildNorthridge",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "contractors-northridge, contracting-company-northridge, general-contractors-northridge-ca, licensed-contractors-northridge, professional-contractors-northridge, construction-company-northridge, home-remodeling-northridge, household-remodeling-northridge-c",
 "alias_list": null,
 "email_address": "DachruvI853@gmail.com",
 "phone_number": "(818) 334-5134",
 "description": "General Contractors Northridge",
 "created_at": "Wed May 15 18:39:15 UTC 2013",
 "updated_at": "Thu May 16 00:34:17 UTC 2013",
 "overview": "\u003Cp\u003EWhen it comes to residential or commercial improvements regarding home repairs or home improvements, locating the right licensed contractor to assist you can be a tough decision. Whether it may be a single floor improvement or multi-level house, Contractors Northridge is able to meet your needs. It doesn’t matter to us whether you need to create extra space such as a professional law office or a medical office. Our general contractors have the capability to perform any type of remodeling job; kitchen remodeling, bathroom renovation and even house bolting. \u003C/p\u003E\n\n\u003Cp\u003EWe are your local contractors that offer residential and commercial construction services including:\n•Kitchen, Bath and Residential Remodeling\n•Installation of Windows, Doors, Crown Molding and Custom Trim\n•Exterior Projects \n•Exterior Painting \n•Interior Painting and Faux finishes\n•Room Additions \n•Installation of Cabinets and Building Custom Cabinets\n•Plaster and Drywall Installation and Repairs\n•Garage and Car Port Additions\n•Customized Projects \n•Commercial Tenant Improvements \u003C/p\u003E\n\n\u003Cp\u003EWhen it comes to room additions or home remodeling, our general contractors are your premier service providers you can count on. We want your next project done right and we feel that we can get it done the right way; efficiently and top-quality craftsmanship. Our licensed contractors have years of experience with all types of construction projects and we are dedicated to client satisfaction in all aspects of our work. Completing your project with a minimum level of stress is our goal.   \u003C/p\u003E\n\n\u003Cp\u003EKitchen remodeling as well as bathroom renovation is a huge step in someone’s life. There are many factors to consider when selecting the proper contractor. A couple of things to come to mind are making sure they are properly insured and bonded. Affordable pricing is another aspect when choosing a contracting company. Here at Contractors Northridge you can be sure your home remodeling job will be well taken care of from start to finish. \u003C/p\u003E\n\n\u003Cp\u003EHouse Bolting is something we specialize in to help prevent extreme damage due to earthquakes and other natural disasters that can cause severe danger to your property. Another service we offer is home additions. Perhaps you want to add a room to your house due to your expanding family or business. Simply give us a call at (818) 334-5134 and we will be more than happy to give you a free over the phone estimate or an on-site estimate.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       133],
      "assets/images/resized/0026/2741/262741v2-max-150x150.png"],
     [[234,
       208],
      "assets/images/resized/0026/2741/262741v2-max-250x250.png"],
     [[234,
       208],
      "assets/images/resized/0026/2741/262741v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}