{"name": "Contractors Irvine",
 "permalink": "contractors-irvine",
 "crunchbase_url": "http://www.crunchbase.com/company/contractors-irvine",
 "homepage_url": "http://contractorsirvine.org",
 "blog_url": "http://contractorsirvine.xanga.com/",
 "blog_feed_url": "http://contractorsirvine.tumblr.com/",
 "twitter_username": "BuildersIrvine",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "contractors-irvine, contracting-company-irvine, general-contractors-irvine-ca, licensed-contractors-irvine, professional-contractors-irvine, construction-company-irvine, home-remodeling-irvine, household-remodeling-irvine-ca, kitchen-remodeling-irvine, ho",
 "alias_list": null,
 "email_address": "Roballyg7522@gmail.com",
 "phone_number": "(949) 272-9132",
 "description": "General Contractors Irvine",
 "created_at": "Tue May 28 22:52:26 UTC 2013",
 "updated_at": "Thu May 30 22:02:06 UTC 2013",
 "overview": "\u003Cp\u003EContractors Irvine provides industrial and residential construction and management services to property owners in Irvine and surrounding areas. Our general contractors offer structural and ground-up construction, tenant improvement work, retail and industrial enhancements. Providing our customers with the best level of service is our mission. From pre-construction through project closeout, we utilize various projects with expertise.  \u003C/p\u003E\n\n\u003Cp\u003EWe are your local general contractor in Irvine providing full and large ranges of remodeling services. Our commitment is to keep up quality and high performance on all projects that we deliver. We give our customers a broad range of services to satisfy their dynamical needs. Our specialties include interior and exterior renovations and enhancements. \u003C/p\u003E\n\n\u003Cp\u003EAdvantages of Working with Contractors Irvine:\n•Quality Craftsmanship\n•On-Time Project Completion\n•Customizable Communication\n•Dedicated Team of Contractors\n•Full Feature Showroom\n•Innovative Technology\n•Clean Job Sites\n•Flexibility\u003C/p\u003E\n\n\u003Cp\u003EWith Contractors Irvine serving as your project coordinator and general contractor, we will oversee every stage of the development and eliminate the problems that routinely occur in construction projects. We offer dependable services at affordable prices that best suit your budget and needs. Our familiarity and relationships with trusted manufacturers and sub contractors allows us to offer our services at competitive prices.  When you need an affordable, top-quality contractor you can count on, call TCWRC Contractors Irvine as your premier service provider. We deliver an array of projects on time and with the quality our clients deserve. Throughout all stages of the remodeling process, many decisions and speculations are needed to ensure the integrity and outcome of our clients’ projects. \u003C/p\u003E\n\n\u003Cp\u003EContact us at (949) 272-9132\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       142],
      "assets/images/resized/0026/8309/268309v2-max-150x150.png"],
     [[250,
       238],
      "assets/images/resized/0026/8309/268309v2-max-250x250.png"],
     [[256,
       244],
      "assets/images/resized/0026/8309/268309v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}