{"name": "CoolStreaming",
 "permalink": "coolstreaming",
 "crunchbase_url": "http://www.crunchbase.com/company/coolstreaming",
 "homepage_url": "http://www.coolstreaming.us",
 "blog_url": "http://corporate.coolstreaming.us",
 "blog_feed_url": "",
 "twitter_username": "csoniphone",
 "category_code": "games_video",
 "number_of_employees": 8,
 "founded_year": 2005,
 "founded_month": 3,
 "founded_day": 17,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "streaming, iptv, wbtv, aggregator, coolstreaming, broadcast, television, tv, televisione",
 "alias_list": null,
 "email_address": "press@coolstreaming.us",
 "phone_number": "",
 "description": "The Biggest Internet Tv Platform",
 "created_at": "Sat May 26 07:27:24 UTC 2012",
 "updated_at": "Sat Jun 02 02:29:05 UTC 2012",
 "overview": "\u003Cp\u003EFounded in 2005 CoolStreaming is a Biggest Innternet Tv Platform. Actually on:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EIPHONE\u003C/li\u003E\n\u003Cli\u003EIPAD\u003C/li\u003E\n\u003Cli\u003EANDROID SMARTHPHONE\u003C/li\u003E\n\u003Cli\u003EANDROID TABLET\u003C/li\u003E\n\u003Cli\u003ETV SURF (TV CONNECTED)\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EOver the past ten years, video creation and distribution has undergone a revolution. Producing and distributing video content was once a concept only available to professionals. This was mainly due to expensive, complex cameras and editing systems, which required technical skill and years of experience to use. Today, just about anyone can create video content using inexpensive digital cameras, easy to use editing software and distribution sites like YouTube. The gap between amateurs and professionals has been bridged.\u003C/p\u003E\n\n\u003Cp\u003EIs TV Dead?\nSome people in the internet video industry believe that classic, \u0026#8220;linear\u0026#8221; TV is dead. When a viewer can see what they want, where they want and when they want, why would anyone bother watching linear TV, where you can\u0026#8217;t control the content?\u003C/p\u003E\n\n\u003Cp\u003EThe truth is, most video content continues to be distributed over traditional linear television channels, even after the insurgence of time shifting DVR\u0026#8217;s, location shifters like Slingbox, and video on demand.\u003C/p\u003E\n\n\u003Cp\u003EThe Power to Choose\nLinear television allows the viewer to choose a channel and be entertained. Conversely, video on demand requires viewers to repeatedly search for content, whether from DVD, streaming video, or websites like YouTube. The two offer very unique experiences.\u003C/p\u003E\n\n\u003Cp\u003EWe believe that the future of television includes a fusion of both on demand and linear television. After all, people want both. There are times when you want to watch a clip a friend sends you from YouTube, while there are also times you want to watch a live, 24/7 news channel like CNN or Fox News.\u003C/p\u003E\n\n\u003Cp\u003EInnovate, Reinvent, Evolve\nWe were all raised on television, so it isn\u0026#8217;t sensible to simply abandon it at this point. It\u0026#8217;s due time to reinvent the medium that revolutionized human communication, and CoolStreaming is the next step in the evolution of television.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision\nWith Coolstreaming are giving a chance to every user to select and aggregate the best television from around the world\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0019/1916/191916v3-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0019/1916/191916v3-max-250x250.png"],
     [[450,
       450],
      "assets/images/resized/0019/1916/191916v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}