{"name": "Corm Capital",
 "permalink": "corm-capital",
 "crunchbase_url": "http://www.crunchbase.com/company/corm-capital",
 "homepage_url": "http://www.cormcapital.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1998,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Investments",
 "created_at": "Tue Apr 09 14:55:39 UTC 2013",
 "updated_at": "Mon Jun 17 18:06:44 UTC 2013",
 "overview": "\u003Cp\u003ECorm Capital ® is a no-nonsense, 100% result driven innovative and flexible global holding company founded in 1998 and passionately active in five main sectors: Finance, Investments, Technology, Media and Real Estate. Over the years, Corm Capital has worked for and with some of the wealthiest individuals and finest companies in the world. Rooted in the spiritual legacy of the late Charles Corm and backed by prestigious advisors, Corm Capital thrives to pursue a tradition of excellence, professionalism and dedication. As a company with global interests, Corm Capital is committed to operating to the highest ethical and moral standards. This common goal is extended to our company’s ever-growing portfolio of businesses, assets and investments. \u003C/p\u003E\n\n\u003Cp\u003EIn addition to traditional investment activities such as Private Equity and Venture Capital, Corm Capital operates a number of leading businesses, leveraging its global platform to ensure optimal success. From the secretive OX Factory (a startup factory endowed with stellar management, record funding and a powerful “ecosystem”) to Inco Capital (a global boutique investment banking outfit) to luxury real estate properties around the world, Corm Capital manages a blend of fascinating businesses always seeking to push the limits of their respective sectors. A global leader in Capital Introduction, an Investment Powerhouse and a Powerful ICT Catalyst, Corm Capital merges the boundaries of Finance, Investments, Technology, Media and Real Estate.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/9884/249884v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0024/9884/249884v2-max-250x250.png"],
     [[400,
       400],
      "assets/images/resized/0024/9884/249884v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}