{"name": "Shriram Packaging",
 "permalink": "corrugated-boxes-export-quality-boxes-carton-boxes-wooden-boxes-wooden-crates",
 "crunchbase_url": "http://www.crunchbase.com/company/corrugated-boxes-export-quality-boxes-carton-boxes-wooden-boxes-wooden-crates",
 "homepage_url": "http://www.indiamart.com/shrirampackagingindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "corrugated-boxes, export-quality-boxes, carton-boxes, wooden-boxes, wooden-crates",
 "alias_list": null,
 "email_address": "shrirampackagingindustries@tradepassport.org",
 "phone_number": "9820223542",
 "description": "Corrugated Boxes",
 "created_at": "Thu Apr 04 05:49:06 UTC 2013",
 "updated_at": "Thu Apr 04 05:51:03 UTC 2013",
 "overview": "\u003Cp\u003EIncepted in the year of 2000, we, “Shriram Packaging Industries”, are counted amongst the leading manufacturer and supplier of Corrugated Boxes. In order to meet the diversified requirements of the clients, we are offering them Corrugated Boxes, Export Quality Boxes, Carton Boxes, Wooden Boxes, Wooden Crates and Wood Pallets. In addition to this, our firm also engaged in delivering to our esteemed clients Thermocol Boxes, Thermocol Moulding Box, BOPP Tapes, Stretch Films, Customized Fancy Boxes and Cylindrical Boxes. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nHighly potential manpower is the main factor behind our success. We are supported by a highly capacious team of professionals owing to its dedicated efforts, we have been able to become the prominent manufacturer and supplier of Corrugated Boxes. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have established a widely sprawling infrastructure and installed all the sophisticated machinery, tools and equipment. We are also committed to upgrade these machines in case of our any hardware or technological developments. It is segregated into various units such as Manufacturing Facilities, Warehousing and Packaging Facilities, Research and Development Cell and others in order to ensure hassle free execution of all the processes and mass production.\u003C/p\u003E\n\n\u003Cp\u003EManufacturing Units:\nWe have state-of-the-art manufacturing units which are equipped with all the latest technologies and facilities. Our integrated manufacturing unit has helped us in gaining immense credibility in the market. Sprawled around the vast area of 10000 square feet our units possess a substantial production capacity. Our 2 manufacturing units are an integral part of our organization. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are a quality centric organization and ensure our products to conform with the international quality standards. In the market, we are recognized as a premier manufacturer and supplier of Corrugated Boxes. It is only because of the quality policy we have adopted to manufacture these products. We have tie ups with only trustworthy and well established vendors of the market to procure the required raw material. \u003C/p\u003E\n\n\u003Cp\u003EResearch \u0026amp; Development:\nTo keep a pace with the emerging market trends, we have employed a diligent team of R\u0026amp;D personnel, which conducts rigorous and exhaustive research of the market. Our professionals read each and every facet of the market, which helps us in developing our organization as per the changing market trends. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7554/247554v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7554/247554v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7554/247554v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}