{"name": "Cosmic Clothings",
 "permalink": "cosmic-clothings",
 "crunchbase_url": "http://www.crunchbase.com/company/cosmic-clothings",
 "homepage_url": "http://www.indiamart.com/cosmicclothings/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "cosmicclothings@tradepassport.org",
 "phone_number": "08377800968",
 "description": "manufacturer, supplier and exporter",
 "created_at": "Fri Apr 05 07:50:54 UTC 2013",
 "updated_at": "Fri Apr 05 07:50:59 UTC 2013",
 "overview": "\u003Cp\u003EStarted in 2009, Cosmic Clothings has created a firm ground for them. Owing to our expertise in producing best quality products, we have successfully managed to put ourselves in the league of leading manufacturer, supplier and exporter of Men\u0026#8217;s T-Shirts, Kids Dress and Ladies Wear. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nClient Satisfaction is one of the most observant facts at A.S. Clothing. There is regular client interaction, which helps us to get what they actually want; this interaction helps us to develop customized products as per the clients’ wish. Thus by inducing theses practices we enjoy tremendous client satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have well planned and sound infrastructure at our disposal, this helps us to work with maximum motivation. Thereby producing products meeting prescribed standards and generating delight for the customers. At our facility we have the best of machineries used across the globe, which adds to our strength. Enjoying the outstanding infrastructure, we are all the more committed in delivering excellence in our product range.  \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe work in line with best of quality standards, the entire production process is mapped and quality control measures are applied at each step, so that there is nothing, which escapes through our watchful eyes.  The need for the highest quality products has spurred sense urgency amongst us, where we are very watchful in monitoring the quality standards.  To maintain the momentum we update ourselves with industry advancements.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur success mantra in the industry is solely dependent on how we have faired in past few years.  Looking back we feel that range of high quality products supplied by us at market leading prices have helped us to scale new heights.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8403/248403v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8403/248403v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8403/248403v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}