{"name": "Cosmopolitan Mechanical Services",
 "permalink": "cosmopolitan-mechanical-services",
 "crunchbase_url": "http://www.crunchbase.com/company/cosmopolitan-mechanical-services",
 "homepage_url": "http://www.cosmopolitanmechanical.com/",
 "blog_url": "http://blog.cosmopolitanmechanical.ca/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 20,
 "founded_year": 2010,
 "founded_month": 3,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "heating, cooling, furnace, air-conditioner, boiler, tankless-water-heater, duct-cleaning, humidifier, thermostat",
 "alias_list": null,
 "email_address": "johnloyd007@gmail.com",
 "phone_number": "905-822-9375",
 "description": "Best HVAC contractors in Canada",
 "created_at": "Wed Jan 30 11:31:00 UTC 2013",
 "updated_at": "Fri Feb 01 19:26:10 UTC 2013",
 "overview": "\u003Cp\u003EDiscover the quality of installation and service for forced air gas furnace, central air conditioner, and boiler for Greater Toronto Area (GTA) homes\u003C/p\u003E\n\n\u003Cp\u003EProud to be rated one of the best HVAC contractors in Canada.\u003C/p\u003E\n\n\u003Cp\u003EAs one of the best Greater Toronto Area’s heating and cooling contractors our desire is to provide you with a helpful and informative experience. Our expertise in the HVAC industry field can guide you to select the best heating and air conditioning products. Whether you are looking for a new high efficiency furnace, air conditioner, ductless air conditioner, boiler, gas fireplace, humidifier, HEPA filter and/or any other HVAC products or service, Cosmopolitan Mechanical Services experienced team can guide you toward the best solution. We trust this illustrates the quality of products and services we offer and the attention to care we provide.\u003C/p\u003E\n\n\u003Cp\u003EWe are committed to responding to our customer\u0026#8217;s needs with the highest standards of professional integrity, quality workmanship at competitive prices. We will deliver beyond what is expected by our customers.\nWe are authorized dealer for Lennox, American Standard, Amana, Rheem - world leading producers of heating, air conditioning, indoor air quality products and services.\nFrom the first phone call to the completion of your service call or installation, our comfort craftsmen do not miss a detail. Our people take great pride in their work and it shows in the home comfort system they build. We maintain our reputation as trusted, innovative quality conscious leaders by offering affordable home comfort systems that operate efficiently, quietly, and reliably.\nCosmopolitan Mechanical Service Inc. is a leading provider of indoor comfort systems and comprehensive service solutions. Its offerings include energy efficient heating, ventilating and air conditioning (HVAC) systems, top-notch service and support, Each system or solution is designed to meet the specific needs of our residential and commercial customers.\nServicing and installing leading edge equipment and providing excellent service is the hallmark of Cosmopolitan Mechanical Service Inc.\nSuccess does not occur without a strong commitment to customer satisfaction. We back our dedication to this commitment with a substantial investment in people. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://blog.cosmopolitanmechanical.ca/2013/01/evolution-of-furnace.html",
    "title": "Evolution of Furnace"}]}