{"name": "CoverItLive",
 "permalink": "coveritlive",
 "crunchbase_url": "http://www.crunchbase.com/company/coveritlive",
 "homepage_url": "http://www.coveritlive.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Liveblogging tool",
 "created_at": "Thu May 22 14:50:09 UTC 2008",
 "updated_at": "Tue Apr 09 16:06:19 UTC 2013",
 "overview": "\u003Cp\u003ECoveritLive is a live events platform used by publishers, broadcasters and brands worldwide. It gives organizations like these the ability to cover live events while adding their own editorial perspective and providing managed audience participation. The result is an engaging and interactive audience experience, with real-time expert or celebrity commentary, audience feedback and discussion, integration of photos and video, incorporation of Twitter and other external content, polls and gaming. CoveritLive events are typically accessible from a page on the host’s Web site or Facebook page. The service is also optimized for mobile Web browsers. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0002/2355/22355v9-max-150x150.png"],
     [[250,
       40],
      "assets/images/resized/0002/2355/22355v9-max-250x250.png"],
     [[274,
       44],
      "assets/images/resized/0002/2355/22355v9-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder \u0026 President",
    "person":
     {"first_name": "Keith",
      "last_name": "McSpurren",
      "permalink": "keith-mcspurren",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "ScribbleLive",
      "permalink": "scribblelive",
      "image":
       {"available_sizes":
         [[[150,
            62],
           "assets/images/resized/0009/0136/90136v2-max-150x150.png"],
          [[250,
            104],
           "assets/images/resized/0009/0136/90136v2-max-250x250.png"],
          [[450,
            188],
           "assets/images/resized/0009/0136/90136v2-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$1M",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "http://www.paidcontent.org/entry/419-coveritlive-gets-1-million-round-for-liveblogging-tech/",
    "source_description": "CoverItLive Picks Up $1 Million Round For Liveblogging Tech",
    "raised_amount": 1000000.0,
    "raised_currency_code": "USD",
    "funded_year": 2009,
    "funded_month": 1,
    "funded_day": 29,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "Flagstone Capital",
         "permalink": "flagstone-capital",
         "image": null},
       "person": null},
      {"company": null,
       "financial_org": null,
       "person":
        {"first_name": "Paul",
         "last_name": "Kedrosky",
         "permalink": "paul-kedrosky",
         "image":
          {"available_sizes":
            [[[121,
               150],
              "assets/images/resized/0006/2151/62151v4-max-150x150.jpg"],
             [[202,
               250],
              "assets/images/resized/0006/2151/62151v4-max-250x250.jpg"],
             [[364,
               450],
              "assets/images/resized/0006/2151/62151v4-max-450x450.jpg"]],
           "attribution": "\u003Cp\u003E\u003Ca href=\"http://www.flickr.com/photos/chesh2000/\" title=\"Jaygoldman\" rel=\"nofollow\"\u003EJaygoldman\u003C/a\u003E\u003C/p\u003E"}}}]}],
 "investments":
  [],
 "acquisition":
  {"price_amount": null,
   "price_currency_code": "USD",
   "term_code": null,
   "source_url": "http://techcrunch.com/2011/03/03/demand-media-buys-liveblogging-tool-coveritlive/",
   "source_description": "Demand Media Buys Liveblogging Tool CoverItLive",
   "acquired_year": 2011,
   "acquired_month": 3,
   "acquired_day": 3,
   "acquiring_company":
    {"name": "Demand Media",
     "permalink": "demandmedia",
     "image":
      {"available_sizes":
        [[[150,
           46],
          "assets/images/resized/0000/0247/247v7-max-150x150.png"],
         [[250,
           78],
          "assets/images/resized/0000/0247/247v7-max-250x250.png"],
         [[362,
           113],
          "assets/images/resized/0000/0247/247v7-max-450x450.png"]],
       "attribution": null}}},
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Headquarters",
    "address1": "200 Academy ",
    "address2": "Suite 100",
    "zip_code": "78704",
    "city": "Austin",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": 43.6378576,
    "longitude": -79.4255306}],
 "milestones":
  [{"description": "CoverItLive Now Lets You Add Qik To Your Live Blogs",
    "stoned_year": 2008,
    "stoned_month": 7,
    "stoned_day": 16,
    "source_url": "http://news.cnet.com/webware/?keyword=%22CoverItLive%22",
    "source_text": "My favorite liveblogging tool, CoverItLive (see Ultimate liveblogging tool: CoverItLive), is set to add support for live video Tuesday. But rather than launch its own video-streaming service, the system now lets authors insert video embeds from uStream, Qik, or Mogulus into a live blog.\r\n\r\nThis approach gives CoverItLive users flexibility, but at the cost of simplicity of use. The cool thing is that bloggers have a choice of video services. If you are live-blogging a speech, for example, and you have a good view of the stage, you can pop a Webcam onto your laptop and stream it to your viewers via uStream. If you're live-blogging a news event from a desk indoors but the news is happening outside, you can embed someone else's Qik camera phone video instead. Regardless, as soon as you paste in the video embed code from your streaming service, a little window will in your viewers' CoverItLive content windows. They can pop out and expand the video if they wish, or close it.\r\n\r\nCoverItLive now lets authors embed live video streams.\r\n(Credit: CoverItLive)\r\n\r\nThe downside is that bloggers will need be logged in to both CoverItLive and their video service to post their own videos into their live blog. That's not a critical flaw, but when you're live-blogging an event and trying to focus on creating great content, dealing with two services at once is a lot to handle.\r\n\r\nCoverItLive CEO Keith McSpurren admits that the current level of video integration in the product is a bit of an experiment, done in part because noisy tech bloggers like me were clamoring for it, and in part because adding video via embeds was quite simple. He may add deeper integration in the future, such as integrated sign-ons done in partnership with the streaming companies, if the current experiment is a success.\r\n\r\nMcSpurren says that only about 20 percent of CoverItLive's use is for covering conferences, where the uStream integration will likely be employed. He told me that he's seeing the most use come from sports and politics coverage, where audiences are larger and where rebroadcasting video is tightly restricted. He's also seen big spikes in usage during disasters, where local news operations have kept live blogs open for hours at a time, to keep readers up to date on road closures, shelter locations, weather conditions, and the like. \"Natural disasters have been a strange boon for the business,\" McSpurren told me.\r\n\r\nIt's public service live blogging like this where I see the Qik video integration having great human value. If a reporter is live-blogging an event from a newsroom and a reader is on the front lines--driving past firetrucks on the way to a shelter, for example--the writer could easily paste in the reader's Qik embed link to show readers what's happening on the ground. Clearly, this would require that people in highly stressful situations take the time and energy to fire up a cell phone video stream, so I wouldn't expect to see a wildfire live blog overwhelmed with available video streams. But a smart firefighter or police officer might want to provide a livestream to reporters to illustrate the conditions they are facing. See also: NowPublic (Reuters 2.0?), which has a lot of conceptual overlap with this concept.\r\n\r\nOther liveblog tools worth looking at include Scribblelive and Google Docs. ",
    "source_description": "CoverItLive gets live video support, of a sort",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "CoverItLive",
      "permalink": "coveritlive"}},
   {"description": "CoveritLive now in 8 languages, Live Edit, Search Engine Optimizer",
    "stoned_year": 2008,
    "stoned_month": 8,
    "stoned_day": 17,
    "source_url": "",
    "source_text": "8 LANGUAGES\r\nIn an effort to better meet the needs of our international users (30% of readership of CoveritLive live blogs are from outside of North America) we are happy to announce that users can now choose one of eight languages for their Viewer Window:\r\n\r\nEnglish, German, French, Japanese, Chinese, Portuguese, Spanish and Italian\r\n\r\nInstead of trying to figure out what things like, \"Vote Now\" or \"Your comment has been sent\" mean, millions of readers will now be able to enjoy live blogs entirely in their own language.\r\n\r\nTo use this new feature, go to 'My Viewer Window' in your account and select a new default language for your template.\r\n\r\nLIVE EDIT\r\nAlthough you could always edit your live blog once it was complete, the new LIVE EDIT feature allows you to fix any errors or delete any unwanted entries while your live blog is still LIVE.  This was a feature our many users at newspapers were asking for (or maybe their editors were asking for it).\r\n\r\nTo use this new feature while LIVE, go to 'Tools' and select the LIVE EDIT tab.  Hover over the entry you wish to edit, make your changes and save. Your Viewer Window is instantly updated with no effort from your readers.\r\n\r\nSEO (Search Engine Optimization) Help\r\nA potential drawback that concerns users of hosted software is that search engines will not credit their site for content in a hosted application (like CoveritLive).  If this is a concern of yours, there are two important points to keep in mind:\r\n\r\n1. A properly tagged and titled live blog on your site or blog will drive the vast majority of search results to the right page.  For example, if you Googled \"USA versus Greece\" yesterday, the blog 'Ball Don't Lie' from Yahoo would have been on the first page of results...they were using CoveritLive.\r\n\r\n2. All CoveritLive live blogs can be downloaded and copied directly onto your site/blog once complete.  Go to 'Completed Live Blogs' and click 'Save Content Locally'.  We have formatted the content nicely so it still looks like our Instant Replay.  Simply paste that content and it will get picked up as any other content on your site.\r\n\r\nThere are other, more sophisticated solutions we are looking into to make this process more simple but if you keep the two points above in mind, SEO should not be a concern when using CoveritLive.\r\n\r\nThanks again for the continued support.\r\nKeith McSpurren\r\n\r\n\r\n",
    "source_description": "",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "CoverItLive",
      "permalink": "coveritlive"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        69],
       "assets/images/resized/0024/9895/249895v2-max-150x150.jpg"],
      [[250,
        115],
       "assets/images/resized/0024/9895/249895v2-max-250x250.jpg"],
      [[450,
        208],
       "assets/images/resized/0024/9895/249895v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}