{"name": "Covisint",
 "permalink": "covisint",
 "crunchbase_url": "http://www.crunchbase.com/company/covisint",
 "homepage_url": "http://www.covisint.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 500,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "saas, software, subsidiary, detroit, security",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Thu Sep 27 11:10:23 UTC 2012",
 "updated_at": "Mon Oct 15 16:39:57 UTC 2012",
 "overview": "\u003Cp\u003ECovisint provides the leading cloud engagement platform for creating and enabling new mission-critical external business processes. Our solutions enable organizations to connect, engage, and collaborate with the critical external audiences that define their success \u0026#8211; including customers, business partners, and suppliers. Covisint enables its customers to establish the kind of secure, reliable, integrated and engaging information experiences that people everywhere have come to expect.\nCovisint integrates data from various sources \u0026#8211; no matter where the data resides \u0026#8211; to provide people with the right information, at the right time, and on the technology of their choosing, including any mobile device (smartphone or tablet) on the market.\nCompared to traditional, time-consuming IT development initiatives, Covisint\u0026#8217;s cloud-based model enables our customers to move with speed and agility to transform their businesses by creating innovative new business models.\nIn many cases, these new mission-critical external business processes don\u0026#8217;t just support the business – they are the business.\nThe Covisint platform:\u003C/p\u003E\n\n\u003Cp\u003EEnables business agility and speed;\nReduces cost and time-to-implementation;\nScalable and repeatable;\nMeets stringent regulatory compliance requirements;\nProvides the tools for securely and reliably enabling the flow of critical information;\nBuilt on a 500-million-dollar investment in cloud-based technology;\nLeveraged by the most-demanding enterprises;\n500+ global customers, with more than 22 million users, processing over 1 billion transactions per year;\nVery reliable and proven…with nearly 100% availability or up-time, and virtually 100% customer retention.\nThe Covisint platform was developed on an initial 500-million-dollar investment to connect the global automotive industry and has been continually modernized to solve current business problems organizations are facing today. Businesses in virtually every industry face similar challenges in connecting with external audiences – securely, reliably and with near seamless collaboration across the entire communication chain. The Covisint platform is designed to meet these challenges. Evidence of our success can be found in the fact that we have referenceable implementations in every industry in which we do business today.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}