{"name": "CQCloud",
 "permalink": "cqcloud",
 "crunchbase_url": "http://www.crunchbase.com/company/cqcloud",
 "homepage_url": "http://www.cqcloud.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "cqcloud",
 "category_code": "security",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ddos, anti-ddos, cloud, security",
 "alias_list": null,
 "email_address": "cqcloud@socialradius.com",
 "phone_number": " (408) 519-5749",
 "description": "SIEM and DDos attack solutions",
 "created_at": "Mon Dec 19 15:33:11 UTC 2011",
 "updated_at": "Tue Dec 20 11:09:23 UTC 2011",
 "overview": "\u003Cp\u003ECQCloud is a Korean based provider of SIEM-based protection against sophisticated DDoS attacks.  CQCloud solutions provide real-time SIEM protection against DDoS attacks to online businesses. CQCloud also provides comprehensive compliance reporting, including SOX, ISO27002, and PCI-DSS.\u003C/p\u003E\n\n\u003Cp\u003EThe CQCloud team started developing network operations management systems for major telecommunication companies in 1999 and, after the DDoS crisis in 2003 when many Telcos saw a lot of losses in both business and brand image, CQCloud began providing anti-DDoS Protection solutions including DDoS detection, analysis, and control systems.  By providing solutions to Korea\u0026#8217;s biggest telcos with some of the largest and fastest networks in the world, CQCloud has grown their solutions to offer the reliable monitoring and control system, CQCloud Medusa, which supports both Anti-DDoS Protection functionality and Next Generation Security Information and Event Management (NGSIEM).\u003C/p\u003E\n\n\u003Cp\u003EThe integrated Anti-DDoS protection functionality in the CQ Cloud Medusa system has been field-tested by major telcos in the fields of high-speed traffic collection, abnormal traffic detection using network behavior analysis (NBA), and traffic analysis and control, and has also been proven in the area of Security Event Analysis of attack traffic.\nSince 2010, after spending eight years focused on technology development and system improvement, CQCloud has begun establishing a strategic partnership model to provide DDoS Mitigation services and analysis of security events which occur in the complex infrastructures of telecommunications companies, IDC/VIDC\u0026#8217;s, some financial institutions and E-commerce companies.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Heonsoo",
      "last_name": "Rhee",
      "permalink": "heonsoo-rhee",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}