{"name": "Creative Interiors",
 "permalink": "creative-interiors",
 "crunchbase_url": "http://www.crunchbase.com/company/creative-interiors",
 "homepage_url": "http://www.indiamart.com/creativeinteriors/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "creativeinteriors@tradepassport.org",
 "phone_number": "9940313652",
 "description": "Manufacturers and suppliers ,",
 "created_at": "Sat Apr 06 05:46:06 UTC 2013",
 "updated_at": "Mon Apr 08 00:14:25 UTC 2013",
 "overview": "\u003Cp\u003ECreative Interiors And Roofings is a sole proprietorship business company that is incorporated in the year 2004 at Chennai, Tamil Nadu. Right from the establishment, we have focused on cent percent client satisfaction that has helped us gain recognition as an eminent manufacturer and supplier of a reliable array of Office Workstations, Decorative Floorings, Roofing Sheets, Polycarbonate Roofings, Roofing Structures, Cassette Awnings, Aluminium Partitions, Window Blinds and False Ceilings. We also provide most reliable Interior Services. \u003C/p\u003E\n\n\u003Cp\u003EMission:\nOur Mission is to transform your dream to a reality by designing the interior that reflects your personality and attitude which makes your life comfortable in every moment.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nBeing a client-oriented firm, it is our responsibility to develop products and execute services that comply with clients’ requisites as well as industrial standards. Our well-structured and equipped infrastructural facility has provided us a much needed support that ensures client contentment. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have been blessed with one of the highly talented and skilled team of professionals. These professionals act as a supporting pillar for our company’s growth and success. Our team works rigorously under strict time deadlines to ensure that each task undertaken by us speaks in itself about our quality assurance and dedication towards the work. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nOurs is a quality-conscious firm that focuses on delivering superlative array of products and services to the clients. The range we offer is made using high quality raw materials and advanced engineering practices and techniques to ensure the compliance of our range with international standards.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nOffice Workstations, Decorative Floorings, Roofing Sheets, Polycarbonate Roofings, Roofing Structures, Cassette Awnings, Aluminium Partitions, Window Blinds and False Ceilings. We also provide most reliable Interior Services. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/9060/249060v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/9060/249060v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/9060/249060v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}