{"name": "Creative I. T. India Private Limited",
 "permalink": "creative-i-t-india-private-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/creative-i-t-india-private-limited",
 "homepage_url": "http://www.criti.in",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 100,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "merchandising-management-and-inventory-control-back-office-solution, ecommerce-solution, cross-platform-mobility-solution, customer-loyalty-solution, point-of-sale-solution-",
 "alias_list": null,
 "email_address": "sales@criti.in",
 "phone_number": "+(91)9004492826",
 "description": "",
 "created_at": "Fri Feb 15 05:35:25 UTC 2013",
 "updated_at": "Mon Feb 18 00:06:24 UTC 2013",
 "overview": "\u003Cp\u003ECriti is head-quartered in Falls Church Virginia and is a part of the large technology group called Creative Information Technology Incorporated (CITI) USA. CITI has been regarded as a reliable technology partner by US government for the last 14 years with a pedigree of working on mission critical projects spanning across many government departments and over 200 countries.\u003C/p\u003E\n\n\u003Cp\u003ECriti has a state-of-the-art Global Delivery Center in Mumbai, India and is committed to develop world-class products and business solutions using cutting-edge technology platform. \nCriti provides niche technology products and innovative services worldwide, with a focus on the following industry verticals: ?\n• Organized Retail\n• Distribution-led businesses\n• Healthcare and Life-Sciences \n• Govt. \u0026amp; Law enforcement\u003C/p\u003E\n\n\u003Cp\u003EProducts:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ESpectrum iboss – Merchandising Management and Inventory Control Back Office Solution\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ESpectrum iboss is a merchandising management and inventory control with manual \u0026amp; auto stock replenishment, logistics execution, and data consolidation for retail and distribution-led businesses. It also includes master data management along with a business process management engine that provides the ability to re-configure retail business processes in an agile manner. Spectrum iboss               provides a backbone for retailers to integrate all of their disparate systems and helps them manage their business by striking a fine and much needed balance of centralized oversight coupled with localized autonomous operations for their business.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ESpectrum Webshop – eCommerce Solution\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ESpectrum webshop is an e-tailing solution which empowers retailers to reach out to their customers beyond their brick and mortar stores into the World Wide Web while offering them a unified shopping experience. Spectrum webshop simplifies customer satisfaction by providing a single version of truth to retailers on products, sales, inventory and all other information relevant to e-commerce operations while being easily integrated with all other existing sale fronts.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ESpectrum mobex – Cross platform Mobility Solution\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ESpectrum mobex is a cross platform retail mobility solution which enables retailers in becoming an integral part of their customer’s lifestyles. It is a highly Customer-centric solution which caters towards enhancing consumer shopping experience by providing detailed product information, stock availability, instant ordering, gift registries and Loyalty related interactions. Spectrum mobex helps the Sales Associates at the store to deal smartly and efficiently with the Customers, thus creating an informed staff environment. Spectrum mobex can be used either in customer-self-service or assisted shopping environments without the challenges of increased man-power, training and costs, thus encouraging customers to shop at the stores and empowering Retailers to influence their purchasing decisions.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ESpectrum clip – Customer Loyalty Solution\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ESpectrum clip is a comprehensive customer loyalty program management and execution system designed specially to cater to the modern customer. It also includes advanced relationship management features which will help the retailer reach out to their customers for promotional messages, newsletters or informative texts via various communication channels for scheduled or arbitrary events. Spectrum clip empowers retailers to build, track, and reward the loyalty of their customers. The flexibility offered by Spectrum clip encourages retailers to get creative with their loyalty programs, without increasing their liabilities. Spectrum clip helps retailers empower their customers through multichannel interactions, thus making them want to come back for more.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ESpectrum ibill – Point of Sale Solution\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ESpectrum ibill is a robust front office point of sale system with special built in features for multiple retail sub-verticals. Spectrum ibill is pci pa-dss compliant, highly auditable, and geared for fraud prevention. Spectrum ibill implements the upos standard for easy integration of peripheral devices specific to retail and has an intuitive user interface thus leading to reduced training time for retail floor staff, an area that usually experiences a high degree of employee turnaround.\u003C/p\u003E\n\n\u003Cp\u003ETo know more visit: http://www.retail-spectrum.com/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       44],
      "assets/images/resized/0023/6083/236083v2-max-150x150.png"],
     [[250,
       74],
      "assets/images/resized/0023/6083/236083v2-max-250x250.png"],
     [[381,
       114],
      "assets/images/resized/0023/6083/236083v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "Creative I. T. India Private Limited, Parshwanath Galaxy A,  Kasarvadavali Junction, Ghodbundar Road, Thane - 400 607, Maharashtra, India",
    "address2": "",
    "zip_code": "400607",
    "city": "Thane",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.retail-spectrum.com/",
    "title": ""}]}