{"name": "Creative Design House DB",
 "permalink": "creative-design-house-db",
 "crunchbase_url": "http://www.crunchbase.com/company/creative-design-house-db",
 "homepage_url": "http://www.clippingpathworkhouse.com",
 "blog_url": "http://clippingpathworkhouse.com/index.php?option=com_content\u0026view=article\u0026id=87\u0026Itemid=469",
 "blog_feed_url": "http://clippingpathworkhouse.com/index.php?option=com_rsmonials",
 "twitter_username": "clippingpath_WH",
 "category_code": "other",
 "number_of_employees": 38,
 "founded_year": 2003,
 "founded_month": 5,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "clipping-path, product-shadow-creating, jewelry-retouching, image-masking, shadow-creating, image-retouching, image-manipulation, color-adjustment, illustration, web-image-optimization, creative-graphics-design-",
 "alias_list": null,
 "email_address": "clippingpathworkhouse@gmail.com",
 "phone_number": "1 408 800 9986",
 "description": "Offshore Image Editing Solutions.",
 "created_at": "Thu Mar 28 19:44:04 UTC 2013",
 "updated_at": "Thu Mar 28 20:56:25 UTC 2013",
 "overview": "\u003Cp\u003EWe have been servicing through the organization from 2003 with good reputation nationally Company Creative Design House BD and internationally go (Clipping Path Work House) 2012.\nClipping paths are one of the most resource intensive elements of the design process. Creative Design House BD is such a offshore outsourcing company . Mamun Molla is CEO and Founder of Creative Design House BD. He was the student of Graphics Arts College. He is skilled \u0026amp; excellent in his work because he was a Student of world famous graphics arts teacher Mr. Dr. RK Molla who is also Uncle of Mamun Molla. Dr. RK Molla, who was a professor of two famous universities.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EUniversity of Graphics Arts Institute Bangladesh (Founder Principal).\u003C/li\u003E\n\u003Cli\u003EArt institute of Pittsburgh (U.S.A).\nDr. RK Molla currently teaches digital prepress for the Graphic Design department of Arts Institute Online which is division of Arts Institute of Pittsburgh. He wrote a book about Electronic Color Separation of Drum Scanner which was published in 1988 which is used more than 50 schools in the U.S.A. Mamun Molla established a Printing Press, Product Photography and a design house (Creative Design House BD) in 2003 by Dr. RK Molla.\nMamun Molla discovered the necessity that Professional like Photographers and calelog companies like Graphics design and Image Manipulation is so high in the world market. He was excited by these themes his Online Outsources Company was started at that time and Mamun Molla involved as a Graphics Designer. They like to do work skillfully.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ECreative Design House BD producing site is placed at a lowest employee charge region called Bangladesh.\u003C/p\u003E\n\n\u003Cp\u003EThere are some working office of Creative Design House BD in Bangladesh, U.S and U.K. They provide their customer services carefully. Exports to continually ensure, that our teams are up to speed with the latest techniques/skills and any development in the applications. We use our proven method of training improvement.\nWe are confident about our excellent and fast pace service. Our excellent is our work, fast transformation and reasonable rate as always! We Promise – Quality, Lower Turnaround, Attractive Costs, Satisfaction Guarantee of Clipping Path, Photo Retouching, Photoshop Image Masking, Picture Restoration and Image Editing Services from Complete Online Graphics Style Organizations.\nOur team is very intelligent confident and discipline who progress maintaining chain of command. All the members of our Image processing experts are graduates on Graphics Arts. Our team is divided in to 3-Shift to operate 24 hours a day. So we can best quality graphics editing work for your satisfaction at your convenience. You can communicate or send image any time in a year so fast within low cost in the turnaround. They must so confident to give their services and also ready to stay with us.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/6333/246333v4-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/6333/246333v4-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/6333/246333v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Image Editing \u0026 Graphic Design",
    "person":
     {"first_name": "Creative Design",
      "last_name": "House",
      "permalink": "clipping-path-work-house",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "Creative Design House BD",
      "permalink": "creative-design-house-bd",
      "image": null}}],
 "providerships":
  [{"title": "Chief Executive Officer.",
    "is_past": false,
    "provider":
     {"name": "Mamun Molla",
      "permalink": "mamun-molla",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Customer Care",
    "address1": "1255 LINCOLN STREET # 1 ",
    "address2": "110A, Bury Park Road, Luton LU1 1HE, UK",
    "zip_code": "95050",
    "city": " SANTA CLARA",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://plus.google.com/u/0/110208853681446779572",
    "title": ""}]}