{"name": "CreationPal",
 "permalink": "creationpal",
 "crunchbase_url": "http://www.crunchbase.com/company/creationpal",
 "homepage_url": "http://www.sportypal.com",
 "blog_url": "http://sportypal.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "Creationpal",
 "category_code": "mobile",
 "number_of_employees": 5,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sportypal, creationpal, gps, tracking, mapping, running, fitness, health, cyling, jogging",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+38923290020",
 "description": "Mobile phone software ",
 "created_at": "Tue Apr 13 09:31:24 UTC 2010",
 "updated_at": "Tue Apr 13 17:24:57 UTC 2010",
 "overview": "\u003Cp\u003EWorks on the GPS fitness tracker application called SportyPal.\u003C/p\u003E\n\n\u003Cp\u003ECompany Name \u0026amp; URL: Creationpal, http://www.sportypal.com\u003C/p\u003E\n\n\u003Cp\u003ESoftware Name \u0026amp; URL: Sportypal, http://www.sportypal.com\u003C/p\u003E\n\n\u003Cp\u003EProduct Description: SportyPal is a application that helps you improve your running, cycling, roller-blading, skiing or any other outdoor workout activities performance by using your phone. When you are done with your workout, upload your tracks on our web service at www.sportypal.com and share them. SportyPal logs your position, shows it on map, logs your movement, distance, tempo, pace, altitude and calories burned while working out. \u003C/p\u003E\n\n\u003Cp\u003EYou activate SportyPal when you start your workout. When you finish exercising, the collected performance information will be stored on your mobile phone. SportyPal will present each exercise in a map view, draw elegant graphics charts of your performance or present summarized information. \nSportyPal provides clean and neat design, simplicity of use, great accuracy, satisfactory functionalities and you can embrace its benefits by using both the mobile and the web clients. It\u0026#8217;s available on almost every type of mobile phone, so it can be used by anyone that has GPS equipped mobile phone. The application, while doing your workout, has a really nice screen with some additional real time information like speed/pace, time,  distance covered, max speed, altitude, climb. You also have the ability to change to a map view that will use Google Maps to display your location. After your workout is over, it allows you to upload it to the \nhttp://www.sportypal.com website. Once the workout is uploaded you can see the route of your movement as well as more detailed data.\nYou will see icons on the map for things like: Start, Stop, Fastest Speed, Highest Elevation and few other tools for manually selecting checkpoints from your track to analyze separated parts from your workout. \nAs well as the ability to share the workout automatically after finishing on the social networks such as Facebook, Twitter. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0008/3594/83594v2-max-150x150.png"],
     [[170,
       170],
      "assets/images/resized/0008/3594/83594v2-max-250x250.png"],
     [[170,
       170],
      "assets/images/resized/0008/3594/83594v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}