{"name": "Creekview Realty",
 "permalink": "creekview-realty",
 "crunchbase_url": "http://www.crunchbase.com/company/creekview-realty",
 "homepage_url": "http://www.creekviewrealty.com/",
 "blog_url": "http://creekviewrealty.wordpress.com",
 "blog_feed_url": "http://creekviewrealty.wordpress.com/",
 "twitter_username": "creekviewrealty",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mls, for-sale-by-owner, real-estate, first-time-buyers, home-buyers, home-sellers, house, flat-fee-listing",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "For Sale By Owner Homes",
 "created_at": "Tue Apr 09 18:45:13 UTC 2013",
 "updated_at": "Tue Apr 09 18:45:15 UTC 2013",
 "overview": "\u003Cp\u003ECreekview Realty was founded in 2002 and is headquartered in Plano, TX. John Prell is the broker, and has over 30 years experience over 4 states in various capacities of the real estate business, including investing, hard money lending, residential \u0026amp; commercial construction, renovations, consulting, and brokerage.\u003C/p\u003E\n\n\u003Cp\u003EThe 4 primary motivating factors for John Prell to first obtain his real estate license in Texas were:\u003C/p\u003E\n\n\u003Cp\u003EThe high percentage of his real estate investment profits that were going to Realtors.\nThat no Realtors were willing to provide services on a discount or flat fee basis like what Creekview Realty does today.\nFrustration with a corrupt real estate brokerage system designed and preserved to make buyers and sellers dependent on Realtors instead of Realtors providing value commensurate with fees charged to motivate buyers and sellers to choose their services willingly.\nGreat business opportunity that ironically benefits from the vast majority of traditional Realtors\u0026#8217; unwillingness to discount, which limits the competition for services that Creekview Realty provides.\nOur Mission:\u003C/p\u003E\n\n\u003Cp\u003EAllow buyers and sellers to save substantial amounts of money on real estate commissions\nProvide service at a level that surpasses what one would expect from a 6% Realtor.\nHelp FSBOs (for Sale By Owners) market their properties on MLS, Realtor.com, and hundreds of other websites that display MLS listings\nEducate home buyers and sellers about the real estate business to empower them to make informed decisions and succeed at buying and selling their homes.\nMake real estate services available on an \u0026#8220;as needed\u0026#8221; or \u0026#8220;fee for service\u0026#8221; basis instead of the \u0026#8220;all or nothing\u0026#8221; 6% commission basis\nFight for consumers by helping and supporting the U.S. Dept of Justice, and fight corruption by Real Estate Associations, MLSs, and state government offices and politicians that are influenced and paid for by read estate trade association lobbyists.\nHelp buyers and sellers be less dependent on real estate agents\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}