{"name": "CRUSH army",
 "permalink": "crush-army",
 "crunchbase_url": "http://www.crunchbase.com/company/crush-army",
 "homepage_url": "http://www.crusharmy.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "crusharmy",
 "category_code": "other",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 11,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sales-intelligence, crowd-sourced, sales-leads, lead-trading, market-intelligence",
 "alias_list": null,
 "email_address": "mevans@salesquest.com",
 "phone_number": "978-749-9999 ",
 "description": "Crowd-Sourced Platform for Sales People",
 "created_at": "Wed Sep 12 21:08:26 UTC 2012",
 "updated_at": "Wed Oct 03 00:08:56 UTC 2012",
 "overview": "\u003Cp\u003EBusiness Description: CRUSH army is a crowd-sourced platform for salespeople to obtain free contact info and company intelligence and to trade/exchange sales leads. It is a “Jigsaw-like” business model data/sales intelligence platform to be launched by SalesQuest LLC. Content to the platform will ultimately be provided by an “army” of sales people who will give up their “account knowledge”(sales LEADS) in exchange for “account knowledge”(sales LEADS) they need for FREE (i.e. “points”). These opportunities (called BattleCards™) can be traded or purchased by individuals or companies. Marketing and Sales organizations will subscribe to this platform for marketing, sales and CRM purposes. This concept capitalizes on the 10B+ market for sales intelligence.\u003C/p\u003E\n\n\u003Cp\u003ECompany Background and Game Plan:  The founders of CRUSH army currently have a successful sales intelligence company, Seligence LLC dba SalesQuest. This product launch will be a natural next company growth opportunity to use their current CRUSH data to quickly get the CRUSH army going.  This current content, which is now a $2M business with customers like EMC, Accenture, CA and Dell, grew out of the need for better/more sales intelligence. Based on an extremely strong demand from this current customer base for this increased intelligence, they have started to develop/seed the CRUSH army platform using technology they developed to provide sales reps with “free” contacts.  Four weeks into the launch, they have 1000+ users of the CRUSH army platform (V1.0).  They are currently developing the “BattleCards™”(V2.0) that will be traded for points or purchased. BattleCards™ include details of a “lead” including the company, opportunity description, timeframe, dollar value and decision-makers.\u003C/p\u003E\n\n\u003Cp\u003EManagement:\u003Cbr/\u003E\nMimi Evans, Co-Founder and CEO is currently Co-Founder and CEO of Salesquest.com has successfully grown the company over 25 – 35% per year for the past 8 years providing high tech companies like EMC, CA and Cognizant with CRUSH Reports and CRUSH Alerts data for sales, marketing and sales operations. She has previously been a leader at IBM, Netscape, Lotus and start-up organizations throughout her career.\u003C/p\u003E\n\n\u003Cp\u003ERyan Murray, Co-Founder and CSO runs the sales, marketing and technology organization that has made SalesQuest so successful since its inception in 2003.  SalesQuest has grown organically, is extremely profitable, currently has no debt and has a 100% receivables record.  Mr. Murray was a sales leader and top performer at Genuity and other successful technology companies prior to co-founding SalesQuest.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}