{"name": "Curtis Financial",
 "permalink": "curtis-financial",
 "crunchbase_url": "http://www.crunchbase.com/company/curtis-financial",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 20,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "worker-comp--insurance-company",
 "alias_list": null,
 "email_address": "mkcurtis1@hotmail.com",
 "phone_number": "7147915880",
 "description": "Insurance Company",
 "created_at": "Mon Nov 19 18:31:51 UTC 2012",
 "updated_at": "Wed Nov 21 08:05:41 UTC 2012",
 "overview": "\u003Cp\u003ECurtis Financial, a California limited liability company formed on March 20, 2012, has been organized for the purposes of (i) forming and/or renting a so-called “Insurance Captive” licensed in California and possibly other states to provide workers compensation insurance focused on high-risk and blue-collar industries (e.g., construction, professional employer organizations (i.e., employee leasing companies or so-called “PEOs”), health care, temp workers, etc.) to be sold through licensed insurance brokers, (ii) outsourcing claims and safety management to nationally qualified third-party administrators to focus on fairly processing claims while mitigating fraud, (iii) engaging safety consultants to provide written and on-site training and management to clients to minimize injuries while reducing premium costs to its policy holders. Workers’ compensation insurance premiums in California alone were $7.1 billion in 2010, an increase of 3% over the previous year. According to the National Association of Insurance Carriers\u0026#8217; (NAIC) data, the top workers compensation insurer in the state last year was the California State Compensation Insurance Fund with $1.14 billion in written premiums and a market share of 16%, followed by Zurich Financial Services Group (No. 2), Travelers Insurance Group (No. 3), American International Group Inc. (No. 4), and Hartford Fire \u0026amp; Casualty Group (No. 5).1\nWorkers compensation insurers’ written premiums in California increased to $11.3 billion during 2011, according to a Workers’ Compensation Insurance Rating Bureau of California report released in February, 2012. California’s average insurer rate, meanwhile, rose to $2.37 per $100 of payroll for policies written during the first nine months of the year.2 This projects to premiums of $12 billion for the year 2012, an increase of 69% over 2010.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}