{"name": "Custom Group Shirts",
 "permalink": "custom-group-shirts",
 "crunchbase_url": "http://www.crunchbase.com/company/custom-group-shirts",
 "homepage_url": "http://www.customgroupshirts.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "cgshirts",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "t-shirt-design, custom-graphics, custom-tshirt-design, competition-team-shirts, group-shirts, dance-t-shirts",
 "alias_list": null,
 "email_address": "info@customgroupshirts.com",
 "phone_number": "",
 "description": "Affordable Custom T-Shirt Designs",
 "created_at": "Sun Nov 04 17:05:45 UTC 2012",
 "updated_at": "Tue Nov 06 00:56:13 UTC 2012",
 "overview": "\u003Cp\u003ECustom Group Shirts was established in 2012, however, Jennifer Barker has been designing for more than 10 years and creating team/group competition T-Shirts for the last 13 years. Jennifer decided on the company name “Custom Group Shirts” as it has the option to be CGShirts. CG is an abbreviation that could mean Color Guard. Jennifer started performing with the Lake Mary High School color guard and winter guard for 4 years after finishing her middle school career. After High School she performed with World Champions, Northeast Independent, for 6 years and the Boston Crusaders Drum and Bugle Corps for 3 years. From Greenwood Lakes Middle School to Tarpon Springs Middle \u0026amp; High School, Jennifer has taught several competition teams in the Orlando and Hillsborough/Pinellas County area of Florida. After being a public school teacher for 3 years, Jennifer went back to her true love of nerding out on the computer with her full time job of Media/Marketing Director for a fast paced Cosmetic Surgeon. From web updates, social media content/analysis and print publication creation, Jennifer at Custom Group Shirts has extensive history with Adobe Photoshop as well as creating basic websites for groups/teams.\u003C/p\u003E\n\n\u003Cp\u003EBeing on staff and/or the director of teams, Jennifer was always around for the last minute “what do you want to put on our competition shirt this year?” We understand how much your students and parents love representing all the hard work and dedication your children/students have put forth. Being proud to wear and support a group is the same way Jennifer started designing. Jennifer began designing her own group shirts as well as other teams she worked with. Among the FFCC community in Florida, BOA community nationwide and WGI community nationwide, Custom Group Shirts are a big hit. Jennifer always had multiple parents from other teams ask “who printed your show shirts this year?” Even though our printers do an outstanding job, we hope that you can join us in correcting parents and spreading the word that Custom Group Shirts DESIGNED your show T-Shirts!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       138],
      "assets/images/resized/0021/8700/218700v2-max-150x150.jpg"],
     [[250,
       231],
      "assets/images/resized/0021/8700/218700v2-max-250x250.jpg"],
     [[450,
       416],
      "assets/images/resized/0021/8700/218700v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}