{"name": "Custom Stitchers",
 "permalink": "custom-stitchers",
 "crunchbase_url": "http://www.crunchbase.com/company/custom-stitchers",
 "homepage_url": "http://www.customstitchers.com/",
 "blog_url": "http://www.customstitchers.com/blog",
 "blog_feed_url": "http://www.customstitchers.com/blog/feed",
 "twitter_username": "customstitchers",
 "category_code": "hardware",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "custom-dress-shirts, custom-shirts-for-men, mens-shirts, custom-tailored-shirts, custom-made-shirts",
 "alias_list": null,
 "email_address": "customstitchers@gmail.com",
 "phone_number": "",
 "description": "Custom dress shirts",
 "created_at": "Mon Jan 21 13:34:27 UTC 2013",
 "updated_at": "Tue Jan 22 05:24:39 UTC 2013",
 "overview": "\u003Cp\u003ESummary:\n‘Custom Stitchers’ sells mens dress shirts with a unique and customized style where users have the liberty to design dress shirts with their own choice. The company is an experienced player in dress shirt manufacturing and serving the industry from decades. By empowering the visitor to design online dress shirt, their online shirt designing process is perfect example of combining the traditional methods of stitching with modern technology. Having registered office in UK, CS is a legal entity incorporated and compliant with the law.\u003C/p\u003E\n\n\u003Cp\u003EHistory\nThe company was serving the needs of local market from many years and has converted the same high standards to online platform. Now it is quite easy to avail their altogether high quality dress shirts from anywhere in the world. It is a milestone that they have achieved in a short span of time.\u003C/p\u003E\n\n\u003Cp\u003EStitching Process\nAs per their official statement, they have a team of experienced tailors whose stitching skills are second to none in this field. All shirts are sewed with manual processing and personal attention. Normally fifteen to twenty stitches are produced per inch that means shirt durability is at maximum levels. Finest material is used for all elements. On the whole, it is an outstanding unit with diversified skills and flexible user friendly mechanism.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance\nCompany’s basic idea behind offering online service is to provide same best quality dress shirts just as for local customers.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}