{"name": "Custom Cable",
 "permalink": "custom-cable",
 "crunchbase_url": "http://www.crunchbase.com/company/custom-cable",
 "homepage_url": "http://www.custom-cable.co.uk",
 "blog_url": "http://www.custom-cable.co.uk/blog",
 "blog_feed_url": "http://www.custom-cable.co.uk/blog/feed/",
 "twitter_username": "talkcustomcabl",
 "category_code": "ecommerce",
 "number_of_employees": 7,
 "founded_year": 1985,
 "founded_month": 8,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sennheiser, audio-technica, beyerdynamic, arcam, knosti, spares, cables, headphones, iem, balanced-armature, dynamic, art-one, audioquest, resonessence, res",
 "alias_list": null,
 "email_address": "",
 "phone_number": "02089429124",
 "description": "Headphones, DACs, Cables Specialist",
 "created_at": "Sat Dec 08 10:39:36 UTC 2012",
 "updated_at": "Mon Dec 17 21:26:23 UTC 2012",
 "overview": "\u003Cp\u003ECustom Cable were founded in 1985 as a mail order only company distributing catalogues to tens of thousands of UK customers who wanted cables and accessories for their HiFi systems. During the first 10 years of operation Custom Cable grew rapidly and began distributing many well known brands to businesses and had an input in many cable and accessory designs, some of which are still available now!\u003C/p\u003E\n\n\u003Cp\u003EIn early 2003 Custom Cable put their mail order catalogue online for the first time so that customers could see what products were available and then phone to place their order. In 2005 Custom Cable revamped their website with more products and for the first time enabled customers to purchase directly from the website. At the same time a website called headphonesdirect.co.uk was also set up to cater for all headphone related queries and list all of the available headphones that were available.Also in 2005 Custom Cable were appointed as a Sennheiser\u0026#8217;s Consumer Spares Partner for their headphones and soon became the go to people for all of Sennheiser customer\u0026#8217;s requiring headphone spares.\u003C/p\u003E\n\n\u003Cp\u003EIn May 2009 Custom Cable and Headphones Direct merged. In August 2009 Custom Cable processed their first online order with a new website that had headphones, cables, accessories and Sennheiser spares all listed on the single website making it easier for customers to purchase.\u003C/p\u003E\n\n\u003Cp\u003ECustom Cable are now one of the largest suppliers of Sennheiser spares and accessories and have a specialist division set up to help customers find the correct part or offer any support that may be required.\u003C/p\u003E\n\n\u003Cp\u003EWith the merging of headphonesdirect, Custom Cable have a seperate division which specialises in medium to high-end headphones and headphone amplifiers.\u003C/p\u003E\n\n\u003Cp\u003EAt the core of Custom Cable is the cable division which aims to supply customers with cable for their HiFi and Home Cinema systems to the length and terminations they require. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Custom Cable",
    "address1": "35 High Street",
    "address2": "New Malden",
    "zip_code": "KT3 4BY",
    "city": "Greater London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        110],
       "assets/images/resized/0022/4480/224480v2-max-150x150.png"],
      [[250,
        183],
       "assets/images/resized/0022/4480/224480v2-max-250x250.png"],
      [[450,
        331],
       "assets/images/resized/0022/4480/224480v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.youtube.com/user/customcableinfo",
    "title": "YouTube"},
   {"external_url": "http://www.pintrest.com/customcable",
    "title": "Pintrest"},
   {"external_url": "http://www.facebook.com/customcable",
    "title": "Facebook"},
   {"external_url": "http://www.twitter.com/talkcustomcable",
    "title": "Twitter"}]}