{"name": "D. K. Enterprises",
 "permalink": "d-k-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/d-k-enterprises",
 "homepage_url": "http://www.indiamart.com/dkenterprisesfaridabad/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "dkenterprisesfaridabad@tradepassport.org",
 "phone_number": "9911607500",
 "description": "Manufacturer, Exporter, Wholesaler and S",
 "created_at": "Thu Apr 04 08:17:38 UTC 2013",
 "updated_at": "Thu Apr 04 08:17:42 UTC 2013",
 "overview": "\u003Cp\u003EIncepted in the year 2005, at Faridabad (Haryana, India), we, “D. K. Enterprises”, are one of the leading names, engaged in manufacturing, exporting, wholesaling and supplying a comprehensive array of Agriculture Implement, Agriculture Machine, Agro - Industrial Implement, Agricultural Equipment, Utility Trolley, etc. Manufactured using superlative quality raw material and sophisticated technology, these are designed with high precision in order to meet the set industry standards. These are widely praised among clients for their features like easy operation, elevated efficiency, rigid construction, low maintenance and longer functional life. As per the varied requirements of clients, these can also be availed by them in various specifications. These are available in variegated sizes, patterns, capacities and dimensions in order to suit the varied demands of customers. Clients can avail the offered products from us at the most affordable price range.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\u003C/p\u003E\n\n\u003Cp\u003EManufacturing, exporting, wholesaling and supplying a comprehensive array of Agriculture Implement, Agriculture Machine, Agro - Industrial Implement, Agricultural Equipment, Utility Trolley, etc\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\u003C/p\u003E\n\n\u003Cp\u003EWe have a well-constructed infrastructural unit that is resourced with all required facilities. Spread across a sprawling area, our latest manufacturing unit is armed with ultra-modern machines and technology that helps us in fabricating these products in bulk quantities.\u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\u003C/p\u003E\n\n\u003Cp\u003EBeing a quality conscious organization, we are engaged in providing quality assortment of products to our valuable customers. Our well-equipped testing unit checks the whole range on various parameters in compliance with the international quality measures. We are set with all the current quality testing tools that enable us to carry out stringent checks on our product range.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\u003C/p\u003E\n\n\u003Cp\u003EWe have appointed talented crew of professionals who have immense industry experience and knowledge in their respective domains. With the assistance of our team, we have been able to successfully cater to the varied needs of customers in accordance with their preferences, budgetary and time constraints.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\u003C/p\u003E\n\n\u003Cp\u003EAdhering to the measures of discipline and honesty, we have carved out a distinct place in the national market. By maintaining strict stand on elevated quality, our organization has succeeded in exceeding the expectations of the patrons. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7672/247672v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7672/247672v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7672/247672v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}