{"name": "D2M",
 "permalink": "d2m-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/d2m-inc",
 "homepage_url": "http://www.d2m-inc.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 1994,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "info@d2m-inc.com",
 "phone_number": "650-567-9995 ",
 "description": "",
 "created_at": "Fri May 28 22:50:59 UTC 2010",
 "updated_at": "Wed Nov 24 16:11:59 UTC 2010",
 "overview": "\u003Cp\u003ED2M, Inc. operates as an engineering consultancy company in the United States. It offers industrial design services, such as market research, conceptual and user interface design, product sketching, storyboarding, modeling, 3d rendering and photorealistic imaging, and human factors analysis, as well as logo creation, design, and implementation services; and electrical and software engineering services, including system architecture, embedded systems, software development, hardware and DSP design, RF and analog design, power systems, and printed circuit board design services. The company also provides mechanical engineering services, which include mechanism and fixture design, packaging and enclosure design, robotics and mechantronics, control systems design, thermal systems and simulations, structural and stress analysis, dynamic analysis and simulation, test plan development and management, alignment systems, and environmental testing services, as well as thermal, structural, and dynamic FEA services. In addition, it offers interdisciplinary engineering services in the areas of proof-of-concept prototyping, technology assessment, system/product architecture, systems integration, production support, failure and hazard analysis, design iteration, technology R and D, system architecture development, risk management, concept development and trade-off matrix, prototype testing and analysis, manufacture/assembly design, agency testing, history file documentation, design transfer package, regulatory submission data, and tissue V and V testing services. Further, D2M provides process and design engineering, and manufacturing support services; various design tools; supply chain management services in Asia; and various community services. It serves consumer and electronics, medical and biotech, industrial, venture engineering, and pro-bono markets. D2M, Inc. was founded in 1994 and is based in Mountain View, California.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0011/1550/111550v1-max-150x150.jpg"],
     [[250,
       98],
      "assets/images/resized/0011/1550/111550v1-max-250x250.jpg"],
     [[283,
       111],
      "assets/images/resized/0011/1550/111550v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Mechanical Design Engineer",
    "person":
     {"first_name": "Edward",
      "last_name": "West",
      "permalink": "edward-west-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "405 West Evelyn Avenue ",
    "address2": "",
    "zip_code": "94041",
    "city": "Mountain View",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        84],
       "assets/images/resized/0011/1551/111551v1-max-150x150.jpg"],
      [[250,
        140],
       "assets/images/resized/0011/1551/111551v1-max-250x250.jpg"],
      [[450,
        252],
       "assets/images/resized/0011/1551/111551v1-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}