{"name": "DANESC, LLC",
 "permalink": "danesc-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/danesc-llc",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Thu May 23 14:43:14 UTC 2013",
 "updated_at": "Mon Jun 17 04:57:26 UTC 2013",
 "overview": "\u003Cp\u003EDANESC is a trusted Atlanta based IT agency with over 15 years of knowledge and entrepreneurial success in the online industry. We specialize in providing IT turnkey solutions to businesses and governments without compromising quality and support. Our goal is to become your trusted advisor and strategic IT partner to help bridge your business challenges with IT solutions. We are experts in developing and implementing IT models and high-performance teams, helping your company increase revenues by lowering IT investments without sacrificing quality of work. DANESC has extensive experience developing and managing high-traffic websites that are interactive and socially driven, developing Facebook and mobile applications for iOS, Android, Blackberry and Windows devices. Startups, Small, medium and Fortune 500 companies within the United States and Latin America have used our services since 1998. We believe in building long-term partnerships with our clients, and promise to provide you with the quality of services and support your deserve.\u003C/p\u003E\n\n\u003Cp\u003EWith every client we create a custom plan and recognize their individual needs. This may include branding, layout designs, social network integrations, website \u0026amp; mobile applications, online security, architecture needs, SEO strategies and data mining. We are experts in content management, most programming languages, network architectures and database systems. We are capable of implementing in both English and Spanish. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Daniel",
      "last_name": "Escobar",
      "permalink": "daniel-escobar",
      "image":
       {"available_sizes":
         [[[150,
            113],
           "assets/images/resized/0008/2447/82447v2-max-150x150.jpg"],
          [[250,
            189],
           "assets/images/resized/0008/2447/82447v2-max-250x250.jpg"],
          [[450,
            340],
           "assets/images/resized/0008/2447/82447v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}