{"name": "Data Patrol Technologies",
 "permalink": "data-patrol-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/data-patrol-technologies",
 "homepage_url": "http://www.datapatroltechnologies.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@datapatroltechnologies.com",
 "phone_number": "9970177046",
 "description": "offering Database Monitoring Service,",
 "created_at": "Thu Apr 04 14:52:28 UTC 2013",
 "updated_at": "Thu Apr 04 14:52:34 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, we \u0026#8220;Data Patrol Technologies Private Limited\u0026#8221; incorporated by a bunch of technology enthusiasts who are former Oracle employees, having years of experience in Oracle Database Administration and Oracle Apps Implementation, Data Patrol is counted as a premier Indian ERP Application and Database Service Provider, offering specialized services in Oracle DBA, and Oracle Apps DBA services.\u003C/p\u003E\n\n\u003Cp\u003EOur Services:\nData Patrol’s diverse set of database services offers one stop solution for all the Database implementation, integration and management needs. With a combination of technical excellence and years of industry experience in Oracle e-Business Suite (Oracle Apps), our team is strongly positioned to provide Implementation and Live Production Support for clients’ business critical applications. \u003C/p\u003E\n\n\u003Cp\u003EApplications:\nThe comprehensive set of Data Patrol services and solutions serve clients from assorted domains like Manufacturing, IT, Banking and Finance. Our services in Oracle e-Business Suite serve various Enterprise Applications like CRM (Customer Relationship Management), ERP (Enterprise Resource Planning), Supply Chain Management, Manufacturing and Procurement.\u003C/p\u003E\n\n\u003Cp\u003EIT Infrastructure:\nWe have put together a perfect combination of highly skilled team, tools and processes to deliver an end-to-end array of data base services ranging from consulting and solution design to performance tuning and disaster recovery and backup services.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n‘Any organization with a well-defined business vision and a team that’s dedicated to achieving it, is infinitely more likely to succeed than a business that just does what it always does and waits for the future to happen’ - Philip Keeffe. True to the statement we have a supportive and knowledgeable team with a clear vision to offer effective and timely client services and solutions, which is making us stride high on the waves of success.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWith keen attention to technology, we assist our clients in realizing a consistent Return on Investment (ROI) on infrastructure by implementing relevant technology advancements, while ensuring that the stability of mission critical systems is never compromised. Our genuine client focus and sound technical knowledge has gone a long way in satisfying our clients. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/7999/247999v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/7999/247999v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/7999/247999v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}