{"name": "DataGlider",
 "permalink": "dataglider",
 "crunchbase_url": "http://www.crunchbase.com/company/dataglider",
 "homepage_url": "http://www.dataglider.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@dataglider.com",
 "phone_number": "905.707.4212",
 "description": null,
 "created_at": "Sat May 10 11:27:58 UTC 2008",
 "updated_at": "Sat Jan 12 05:21:02 UTC 2013",
 "overview": "\u003Cp\u003EData Glider specializes in web-based healthcare portal solutions that provide knowledge-driven, process-improving integration technology and related service solutions to major healthcare providers, including Hospitals and Medical Centers. \u003C/p\u003E\n\n\u003Cp\u003EData Glider combines Portal Technology with Intelligent Dynamic Middleware that leverages existing IT investments and improves decision-making and workflow for Physicians and Executives, by dynamically linking real-time clinical and financial data into personalized views accessible from a browser or wireless device.\u003C/p\u003E\n\n\u003Cp\u003EData Glider\u0026#8217;s system is an interactive portal technology, which assembles multiple sources of information onto a single web-based interface. Through this interface, users can easily extract information, and unite data from different systems and benefit from a universal perspective. The quick and real-time reach of this universal perspective redefines the process of workflow and decision support and creates the highest level of management, performance and effective patient safety. Data Glider essentially optimizes the workflow of hospital and clinical staff by enhancing the ability to access information and integrating the existing hospital information systems (HIS).\u003C/p\u003E\n\n\u003Cp\u003EData Glider extends the effectiveness of existing systems by utilizing web and wireless technologies to enable users to interact with enterprise data in new and innovative ways.\u003C/p\u003E\n\n\u003Cp\u003EThis unique technology, which has already been successfully launched, has potential to create a revolution in the way the Healthcare System network operates.\u003C/p\u003E\n\n\u003Cp\u003EThe unique technology has the ability to create multiple Points of View (POV) based on each user\u0026#8217;s specific needs which allows each user to focus on immediate necessary key information that is relevant to their specific task.  This allows for an increase of available time for all hospital staff, more accurate and relevant data and documentation of medical outcomes, as well as real-time collaboration between all medical professionals. \u003C/p\u003E\n\n\u003Cp\u003EConsolidating and dynamically linking data from different systems enables Healthcare Organizations to use enterprise data in new ways to improve workflow and improve decision-making capabilities.  \u003C/p\u003E\n\n\u003Cp\u003EData Glider\u0026#8217;s portal technology can customize the existing systems in order to meet the particular needs and requirements of medical professionals and Healthcare organizations, and in order to support the attainment of each organization\u0026#8217;s strategic goals and objectives. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[136,
       57],
      "assets/images/resized/0001/8317/18317v1-max-150x150.png"],
     [[136,
       57],
      "assets/images/resized/0001/8317/18317v1-max-250x250.png"],
     [[136,
       57],
      "assets/images/resized/0001/8317/18317v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": null,
    "address1": "25 Leek Cr",
    "address2": "",
    "zip_code": " L4B 4B3",
    "city": "Toronto, Ontario",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}