{"name": "Daterly",
 "permalink": "daterly",
 "crunchbase_url": "http://www.crunchbase.com/company/daterly",
 "homepage_url": "http://www.daterly.com",
 "blog_url": "http://www.facebook.com/Daterly",
 "blog_feed_url": "",
 "twitter_username": "Daterly",
 "category_code": "web",
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": 2,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-dating",
 "alias_list": null,
 "email_address": "admin@daterly.com",
 "phone_number": "",
 "description": "Online Dating",
 "created_at": "Tue Mar 13 09:54:34 UTC 2012",
 "updated_at": "Mon Oct 08 13:52:06 UTC 2012",
 "overview": "\u003Cp\u003EDaterly is a social network for singles\u003C/p\u003E\n\n\u003Cp\u003EDating sites came to the internet in 1995 and earlier in other forms such as bulletin boards since 1986, way before social networks, so the idea is not new. Existing dating sites lack a social element and social networks lack the tools to enable you to meet new people out of your social circle who might share your tastes and interests.\u003C/p\u003E\n\n\u003Cp\u003EMatching a potential partner with a mathematical equation will never produce meaningful results. Sharing what you do on a daily basis, what game you watched over the weekend, what music you are listening to right now, sharing what you just read, whats in the news, what restaurant you ate at last night or where you met your friends for drinks. All these activities describe your lifestyle and the type of person you are. You will have plenty in common and lots to talk about on your first date.\u003C/p\u003E\n\n\u003Cp\u003ESocial resume\u003C/p\u003E\n\n\u003Cp\u003EOffering a newsfeed on a dating site is a departure from the traditional dating sites that all seem to run on the same old formula. On Daterly you can upload photos, share Youtube videos, make posts and comments, much like you do on Facebook. Daterly provides you with the tools to express yourself through sharing your tastes and experiences on an ongoing basis, thus creating your online social resume. Discover who shares your interests, connect to follow their posts in your news feed. Find out what she is reading or where she ate last night, what he likes to do on his day off or what movie he went to see recently.\u003C/p\u003E\n\n\u003Cp\u003EConnect\u003C/p\u003E\n\n\u003Cp\u003ETagging an interest creates a tag bubble that you or another user can click on that will show you a cascading list or gallery view of people with the same interests that you can connect with. \u003C/p\u003E\n\n\u003Cp\u003EThe key feature on Daterly is being able to connect and share with other site users, much in the same way you do on Twitter, once you have connected with a user, their posts appear in your news feed on your home page. You can then add a Connection to a subgroup, where you can select hotlist, follow, friend or just leave them in the default group connections. This is a great way to get to know someone by following their posts and commenting on updates and photos, but without the expectations, pressure and possible disappointment that might come when hotlisting or favouriting someone on a conventional dating site.\u003C/p\u003E\n\n\u003Cp\u003ESocial discovery\u003C/p\u003E\n\n\u003Cp\u003EThe established dating sites haven’t changed much since 1995 and the new wave of hookup sites lack depth. Daterly aims to bridge the gap between these two paradigms with an element of fun, while being sincere and genuine. By sharing the awesome pizza restaurant you discovered last night or what movie or live band you went to see also brings an element of social discovery and location based recommendations to online dating.\u003C/p\u003E\n\n\u003Cp\u003EGamification\u003C/p\u003E\n\n\u003Cp\u003EThe site operates on a freemium model with elements of gamification which are currently being extended on the site. Members are awarded badges for certain milestones and actions which translate into Daterly credits that can be used to purchase Silver membership and other site services like virtual gifts or e-cards, effectively making the premium site features available for free.\u003C/p\u003E\n\n\u003Cp\u003EAll the traditional dating site functionality like flirts, e-cards, chat, profile matching, mail, rating other profiles (hot or not), creating a compatibility quiz and a selection of games are included.\u003C/p\u003E\n\n\u003Cp\u003EIcebreakers\u003C/p\u003E\n\n\u003Cp\u003EOn your home page you will find two icebreaker widgets to get you started, Share your tastes \u0026amp; Experiences which covers most activities starting with open ended questions like, I am reading …, I ate at …, I saw …, this seems to be a perfect prompt for people with busy lifestyles and the short and sweet Twitter generation. Questions \u0026amp; Answers offer a different selection of questions that you can answer to get the conversation going, for example: If you could have lunch with any person, living or dead it would be … your response to both of these prompts appear in your newsfeed where other users can learn more about you, as well as make comment on your posts. \u003C/p\u003E\n\n\u003Cp\u003EVisit us at www.daterly.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0021/2379/212379v1-max-150x150.png"],
     [[183,
       45],
      "assets/images/resized/0021/2379/212379v1-max-250x250.png"],
     [[183,
       45],
      "assets/images/resized/0021/2379/212379v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}