{"name": "Davinder Exports",
 "permalink": "davinder-exports",
 "crunchbase_url": "http://www.crunchbase.com/company/davinder-exports",
 "homepage_url": "http://www.indiamart.com/davinderexports/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "davinderexports@tradepassport.org",
 "phone_number": "9915010642",
 "description": "manufacturer and exporter",
 "created_at": "Thu Apr 04 15:34:03 UTC 2013",
 "updated_at": "Thu Apr 04 15:34:07 UTC 2013",
 "overview": "\u003Cp\u003EDavinder Exports was established in the year 1993 as a Partnership Organization, engaged in manufacturing and exporting a broad spectrum of Men\u0026#8217;s Winter Wear, Men\u0026#8217;s Polo T-Shirts \u0026amp; Kid\u0026#8217;s T-Shirts. Our range encompasses Men\u0026#8217;s Long Sleeve T Shirts, Men\u0026#8217;s Round Neck T Shirts, Men\u0026#8217;s Polo Long Sleeve T Shirts, Men\u0026#8217;s Interlock Polo Shirts, Jacquard Collar Polo Shirts, Polo Basic Men\u0026#8217;s T Shirts, Men\u0026#8217;s Thermal Sets, Men\u0026#8217;s Track Pants, Kid\u0026#8217;s Round Neck T Shirts and many others. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nStringent quality measures are followed by us, in order to make our range up-to-the-mark and flawless. Our experts ensure that fabric of premium quality is used in making of our range. They keep close vigil on each stage ranging from procurement of raw material till the final delivery. Our quality experts make their best efforts to make sure that clients have no complaints from our products.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nEfficiently designed with adequate lighting, extensive ventilation and ample workspace, our production unit enables us to carry bulk and efficient production in timely manner. Our manufacturing unit is equipped with advanced knitting, dyeing, fabric cutting, sewing, fusing, packing and finishing machinery, which ensures higher efficiency and better quality in productivity.  \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nPrime motto of our firm is to render utmost satisfaction to the clients. Our creative designers make sure that products with fine finish and quality are made delivered to the clients. Products offered by us are elastic and designed as per the specifications given by the clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWith the support of our skilled and adroit team of professionals, we have been able to serve our customers with best quality and trendy product range. Our team consists of quality analyzers, designers, R \u0026amp; D experts, warehouse personnel, tailors, administrators and other helping staff. Our team is trained on regular basis, so that they can understand the latest trends of the industry and can successfully cope up with them. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8034/248034v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8034/248034v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8034/248034v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}