{"name": "Daya Industries",
 "permalink": "daya-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/daya-industries",
 "homepage_url": "http://www.indiamart.com/dayaindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "dayaindustries@tradepassport.org",
 "phone_number": "9814705270",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 16:09:14 UTC 2013",
 "updated_at": "Fri Apr 05 16:09:17 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1987, at Ludhiana (Punjab, India), we, “Daya Industries” are a leading manufacturer, supplier and exporter of an exclusive range of Tractor Parts, Railway Parts, Auto Parts, and Combine Parts.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a well-established manufacturing unit that sprawls over a large area of land and is equipped with advance manufacturing technologies and machines that enables us to manufacture qualitative ranges of products.\u003C/p\u003E\n\n\u003Cp\u003EProduct Development:\nWe are continually improving on our existing product range and are developing new products, to meet the customer\u0026#8217;s requirements and surpass their expectations. Innovative ideas from our employees and as well as diversified customer base continue to provide us with the competitive edge.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nSince the establishment of our company, quality standardization has always been our main objective. Our talented team of quality controllers makes us highly efficient in offering the supreme quality products to our esteemed clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOwing to our dedicated and sincere efforts to cater each and every requirement of our clients, we have established ourselves strongly in the market. Backed by skilled and experienced team of professionals, we are able to design our wide range of products in compliance with client specifications.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have vast industrial experience and rich expertise in the production of industrial products such as Tractor Parts, Railway Parts, Auto Parts, and Combine Parts. We make sure that we offer only the finest quality product range to our valuable clients. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8880/248880v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8880/248880v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8880/248880v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}