{"name": "Décor Experts Expo",
 "permalink": "dcor-experts-expo",
 "crunchbase_url": "http://www.crunchbase.com/company/dcor-experts-expo",
 "homepage_url": "http://www.decorexpertsexpo.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "DecorExpertExpo",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 1998,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "stands-exposition, tradeshow-banner, stand-supply, portable-tradeshow-booth, custom-exhibits, tradeshow-supplies, general-tradeshow-contractor, amnagement-stands-exposition, tradeshow-services, custom-promotional-exhibits, rental-tradeshow-booths, tradesh",
 "alias_list": null,
 "email_address": "",
 "phone_number": "(450) 646-6342",
 "description": "Custom promotional exhibits",
 "created_at": "Fri Nov 30 14:22:32 UTC 2012",
 "updated_at": "Wed Dec 12 08:03:12 UTC 2012",
 "overview": "\u003Cp\u003EGraduated from « Hautes Études commerciales » and being by profession a chartered accountant, Micheline Audet implemented her own accounting firm in St-Bruno for almost 15 years. Then, in 1988, she acquired la Société Expo Expert, specializing in the creation of booths for exposition. With the passing years, Mrs Audet will ad some subsidiaries; Décor Experts Expo [DEE], Signalisation Experts and EDI. The company will become a small intermediate enterprise (PME) established at the international level. Micheline Audet distinguished herself as a woman of vision and a relented hard achiever. Thanks to her personality and her success, she is the sole of her success. Later on, Expo Experts will become Décor Experts Expo [DEE].\u003C/p\u003E\n\n\u003Cp\u003EAt Décor Experts Expo, family is a priority to their hearts. Mrs Audet’s son, John Bannerman and Mr Jacques Guay’s son, Dominic Guay took over the torch of the company; John Bannerman as Director General and Dominic Guay as Director of production for DEE.\u003C/p\u003E\n\n\u003Cp\u003EFor over 10 years, Décor Experts Expo supports many charities. The one that touches the heart of these leaders is no doubt “La foundation de l’hôpital pour enfant de Montréal. Each year, the Director General, John Bannerman, organizes a baseball tournament for the benefit of this foundation. During this tournament, meals are served by volunteers and ticket sales are organized. All profits and donations are over turned in full to the hospital’s foundation.\u003C/p\u003E\n\n\u003Cp\u003EYear after year, Décor Experts Expo stayed on the lookout for the market new trends by attending various congresses and by participating in training sessions. Thanks to an experienced team of designers, many DEE conceptstands are the envy of our competitors.\u003C/p\u003E\n\n\u003Cp\u003ESince 1988, we succeeded to develop and maintain a trusty relation with our at most clients, such as; Colabor, Jean Coutu, BMR, Metro, Uni-select, Polaris, Expo-Prestige, Marions-nous and much more.\u003C/p\u003E\n\n\u003Cp\u003ESeveral major projects were handed to us in trust. Successfully, we were able to meet the challenges of the Kyoto event, the Montreal Outgames in 2006 and the FINA event (International Swimming Federation) in 2005. Décor Experts Expo is also the recipient of the 2000 Award for Excellence from the south shore Chamber of Commerce and Industry.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main office",
    "address1": "778, Jean-Neveu",
    "address2": "",
    "zip_code": "J4G 1P1",
    "city": " Longueuil (Québec)",
    "state_code": null,
    "country_code": "CAN",
    "latitude": 45.573745,
    "longitude": -73.4564483}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}