{"name": "DealPharmaRx",
 "permalink": "dealpharmarx",
 "crunchbase_url": "http://www.crunchbase.com/company/dealpharmarx",
 "homepage_url": "http://www.dealpharmarx.com",
 "blog_url": "http://www.dealpharmarx.com/blog",
 "blog_feed_url": "",
 "twitter_username": "dealpharmarx",
 "category_code": "other",
 "number_of_employees": 25,
 "founded_year": 2012,
 "founded_month": 12,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "generic-meds, online-health-care",
 "alias_list": null,
 "email_address": "dealpharmarx@gmail.com",
 "phone_number": "1-800-717-6319",
 "description": "Generic MedStore",
 "created_at": "Thu Jan 24 10:56:08 UTC 2013",
 "updated_at": "Fri Jan 25 05:33:09 UTC 2013",
 "overview": "\u003Cp\u003EProviding quality drugs at alluring prices is our aim at dealpharmarx.com which is an excellent online source of quality generic meds. You can also get branded drug at this pharmacy. Each and every drug displayed on the website has gone through strict quality checking process. Food and Drug Administration (FDA) has approved all these drugs and thus you can use these medicines with confidence. All these drugs are accessible at low cost and thus it won’t make hole in your pocket. \u003C/p\u003E\n\n\u003Cp\u003EYou will never find a pharmacy which is providing quality drug at such cheap rates. It is possible for us due to their availability in generic form. Branded drugs are quite expensive as its price includes all other expenses such as production cost, marketing cost etc. This is not the case with generic drugs. There is no hidden charge and thus the price is very less. Though there is difference in the price of the medications, there is no difference in the way these acts on the health issues. Quality stands first for us. \nCustomer’s security holds utmost importance to us. Every minute detail given by the customer captured by the security system known as secure socket layer (SSL). This is introduced in to the website to make it online threat free. This data is kept in this system and it won’t get leak to any third party. Our online drug store, dealpharmarx.com is well secured with highly advanced security technology. This guarantees a safe and secure transaction at our website. \u003C/p\u003E\n\n\u003Cp\u003ETo enhance customer satisfaction at our drug store, we have come up with few policies such as refund policy, shipping policy, privacy policy etc. You can claim a refund if you are not satisfied with our service. Shipping policy let you know how your parcel will reach to you. You can also go through the privacy policy so that you will have better idea regarding the same. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       27],
      "assets/images/resized/0023/1387/231387v2-max-150x150.jpg"],
     [[250,
       45],
      "assets/images/resized/0023/1387/231387v2-max-250x250.jpg"],
     [[277,
       50],
      "assets/images/resized/0023/1387/231387v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}