{"name": "Dealyst",
 "permalink": "dealyst",
 "crunchbase_url": "http://www.crunchbase.com/company/dealyst",
 "homepage_url": "http://www.dealyst.com/",
 "blog_url": "http://www.dealyst.com/blog/",
 "blog_feed_url": "http://www.dealyst.com/rss/",
 "twitter_username": "dealyst",
 "category_code": "web",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "travel-deals, deals, hideen-deals, points-programs, rewards, loylaty-programs, loyalty-points, loyalty-miles",
 "alias_list": null,
 "email_address": "Stephen@Dealyst.com",
 "phone_number": "",
 "description": "Good deals finder ",
 "created_at": "Mon Jan 28 16:56:25 UTC 2013",
 "updated_at": "Fri Feb 01 04:31:40 UTC 2013",
 "overview": "\u003Cp\u003EDEALYST was created to help you make sense – and save money – from the mess of travel deals and loyalty, rewards, miles and points programs, by bringing you the best in travel deals and the best insider information in the simplest English out there, so those new to travel deals can travel just like the experts.\u003C/p\u003E\n\n\u003Cp\u003EDeals on the web continue to be created in record numbers. That’s a good thing. But there are way too many travel deals to keep track of. And too many travel deal sites. And too many travel deals that aren’t even really deals. Those are bad things. Even the good sites have too many deals to sift through. Who wants to spend their day searching for the few really good deals hidden among so many bad ones?\u003C/p\u003E\n\n\u003Cp\u003EAnd talk about confusing loyalty, rewards, miles and points programs. The ins and outs of these programs can be so complicated to understand, sometimes it feels like forgetting they exist is the best option around. And even if you’ve tried your hand at making sense of these programs, somehow your questions always seem to go unanswered by the experts.\u003C/p\u003E\n\n\u003Cp\u003EThat’s where DEALYST comes in. DEALYST was started by expert travel deal junkies, who have unique insider travel knowledge from years of experience traveling and selling travel. We like to call ourselves deal experts, or, in the context of this site, the DEALYST Experts. We are determined to create the web’s premier travel deal experience by constantly scouring the web for the absolute best travel deals and only posting deals that have been vetted and quality assured using proprietary methods and careful deal analysis. Plus the DEALYST Experts are demystifying the world of loyalty, rewards, miles and points programs one great redemption at a time on The DEAL Blog, so new die hard travel junkies like yourself can cash in on what the experts have been for years.\u003C/p\u003E\n\n\u003Cp\u003EDEALYST was built on the fundamentals of usability, graphic design and expert curation that no one in the space can match. The following features will help maximize your DEALYST experience, and of course help you get the deals and the knowledge you need to travel where you want to go, when you want to go.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "45 Broadway",
    "address2": "",
    "zip_code": "10006",
    "city": "New York ",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": 40.706556,
    "longitude": -74.01327}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.bluefountainmedia.com/case-studies/dealyst",
    "title": ""},
   {"external_url": "https://www.facebook.com/dealyst",
    "title": "facebook "}]}