{"name": "Deals411.com",
 "permalink": "deals411",
 "crunchbase_url": "http://www.crunchbase.com/company/deals411",
 "homepage_url": "http://www.deals411.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Deals411",
 "category_code": "other",
 "number_of_employees": 6,
 "founded_year": 2012,
 "founded_month": 6,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "group-deals-daily-deals-online-coupon-management-coupon-aggregation-buy-sell-coupons-group-deal-needs-link-coupons-integrate-coupons",
 "alias_list": "SuperGroupDeals",
 "email_address": "customercare@deals411.com",
 "phone_number": "647-869-7284",
 "description": "Coupon management and aggregation site",
 "created_at": "Tue Feb 21 18:53:57 UTC 2012",
 "updated_at": "Thu Jul 12 17:50:08 UTC 2012",
 "overview": "\u003Cp\u003EDeals411.com is an online service that offers online coupon buyers a centralized location to organize, manage and sell coupons purchased from multiple collective group buying sites.  The website allows users to consolidate their coupons into a single location where they are able to view, download and see new deals or similar deals from the multiple lenders they have subscribed to.  The key feature of the website is to provide users with a tool that will access all of their coupons purchased from various coupon sites and compile it into a single application.  Deals411 integrates their services with collective buying sites’ websites which will enable subscribes to easily access their coupons by linking their accounts with the Deals411 website.  By logging onto the website, the end users can view, downloaded and print their coupons or conduct a search for coupons categorically in a quick and trouble-free manner.  In addition to online management and organization of coupons the website also aggregates all daily deals presented by various coupon buying sites and sends a single, personalized email to its subscribers.  In addition, the website utilizes a consolidation approach that will  allow online end-users to access information on other similar coupons offered categorically from various group buying sites and will enable them to conduct key word searches.  The most unique feature about the website is that it takes unused coupons and turns it into new selling opportunities for online customers by allowing the users to post it for sale.  Deals411 simplify the experience of purchasing, organizing and selling coupons. By using our online service, online coupon buyers can now manage and organize their deal purchases into a single application which will save a lot of time and frustration. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[140,
       94],
      "assets/images/resized/0017/5251/175251v5-max-150x150.png"],
     [[140,
       94],
      "assets/images/resized/0017/5251/175251v5-max-250x250.png"],
     [[140,
       94],
      "assets/images/resized/0017/5251/175251v5-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co Founder \u0026 CTO",
    "person":
     {"first_name": "Thusjanthan",
      "last_name": "Kubendranathan",
      "permalink": "thusjanthan-kubendranathan",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Toronto, ON",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}