{"name": "Degreetrip",
 "permalink": "degreetrip",
 "crunchbase_url": "http://www.crunchbase.com/company/degreetrip",
 "homepage_url": "http://www.degreetrip.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "find-colleges, job-training, online-degree-programs, associate-degree-programs, online-education-programs, distance-learning-programs, advanced-degrees",
 "alias_list": null,
 "email_address": "degreetrip@gmail.com",
 "phone_number": "505-288-0708",
 "description": "Online Degree Programs",
 "created_at": "Wed May 15 07:16:34 UTC 2013",
 "updated_at": "Thu May 16 00:31:10 UTC 2013",
 "overview": "\u003Cp\u003EWhether you want to go back to college after years in the workforce, are attending college for the first time, or returning to higher education to advance your degree, Degree Trip is here to help you make informed decisions about your career, education and future. With a huge selection of degree and diploma programs to choose from, Degree Trip can help you: find colleges, job training, online degree programs, Associate Degree Programs and more!\u003C/p\u003E\n\n\u003Cp\u003EDegree Trip offers an exclusive set of tools to assist you with your higher education decisions. We offer comprehensive information on student financial aid options, career paths, degree planning FAQ, and even the ability to chat with a live enrollment adviser online. Our Knowledge Library offers exclusive, up-to-date education articles written by experts, while our Blogs provide fun and timely information related to education. With our Find My Degree search feature, you can find colleges or universities close to home and that offer associate degree programs in your area of interest, as well as online degree programs to fit your lifestyle. Start searching for a degree program now!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "DegreeTrip",
    "address1": "6565 Americas Parkway NE",
    "address2": "Suite 200",
    "zip_code": "87110",
    "city": "Albuquerque",
    "state_code": "NM",
    "country_code": "USA",
    "latitude": 35.1006,
    "longitude": -106.570757}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}