{"name": "Deptheye technologies",
 "permalink": "deptheye-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/deptheye-technologies",
 "homepage_url": "http://www.deptheye.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "website-design-and-development-india-ncr",
 "alias_list": null,
 "email_address": "info@deptheye.com",
 "phone_number": "09873731595",
 "description": "Deptheye Website development design comp",
 "created_at": "Thu Nov 05 11:19:28 UTC 2009",
 "updated_at": "Thu Nov 05 18:03:07 UTC 2009",
 "overview": "\u003Cp\u003EDepthEye Technologies is website design company based in Noida, India that provides services of website design, website development, flash website design, website hosting, software development, graphics design, brochure design, corporate identity and logo design. We have talented \u0026amp; professional team of website designers, website developers. They are using the latest technology in website development, we will provide you professional services at very affordable prices. Our Website Developing team has designed websites professionally with affordable price for individuals and businesses worldwide. From e-commerce website development to the simplest logo design, we works as per clients needed.\u003C/p\u003E\n\n\u003Cp\u003ETherefore, If you need a website design or a re-design of your existing website, then DepthEye Technologies website design company based in India, has a complete solution for your company. DepthEye Technologies is a leading professional website design and website development company in India.\u003C/p\u003E\n\n\u003Cp\u003EDepthEye Technology is also actively involved in website application development and offers offshore software development, web application development, affordable web development, professional web development, custom outsourced software development, Dotnet, PHP programming, Information Technology services, outsourced IT manpower, web development in india, web application development, Offshore staffing on contract etc.\u003C/p\u003E\n\n\u003Cp\u003EBesides Website Design \u0026amp; Website Development services, we also doing logo design, graphic design solutions, flash \u0026amp; multimedia presentations, custom website design, corporate identity design services, programming, flash website design, e-commerce website design, web application development, offshore software development, seo services india, flash intro, outsourcing website design \u0026amp; website development in india.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0006/5021/65021v2-max-150x150.jpg"],
     [[250,
       95],
      "assets/images/resized/0006/5021/65021v2-max-250x250.jpg"],
     [[254,
       97],
      "assets/images/resized/0006/5021/65021v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}