{"name": "DesiDieter",
 "permalink": "desidieter",
 "crunchbase_url": "http://www.crunchbase.com/company/desidieter",
 "homepage_url": "http://www.desidieter.com",
 "blog_url": "http://blog.desidieter.com",
 "blog_feed_url": "http://www.desidieter.com/rss/rss?ty=blogAll",
 "twitter_username": "desidieter",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "diet, nutrition, diet--plans-for-indians, weight-loss",
 "alias_list": null,
 "email_address": "customer_service@desidieter.com",
 "phone_number": "",
 "description": "Diet, Nutrition and Fitness Portal",
 "created_at": "Thu Mar 03 06:40:15 UTC 2011",
 "updated_at": "Mon Mar 07 16:12:59 UTC 2011",
 "overview": "\u003Cp\u003EDesiDieter is one of its kind website that encourages and supports the South Asian community to take a step towards Good Health and a Good Life.\u003C/p\u003E\n\n\u003Cp\u003EWe are a one stop shop for all your health, nutrition and fitness related information. Be it Yoga, Ayurveda, Homeopathy, Home Remedies or Indian Diets and Recipes.\u003C/p\u003E\n\n\u003Cp\u003EWith so much information floating on the internet, it has become impossible for one to choose what to believe. Most of the information that we get is either from foreign websites and is not relevant to our \u0026#8220;Indian\u0026#8221; lifestyle and neither is it consistent with our \u0026#8220;Indian\u0026#8221; culture.\u003C/p\u003E\n\n\u003Cp\u003ESouth Asians are genetically different from the rest of the world. This makes them more prone to lifestyle related diseases like obesity, diabetes and cardiovascular disease as compared to, for example the Caucasian community\u003C/p\u003E\n\n\u003Cp\u003EWe also have very different food ingredients and dietary habits. All these make our eating habits very different from the rest of the world!\u003C/p\u003E\n\n\u003Cp\u003EA few of us felt this pain after wasting time on the Atkins, Weight Watchers, Jenny Craig, eDiets of the world and embarked on a journey with a mission to create a site that was made specially for the South Asian Community.\u003C/p\u003E\n\n\u003Cp\u003ESo What Do We Have For YOU?\u003C/p\u003E\n\n\u003Cp\u003EWith DesiDieter you can lose weight the easy and healthy way with our Weight Loss Diet, Indian Diet and Ayurveda Diet, Online Diet Generators. Each of these are built on sound scientific nutritional principles and have been tried and proven over months of trial over a diverse set of users. Thanks to our \u0026#8221; Focus Group \u0026#8221; (or \u0026#8220;Guinea Pigs\u0026#8221; as they liked to call themselves!!).\u003C/p\u003E\n\n\u003Cp\u003EChoose from a variety of Indian recipes and ingredients, all of which are easy to understand and readily available at your local bazaar! We are the only site with a comprehensive Indian Recipe List along with associated Nutritional Labels which are a must to understand the Calories that we eat. Find out how many calories are there for example in a Samosa!!\u003C/p\u003E\n\n\u003Cp\u003ECheck out our Home Remedies which have been researched and proven over years of use by various elders in our communities.\u003C/p\u003E\n\n\u003Cp\u003EGet in touch with our Fitness and Nutrition Experts and get your Personalized Fitness and Nutrition Plans Made.\u003C/p\u003E\n\n\u003Cp\u003EGo to the Diet Tools and try out a whole bunch of cool tools from our BMI Calculator to the Body Fat Calculator etc.\u003C/p\u003E\n\n\u003Cp\u003EWant to figure out the calories or fat content in a Pizza Hut Onion, Capsicum, Mushroom Pizza?? You can get Nutritional Facts on over 50,000 common foods from around the world in our Food Calorie Finder.\u003C/p\u003E\n\n\u003Cp\u003EGet free articles written by our various experts and guest authors in our Newsletters.\u003C/p\u003E\n\n\u003Cp\u003EHave an interesting Recipe or Home Remedy you want to share?? Add it to our ever-growing database.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0012/4723/124723v2-max-150x150.jpg"],
     [[220,
       220],
      "assets/images/resized/0012/4723/124723v2-max-250x250.jpg"],
     [[220,
       220],
      "assets/images/resized/0012/4723/124723v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0012/4722/124722v2-max-150x150.jpg"],
      [[250,
        156],
       "assets/images/resized/0012/4722/124722v2-max-250x250.jpg"],
      [[450,
        281],
       "assets/images/resized/0012/4722/124722v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}