{"name": "DesignMe",
 "permalink": "designme",
 "crunchbase_url": "http://www.crunchbase.com/company/designme",
 "homepage_url": "http://des.ign.me",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "design_me",
 "category_code": "software",
 "number_of_employees": 25,
 "founded_year": 2008,
 "founded_month": 2,
 "founded_day": 25,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "contact@designmellc.com",
 "phone_number": "202.596.WEB1",
 "description": "Innovative Webdesign Solutions",
 "created_at": "Wed Oct 27 20:04:59 UTC 2010",
 "updated_at": "Sat Nov 27 17:22:58 UTC 2010",
 "overview": "\u003Cp\u003EDesignMe, LLC is a private for-profit organization based in the Washington, DC Metro Area. Originally specializing in web services for a fee, we have streamlined our technology to bring you the latest and greatest tools on the internet at an affordable price. Sick of paying costly development fees to firms who nickle-and-dime you? Not able to update even a single word on your own webpage? Let us help you to reach your online goals at an affordable price with our Ubunifu Platform. Offering a content management system and a host of social media tools, this platform can transform your website into a clean, functional and robust web application.\u003C/p\u003E\n\n\u003Cp\u003EOpening its doors officially in 2009, DesignMe was founded by two young entrepreneurs looking to improve the marketability of both large and small organizations while maintaining core social values. As such, the founders are passionate at providing clean code that is fast, scalable and accessible to all. We also strive to provide discounted services to qualifying non-profit or green organizations through The DesignMe Foundation. As a fellow green company, we realize how difficult it is to provide a valuable service while maintaining your core philosophies. For that reason, we want to reward green companies and non-profits for their hard work.\u003C/p\u003E\n\n\u003Cp\u003EBefore its inception, the founders worked as independent consultants for companies around the United States offering valuable development services to their clients. However, we noticed how quickly development costs code add up and providing custom code for every individual became very time consuming and also could not possibly provide ample functionality at an affordable price. The Ubunifu Platform changes it all. We give you all of the functionality you need to market yourself, custom development for those special cases, consulting services, custom design and hosting services. Let us take care of your online needs while you take the driver\u0026#8217;s seat in bringing your business to the next level.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       124],
      "assets/images/resized/0010/7577/107577v2-max-150x150.jpg"],
     [[250,
       207],
      "assets/images/resized/0010/7577/107577v2-max-250x250.jpg"],
     [[337,
       280],
      "assets/images/resized/0010/7577/107577v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquaters",
    "address1": "2700 S Adams St",
    "address2": "Suite 301",
    "zip_code": "22206",
    "city": "Arlington",
    "state_code": "VA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        102],
       "assets/images/resized/0011/1915/111915v1-max-150x150.jpg"],
      [[250,
        170],
       "assets/images/resized/0011/1915/111915v1-max-250x250.jpg"],
      [[450,
        306],
       "assets/images/resized/0011/1915/111915v1-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}