{"name": "DeskGod",
 "permalink": "deskgod",
 "crunchbase_url": "http://www.crunchbase.com/company/deskgod",
 "homepage_url": "http://www.deskgod.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2008,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software, software-as-a-service, analytic, pay-per-click, tools, interface, live-chat, email-marketing, other",
 "alias_list": null,
 "email_address": "michael@deskgod.com",
 "phone_number": "(415)-358-1285 / (415)-358-1286 / (302)-966-9647 ",
 "description": "Software as a Service",
 "created_at": "Tue Mar 12 18:56:46 UTC 2013",
 "updated_at": "Tue Mar 12 18:56:52 UTC 2013",
 "overview": "\u003Cp\u003EDeskGod’s vision is rooted in the idea to provide the small and medium business with the same kind of software tools that only the largest corporations have. Giving them the best tools and the ability to be fully competitive, the power to keep growing event in a bad economy, and the freedom and flexibility they are hoping to achieve. Giving the companies the edge they are looking for to grow faster. \u003C/p\u003E\n\n\u003Cp\u003EBecause In order to survive and succeed in this world of accelerating change, modern marketing professionals need a new generation of marketing software to help them find more future customers; to build, sustain and grow relationships with those buyers over time; and to cope with the sheer pace and complexity of engaging with customers in real-time across the web. And in many companies, marketing must knit these digital interactions together with the efforts of their colleagues on the sales team. \u003C/p\u003E\n\n\u003Cp\u003EMarketers need to interact seamlessly with their customers across all stages of the sales funnel, and they need data and analytic insights to understand where and how to allocate their budgets for maximum return.\u003C/p\u003E\n\n\u003Cp\u003EOur software must be easy to adopt and use. Visitors Lifecycle Menagement(VLM) software is fundamentally different from other kinds of business applications, like CRM, ERP and independent singlepoint solution vendors. With those systems, the large companies typically configure them once, and then use them for months or even years with relatively little change. Marketing is much more dynamic – users need to constantly conceive, build and launch new marketing campaigns every few days or weeks, with minimum effort and no IT support. Our customers at DeskGod typically tell us that they spend one-half to one-third of the time as they did previously, which translates into much more time for them to invest in the creative aspects of their job.\u003C/p\u003E\n\n\u003Cp\u003EOur software must be powerful enough to solve real-world challenges. Modern marketing is challenging, to say the least. Marketers must control all aspects of visiors lifecycle management without of consistently switching between multiple applications like email marketing, analytics, helpdesk, live chat and more. Visitors are the lifeblood of the online businesses. Visitors must accurately guided to become customers, before being snatched up by competitors . And today’s marketer needs to be able to prove the results of their marketing investments, so sophisticated-yet-easy reporting and analytic tools are as important as campaign tools. \u003C/p\u003E\n\n\u003Cp\u003EDeskGod was designed and built by real world marketing professionals who understand what marketers need to be successful. Still, DeskGod always balances powerful with easy, so that you can unleash the power when you need it, without having it in the way when you just need to get something simple done and out the door.\u003C/p\u003E\n\n\u003Cp\u003EOur software must be complete, for you and your customers. Your customers don’t care about what marketing software you use. But they will care if you use multiple disconnected systems that create a confusing user experience as they move from the web to email to live chat and beyond. \u003C/p\u003E\n\n\u003Cp\u003EDeskGod Visitors Lifecycle Management(VLM) software spans the entire customer experience, across every stage of the sales funnel. Looking inward toward the marketing user, only \u003C/p\u003E\n\n\u003Cp\u003EDeskGod combines completely integrated tools for managing the entire Lifecycle of website visitors, with powerful analytic tools to make sense of it all. DeskGod is the most complete marketing solution available today.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0024/1989/241989v2-max-150x150.png"],
     [[250,
       72],
      "assets/images/resized/0024/1989/241989v2-max-250x250.png"],
     [[347,
       100],
      "assets/images/resized/0024/1989/241989v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder/ CEO",
    "person":
     {"first_name": "Daniel",
      "last_name": "Hristov",
      "permalink": "daniel-hristov",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "San Francisco Office",
    "address1": "1868 Greenwich St.",
    "address2": "",
    "zip_code": "94123",
    "city": "San Francisco",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "Europe Office",
    "address1": "30 Maria Luisa Blvd.",
    "address2": "",
    "zip_code": "4000",
    "city": "Plovdiv",
    "state_code": null,
    "country_code": "BGR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        144],
       "assets/images/resized/0024/1986/241986v2-max-150x150.jpg"],
      [[175,
        168],
       "assets/images/resized/0024/1986/241986v2-max-250x250.jpg"],
      [[175,
        168],
       "assets/images/resized/0024/1986/241986v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[129,
        150],
       "assets/images/resized/0024/1987/241987v2-max-150x150.jpg"],
      [[215,
        250],
       "assets/images/resized/0024/1987/241987v2-max-250x250.jpg"],
      [[332,
        385],
       "assets/images/resized/0024/1987/241987v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[132,
        150],
       "assets/images/resized/0024/1988/241988v2-max-150x150.png"],
      [[221,
        250],
       "assets/images/resized/0024/1988/241988v2-max-250x250.png"],
      [[398,
        450],
       "assets/images/resized/0024/1988/241988v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://launchub.com/news/read/25",
    "title": "Lauchhub Article"},
   {"external_url": "http://btvnews.bg/bulgaria/ikonomika/shest-balgarski-kompanii-poluchavat-do-200-hil-evro-finansirane-ot-fonda-launchub.html",
    "title": "BTVNews Article"}]}