{"name": "Deterministic Programming",
 "permalink": "deterministic-programming",
 "crunchbase_url": "http://www.crunchbase.com/company/deterministic-programming",
 "homepage_url": "http://deterministicprogramming.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 6,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "algorithm, software, engineering, computer, science, olin, architecture, consult, consultant, consulting",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Algorithm Consulting",
 "created_at": "Mon Jul 18 06:05:42 UTC 2011",
 "updated_at": "Mon Jul 18 21:09:33 UTC 2011",
 "overview": "\u003Cp\u003EDeterministic Programming is an algorithms consulting firm specializing in software development in Python, Java, and LabVIEW.\u003C/p\u003E\n\n\u003Cp\u003EWe have been serving a number of clients utilizing a number of novel technologies in the web and automatic testing spaces. Past projects include work in machine learning, neural networks, automating intensive human actions, and novel correlation heuristics.\u003C/p\u003E\n\n\u003Cp\u003EWilliam Dvorak\u003C/p\u003E\n\n\u003Cp\u003EPrincipal\u003C/p\u003E\n\n\u003Cp\u003EHaving graduated from Franklin W. Olin College of Engineering in 2010 with a degree in Electrical and Computer Engineering, William received a world-class education in design, problem solving, and teamwork. After working with a number of industry leaders, helping to further their core technologies, and countless group projects at Olin, William is now working to solve further challenging problems for his clients through Deterministic Programming.\u003C/p\u003E\n\n\u003Cp\u003EWilliam has been honored in national competitions in mathematics (at ARML) and musical performance (on tuba). He has developed technologies for enterprises from San Francisco to New York to Boston.\u003C/p\u003E\n\n\u003Cp\u003EOlin College, recently named one of the New Ivy\u0026#8217;s by Newsweek, had given a full merit-based scholarship to all incoming students. It is an institution with an ambitious mission statement: \u0026#8220;Olin College prepares future leaders through an innovative engineering education that bridges science and technology, enterprise, and society. Skilled in independent learning and the art of design, our graduates will seek opportunities and take initiative to make a positive difference in the world.\u0026#8221;\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Principal",
    "person":
     {"first_name": "William",
      "last_name": "Dvorak",
      "permalink": "william-dvorak-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}