{"name": "Detectent",
 "permalink": "detectent",
 "crunchbase_url": "http://www.crunchbase.com/company/detectent",
 "homepage_url": "http://www.detectent.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "info@detectent.com",
 "phone_number": "+1 760-233-4030",
 "description": "Business Intelligence Services",
 "created_at": "Mon Dec 14 20:17:24 UTC 2009",
 "updated_at": "Tue May 28 03:57:29 UTC 2013",
 "overview": "\u003Cp\u003EDetectent pioneered the concept of Customer Intelligence for utility business decision support with an initial focus on the identification of energy theft using advanced analytics. Detectent’s rapid success with this first Customer Intelligence application was predicated upon the fact that we did not simply provide a sophisticated tool; we delivered a solution that enabled our customers to recognize new revenue immediately. Detectent’s fast-growing customer base already encompasses more than one-third of North America’s largest utility companies, as well as many major mid-tier and municipal utilities.\u003C/p\u003E\n\n\u003Cp\u003EIt is these customers who have enabled Detectent to break new ground with Customer Intelligence Solutions in other utility business areas. Our close-working relationships have created new and innovative uses of utility data. This data, when enhanced with our vast, ever-expanding repository of customer behavior characteristics, has repeatedly proven its value in diverse applications. Detectent has remained at the forefront of the industry in providing superior customer intelligence to utilities, helping our clients make sound business decisions based on detailed analytics.\u003C/p\u003E\n\n\u003Cp\u003EDetectent gives you unprecedented visibility of your client base, so you can make more accurate business decisions to maximize customer satisfaction, minimize risk, capitalize on revenue opportunities, and achieve significant cost savings. Our advanced technology layer uses information from sources both inside and outside of the utility’s domain in tandem, enabling business-decision support based on enhanced intelligence of your customers.\u003C/p\u003E\n\n\u003Cp\u003EUtilities that partner with Detectent do so based on a clear exchange of value. Detectent’s solutions are provided on a fee-for-value basis, in which the investment is made over time and returns are measured monthly. Spreading the investment over time provides instant cash flow and benefits to the utility, protects the utility from risk, and ensures that the returns are realized within the same fiscal period in which the investment was made.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       64],
      "assets/images/resized/0007/2217/72217v3-max-150x150.jpg"],
     [[160,
       69],
      "assets/images/resized/0007/2217/72217v3-max-250x250.jpg"],
     [[160,
       69],
      "assets/images/resized/0007/2217/72217v3-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$31.1k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "http://www.sec.gov/Archives/edgar/data/1409054/000140905413000004/xslFormDX01/primary_doc.xml",
    "source_description": "SEC",
    "raised_amount": 31148.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 5,
    "funded_day": 7,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "120 W. Grand Ave",
    "address2": "Suite 104",
    "zip_code": "92025",
    "city": "Escondido",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}