{"name": "deTODOfree.com",
 "permalink": "detodofree-com",
 "crunchbase_url": "http://www.crunchbase.com/company/detodofree-com",
 "homepage_url": "http://www.deTODOfree.com",
 "blog_url": "http://www.deTODOfree.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "deTODOfree",
 "category_code": "advertising",
 "number_of_employees": 3,
 "founded_year": 2011,
 "founded_month": 5,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "nebraska, colorado, abogados, autos, bienes-raices, bodas, quinces, contratistas, abarrotes, ropa, botas, restaurantes, tecnologia, servicios, bares, cines, discotecas",
 "alias_list": null,
 "email_address": "support@deTODOfree.com",
 "phone_number": "",
 "description": "spanish directory Nebraska Colorado",
 "created_at": "Tue Jun 21 18:46:18 UTC 2011",
 "updated_at": "Tue Jun 21 21:58:50 UTC 2011",
 "overview": "\u003Cp\u003EdeTODOfree.com allows residents of Nebraska and Colorado to buy, sell, search and find within their hispanic communities.  \u003C/p\u003E\n\n\u003Cp\u003EIn this age where phone books are becoming a thing of the past, the online directory seems to be a more popular option.  After all, at this very moment, how many people do you think are holding a phone book in their hands and how many are holding a mouse?\u003C/p\u003E\n\n\u003Cp\u003EBusinesses are able to list themselves and have complete control of their profiles.  They can change their company information, add images, coupons, offers and more.  All of this for one small annual fee and they can make as many changes as they want throughout the year!\u003C/p\u003E\n\n\u003Cp\u003EIt also adds a classifieds section for the users but allows the use of not only images, but also video.   If they say a picture is worth a thousand words, then video must be worth millions!\u003C/p\u003E\n\n\u003Cp\u003EBest of all, keep yourself informed with deTODOfree.com!  This website includes a local events calendar a blog supported by various authors regarding a wide array of topics from items of interest for small business owners, to sports, from health and beauty to technology.  deTODOfree has it all!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}