{"name": "Dey Instruments",
 "permalink": "dey-instruments",
 "crunchbase_url": "http://www.crunchbase.com/company/dey-instruments",
 "homepage_url": "http://www.indiamart.com/deyinstruments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "deyinstruments@tradepassport.org",
 "phone_number": "",
 "description": "suppliers, trader",
 "created_at": "Thu Apr 04 14:13:40 UTC 2013",
 "updated_at": "Thu Apr 04 14:13:43 UTC 2013",
 "overview": "\u003Cp\u003EDey Instruments has captured an extensive market share by supplying and trading a quality centric range of the best Electrical Ammeter, Transducer Power Meter, Frequency Meter, Industrial Dynamometer, Watt Hour Meter and many more.\u003C/p\u003E\n\n\u003Cp\u003EAim / Vision / Mission:\nOur mission is to become a premier provider of high quality products to the market. We promise on-time delivery and competitive pricing. Dey Instrument is committed to fulfilling all customer requirements as promised and to developing and maintaining long term business relationships through treating its customers with honesty, integrity and respect.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nKeeping all the quality parameters as our major focus, we manufacture and supply an extensive range of product. Quality being the most vital of all the features, we pay utmost importance in order to live up to the expectations of our prestigious clients.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWith the help of qualified staff, we have laid a base of perfection, thanks to the vendors who we have chosen after considering their stature in the market arena. Our company has incorporated a modern laboratory equipped with testing instruments and equipment along with physical and chemical testing facilities to conduct tests.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe follow the motto of Success being a journey, and not a destination, hence we encourage our clients to pour in their feedbacks so that we could work on them. With quality raw materials and highly advanced infrastructure we have raised the bar of our production.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7957/247957v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7957/247957v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7957/247957v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}