{"name": "DFMN Group",
 "permalink": "dfmn-group",
 "crunchbase_url": "http://www.crunchbase.com/company/dfmn-group",
 "homepage_url": "http://www.indiamart.com/delhifootwear/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "delhifootwear@tradepassport.org",
 "phone_number": "9654766987",
 "description": "Publishing Fashion and Footwear Magazine",
 "created_at": "Thu Apr 04 13:57:45 UTC 2013",
 "updated_at": "Thu Apr 04 13:57:47 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1984, we, \u0026#8216;Delhi Footwear Market News\u0026#8217;, are one of the reputed publishing house engaged in publishing Fashion and Footwear Magazines. These magazines offer extensive information on business issues covering various industries like footwear, shoe retailing, cosmetic \u0026amp; herbal. The wide range of fashion footwear magazines, fashion cosmetic magazines, cosmetic news magazine and herbal news magazines we offer serve as a best economical media for the dissemination of business messages far and wide and covers covers all intricate details of all the happenings from news to views \u0026amp; updates in the related industry.\u003C/p\u003E\n\n\u003Cp\u003EWhere Are We Located?\nThe Publication house provides consumer services and delivers at your doorstep. Headquartered in New Delhi with its branches in Mumbai and Agra, DFMN Publications endeavor to be the one of the most economical and effective media for Players of the Industry.\u003C/p\u003E\n\n\u003Cp\u003EService Portfolio:\nBeing a renowned publishing house, we are engaged in offering one of the best product awareness platforms in the market with our Shoe Magazines, Footwear Magazines and Cosmetic Magazines along with directories. We have latest publishing amenities and the support of experienced editors that help us present magazine that covers all possible departments of related industry be it raw material, machinery or finished products.\u003C/p\u003E\n\n\u003Cp\u003EOur Aim:\n    To meet varied business related demands of footwear, cosmetic and herbal manufacturers, wholesale dealers, distributors and other concerned trade people across the country.   To enhance \u0026amp; develop Indian trade and industry by providing leads to different sources and related information that benefits the individual business plans of the clients.\u003C/p\u003E\n\n\u003Cp\u003EMIssion, Visson \u0026amp; Values:\nDFMN publications are bilingual that is dedicated to enhance results for organizations by promoting them. Our goal is to enhance business mileage for all Players of the Trade. We seek to strategically endeavor to be a convenient and accessible media that will create business opportunities. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7945/247945v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7945/247945v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7945/247945v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}