{"name": "Dhariwal Sons",
 "permalink": "dhariwal-sons",
 "crunchbase_url": "http://www.crunchbase.com/company/dhariwal-sons",
 "homepage_url": "http://www.indiamart.com/dhariwalandsons/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "dhariwalandsons@tradepassport.org",
 "phone_number": "9357470000",
 "description": "manufacture and supplier of Uniform ",
 "created_at": "Fri Apr 05 11:15:04 UTC 2013",
 "updated_at": "Fri Apr 05 11:15:11 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, Dhariwal \u0026amp; Sons, is a sole proprietorship firm located at Ludhiana in Punjab, India. We are engaged in manufacturing and supplying an excellent gamut of Uniform T-Shirts, Uniform Sweaters, Sweatshirts, Jackets, Track Suits, Lowers and Uniform Blazers. We also manufacture all garment items as per customer requirement.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nSince our incorporation, we have unflinchingly practiced total quality management. By adhering to the norms and guidelines set by concerned industrial authorities, we are able to bring forth a superior quality range naturally. The raw materials used in the manufacturing our products are obtained from reliable sources. Furthermore, each stage of product development is cautiously scrutinized by seasoned quality specialists. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a strong infrastructural base in the township of Ludhiana, India. It is the base point of several day to day business tasks. In order to develop reliable apparels, we have equipped our manufacturing facility with technologically advanced tools and machines. We have judiciously segmented our infrastructure into separate units to facilitate uninterrupted flow of different operations. For each designing, quality testing, procurement and packaging we have a sophisticated and adequately manned unit. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have recruited a knowledgeable and experienced team of professionals, who carry out business activities in an efficient and timely manner. The recruitment process is carried our by industrial experts, who thoroughly analyze the knowledge levels, dedication and determination of interviewing candidates. Owing to extensive training, our professionals are able to understand the assigned procedures in a profound manner. Moreover, they work in harmony with one another and as a result attain success in set organizational goals. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client centric organization, we emphasize on each and every need of our valuable clients. We leave no stone unturned to meet the diversified requirements of our clients. To their delight, we offer effective customized designing and packaging services. Our range complies with latest fashion trends and is offered at industry leading rates.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8561/248561v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8561/248561v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8561/248561v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}