{"name": "Dharmesh Manufacturers",
 "permalink": "dharmesh-manufacturers",
 "crunchbase_url": "http://www.crunchbase.com/company/dharmesh-manufacturers",
 "homepage_url": "http://www.indiamart.com/dharmeshmanufacturers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "single-end-grooved-pulley, double-end-grooved-pulley, v-grooved-pulley, grooved-round-pulley-and-grooved-pulley",
 "alias_list": null,
 "email_address": "dharmeshmanufacturers@tradepassport.org",
 "phone_number": "9427725558",
 "description": "We, Dharmesh Manufacturers, are engaged ",
 "created_at": "Thu Apr 04 11:35:57 UTC 2013",
 "updated_at": "Thu Apr 04 11:36:01 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1984, we, “Dharmesh Manufacturers”, are counted among the recognized firms engaged in offering a wide range of B Grooved Pulley, C Grooved Pulley, Section C Pulley, Pulley Spare Part, V Belt Grooved Pulley and Heavy Duty V Belt Pulley. The range offered by us includes Single End Grooved Pulley, Double End Grooved Pulley, V Grooved Pulley, Grooved Round Pulley and Grooved Pulley. In addition to this, we offer Thresher Pulley, Industrial V Belt Pulley, Motor Slide Pulley, Plain \u0026amp; Joint Pulley, Grooved Pulley and many more. These products are manufactured using superior quality raw material, which is sourced from the reliable vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a group of expert professionals, which helps us in manufacturing and supplying a quality assured assortment of B Grooved Pulley, C Grooved Pulley, Section C Pulley, Pulley Spare Part, V Belt Grooved Pulley and Heavy Duty V Belt Pulley.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur organization is committed to maintain the quality of the entire range of B Grooved Pulley, C Grooved Pulley, Section C Pulley, Pulley Spare Part, V Belt Grooved Pulley and Heavy Duty V Belt Pulley. We make sure to offer the products that are in compliance with the international standards \u0026amp; norms of quality. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have established a state-of-the-art infrastructure, which is backbone of our organization. This infrastructure is divided into various units that help in carrying out the business related activities in a streamlined manner. One of the most important units of our infrastructure is the manufacturing department. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have gained an appreciation by the clients, owing to our impeccable range of B Grooved Pulley, C Grooved Pulley, Section C Pulley, Pulley Spare Part, V Belt Grooved Pulley and Heavy Duty V Belt Pulley. To continue, we make sure to offer the products to the clients that in compliance with the international standards and norms and as per the requirements of our clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nGrooved Pulley, C Grooved Pulley, Section C Pulley, Pulley Spare Part, V Belt Grooved Pulley and Heavy Duty V Belt Pulley.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7860/247860v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/7860/247860v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/7860/247860v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}