{"name": "Dhwiti Electric",
 "permalink": "dhwiti-electric",
 "crunchbase_url": "http://www.crunchbase.com/company/dhwiti-electric",
 "homepage_url": "http://www.indiamart.com/dhwitielectric/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 40,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ginning-machine, electric-panel-board, super-cleaner, trolley-system",
 "alias_list": null,
 "email_address": "dhwitielectric@tradepassport.org",
 "phone_number": "7922973402",
 "description": "trading a wide range of Ginning Machine,",
 "created_at": "Thu Apr 04 07:05:16 UTC 2013",
 "updated_at": "Thu Apr 04 07:05:18 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nEstablished in the year 2009, we, “Dhwiti Electric”, are one of the leading organizations, engaged in manufacturing, supplying and exporting a comprehensive range of Ginning Machine, Electric Panel Board, Super Cleaner, Trolley System, Pneumatic System \u0026amp; Air Separator, Belt Conveyor \u0026amp; Industrial Belt, Screw Conveyor \u0026amp; Elevator, Industrial Blower and Cotton Feeding Equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision\u003C/p\u003E\n\n\u003Cp\u003ETo achieve complete customer satisfaction with the most advanced technology for handling bulk materials safely and economically.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed a state-of-the-art infrastructure, which is spread over a vast area of land at Ahmedabad (Gujarat, India). Our infrastructure is internally segregated into various units such as designing, manufacturing, quality testing, warehousing and packaging.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a team of expert professional, who have years of experience and in-depth knowledge in their respective domains. All the professionals work in close coordination with each other for carrying out business operations smoothly and accurately.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a quality-driven organizations, we strive for maintaining the equal standards in each of our product. For this reason, we make use of only superior quality raw material and components to develop our entire range of Ginning Machine, Electric Panel Board, Super Cleaner, Trolley System, Pneumatic System \u0026amp; Air Separator and many more. In addition to this, we have a team of expert quality controllers, which stringently checks and tests the entire range on various parameters to ensure flawlessness.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction\u003C/p\u003E\n\n\u003Cp\u003ESince our inception, all our endeavors are directed towards achieving the highest level of customer satisfaction by providing them with a qualitative range of Ginning Machine, Electric Panel Board, Super Cleaner, Trolley System, Pneumatic System \u0026amp; Air Separator and many more. We also provide the facility of customization to clients as per their demands and needs. To win their trust, we also accept payment from our customers via several easy modes.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7607/247607v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7607/247607v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7607/247607v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}