{"name": "Diasoft",
 "permalink": "diasoft",
 "crunchbase_url": "http://www.crunchbase.com/company/diasoft",
 "homepage_url": "http://www.diasoft.com",
 "blog_url": "http://www.linkedin.com/company/diasoft?trk=hb_tab_compy_id_19483",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 1600,
 "founded_year": 1991,
 "founded_month": 4,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "core-banking, retail-banking, financial-technology, legacy-renovation, insurance-solutions, treasury-solutions",
 "alias_list": null,
 "email_address": "info@diasoft.com",
 "phone_number": "+44 20 3355 7658",
 "description": "financial technologies, core banking",
 "created_at": "Mon Feb 25 11:55:28 UTC 2013",
 "updated_at": "Wed Feb 27 15:36:01 UTC 2013",
 "overview": "\u003Cp\u003ESince 1991 Diasoft has been providing cutting edge financial software solutions supporting all the aspects of retail, corporate and universal banking, treasury and capital market services, and insurance business. \u003C/p\u003E\n\n\u003Cp\u003EToday, the company’s main offering to the global financial market is FLEXTERA — the SOA-based universal solution for front-to-back automation of financial services. \u003C/p\u003E\n\n\u003Cp\u003EFLEXTERA is designed for retail, corporate, universal and investment banks, treasuries, non-government pension funds and insurance companies, and offers the broadest range of advanced tools to support modern banking and insurance products and services, operations at financial markets, accounting and reporting. \u003C/p\u003E\n\n\u003Cp\u003EIn addition to the full scale deployment of FLEXTERA solutions to support its Customers’ businesses, Diasoft has developed a unique methodology for legacy system enhancement which offers the Customer all advantages of modern technologies without the need to reconstruct their business processes. \u003C/p\u003E\n\n\u003Cp\u003EDiasoft’s solutions are successfully used by more than 360 financial organizations including 6 of the TOP10 world’s most profitable banks and 12 of the 50 largest international banks. With over 1,600 highly qualified specialists Diasoft implements more than 600 projects per year to deliver to its Customers the most advanced inventory for their business development.\u003C/p\u003E\n\n\u003Cp\u003ETo enhance its solutions’ value, the company has built strong relationships with a broad chain of technological and strategic partners including the leading global vendors IBM, Oracle, Microsoft, Hewlett Packard, Fujitsu-Siemens, Intel, Sybase, Sun Microsystems, Informatica, Scorto, Stins Coman and others.\u003C/p\u003E\n\n\u003Cp\u003EDiasoft is a recognized multi-awarded company ranked among TOP100 global financial technologies providers and the TOP10 software vendors in Russia. Our contribution into innovations has been recognized by a number of market accolades from the leading global analysts and industry leaders: Gartner magic Quadrant for International Retail core Banking, Celent Big League EEMEA leader, IBM Beacon Award 2013 finalist, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[90,
       23],
      "assets/images/resized/0023/8394/238394v2-max-150x150.jpg"],
     [[90,
       23],
      "assets/images/resized/0023/8394/238394v2-max-250x250.jpg"],
     [[90,
       23],
      "assets/images/resized/0023/8394/238394v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://finextra.com/News/Announcement.aspx?pressreleaseid=44639",
    "title": "Flextera Middle Office validated on IBM banking industry framework"},
   {"external_url": "http://www.bobsguide.com/guide/news/2012/Oct/5/two-diasoft-solutions-positioned-in-magic-quadrant-for-international-retail-core-banking.html",
    "title": "Two Diasoft solutions positioned in Magic Quadrant for International Retail Core Banking "},
   {"external_url": "http://www.americanbanker.com/fintech100/2012-rankings/",
    "title": ""},
   {"external_url": "http://www.inntron.com/banksys/diasoft.htm",
    "title": ""},
   {"external_url": "http://www.ibsintelligence.com/index.php?option=com_content\u0026view=article\u0026id=16756:diasofts-flextera-gains-first-full-live-site-at-unistream\u0026catid=2:news\u0026Itemid=12",
    "title": "Diasoft's Flextera goes live at Unistream"}]}