{"name": "Digital Watchdog",
 "permalink": "digital-watchdog",
 "crunchbase_url": "http://www.crunchbase.com/company/digital-watchdog",
 "homepage_url": "http://www.Digital-Watchdog.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "DW_CCTV",
 "category_code": "security",
 "number_of_employees": 50,
 "founded_year": 1987,
 "founded_month": 2,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "security, cctv, analog, ip-cameras, nvr, dvr, surveillance",
 "alias_list": null,
 "email_address": "emarketing@dwcc.tv",
 "phone_number": "8664463595",
 "description": "Premium CCTV Manufacturing Company",
 "created_at": "Mon Dec 03 19:03:47 UTC 2012",
 "updated_at": "Wed Dec 12 08:06:23 UTC 2012",
 "overview": "\u003Cp\u003ELeading Manufacturer in the CCTV Industry, providing CCTV, IP, and Surveillance Solutions.\u003C/p\u003E\n\n\u003Cp\u003EWith engineering and manufacturing facilities in Seoul, Korea and assembly in the United States, Digital Watchdog offers a level of specialty in the manufacturing and deployment of analog and IP video security technology that your business can rely upon. Our high refined production process offers substantial savings to our customers requiring quality products on a “just in time” basis. Our premier in-house production capabilities and quality control programs allow for the customization of comprehensive, scalable recording solutions, video imaging devices, and pre-programmed network security devices. \u003C/p\u003E\n\n\u003Cp\u003EWe continue our commitment to taking service and technology solutions to the next level with a renewed investment in additional skilled industry professionals, online service capabilities, and application support. Additionally, we have shipping facilities on both coasts of the United States as well as additional service capabilities in our Latin American and  Canadian markets. We have what you need, when you need it! \u003C/p\u003E\n\n\u003Cp\u003EOur goal is simple… to build on and advance our partner’s success in areas spanning technology development, project application, software support, and most importantly industry education. Facilitating this effort, we offer programs such as our in-house technology training webinars, and our highly successful DW University Certification programs. We believe our future relies on the success of our partners, and we are committed to promoting this through the highest standards in all areas of our products and services. \u003C/p\u003E\n\n\u003Cp\u003EThank you for your continued support as we grow to meet your need for scalable, reliable, and effective products. All of us here at Digital Watchdog care about your success… That is why we are in business.\u003C/p\u003E\n\n\u003Cp\u003EVisit our Website @ \nwww.DWCC.tv\u003C/p\u003E\n\n\u003Cp\u003EFollow us on Twitter \n@DW_CCTV\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Like\u0026#8221; Us on Facebook http://www.facebook.com/DigitalWatchdog\u003C/p\u003E\n\n\u003Cp\u003EFollow our Company LinkedIn Page\nhttp://www.linkedin.com/company/digital-watchdog-cctv\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Tampa Headquarters",
    "address1": "5436 West Crenshaw Street",
    "address2": "",
    "zip_code": "33634",
    "city": "Tampa",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": 28.0154975,
    "longitude": -82.5367738},
   {"description": "California Location",
    "address1": "16",
    "address2": "",
    "zip_code": "90703",
    "city": "Cerritos",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 33.8859852,
    "longitude": -118.1014785}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}