{"name": "Digital Time Capture Inc.",
 "permalink": "digital-time-capture-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/digital-time-capture-inc",
 "homepage_url": "http://www.digitaltimecapture.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "DTCapture",
 "category_code": "software",
 "number_of_employees": 11,
 "founded_year": 2005,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "time-capture-software-construction-industrial-heavy-primavera-adp-oracle-microsoft-lem-timesheet-real-time-management-entry-cost-reporting, time-capture, software, construction, industrial, heavy-construction, primavera, adp, oracle, microsoft, lem, times",
 "alias_list": null,
 "email_address": "info@digitaltimecapture.com",
 "phone_number": "1-888-927-8873",
 "description": "Timesheet Management Software",
 "created_at": "Wed Dec 01 19:49:59 UTC 2010",
 "updated_at": "Fri Mar 18 22:06:41 UTC 2011",
 "overview": "\u003Cp\u003EDigital Time Capture Inc. produces timesheet (LEM) management software for the industrial construction industry. Digital Time Capture Inc. enables businesses to track labour, equipment, materials, and subcontractor information as it happens on-site.\u003C/p\u003E\n\n\u003Cp\u003EDigital Time Capture Inc. was built by construction people who believe it is possible to singly collect operational data to support both operations and financial requirements. In the process, we improve accuracy, eliminate duplicate data entry, and create the ability to produce job cost and KPI reports on demand.\u003C/p\u003E\n\n\u003Cp\u003EDigital Time Capture Inc. is passionate about bringing innovative and practical cost management standards to the industrial construction industry. Every day, millions of dollars are lost in the construction industry because construction and financial systems don\u0026#8217;t communicate. Digital Time Capture Inc. has created DTC Constructive Software, an evolutionary time-tracking and invoicing approach to bridge the gap.  With DTC, Executives can confidently take on both high risk and high volume projects without increasing administrative overhead.  Project Managers will be equipped with daily cost reporting so that every team member understands progress relative to cost and estimates across all projects, and administrative personal will experience a more intuitive and user friendly interface. With our superior service offering, our customers will also receive help with software implementation, training, and support. \u003C/p\u003E\n\n\u003Cp\u003EPrior to starting software development, Digital Time Capture Inc. consulted with several key customers in the industrial construction industry who also believed this systemic issue between operations and finance could be resolved. These customers provided invaluable insight into the internal and external challenges they face, and how one system could be designed to solve the problem for any number or types of industrial projects. Digital Time Capture Inc. continues to partner with each customer and key industry champions to ensure customer requirements are met and DTC Construction Software continues to meet and exceed industry expectations.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       127],
      "assets/images/resized/0011/2486/112486v6-max-150x150.jpg"],
     [[250,
       212],
      "assets/images/resized/0011/2486/112486v6-max-250x250.jpg"],
     [[425,
       362],
      "assets/images/resized/0011/2486/112486v6-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "DTC Construction Software",
    "permalink": "dtc-construction-software",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "Suite 201",
    "address2": "9644 - 54 Avenue",
    "zip_code": "T6E 5V1",
    "city": "Edmonton",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.capterra.com/construction-management-software/spotlight/69128/Digital%20Time%20Capture/Digital%20Time%20Capture?srchid=351265\u0026pos=1",
    "title": "Submit a Review"},
   {"external_url": "http://www.linkedin.com/company/digital-time-capture",
    "title": "Follow us on LinkedIn"}]}