{"name": "Dilpoint",
 "permalink": "dilpoint",
 "crunchbase_url": "http://www.crunchbase.com/company/dilpoint",
 "homepage_url": "http://www.dilpoint.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "dilpoint",
 "category_code": "other",
 "number_of_employees": 1,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "search, opinions, famous, brands, gadgets, automobiles, places, movies, tags, summary, research, instant",
 "alias_list": null,
 "email_address": "support@dilpoint.com",
 "phone_number": "+97433242457",
 "description": "Compiling Opinions",
 "created_at": "Sun Nov 25 13:47:18 UTC 2012",
 "updated_at": "Sun Nov 25 23:57:58 UTC 2012",
 "overview": "\u003Cp\u003EDilpoint is a website that is aimed at compiling opinions using a tagging system, that may be used for easy decision-making, analysis or research.  \u003C/p\u003E\n\n\u003Cp\u003EOn the homepage, visitors are asked to express their opinions on random subjects featured on Dilpoint. Subjects covered include famous personalities, brands, gadgets, automobiles, movies and places. The opinions are collected mainly in the form of tags, with comments being optional - green tag for like, red tag for dislike, and yellow tag for neutral. Visitors are given the option to choose between registering or not. Once registered, they may also choose whether they wish to have a brief profile or not. Registered users are given points for expressing opinions. Dilpoint explains these as rewards for the users\u0026#8217; \u0026#8216;contribution to mankind\u0026#8217;.\u003C/p\u003E\n\n\u003Cp\u003EVisitors may search for specific subjects to check the stats  on opinions already expressed about it. Instant summary is provided by Dilpoint about the opinions, only giving the number of tags for like, dislike, and neutral. Detailed view displaying comments entered may also be obtained easily.\u003C/p\u003E\n\n\u003Cp\u003EThe website takes up a unique approach to human opinions. It was founded by Adil Abdul Aziz, an Indian employed in Qatar. It has been expressed by Dilpoint\u0026#8217;s founder on the website that it could be used in a variety of ways for human development. He believes that it could be useful for generations to come as it would be the source of common man\u0026#8217;s opinions on subjects over time. At the moment, the website is funded and administered solely by Adil.\u003C/p\u003E\n\n\u003Cp\u003EThere are a couple of other features for Dilpoint that make it an easy gateway to the web. Quick Links on every page helps to navigate to the best websites on the internet. Visitors could also learn more about any of the random subjects they are unaware of, by clicking on icons of Google, Yahoo, Bing or Wikipedia which would show up search results on the respective websites. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/2081/222081v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0022/2081/222081v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0022/2081/222081v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Adil",
      "last_name": "Abdul Aziz",
      "permalink": "adil-abdul-aziz",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        108],
       "assets/images/resized/0022/2080/222080v2-max-150x150.png"],
      [[250,
        180],
       "assets/images/resized/0022/2080/222080v2-max-250x250.png"],
      [[450,
        324],
       "assets/images/resized/0022/2080/222080v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}