{"name": "Dipti Wire Products",
 "permalink": "dipti-wire-products",
 "crunchbase_url": "http://www.crunchbase.com/company/dipti-wire-products",
 "homepage_url": "http://www.indiamart.com/diptiwireproducts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "diptiwireproducts@tradepassport.org",
 "phone_number": "9819319900",
 "description": "manufacturing and supplying",
 "created_at": "Thu Apr 04 16:02:27 UTC 2013",
 "updated_at": "Thu Apr 04 16:02:30 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1974. we Dipti Wire Products, are a prominent firm engaged in manufacturing and supplying Industrial Wire Products. Our offered range includes Vibrating Screens,Metal Screens, Metal Mesh, Demister Pad, Wire Cloth Fabrications, Perforated Sheets, and Metal Wire Conveyor Belt. All these products are manufactured using premium quality metals that are procured from reliable vendors in this industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are blessed with a team of dexterous professionals who work in a coordinated manner to carry out all our business tasks efficiently. These professionals are highly qualified and hold immense expertise in their respective fields. Our team of deft quality analysts test the manufactured products on various parameters to ensure their adherence to set industry standards and quality norms.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nSince inception, we have had our main focus towards the quality aspect of the products manufactured by us. The procuring agents of our firm ensure that the raw material for the products are procured from reliable vendors only. Our professionals give utmost importance to the dimensional accuracy and sturdiness of the product so as to provide our clients with best-in-class products.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a state-of-the-art infrastructure set up for our firm. Our production unit is well equipped with high grade machines and equipment such as Chain link fencing machine, Crimped wire mesh machine and Perforation machine. These help our manufacturing experts to carry out all our production activities in a stream-lined and effective manner. Our ventilated storage unit is divided into various segments that helps in easy storage and retrieval of goods.\u003C/p\u003E\n\n\u003Cp\u003EIndustries Cater To:\n    Fertilizers\n    Chemical Industries\n    Rubber Industries\n    Sugar Factories\n    Mining Industries\n    Celluloid Factories\n    Petrochemical Industries\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       125],
      "assets/images/resized/0024/8054/248054v2-max-150x150.jpg"],
     [[240,
       200],
      "assets/images/resized/0024/8054/248054v2-max-250x250.jpg"],
     [[240,
       200],
      "assets/images/resized/0024/8054/248054v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}