{"name": "discountbomb",
 "permalink": "discountbomb",
 "crunchbase_url": "http://www.crunchbase.com/company/discountbomb",
 "homepage_url": "http://discountbomb.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "discountbomb",
 "category_code": "advertising",
 "number_of_employees": 9,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "save-money, discounts, local, prizes",
 "alias_list": null,
 "email_address": "franklin@discountbomb.com",
 "phone_number": "",
 "description": "Local Discounts right from your phone",
 "created_at": "Mon Sep 17 11:33:45 UTC 2012",
 "updated_at": "Mon Sep 24 17:20:42 UTC 2012",
 "overview": "\u003Cp\u003EDiscount Bomb is a division of the Media Ad Group, we have developed this membership/rewards platform to help Consumers and Business owners both realize a Money Saving Program in “The New Economy”!\u003C/p\u003E\n\n\u003Cp\u003EDiscount Bomb is a syndication app allowing members to browse through local business subscribers that offer Samples/Deals/Prizes on the Discount Bomb Platform.  Each of these merchants have created a selection of offers,  ready for immediate redemption to the member’s cell phone or email address.\u003C/p\u003E\n\n\u003Cp\u003EDiscounts for restaurants, bars, retail, merchandise, services and an array of products are being set up now…\u003C/p\u003E\n\n\u003Cp\u003EConsumers can become a free member instantly by downloading our free app, visiting the DiscountBomb website, the merchant’s website and various Social Media Marketing methods.\u003C/p\u003E\n\n\u003Cp\u003EWhen a member redeems an offer, the member not only receives  the incentive but also receives points for the redemption. When redeeming the offer, a unique code that the merchant has chosen is entered on the handheld device and that offer is marked as “redeemed”. The offer is automatically sent to the merchant alerting them  also.\u003C/p\u003E\n\n\u003Cp\u003EAll the member needs to do is show the cashier at the respective retailer when checking out, the phone’s screen containing the offer code (text or inbox) and they receive the incentive! How Cool (Green) is that?\u003C/p\u003E\n\n\u003Cp\u003EConsumers like it because they get access to deals and discounts they normally would never receive. Businesses love it because it’s low cost advertising that creates massive exposure and brings forth measurable results. The less it cost a business to advertise, the more the consumer can realize savings!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       120],
      "assets/images/resized/0021/1632/211632v2-max-150x150.png"],
     [[250,
       200],
      "assets/images/resized/0021/1632/211632v2-max-250x250.png"],
     [[275,
       220],
      "assets/images/resized/0021/1632/211632v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}