{"name": "ditlo",
 "permalink": "ditlo",
 "crunchbase_url": "http://www.crunchbase.com/company/ditlo",
 "homepage_url": "http://www.ditlo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "theditlollc",
 "category_code": "games_video",
 "number_of_employees": 5,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "celeberties, tv, film, music, photography",
 "alias_list": null,
 "email_address": "bruce@ditlo.com",
 "phone_number": "3109438105",
 "description": "Visual interviews of trending people",
 "created_at": "Thu Jan 31 21:51:37 UTC 2013",
 "updated_at": "Sun Feb 03 06:50:28 UTC 2013",
 "overview": "\u003Cp\u003EVisual interviews of trending people, place and things.\u003C/p\u003E\n\n\u003Cp\u003EFounded in 2013 by Bruce Kramer of ArtMixCreative.com, ditlo.com offers an online platform for fans and consumers to access behind-the-scenes imagery and video content for their favorite personalities. Each profiled individual will be captured on camera by a world renowned photographer to showcase their lives, interests, and upcoming projects. All imagery will be copyrighted by the site, with editorial rights available for purchase through its content archive, ditloArchives.com. To learn more, visit www.ditlo.com.\u003C/p\u003E\n\n\u003Cp\u003Editlo.com, acronym for “a day in the life of…,” grants visitors open access to their favorite personalities through behind-the-scenes imagery, personalized video content, and fun facts, offering insights into their lives, personal interests, and upcoming projects. Each subject will be captured by a renowned industry photographer aiming to give fans an intimate look inside their lives, giving the audience a fly on the wall perspective. \u003C/p\u003E\n\n\u003Cp\u003EAiming to capture them in their most natural form, subjects are photographed one-on-one without the use of a stylist, artificial lighting or a crew. This experience offers a very candid format and gives fans a chance to see their favorite personalities through untouched photos at home, at work or at play. Each profiled individual will also have a chance to provide direct input into their “meet me” section as well as the connections circle component of their page – offering fans a collective insight into their online social channels and personal interests.\u003C/p\u003E\n\n\u003Cp\u003E“As a consumer I found myself bored seeing the exact same photo from different angles repetitively… and of the same people,” said Bruce Kramer, founder of ditlo.com. “I was inspired to take the next step to capture what a typical day or event looks like for personalities and show individuals in their most natural form.”\u003C/p\u003E\n\n\u003Cp\u003EThe ditlo platform will also offer fans the chance to get a glimpse into leading industry events and exclusive parties, in a sense granting them a virtual backstage pass. Personalities that are profiled on the platform include actors, athletes, business entrepreneurs, celebrities, comedians, designers, fitness and training professionals, food and wine experts, media moguls, musicians and other influencers. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder/CEO",
    "person":
     {"first_name": "Bruce",
      "last_name": "Kramer",
      "permalink": "bruce-kramer",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$250k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 250000.0,
    "raised_currency_code": "USD",
    "funded_year": 2012,
    "funded_month": 7,
    "funded_day": 8,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "8440 Warner Drive",
    "address2": "Suite A2",
    "zip_code": "90232",
    "city": "Los Angeles",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}