{"name": "Divy Papers",
 "permalink": "divy-papers",
 "crunchbase_url": "http://www.crunchbase.com/company/divy-papers",
 "homepage_url": "http://www.indiamart.com/divypapers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "storage-boxes, gifts-boxes, note-books, wrapping-sheets, file-folders, corporate-sets-and-office-desk-accessories-",
 "alias_list": null,
 "email_address": "divypapers@tradepassport.org",
 "phone_number": "9166612999",
 "description": "Manufacturer, supplier, wholesaler ,",
 "created_at": "Fri Apr 05 12:05:38 UTC 2013",
 "updated_at": "Fri Apr 05 12:05:43 UTC 2013",
 "overview": "\u003Cp\u003EDivy Papers was established in 2013 as Sole Proprietorship at Jaipur, Rajasthan. Our company has become one of the prominent names in manufacturing, supplying, exporting and wholesaling of Paper Bags, Storage Boxes, Gifts Boxes, Note Books, Wrapping Sheets, File Folders, Corporate Sets and Office Desk Accessories. Our company is determined to provide only quality products with good packaging to our precious clients on allotted time at the most reasonable rates in the market. This is the reason which has helped our company to carve a special niche among clients in such a short period of time. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe always take appropriate steps to ensure quality management of our products. Our company has implemented flawless stringent quality control mechanism to ensure best production. We use only high quality raw material for manufacturing of products with the help of latest technology. To ensure that all the industrial activities have been done according to industrial norms, we have employed a vigilant team of technicians. Client satisfaction is our prime motto.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur company has a large area campus which is well set-up with hi-tech infrastructural facilities and well equipped machinery. We have installed machines and other technical arrangements with latest technology in order to meet the wide and diverse demands of our clients. We have left no stone unturned to provide our company with latest technology for fulfilling all requirements of market without any delay.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur company is determined to follow only standard quality parameters while manufacturing the products and believe in transparent dealings with clients. We have a team of efficient professionals who are relentlessly engaged in various fields on the whole process. Moreover, we provide all our products at the most reasonable prices.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nPaper Bags, Storage Boxes, Gifts Boxes, Note Books, Wrapping Sheets, File Folders, Corporate Sets and Office Desk Accessories. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8622/248622v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8622/248622v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8622/248622v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}