{"name": "Divya Plasto",
 "permalink": "divya-plasto",
 "crunchbase_url": "http://www.crunchbase.com/company/divya-plasto",
 "homepage_url": "http://www.indiamart.com/divyaplastotecknik/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "divyaplastotecknik@tradepassport.org",
 "phone_number": "9727755332",
 "description": "Manufacturer, supplier.",
 "created_at": "Sat Apr 06 03:18:44 UTC 2013",
 "updated_at": "Mon Apr 08 00:06:50 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, we, \u0026#8220;Divya Plasto Tecknik\u0026#8221; are counted among one of the foremost manufacturers and suppliers of a comprehensive range of Screw Barrel, Twin Screw and Plastic Machinery Parts.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nSimple in design but optimum in process and performance with high speed and torque control, our range comprises Twin Barrel, Segmented Screw \u0026amp; Barrel, Conical Twin Screw Barrel, Twin Screw Extruder Barrel, Single Screw Extruder Barrel and Die Head Screw Barrel. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are well-supported by a modern infrastructure facility, which aids us in supplying a quality approved and innovative range of Screw Barrel, Twin Screw and Plastic Machinery Parts.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have earned a position of repute in this competitive market place due to the efficient support of our dexterous team of professionals. Experts of their respective working domain, these professionals support us in maintaining utmost quality, tmeliness and transparency in our business operations.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nEver since our inception, we had managed to gain an undisputed leading position in this competitive market, by maintaining quality at its best in the offered range of Screw Barrel, Twin Screw and Plastic Machinery Parts. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nIn order to maintain our forefront position, we have always paid utmost attention on attaining complete satisfaction of clients and maintaining strong rapport with them. For the same, we offer the range of Screw Barrel, Twin Screw and Plastic Machinery Parts, which is precisely manufactured using only superior grade raw material and latest techniques. Moreover, our professionals also check the range stringently to ensure its flawlessness and compliance with industry standards.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       114],
      "assets/images/resized/0024/8984/248984v2-max-150x150.jpg"],
     [[205,
       157],
      "assets/images/resized/0024/8984/248984v2-max-250x250.jpg"],
     [[205,
       157],
      "assets/images/resized/0024/8984/248984v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}