{"name": "DK Systems",
 "permalink": "dk-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/dk-systems",
 "homepage_url": "http://www.indiamart.com/dksystems/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "dksystems@tradepassport.org",
 "phone_number": "9637460160",
 "description": "Manufacturing and Supplying",
 "created_at": "Fri Apr 05 09:55:53 UTC 2013",
 "updated_at": "Fri Apr 05 09:55:59 UTC 2013",
 "overview": "\u003Cp\u003ESince 2006, we, “DK Systems,” at Pune, (Maharashtra, India), are engaged in manufacturing and supplying a wide range of optimum quality Control Panels, Machining Systems and Filling Machines. Our exclusive range includes FLP Control Panels, PLC and VFD Control Panels, Dust Collection Systems, Bag Filling Systems, Jumbo Bag Unloading Systems, Bag Filling Machines, etc.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are the leading organization in the market, engaged in offering Control Panels, Machining Systems and Filling Machines in various specifications. The goodwill we have generated is due to the timely delivery of best quality products. Our entire range is made as per the set industry standards by our skilled professionals.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a quality-centric organization, we assure our clients that the products offered by us are fault free and require less maintenance. In order to design \u0026amp; assemble these products, we use excellent quality components sourced from the most trusted vendors of the industry. Also, we have advanced manufacturing unit, where we manufacture these products using sophisticated technology as per the variegated requirements of our clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client-conscious organization and divert all our efforts on providing optimum satisfaction to the clients present in India as well as across the world. Our range of products is designed using superior quality raw material. With the overwhelming client response, we have established a great rapport worldwide.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur highly experienced and diligent team of experts assists us in offering high quality products to our clients. The team of our professionals in our company is highly experienced and knowledgeable in meeting the variegated demands of the clients. We have hired these professionals on the basis of their experience and expertise.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe are supported with the most appropriate and advanced infrastructure, equipped with all latest machinery and cutting edge tools, which assists us in building a reputable image in the market. Our team of experts ensures that each product is manufactured from optimum quality raw material to meet international quality standards.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8506/248506v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8506/248506v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8506/248506v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}