{"name": "Domain Hosting Services",
 "permalink": "domain-hosting-services",
 "crunchbase_url": "http://www.crunchbase.com/company/domain-hosting-services",
 "homepage_url": "http://www.domain-hosting-services.in",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "network_hosting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Best Hosting Company in India",
 "created_at": "Wed Jul 11 10:20:10 UTC 2012",
 "updated_at": "Wed Jul 11 16:04:13 UTC 2012",
 "overview": "\u003Cp\u003EThese high power servers are located in data centers, always connected to the internet and have complete power backup so that the website is always running. India is also in a great hike regarding internet business, for the benefit of the domain hosting services india as well as its clients, complete 24x7 security cover is arranged to monitor the safety of the data center.\u003C/p\u003E\n\n\u003Cp\u003EOne popular web hosting is dedicated server hosting, in which a complete server is leased to a single website of an organization or business, this means exponentially more space and bandwidth than that provided by hosting servers but it is more expensive as compared to cheap hosting service of shared servers. A new form of web hosting service has been developed recently, named as virtual private servers, which means profit for the clients, since they are charged only for the space and bandwidth they used, not for what they could have used. \u003C/p\u003E\n\n\u003Cp\u003EThese are the most popular types of web hosting services that individuals find suitable for their business concerns and other less popular types of web hosting include reseller, clustered, managed etc, all these type of web hosting services combined can be availed at very affordable prices from domain name hosting companies based in India.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.web-hosting-service.in",
    "title": ""}]}