{"name": "Doshi Brothers",
 "permalink": "doshi-brothers",
 "crunchbase_url": "http://www.crunchbase.com/company/doshi-brothers",
 "homepage_url": "http://www.indiamart.com/dbpharma/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "9920112303",
 "description": "We are exporter, importer \u0026 trader ,",
 "created_at": "Fri Apr 05 11:20:59 UTC 2013",
 "updated_at": "Fri Apr 05 11:21:05 UTC 2013",
 "overview": "\u003Cp\u003EThe Doshi Group is amongst the leading large-scale distribution group for pharmaceutical finished formulations in India. An enterprise that began in 1944, every company under the group’s banner is reputed to deliver exclusively to each particular segment of healthcare comprising of chemists, doctors, nursing homes, hospitals and government and private institutions. Moreover, our distribution network is also segregated for branded medicines, generic medicines, vaccines and specialty care medicines, oncology products and  cold-chain products to meet the specific demands in each category and has enabled us to establish a benchmark in standard of service an edge over others.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nHonoring the demand to deliver under any circumstances has been our fundamental commandment. It is with this resolve that Doshi Group goes about fulfilling its duty, playing its part with utmost devotion to deliver the best in the hour of crisis. \u003C/p\u003E\n\n\u003Cp\u003EOur Services:\nAs a large-scale distribution group, we deliver more than 12,000 products from over 150 major Indian and multinational pharmaceutical companies to over 5000 customers across the country and overseas. Our in-house customer relations team ensures effective and fast response to all our major clients, thereby helping us process over 30,000 orders per month, and each delivered within 24 hours.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nEstablishing a large-scale distribution group in pharmaceuticals demands a tough task. It requires more than knowledge and expertise in mere logistics. From storing various drugs under controlled environmental conditions to providing fast and effective response to clients. We have ensured that the infrastructure setup of Doshi Group meets every single criteria on its own.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8568/248568v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8568/248568v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8568/248568v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}