{"name": "Doshi Metal Corporation",
 "permalink": "doshi-metal-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/doshi-metal-corporation",
 "homepage_url": "http://www.indiamart.com/doshimetalcorportation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "doshi-metal-corporation-is-a-reputed-supplier, wholesaler-and-trader",
 "alias_list": null,
 "email_address": "",
 "phone_number": "9819316830",
 "description": "",
 "created_at": "Wed Apr 03 12:53:42 UTC 2013",
 "updated_at": "Wed Apr 03 18:52:47 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1997, we, “Doshi Metal Corportation”, are a reputed ISO 9001:2008 Certified Company engaged in Supplying and Wholesaling range of Pipes \u0026amp; Tubes Fittings,Titanium \u0026amp; Copper Products. Under this range, we are offer Buttweld Pipe Fittings, Forged Pipe Fittings, Steel Plates \u0026amp; Sheets, Copper Fittings \u0026amp; Flanges, Titanium Products, Pipe Flanges, Pipe Flanges and many more. We manufacture our entire range using optimum grade raw material sourced from the authorized dealer pf the market under the supervision of our experienced team of professionals.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nTo carry out all our organization activities in a systematic manner, we have appointed a skilled and experienced team of professionals through varied tough recruitment test conducted by our management team. Being the backbone of our organization, our professionals work in complete coordination with each other as well as with our clients.\u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\nQuality is the main concern of our organization, we strictly adhere to the quality policies and offer a unparalleled range of products. So, all the products offered by us are sourced from the famed vendors of the market who follow all the quality guidelines to manufacture this range as par the International Quality Standards such as STM, BS, IS, DIN, ASME, ANSI, MSS and many other. Each product is stringently examined and tested before being procured from the vendors end to make certain that we are offering a flawless range to our clients.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nSine our inception we are associated with the famed, certified and the most trustworthy vendors of the market, who supports to come up with a commendable range of Pipes \u0026amp; Tubes Fittings and Titanium \u0026amp; Copper Products. All the vendors and dealer from whom we sourced this range, are selected on suggestions of our procuring agents who organize various market surveys and research activities to selected the vendors.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nButtweld Pipe Fittings\nForged Pipe Fittings\nSteel Plates \u0026amp; Sheets\nCopper Fittings \u0026amp; Flanges\nTitanium Products\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0024/7335/247335v2-max-150x150.jpg"],
     [[250,
       65],
      "assets/images/resized/0024/7335/247335v2-max-250x250.jpg"],
     [[450,
       118],
      "assets/images/resized/0024/7335/247335v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}