{"name": "Dotline Web Media Pvt Ltd",
 "permalink": "dotline-web-media-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/dotline-web-media-pvt-ltd",
 "homepage_url": "http://www.dotlinedesigns.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "network_hosting",
 "number_of_employees": 20,
 "founded_year": 2001,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-designing, web-application, web-hosting, multimedia-and-e-commerce-company",
 "alias_list": null,
 "email_address": "links@dotlinedesigns.com",
 "phone_number": "65708461",
 "description": "A professional web design/development .",
 "created_at": "Thu Apr 12 10:09:00 UTC 2012",
 "updated_at": "Sat Apr 14 19:59:09 UTC 2012",
 "overview": "\u003Cp\u003EA professional web design/development company in India offers web Designing in Bangalore, Web Developing bangalore, web hosting, multimedia presentation, search engine optimization, joomla content management, interactive cd presentation bangalore, best web hosting, PHP Web Development Bangalore, e commerce and logo design services for your business at affordable prices.\u003C/p\u003E\n\n\u003Cp\u003EDotline is an established web development company delivering web development services of any complexity to clients worldwide. Being in IT business for over 6 years now Dotline has a strong team of skilled and experienced IT experts. Our customers are companies of all sizes ranging from start ups to large enterprises who realize that they need a professional internet solution to generate revenue streams, establish communication channels or streamline business operations. \u003C/p\u003E\n\n\u003Cp\u003Eour Services includes:\u003C/p\u003E\n\n\u003Cp\u003EWeb Designing\nWe can design for you, the most eye-catching, content rich and navigation friendly website, to put across your messages to your target audience. Our expertise in the latest software and technology enables us to take up the complete process of web development. From strategy development to graphic design to hosting the site\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EWeb Hosting\nThe dotlinedesigns.com, a product site of Dotline Web Media Pvt Ltd., one of the most reliable web solutions company, provides the lowest cost web hosting on it\u0026#8217;s Windows 2000 and Linux 7.2 based servers, with free ms access, ms sql and my sql database support.\u003C/p\u003E\n\n\u003Cp\u003ELogo Designing\nOver the years (since \u0026#8216;96 to be exact) we have made corporate identity design our specialty. After all, a highly effective logo becomes a symbol of your company image, and demonstrates your attention to detail whether it\u0026#8217;s used on your web site, flash animation, advertising or letterhead design.\u003C/p\u003E\n\n\u003Cp\u003EMultimedia Presentations\nWe can manage your project from start to finish, including everything from the design and programming to product packaging. We can design and execute pieces that will make your multimedia presentation experience worry free.\u003C/p\u003E\n\n\u003Cp\u003EE-commerce Solutions\nDotline team will take you step by step through each level of e-Commerce development from secure order processing to final dispatch of goods advising on technology, applications and good practice online trading. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       70],
      "assets/images/resized/0018/3890/183890v2-max-150x150.png"],
     [[171,
       80],
      "assets/images/resized/0018/3890/183890v2-max-250x250.png"],
     [[171,
       80],
      "assets/images/resized/0018/3890/183890v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "No: 344, 1st foor, 14th cross, ",
    "address2": "2nd block, Jayanagar",
    "zip_code": "560011",
    "city": "Bangalore",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}