{"name": "DoxOut",
 "permalink": "doxout",
 "crunchbase_url": "http://www.crunchbase.com/company/doxout",
 "homepage_url": "http://doxout.com",
 "blog_url": "http://www.doxout.com/blog.html",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 7,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cross-platform-office-suite, integrated-with-cloud, post-pc-era-solution, mobile-as-pc",
 "alias_list": null,
 "email_address": "gligord@gmail.com",
 "phone_number": "+0038972234456",
 "description": "The Ultimate Office Suite",
 "created_at": "Mon Jul 09 12:37:38 UTC 2012",
 "updated_at": "Mon Jul 09 16:13:21 UTC 2012",
 "overview": "\u003Cp\u003EDoxOut is the most extensive office suite on the World.\u003C/p\u003E\n\n\u003Cp\u003EDoxOut is a spin off from CreationPal. \u003C/p\u003E\n\n\u003Cp\u003ECreationPal is a software development company with an expertise in cross platform mobile development integrated with big data bases. Throughout the last two years, the company developed the first cross platform fitness mobile app in the World – SportyPal.  SportyPal received number of professional accolades - Best Fitness App on Android 2009 and one of the three best apps for Windows Mobile in 2010. \u003C/p\u003E\n\n\u003Cp\u003EBased on these achievements, the company started the development of DoxOut, the first cross platform office suite app integrated with cloud, developed with the same code base. \u003C/p\u003E\n\n\u003Cp\u003EThe technology behind DoxOut is revolutionary. It is based on HTML5 and own components and enables cross platform code sharing by 90%, while dramatically decreasing development time. Unlike other HTML5 based packages, the performance of the technology is indistinguishable from native performance - unrestricted fast scrolling and fast clicking anywhere.  And the company is capable of delivering a market ready product in a short time span.  \u003C/p\u003E\n\n\u003Cp\u003EWhen fully developed, DoxOut will offer complete office solution for smartphones, tablets and PCs (Windows, Linux and ChromeOS) accessible in offline or online mode, with a unified look and feel across all platforms. DoxOut is integrated with cloud, too. \u003C/p\u003E\n\n\u003Cp\u003EThe consumers will have a universal app that they can utilize on every device they own, while seamlessly synchronizing files through the public cloud. The business users and companies will be able to easily integrate with a private cloud or public cloud, which will increase productivity and decrease costs significantly.  \u003C/p\u003E\n\n\u003Cp\u003EDoxOut has a potential to utilize the advanced hardware possibilities of today’s smartphones and especially tablets, and help them transform into serious PC competitors as we enter the post PC era. \u003C/p\u003E\n\n\u003Cp\u003EThe market, on the other hand, is clearly shifting towards the mobile world. The sale stats are saying it all – PCs are outsold by smartphones and tablets. \u003C/p\u003E\n\n\u003Cp\u003EWindows may be still a dominant player on the PC market, but PC sales are less than half of the total sales of computers today. There is iOS, and there is Android. \u003C/p\u003E\n\n\u003Cp\u003EDoxOut is a single universal cross platform office solution.\u003C/p\u003E\n\n\u003Cp\u003Eit’s integrated with cloud and works as a standalone app, too. It can be installed on the device or accessed through the web - It fits into any user scenario. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       53],
      "assets/images/resized/0019/9612/199612v2-max-150x150.png"],
     [[250,
       88],
      "assets/images/resized/0019/9612/199612v2-max-250x250.png"],
     [[450,
       159],
      "assets/images/resized/0019/9612/199612v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "Google Docs",
      "permalink": "google-docs-2",
      "image": null}},
   {"competitor":
     {"name": "Quick Office",
      "permalink": "quick-office",
      "image": null}},
   {"competitor":
     {"name": "Documents To Go",
      "permalink": "documents-to-go",
      "image": null}},
   {"competitor":
     {"name": "Microsoft Office",
      "permalink": "microsoft-office",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "DoxOut HQ",
    "address1": "Marks i Engels 1/5 - 17",
    "address2": "",
    "zip_code": "1000",
    "city": "Skopje",
    "state_code": null,
    "country_code": "MKD",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        102],
       "assets/images/resized/0019/9611/199611v2-max-150x150.png"],
      [[250,
        171],
       "assets/images/resized/0019/9611/199611v2-max-250x250.png"],
      [[450,
        308],
       "assets/images/resized/0019/9611/199611v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}