{"name": "Dreams International",
 "permalink": "dreams-international",
 "crunchbase_url": "http://www.crunchbase.com/company/dreams-international",
 "homepage_url": "http://www.indiamart.com/dreamsinternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "dreamsinternational@tradepassport.org",
 "phone_number": "9212701117",
 "description": "Wholesaler and Supplier",
 "created_at": "Fri Apr 05 11:31:33 UTC 2013",
 "updated_at": "Fri Apr 05 11:31:37 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2003, at Delhi (India), we, “Dreams International”, are ranked as the distinguished wholesaler and supplier of a comprehensive assortment of Radha Krishna Statue, Lord Ganesha Statue, Lord Krishna Statue, Shankar Parvati Statue, Lord Durga Statue, Lord Budha Statue, Luxmi Ganesh Statue, Shirdi Sai Baba Statue, Laughing Buddha Statue, Maa Saraswati Statue, Ram Hanuman Statue, Lord Vishnu Statue, Decorative Bowl and Decorative Gift Item.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nAs a leading wholesaler and supplier we are offering our clients a quality proven and durable range of Radha Krishna Statue, Lord Ganesha Statue, Lord Krishna Statue, Shankar Parvati Statue, Lord Durga Statue, Lord Budha Statue, Luxmi Ganesh Statue, Shirdi Sai Baba Statue, Laughing Buddha Statue, Maa Saraswati Statue, Ram Hanuman Statue, Lord Vishnu Statue, Decorative Bowl and Decorative Gift Item.\u003C/p\u003E\n\n\u003Cp\u003EResearch And Development:\nTo match steps with the fast changing trends and needs of the industry, our company has established distinct unit that looks after the work of research and development. The studies and suggestions of this unit help us in developing and designing our products with innovative features that are more appropriate for contemporary industrial and commercial requirements.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nUnaffected, reliable and quality products are the main factors to earn the trust and support of our valued customers. With a rich vendor base, we are capable of offering Radha Krishna Statue, Lord Ganesha Statue, Lord Krishna Statue, Shankar Parvati Statue, Lord Durga Statue, Lord Budha Statue, Luxmi Ganesh Statue, Shirdi Sai Baba Statue, Laughing Buddha Statue.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\nWe have emerged as a leading wholesaler and supplier of superior quality range of Radha Krishna Statue, Lord Ganesha Statue, Lord Krishna Statue, Shankar Parvati Statue, Lord Durga Statue, Lord Budha Statue, Luxmi Ganesh Statue, Shirdi Sai Baba Statue, Laughing Buddha Statue, Maa Saraswati Statue, Ram Hanuman Statue\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8584/248584v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8584/248584v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8584/248584v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}