{"name": "DS Patel",
 "permalink": "ds-patel",
 "crunchbase_url": "http://www.crunchbase.com/company/ds-patel",
 "homepage_url": "http://www.indiamart.com/dspatelandco/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rough-teak-sawn-timber, teak-sawn-timber, ash-sawn-timber, teak-wood-moulding",
 "alias_list": null,
 "email_address": "dspatelandco@tradepassport.org",
 "phone_number": "8600994372",
 "description": "The D.S.Patel \u0026 Co. are one of the disti",
 "created_at": "Thu Apr 04 06:38:52 UTC 2013",
 "updated_at": "Thu Apr 04 06:38:57 UTC 2013",
 "overview": "\u003Cp\u003ESince our inception in the year 1964, we, “D. S. Patel \u0026amp; Co.” are one of the highly praised manufacturers, suppliers and traders of the finest quality range of Timber and Teak Wood Products. Under this range, we offer a remarkable array of Sawn Timber, Rough Teak Sawn Timber, Teak Sawn Timber,Ash Sawn Timber, Teak Wood Moulding, Teak Wood Bidding, Teak Wood Cut Size, African Teak Wood among others. These Timber Plywoods are manufactured by our skilled artisans in order to cater to the diverse requirements of the customers.\u003C/p\u003E\n\n\u003Cp\u003EQuality Standards:\nWe leave no scope of criticism, as the range of products offered by us is flawless in nature. These products are tested on some well-defined parameters before dispatch in order to deliver a defect-free range of products to the customers. Our engineers and technocrats execute the entire quality checks and tests with utmost precision and perfection. Besides, we have a qualified team of quality controllers to keep a strict check on the execution of entire production processes. These professionals closely examined at every stage of production.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOwing to the hard work, sincerity and efforts of our team-mates, we have established ourselves as a prominent name in the industry. These professionals hold immense expertise in their respective fields of specialisation. Their in-depth knowledge, understanding and experience has always assisted us in executing the production tasks with excellence and perfection.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have built a highly advanced infrastructure unit sprawled across a large area. Our infrastructure set up is well equipped with some of the advanced machinery and equipment. We employ latest technology and make use of advanced production techniques in manufacturing the entire range of products. Moreover, we keep on upgrading these products as per the ever-changing market trends so as to offer a highly efficient array of products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe consistently strive to fulfil the diverse needs of the customers so as to be their foremost choice. Our transparent business policies, persistent efforts, ethics and standards help us in achieving the set goals and objectives of the organisations.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nCostaria Rough Square\nRound Wooden Log\nTimber Product\nTeak Wood \u0026amp; Log\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7592/247592v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/7592/247592v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/7592/247592v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}