{"name": "Durvankur Creations",
 "permalink": "durvankur-creations",
 "crunchbase_url": "http://www.crunchbase.com/company/durvankur-creations",
 "homepage_url": "http://www.indiamart.com/durvankurcreations/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ladies-kurtisladies, leggingladies, salwarladies, kolhapuri-chappalgents, kolhapuri-chappal",
 "alias_list": null,
 "email_address": "durvankurcreations@tradepassport.org",
 "phone_number": "9833764502",
 "description": "Gents \u0026 Ladies Kolhapuri Chappals.",
 "created_at": "Thu Apr 04 06:07:43 UTC 2013",
 "updated_at": "Thu Apr 04 06:07:49 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Durvankur Creations”, we are a renowned manufacturer and supplier Gents \u0026amp; Ladies Kolhapuri Chappals. In this range, we offer Ladies Kolhapuri Biscuit Chappal, Ladies Kolhapuri Chappal, Ladies Kolhapuri with Regular Shape Chappal, Ladies Kolhapuri with T Shape flat Chappal, Ladies Kolhapuri Biscuit Paan Chappal, Ladies Flat Kolhapuri Chappal, Ladies Kolhapuri with Bandu Open Effect Chappal and Ladies Kolhapuri with Double Stitched Effect Chappal. We also offer Ladies Kolhapuri Paperkapsi Chappal, Ladies Kolhapuri with Pressed Yellow Nacchi Mayuri Chappal, Ladies Kolhapuri with Pressed Yellow Straight Shaped Chappal, Ladies Kolhapuri with Pressed Yellow Clock Chappal and Ladies Kolhapuri with Pressed Punching Chappal. \u003C/p\u003E\n\n\u003Cp\u003EOur Manpower: \nOur diligent and adroit professionals are well aware of the changing market trends and enable us to meet the variegated demands of our clients in an effective manner. They work in close coordination of each other as well as with the clients to gauge their variegated demands and fulfil the same. Our professionals are also provided with regular training in order to remain abreast of the changing market trends. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance: \nQuality has been the foremost aspect of our organization and we ensure that all our products are manufactured in compliance with the industry standards. Quality controllers at our premise check the whole processes including procuring, manufacturing, storage \u0026amp; packaging to assure we follow ethical practices throughout different stages. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure: \nSpread across a sprawling area, our infrastructure houses facilities for designing, manufacturing, quality testing, storage and packaging of our Kolhapuri Chappals for gents and ladies. We have installed technologically advanced machines in all these units that allow us in smooth \u0026amp; streamlined production of our range. Regular upgradation of these machines allows us in maintaining high production capability of our production unit. Due to our sophisticated facilities, we have been able to offer bulk range of products and thereby able to build a vast customer base across the country. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction: \nOur in-depth domain knowledge and skilled professionals have allowed us to meet the variegated demands of our clients in an effective manner. We also offer customized range of Kolhapuri Chappals for men \u0026amp; women that act as a catalyst to maximize the satisfaction level of our clients. As per the client-centric policy, we assure to offer qualitative products, cost effective prices, timely delivery and easy payment options. All these factors have enabled us to become the foremost choice of our clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Products: \nLadies Kolhapuri with Double Stitched Effect Chappal \nLadies Kolhapuri Paperkapsi Chappal \nLadies Kolhapuri with Pressed Yellow Nacchi Mayuri Chappal Ladies Kolhapuri with Pressed Yellow Straight Shaped Chappal \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       123],
      "assets/images/resized/0024/7564/247564v2-max-150x150.jpg"],
     [[250,
       205],
      "assets/images/resized/0024/7564/247564v2-max-250x250.jpg"],
     [[250,
       205],
      "assets/images/resized/0024/7564/247564v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}