{"name": "Eagle Polymers",
 "permalink": "eagle-polymers",
 "crunchbase_url": "http://www.crunchbase.com/company/eagle-polymers",
 "homepage_url": "http://www.indiamart.com/eaglepolymers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "l-d--vacuum-bag, l-d--foam-roll, l-d--foam-sheet, l-d--foam-bag-and-l-d--shopping-bag, l-d-p-e--liner-bag, l-d-p-e--garbage-bag-and-others-",
 "alias_list": null,
 "email_address": "eaglepolymers@tradepassport.org",
 "phone_number": "9712235337",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Fri Apr 05 08:13:24 UTC 2013",
 "updated_at": "Fri Apr 05 08:13:27 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2009, we, “Eagle Polymers”, are a renowned firm engaged in manufacturing, supplying and exporting a comprehensive range of L.D. Foam Bag, L.D. Bag, and Poly Bag. Products offered in this range are L.D. Vacuum Bag, L.D. Foam Roll, L.D. Foam Sheet, L.D. Foam Bag and L.D. Shopping Bag, L.D.P.E. Liner Bag, L.D.P.E. Garbage Bag and others. Our range of products is manufactured using high-grade quality polyethylene, procured from authentic sources of the industry, in strict compliance with international quality standards. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWith the passage of time, we have been able to serve our clients in the best possible manner owing to the constant and dedicated efforts of our qualified professionals. These professionals work in absolute sync with each other, so as to meet the requirements of the clients in a timely manner. Moreover, our efficient production managers make optimum use of all the resources that are available, so as to deliver a flawless range of products to our esteemed customers. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality-centric organization, we are known for delivering to our clients, a remarkable range of high-grade quality products which are manufactured using the optimum quality raw material, procured from some of the most trusted and reliable vendors of the industry. These professionals make use of the latest technology and advanced machinery, in order to manufacture these products, in compliance with international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nIn order to serve our clients with a flawless range of products, we have in-built a contemporary infrastructure to facilitate this process which is well segregated into various units, in order to manufacture and supply an excellent range of products. Moreover, these products are exclusively designed by a team of qualified professionals, keeping in view the quality and durability of these products. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have always been a customer-centric organization which is engaged in maximizing the contentment level of our esteemed patrons by offering a wide range of highly useful products. These products are manufactured using high-grade quality raw material, which is procured from authentic vendors of the industry. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nL.D. Vacuum Bag, L.D. Foam Roll, L.D. Foam Sheet, L.D. Foam Bag and L.D. Shopping Bag, L.D.P.E. Liner Bag, L.D.P.E. Garbage Bag and others. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8420/248420v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8420/248420v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8420/248420v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}