{"name": "Earn \u0026 Play",
 "permalink": "earn-play",
 "crunchbase_url": "http://www.crunchbase.com/company/earn-play",
 "homepage_url": "http://eandplay.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "pablo@eandplay.com",
 "phone_number": "",
 "description": "Brand Marketing Through Gamification ",
 "created_at": "Mon Sep 24 18:33:44 UTC 2012",
 "updated_at": "Fri Oct 19 02:27:52 UTC 2012",
 "overview": "\u003Cp\u003EEarn and Play is the first mobile app that connects brands with consumers at the store shelf. It’s the first initiative that can guarantee an increase in sales, and provides a 1200% greater brand message recall and a 111% lift in brand recall from a study published by the College of Wharton.  Procter and Gamble has provided irrefutable evidence that this type of initiative can provide a global 6% lift in sales.\u003C/p\u003E\n\n\u003Cp\u003EPablo Arellano (http://www.linkedin.com/pub/pablo-arellano-jr/4/161/663) and Colin Klayer (http://www.linkedin.com/in/klayerc) first met seven years ago while attending Northern Kentucky University; Pablo was studying Marketing and Colin was the first person to graduate from NKU’s Entrepreneurship program. They were co-presidents of NKU’s Collegiate Entrepreneurs’ Organization (CEO) Club, where they grew the organization to become one of the largest on campus and brought in speakers such as Terry Atwater (Warren Buffet’s apprentice) and Jack Cassidy (CEO, Cincinnati Bell). After graduation, Pablo focused on his position as the first NKU undergrad to become an Assistant Brand Manager at Procter and Gamble and then on launching several tech start-ups (WouldURather and YoDeal–sold to Reach Magazine–and most recently, American Beauty Association), while Colin joined a Cincinnati Startup called Zipscene where he worked as a Product Marketer, Product Manager and ultimately the Director of Operations. Last year, the pair began meeting on a weekly basis to brainstorm start-up ideas and out of hundreds of ideas, Earn and Play was born. They took the idea to NKU’s Start-Up Weekend where they were able to recruit several key players and have since brought on additional team members.\u003C/p\u003E\n\n\u003Cp\u003EPablo is the innovator and idea generator. He provides guidance and direction for the rest of the team. Colin brings his experience developing new products, bringing ideas to life and scaling organizations to ensure success for Earn and Play.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/2784/212784v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0021/2784/212784v2-max-250x250.png"],
     [[450,
       450],
      "assets/images/resized/0021/2784/212784v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Pablo",
      "last_name": "Arellano",
      "permalink": "pablo-arellano",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}