{"name": "Earthenhive Architects",
 "permalink": "earthenhive-architects",
 "crunchbase_url": "http://www.crunchbase.com/company/earthenhive-architects",
 "homepage_url": "http://www.earthenhive.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 12,
 "founded_year": 2009,
 "founded_month": 3,
 "founded_day": 28,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "architects-and-anterior-designs, turnkey-solutions",
 "alias_list": null,
 "email_address": "studio@earthenhive.com",
 "phone_number": "",
 "description": "Architects and Interior Designs",
 "created_at": "Sat Apr 04 13:04:30 UTC 2009",
 "updated_at": "Tue Jun 12 16:06:17 UTC 2012",
 "overview": "\u003Cp\u003EThe company undertakes the design and development of Eco friendly Architecture and Interior design.\u003C/p\u003E\n\n\u003Cp\u003EEco friendly architecture is a process which is incorporated into every stage of the construction project, from start to finish. To achieve genuine eco-friendly, green architecture principles are upheld from design to construction.\u003C/p\u003E\n\n\u003Cp\u003EWe Emphasize on:\nEnergy Efficiency- Green designers study how to heat, light and design in ways that are ecologically friendly to the environment and non-toxic to people. Design of walls and floors and their connection to indoor air quality is an important feature of green design. \nRecycling- Green designers use recycled interior design products where possible. Product lifespan is also important in eco-design.\nSustainability- Unsustainable practices of consumption use up resources and leave waste behind. Sustainability, in both design and development, emphasizes renewable resources.\u003C/p\u003E\n\n\u003Cp\u003EThe Services We Provide:\nEvery design project is unique. We take the time to discuss your individual design needs and provide an accurate estimate based on your site conditions and the complexity of the design.\nSince we are a relatively small architectural firm, we are able to maintain minimal overhead costs and we pass these savings along to our clients. As such, we will modify our fees and services based on your specific building requirements.  Below are a few examples of our fees based on commonly requested services by our clients.\nWe are happy to provide estimates for your individual building project. Please do not hesitate to contact us to discuss our fees or if you have any questions about budgeting for an architect\u0026#8217;s services. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Earthenhive Architects",
    "address1": "No.37 SriBhooma, 17th cross,",
    "address2": "Malleshwaram",
    "zip_code": "560055",
    "city": "Bangalore",
    "state_code": null,
    "country_code": "IND",
    "latitude": 13.014823,
    "longitude": 77.6503104}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}