{"name": "Earth Infosoft",
 "permalink": "earth-infosoft",
 "crunchbase_url": "http://www.crunchbase.com/company/earth-infosoft",
 "homepage_url": "http://www.EarthInfosoft.in",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 200,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-development-services-in-delhi, web-promotion-services-in-delhi, ecommerce-web-site-design-in-india, web-development-services-in-india, web-site-promotion-companies-in-delhi, software-development-companies, web-designing-companies-in-delhi, web-program",
 "alias_list": null,
 "email_address": "info@earthinfosoft.in",
 "phone_number": "+91-9311494845",
 "description": "Offering SEO, web designing services.",
 "created_at": "Sat Nov 20 09:41:01 UTC 2010",
 "updated_at": "Tue Nov 23 15:50:55 UTC 2010",
 "overview": "\u003Cp\u003EEarth Infosoft conceptualized in the 2006, and since then has kept a finger on the pulse of what\u0026#8217;s new on the web . We are here to provide complete business solutions to all organizations and are prepared and educated to better provide a face for your business on the Internet. Providing a unique presence on the net is a challenge for any company whether small or big. We at Earth Infosoft offer a complete web design service from initial consultation through to design, publication and periodic overhauls and maintenance. Global Solutions specializes in getting small to medium sized businesses onto the Internet. We do not try to target our services to millions of different people; instead, we design and provide a powerful Internet presence for small to medium sized companies looking to establish a web site.\u003C/p\u003E\n\n\u003Cp\u003EEarth Infosoft is a prominent and one of the leading companies of India in the ever-expanding fields of Web Design, Web Script And Application, Web Programming, Software Development, E-Commerce Website, Search Engine Optimization(SEO), Search Media Optimization (SMO) and submission and internet marketing, readymade web site packages, Internet Advertising, search engine and web directory solutions, portal development, Readymade website templates, link exchange services, Data Entry, BPO, Data Conversion and customer online support solutions. We deal with our clients by understanding their specific needs and providing solutions that enable them to cope with the present day\u0026#8217;s competitive and volatile business environment. Earth Infosoft has taken a leadership role in offering Total IT Solutions to Business Organizations all over the world. The ultimate goal is to provide you with solutions that are unique, functional and gives you value for your money. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       105],
      "assets/images/resized/0011/1008/111008v2-max-150x150.jpg"],
     [[247,
       173],
      "assets/images/resized/0011/1008/111008v2-max-250x250.jpg"],
     [[247,
       173],
      "assets/images/resized/0011/1008/111008v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "201, E-67, Laxmi Market ",
    "address2": "Opp. Canara Bank, Munirka ",
    "zip_code": "110067",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}