{"name": "Earth Car Wash",
 "permalink": "earth-car-wash",
 "crunchbase_url": "http://www.crunchbase.com/company/earth-car-wash",
 "homepage_url": "http://earthcarwash.com",
 "blog_url": "http://earthcarwash.com/news-blog-waterless-car-wash-detailing/",
 "blog_feed_url": "",
 "twitter_username": "EarthCarWash",
 "category_code": "web",
 "number_of_employees": 7,
 "founded_year": 2010,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-car-wash, mobile-auto-detailing, car-wash-that-comes-to-you, car-detailing-at-home, book-a-mobile-car-wash-online",
 "alias_list": null,
 "email_address": "sales@earthcarwash.com",
 "phone_number": "(877) 557-7737",
 "description": "Mobile Car Wash and Detailing",
 "created_at": "Thu Nov 22 19:15:40 UTC 2012",
 "updated_at": "Wed Dec 12 07:52:53 UTC 2012",
 "overview": "\u003Cp\u003EEarth Car Wash started in the summer of 2010 in Los Angeles, as a project born from the owner’s passion for cars, interest in the environment and an interest in the car wash and detailing industry.\nEarth Car Wash, a waterless Eco-friendly car wash \u0026amp; detailing service was developed to help reduce water consumption and improve car detailing services. We provide car wash \u0026amp; detailing at our Earth Car Wash locations and also for the customer’s convenience, we offer mobile services at your home or office.\nEarth Car Wash is qualified to deal with individual car owners, large companies, car rental companies and dealerships.\nEarth Car Wash is a young, energetic and creative team that does everything from a basic car wash, deluxe details to headlights restoration. To prove how confident we are about our services, and to encourage you to try Earth Car Wash, we encourage you to try Earth Car Wash: we offer “100% customer satisfaction”. This ensures that if you are not happy or fully satisfied with our services, we will refund you 100%.\nOn our customer friendly website, you can create, change or cancel an appointment. As an added convenience we also offer mobile service, for which you can choose to pay cash or pay by credit card on our website.\nThank you for your interest in Earth Car Wash!\nWe believe that the car wash industry needs changing due to the water shortage, and to the environmental damage we can cause by not carrying about how are our cars are washed. When you choose Earth Car Wash feel assured we are helping you contribute in being Eco-friendly.\nPeople are busier than ever, and time is becoming more expensive then what we can afford. That is why mobile businesses and, in our case, mobile car washes became faster and better than regular car washes. You don’t have to spend time at your corner car wash, or drive to one. You can now work, relax or enjoy time with your family, while Earth Car Wash can take a good care or your car.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/1727/221727v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0022/1727/221727v2-max-250x250.png"],
     [[250,
       250],
      "assets/images/resized/0022/1727/221727v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Los Angeles Office",
    "address1": "",
    "address2": "",
    "zip_code": "90046",
    "city": "Los Angeles",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 34.1147313,
    "longitude": -118.3637264}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}