{"name": "Earth Solutions Pvt Ltd",
 "permalink": "earth-solutions-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/earth-solutions-pvt-ltd",
 "homepage_url": "http://www.earthsolutions.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 20,
 "founded_year": 2009,
 "founded_month": 11,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "contact@e-arth.in",
 "phone_number": "",
 "description": "",
 "created_at": "Wed Jun 16 10:19:27 UTC 2010",
 "updated_at": "Fri Dec 30 19:30:19 UTC 2011",
 "overview": "\u003Cp\u003E\u0026#8220;Arth\u0026#8221; in Sanskrit means \u0026#8221;purpose, cause, motive, meaning, notion and finance.\u0026#8221; We have chosen our name very carefully as we strive to do meaningful business and provide solutions using electronic medium.\u003C/p\u003E\n\n\u003Cp\u003EeArth Solutions is a one stop shop for all your web needs. eArth Solutions team of experienced and expert software engineers are ready to work with you to achieve your business goals. Our unique competence in various technologies enables us to deliver integrated, scalable, and robust solutions with the optimal cost/performance ratio.\u003C/p\u003E\n\n\u003Cp\u003EAt eArth Solutions, Both IT services and product development are integral part of the company\u0026#8217;s success. Our services include technology consulting, software design, development and delivery for our customers. Product development helps build technical expertise, innovations and the required culture.\u003C/p\u003E\n\n\u003Cp\u003EeArth Solutions constantly works towards improving and enhancing internet, embellish it with inventive, eye-catching and user friendly web pages and sites. We help our clients, to communicate better, and find the right strategy for their business needs by offering custom web solutions. In Web Development, we offer services such as Website Designing, Web Apps and Enterprise Portal development, Database designing, Domain name registration and website hosting and open source software customization.\u003C/p\u003E\n\n\u003Cp\u003EMobile applications are the future for today\u0026#8217;s businesses. Our Mobile Application development team has developed high quality mobile apps with customized user interfaces for iPhone, Blackberry and Google Android.\u003C/p\u003E\n\n\u003Cp\u003EWith more and more businesses competing for Internet user attention, it is becoming increasingly hard to appear among the top in search results. Earth Solutions internet marketing includes SEO, SEM, SMO, SMM and analytics.\u003C/p\u003E\n\n\u003Cp\u003EeArth Solutions  is focused on creating engaging, quality, usable Social Apps for the Web, Facebook, Twitter and other similar environments.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       125],
      "assets/images/resized/0009/1030/91030v2-max-150x150.png"],
     [[150,
       125],
      "assets/images/resized/0009/1030/91030v2-max-250x250.png"],
     [[150,
       125],
      "assets/images/resized/0009/1030/91030v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Co-Founder",
    "person":
     {"first_name": "Avinash",
      "last_name": "Gavali",
      "permalink": "avinash-gavali",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}