{"name": "Earthtronics",
 "permalink": "earthtronics",
 "crunchbase_url": "http://www.crunchbase.com/company/earthtronics",
 "homepage_url": "http://www.earthtronics.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Wind Turbine Producer",
 "created_at": "Tue Jun 16 20:07:31 UTC 2009",
 "updated_at": "Tue Jun 16 20:12:09 UTC 2009",
 "overview": "\u003Cp\u003EEarthronics develops a variety of products and technologies that address energy demand, from lighting to alternative energy products to medical equipment.  The company is based in the Michigan Alternative and Renewable Energy Center (MAREC), a research and development facility on the shores of Lake Michigan. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       28],
      "assets/images/resized/0004/8899/48899v1-max-150x150.png"],
     [[228,
       44],
      "assets/images/resized/0004/8899/48899v1-max-250x250.png"],
     [[228,
       44],
      "assets/images/resized/0004/8899/48899v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Headquarters",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": "MI",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [{"description": "Earthtronics Supplies Wind Turbines for Roofs Through ACE Hardware",
    "stoned_year": 2009,
    "stoned_month": 6,
    "stoned_day": 8,
    "source_url": "http://www.greentechmedia.com/articles/read/earthtronics-to-launch-small-wind-turbines-for-the-rooftops",
    "source_text": "\r\nIt looks like a giant wheel and is designed to turn breeze into power.\r\n\r\nIt's a small wind turbine that its maker, EarthTronics, hopes will entice more consumers into becoming their own wind power producers.\r\n\r\nThe Muskegon, Mich.-based company plans to launch the product this fall by selling it at the ACE Hardware chain, said Brian Levine, vice president of business development. The company is calling the product Honeywell Wind Turbine under a brand licensing deal with Honeywell.\r\n\r\nThe challenges of designing attractive and affordable small wind turbines include making them light weight and capable of turning light wind into power. Being able to get the turbine to generate power at low wind speeds is particularly critical for small wind-turbine makers because many of their potential customers are located in urban and suburban settings where trees and buildings could easily block wind.\r\n\r\nThe 2-kilowatt Honeywell wind turbine could start producing power with a 2-mile-per-hour wind, lower than competing products, Levine said. The upper limit is 45 miles per hour.\r\n\r\nThe circular turbine has a six-foot diameter and weighs 95 pounds. Unlike many other small wind turbines that designed to rise from the ground, the Honeywell turbine could be mounted on the rooftops.\r\n\r\nRooftop wind turbine sales represent less than 0.002 percent of the small wind market in the United States, but more companies plan to launch building-mounted products, said the American Wind Energy Association (AWEA)\r\n\r\nIt could generate about 2,000 kilowatt hours of electricity per year, Levine said. Of course, how much power a wind turbine can generate depends largely on locations and operating conditions.\r\n\r\n\"It'll start to operate much earlier and get to prime production at the level when other technologies\" are just starting, Levine said.\r\n\r\nImad Mahawili, the former executive director of the Michigan Alternative and Renewable Energy Research Center at the Grand Valley State University, founded EarthTronics and is the company's chief technology officer. EarthTronics' investors include large wind farm operators, said Levine, who declined to disclose names or the amount of funding.\r\n\r\nThe startup, which was started in 2007 and incorporated in 2008, is entering the small wind turbine market at a time when the market in the United States is expected to soar.\r\n\r\nThe AWEA said the cumulative installed capacity would grow from 80 megawatts in 2008 to 1,700 megawatts in 2013. Small wind turbines are rated at 100 kilowatts or less, the AWEA said. In 2008, the industry installed 17.3 megawatts worth of small wind ($77 million in sales), up 78 percent from 2007.\r\n\r\nFederal and state incentives are making small wind systems more attractive, though the equipment is by no means cheap to own and maintain. Overcoming aesthetic issues and other complaints by neighbors also could prevent small wind turbines from becoming popular.\r\n\r\nThe federal stimulus bill, the American Recovery and Reinvestment Act passed earlier this year, has lifted a $4,000 cap for consumers and businesses investing in and owning small wind turbines. Now they can take get an uncapped 30 percent investment tax credit, allowing people to recoup 30 percent of the installation costs.\r\n\r\nA traditional wind-turbine design features a few blades around a central hub that houses the gearbox that contains the power generator. This design is often seen in large turbines in wind farms that generate electricity for utilities.\r\n\r\nThe Honeywell turbine has no gearbox in the center. The wind power turns the magnets located around the frame to generate power, a designed called \"direct-drive\" generator that gets rid of the heavy and costly gearbox in the middle. The design reduces the number of components and allows the turbine to start generating power with low wind.\r\n\r\nThe direct-drive generator, or gearless wind turbine, isn't a new concept, and many makers of large and small wind turbines are developing products with that design. Siemens began field-testing gearless wind turbines last year to see if they would be a good fit for utility-scale power generation.\r\n\r\nQuiet Revolution, a London-based startup, also has developed a small wind turbine with a direct-drive generator. The AWEA lists on its website some of the U.S.-based makers of gearless wind turbines.\r\n\r\nSmall wind turbine developers also have created novel designs that also are supposed to produce power at low wind speeds and operate with minimal noises. Private equity investors have taken a keen interest in the small wind market and invested in companies such as Reno-based Mariah Power (Check out its Windspire turbine) and Wind Energy in Kentucky.\r\n\r\nEarthTronics has priced the turbine at $4,500. Installation costs are extra and could be as much as $1,500, Levine said. The company is carrying out a training program to train contractors and electricians on installing its product, he said.\r\n",
    "source_description": "EarthTronics Brings Small Wind to Rooftops",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Earthtronics",
      "permalink": "earthtronics"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}