{"name": "Eastern Biotech and Life Sciences",
 "permalink": "eastern-biotech-and-life-sciences",
 "crunchbase_url": "http://www.crunchbase.com/company/eastern-biotech-and-life-sciences",
 "homepage_url": "http://www.easternbiotech.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": 100,
 "founded_year": 2005,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "paternity, newborn, genetics, ancestry, dna, biotech, medical, healthcare",
 "alias_list": null,
 "email_address": "pankaj@easternbiotech.com",
 "phone_number": "0097143692061",
 "description": "Predictive Healthcare in UAE",
 "created_at": "Thu May 13 20:03:29 UTC 2010",
 "updated_at": "Fri May 14 19:53:08 UTC 2010",
 "overview": "\u003Cp\u003EEastern Biotech \u0026amp; Life Sciences is a UAE based Biotechnology Company under the Dubai Biotechnology and Research Park, DUBIOTECH, Dubai. The company has a vision to prevent morbidity and mortality among individuals and families with or at risk of genetic, congenital, and/or familial disorders. We want to provide quality screening, education and family-centered comprehensive services for the Middle Eastern people.\u003C/p\u003E\n\n\u003Cp\u003EBackground\nThe company brings over 50 years of combined healthcare experience through its directors. The board of Directors is headed by Dr. F. M. Badiuddin, MBBS, FRCS, a surgeon with an active practise in Laparoscopic and Bariatic Surgery. Dr. Justine Badiuddin is a practising Gynaecologist. Mr. Junaid Faruq, Director Marketing, is a graduate in Biotechnology from the Dublin City University, Dublin Ireland. Dr. Sanjida Ahmed, Research Director, is a Ph.D in Cell Biology from Yokohama City University, Japan. We are currently operating through an office out of the Dubai Media City.\u003C/p\u003E\n\n\u003Cp\u003EPresent Scenario\nWe understand that biotechnology is a growing and evolving field and one of our prime objectives is to educate and inform the people of the usefulness of our products and services which we bring to the region through our international partners. The unique feature of Eastern Biotech\u0026#8217;s approach is its easy access to the people, and its ability to interact directly with the end users. This enables our clients to make independent decisions about their health, empowering them to proactively take control of their health needs, and assist them in the process of changing their lifestyles to prevent the onset of some of the most common illnesses of our times.\u003C/p\u003E\n\n\u003Cp\u003EOur product line is a comprehensive portfolio of Genetic Tests that covers the areas of:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* DNA Relationship Tests\n* Cancer Safe Tests\n* Genetic Tests for Cancer\n* Cytogenetic Tests\n* Genomic Profiling\n* Personal Genome Scan\n* Gene Based Diagnosis for Common Diseases\n* Detection of Pathogens by DNA Macro-Chip\n* Neonatal Screening 10. Pre Marital screening\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EWe have built up an excellent rapport with the medical professionals and clinics throughout the United Arab Emirates and surrounding Gulf Countries.\u003C/p\u003E\n\n\u003Cp\u003EFuture Objective\nThe long term objective of Eastern Biotech is to make a significant contribution to finding Biotechnological solution to the modern day diseases which are going to become a major health issue of the future i.e. Diabetics and Obesity. Initially, we will conduct the epidemiological and clinical research which will be followed by genetic research on these diseases in the years to come. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0008/7064/87064v2-max-150x150.jpg"],
     [[250,
       50],
      "assets/images/resized/0008/7064/87064v2-max-250x250.jpg"],
     [[300,
       60],
      "assets/images/resized/0008/7064/87064v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.easternbiotech.com",
    "title": "DNA Testing Services in Middle East"}]}