{"name": "EBS Marketing",
 "permalink": "ebs-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/ebs-marketing",
 "homepage_url": "http://ebsmarketing.biz/",
 "blog_url": "http://ebsmarketingblog.co.uk",
 "blog_feed_url": "",
 "twitter_username": "ebsmanchester",
 "category_code": "other",
 "number_of_employees": 70,
 "founded_year": 2011,
 "founded_month": 1,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-marketing, facebook-marketing, seo, site-design",
 "alias_list": null,
 "email_address": "ebsmarketingmanchester@gmail.com",
 "phone_number": "0161 212 1187",
 "description": "Online marketing and SEO",
 "created_at": "Thu Nov 15 16:44:51 UTC 2012",
 "updated_at": "Wed Dec 12 07:44:28 UTC 2012",
 "overview": "\u003Cp\u003EEBS Marketing specializes in search engine optimisation, an integral aspect of any businesses strategy. Online presence is critical in the modern era, with most of the clientele of any type of business reachable through the Internet. Obviously, a high-quality website is an important part of any business, but the sit is useless unless people are seeing it. This is where EBS, based in Manchester, England, comes in. Properly executed SEO is the most effective way for any sized business to ensure that their web presence will increase revenues. EBS marketing reviews their clients\u0026#8217; needs, strategizes a plan of execution and a clear set of goals and gets immediate results that clients can see almost immediately.\u003C/p\u003E\n\n\u003Cp\u003EEBS Marketing staffs talented professionals with years of experience. They come from different backgrounds, in both the technology field and the advertising field, so their combined knowledge is also a strategic asset for marketing purposes. The first step of the SEO process for EBS Marketing is to analyse and target clients\u0026#8217; needs. They use a number of diagnostic tools to compile a report on what are the best strategies for optimising any companies\u0026#8217; Internet abilities and, based on this, put together a complete strategy. EBS Marketing reviews their plan with clients before getting started as well. \u003C/p\u003E\n\n\u003Cp\u003EOne unique feature EBS Marketing offers is a short term contract. This allows clients freedom with the marketing campaigns, so they have the chance to stop and analyse the level of SEO success and how they benefit from it. EBS Marketing reviews each clients\u0026#8217; potential abilities and they are careful to manage expectations for SEO goals. Businesses don\u0026#8217;t have to purchase longterm SEO contracts in order to reap the benefits of such business strategy. However, EBS Marketing also knows that the practices they set in place with their work often continue beneficially for companies long after the initial SEO campaign is executed.\u003C/p\u003E\n\n\u003Cp\u003EEBS Marketing is a highly professional company, known for strategically designing all plans before executing them. Companies can trust that their money is well spent on the dedicated EBS staff\u0026#8217;s ability to strategise an effective SEO plan for any company\u0026#8217;s needs. EBS staff uses the most well-known tools on the Internet, but in combinations that are specifically designed to increase SEO and, therefore, revenues. Facebook microsites, for example, are an incredible effective tool. Also, EBS Marketing reviews Google PPC and Google Places possibilities, in order to decide which options will most optimize a particular companies web presence. Different search engines are all implemented in the EBS Marketing plan, as well as a plethora of media platforms and social media. EBS Marketing clients receive a branded Twitter account which the staff links to their Facebook page; if a Facebook page does not already exist, EBS Marketing will also design one for each company. Twitter and Facebook can, on their own, send any company up the hierarchy of success, as these are the media platforms most traversed by broad traffice worldwide. EBS Marketing works with companies of all sizes because SEO can be an effective marketing tool no matter what the target audience is. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[109,
       109],
      "assets/images/resized/0022/0559/220559v2-max-150x150.jpg"],
     [[109,
       109],
      "assets/images/resized/0022/0559/220559v2-max-250x250.jpg"],
     [[109,
       109],
      "assets/images/resized/0022/0559/220559v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "Saint James Court 30 Brown Street",
    "address2": "",
    "zip_code": "M2 1DH",
    "city": "Manchester",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 53.4816246,
    "longitude": -2.2423701}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}