{"name": "eCarInsurance",
 "permalink": "ecarinsurance",
 "crunchbase_url": "http://www.crunchbase.com/company/ecarinsurance",
 "homepage_url": "http://ecarinsurance.net/",
 "blog_url": "http://ecarinsurance.net/blog/",
 "blog_feed_url": "http://feeds.feedburner.com/ecarinsurance",
 "twitter_username": "ecarinsurance1",
 "category_code": "web",
 "number_of_employees": 4,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cheap-car-insurance, cheapest-auto-insurance, cheap-insurance, car-insurance, insurance, auto-insurance, cheapest-car-insurance",
 "alias_list": null,
 "email_address": "info@ecarinsurance.net",
 "phone_number": "877-578-4384",
 "description": "Compare Cheap Car Insurance Quotes",
 "created_at": "Fri Nov 30 08:54:54 UTC 2012",
 "updated_at": "Fri Dec 07 06:58:18 UTC 2012",
 "overview": "\u003Cp\u003EeCarInsurance is a website that allows consumers to request and compare multiple cheap car insurance quotes.\u003C/p\u003E\n\n\u003Cp\u003EThe main advantage that users of this website receive is that they get peace of mind knowing that they are receiving the best price on car insurance possible. To start the process you simply need to enter your zip code into the prominently displayed capture box on the website. From there eCarInsurance goes to work for you by grabbing information from the different car insurance companies in your area that serve drivers.\u003C/p\u003E\n\n\u003Cp\u003EOnce you have a listing of the different companies you can then fill out the online rate quote request form in order to receive a targeted and personalized quote to your email inbox.\u003C/p\u003E\n\n\u003Cp\u003EAn additional big advantage of using eCarInsurance is that the whole process can be completed in just a few minutes as you will be quickly connected with the insurance companies. You can have quotes back in your hand very quickly once you complete the request forms.\u003C/p\u003E\n\n\u003Cp\u003EA nice feature of eCarInsurance is that the website is informative to users in more than one way. There is a library of articles that provide accurate and up to date information on current trends as they concern car insurance. This library of articles allows the consumer to become more educated on the laws that govern their state in regard to car insurance. The library also includes articles on how to lower your car insurance premiums.\u003C/p\u003E\n\n\u003Cp\u003EAnother section of the website is committed to detailing the nuances of car insurance as they relate to the make of their vehicle. This useful tool allows the user to know what type of insurance they will need before even requesting the quotes. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       86],
      "assets/images/resized/0022/3142/223142v2-max-150x150.jpg"],
     [[250,
       144],
      "assets/images/resized/0022/3142/223142v2-max-250x250.jpg"],
     [[364,
       210],
      "assets/images/resized/0022/3142/223142v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/wfmbfk_zaNA?rel=0\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EDo you want Cheaper Car Insurance Coverage?\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}