{"name": "eCareer",
 "permalink": "ecareer",
 "crunchbase_url": "http://www.crunchbase.com/company/ecareer",
 "homepage_url": "http://www.ecareer.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 100,
 "founded_year": 2009,
 "founded_month": 11,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jja@ecareer.com",
 "phone_number": "877-880-4400",
 "description": "Specialized Career Communities",
 "created_at": "Tue Jul 31 22:02:33 UTC 2012",
 "updated_at": "Sat Aug 04 14:01:23 UTC 2012",
 "overview": "\u003Cp\u003EeCareer, Inc. is an innovative Internet advertising company deploying a unique “First to Market” Talent Acquisition System that combines the power of a profession-specific\nonline career vertical with branded professional and social networks in order to address the ongoing demand for and shortage of skilled professionals across specific industries.\u003C/p\u003E\n\n\u003Cp\u003EeCareer’s mission is to organize the online hiring process by creating content-rich profession specific communities that are fully integrated personalized career centers each with matching branded professional and social networks where employers and professionals can enjoy the very best user experience possible.\u003C/p\u003E\n\n\u003Cp\u003EHeadquartered in Boca Raton, Florida, eCareer is an early-stage high growth Internet marketing company. Through the development of branded career websites organized into specialized “Internet Job Verticals,” the company’s goal is to provide the most effective job advertising platform in the marketplace. Focused on the use of the latest technologies, widespread and emerging mobile capabilities and the integration of social/professional networking tools, eCareer\nwill specifically address those career sectors with high demand, heavy recruiting and staffing activities as well as forecasted long term shortages of skilled professionals while attracting clients with strong advertising budgets.\u003C/p\u003E\n\n\u003Cp\u003EProducts and Services\u003C/p\u003E\n\n\u003Cp\u003EFor Professionals and Job Candidates: \neCareer will launch highly specialized career websites with profession-specific content: job listings, industry information and news, career development tips, salary scales, career blogs and a customized subscription tool to receive personalized information by request. Each specialized career website will be fully integrated with links to Smart- phone apps, Facebook, LinkedIn, Twitter and YouTube. The goal of\nthese websites is to become the number-one choice for career professionals, where not only active job seekers can interact with advertisers, but also passive candidates can enjoy a unique career site experience. The content and\naccess to these sites will be available to the job seeker at no cost.\u003C/p\u003E\n\n\u003Cp\u003EFor Corporate HR Hiring Departments, Recruiting \u0026amp; Staffing Firms:\neCareer will offer a unique Talent Acquisition System. Using the latest features and tools, eCareer will enable our clients to capture qualified resumes and manage potential hires across their network of recruiters and staff. In addition\nto traditional web-based job advertising, the Company’s career verticals will enable advertising clients to leverage their advertising dollars across multiple social, professional, video and mobile networking platforms through a single\nvendor at a fixed rate. This unique process is expected to save clients advertising capital and time, as well as centralize their hiring and recruiting efforts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       148],
      "assets/images/resized/0020/3808/203808v2-max-150x150.jpg"],
     [[250,
       247],
      "assets/images/resized/0020/3808/203808v2-max-250x250.jpg"],
     [[420,
       415],
      "assets/images/resized/0020/3808/203808v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}