{"name": "Eco Scraps",
 "permalink": "eco-scraps",
 "crunchbase_url": "http://www.crunchbase.com/company/eco-scraps",
 "homepage_url": "",
 "blog_url": "http://ecoscraps.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "EcoScraps",
 "category_code": "cleantech",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "801-415-4015",
 "description": "",
 "created_at": "Wed May 29 12:25:48 UTC 2013",
 "updated_at": "Wed May 29 12:31:18 UTC 2013",
 "overview": "\u003Cp\u003EEcoScraps was founded in Provo, Utah in 2010 by Craig Martineau and Daniel Blake. The idea behind EcoScraps originated in an all-you-can-eat buffet where Dan was having breakfast with his brother. As they ate their meal, Dan was amazed at how much food was wasted during the course of his meal.\u003C/p\u003E\n\n\u003Cp\u003E“I was intrigued by the idea of starting a business that utilized food waste to manufacture a different product.”\u003C/p\u003E\n\n\u003Cp\u003EDan then began researching food waste in the United States and discovered just how much food went unused. With additional research in composting, Dan pursued the idea of turning used and leftover food into natural and organic compost, and with that idea, EcoScraps was born.\u003C/p\u003E\n\n\u003Cp\u003EAs business students at BYU, Craig and Dan began to see success as they presented their business model at BYU’s Business Plan Competition.\u003C/p\u003E\n\n\u003Cp\u003E“Seeing the way that our product and story resonated with our future consumers, that was one of the moments for us when we really thought that we might be onto something special.”\u003C/p\u003E\n\n\u003Cp\u003EEcoScraps began in very humble circumstances, first being housed in an abandoned building on a lot that EcoScraps did not own (the owner was later convinced and allowed full use of the building).\u003C/p\u003E\n\n\u003Cp\u003EFrom dumpster diving to storing decomposing fruits and vegetables in an apartment complex parking lot, EcoScraps has evolved from two student’s dreams into a flourishing company that not only cuts down on waste but also gives nutrients back to the soil.\u003C/p\u003E\n\n\u003Cp\u003EWhen asked about dumpster diving, Dan responded:\u003C/p\u003E\n\n\u003Cp\u003E“The first time, I was obviously an amateur. I didn’t look at all; I just jumped in and right away my shoes and pants were soaking wet. [ \u0026#8230; ] Eventually we bought boots and plumber outfits and gloves, and I got a lot better at jumping into trash cans.”\u003C/p\u003E\n\n\u003Cp\u003EAs the company progressed from dumpster diving to enlisting clients for their thrown out fruits and vegetables, EcoScraps began to take form as a promising company. On the initial establishment of the company, Craig said:\u003C/p\u003E\n\n\u003Cp\u003E“I think one hard thing for me was learning to really believe that we could do it.”\u003C/p\u003E\n\n\u003Cp\u003ECraig and Dan were repeatedly told that they were too young, too inexperienced, and that they did not have the assets to succeed in the business world. A couple of years later, EcoScraps is a thriving company that is not only a successful business, but it is also a movement for a better environment and a better world. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0026/8588/268588v1-max-150x150.png"],
     [[250,
       152],
      "assets/images/resized/0026/8588/268588v1-max-250x250.png"],
     [[343,
       209],
      "assets/images/resized/0026/8588/268588v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Daniel",
      "last_name": "Blake",
      "permalink": "daniel-blake-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$2.6M",
 "funding_rounds":
  [{"round_code": "debt_round",
    "source_url": "http://www.sec.gov/Archives/edgar/data/1532703/000153270313000003/xslFormDX01/primary_doc.xml",
    "source_description": "SEC",
    "raised_amount": 2603444.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 4,
    "funded_day": 23,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "489 W. Parkland Drive",
    "address2": "",
    "zip_code": "84070",
    "city": "Sandy",
    "state_code": "UT",
    "country_code": "USA",
    "latitude": 40.590363,
    "longitude": -111.905194}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}