{"name": "EcoFab Engineering",
 "permalink": "ecofab-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/ecofab-engineering",
 "homepage_url": "http://www.indiamart.com/ecofabengineeringsolutions/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we, eco-fab-engineering-solutions, are-a-renowned-manufacturer-and-supplier-of-cable-trays, accessories",
 "alias_list": null,
 "email_address": "ecofabengineeringsolutions@tradepassport.org",
 "phone_number": "9594032457",
 "description": "We, Eco-Fab Engineering Solutions, ",
 "created_at": "Thu Apr 04 05:59:21 UTC 2013",
 "updated_at": "Thu Apr 04 05:59:23 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2006, we, “Eco-Fab Engineering Solutions”, are one of the renowned organizations that are engaged in manufacturing and supplying a wide range of superior quality Cable Trays, Ladder Type Cable Accessories, Cable Tray Support Systems. In this range, we are offering Ladder Cable Trays, Perforated Cable Trays, Underground Trunking Panel Systems, Junction Boxes, Purlin Clamps, Wire Ducts and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team of hard-working \u0026amp; sincere professionals is a main reason behind the success of organization. These professionals put their dedicated efforts to manufacture \u0026amp; supply a qualitative range of Cable Trays, Ladder Type Cable Accessories, Cable Tray Support Systems and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are supported by a well-developed infrastructure facility, which aids us in performing all processes with ease. Our sophisticated facility helps us is manufacturing and supplying a comprehensive range of superior-grade Cable Trays, Ladder Type Cable Accessories, Cable Tray Support Systems and many more. Equipped with the latest machines and cutting-edge technology, our facility sprawls over vast area of land. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe, at Eco-Fab Engineering Solutions, have committed ourselves to assure the quality at every stage of the business, right from sales to delivery. This is not just our USP, but it is our motto as well, to offer our clients what they rightly deserve, that is, excellent quality. We believe that the best way we can ensure our customers’ satisfaction is by putting ourselves in our customers’ shoes and trying to visualize what we would expect had we been in their place. This helps us in delivering the best possible results to our clients. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nDriven with the perfection, we work-hard to acquire the utmost satisfaction of our patrons. For the same, we are offering a broad assortment of high-grade Cable Trays, Ladder Type Cable Accessories, Cable Tray Support Systems and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nCable Trays, Ladder Type Cable Accessories, Cable Tray Support Systems. In this range, we are offering Ladder Cable Trays, Perforated Cable Trays, Underground Trunking Panel Systems, Junction Boxes, Purlin Clamps, Wire Ducts and many more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7560/247560v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7560/247560v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7560/247560v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}