{"name": "Economic Technology Systems",
 "permalink": "economic-technology-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/economic-technology-systems",
 "homepage_url": "http://www.econtechsys.com",
 "blog_url": "http://www.econtechsys.com/discussions.aspx",
 "blog_feed_url": "",
 "twitter_username": "EconTechSys",
 "category_code": "ecommerce",
 "number_of_employees": 4,
 "founded_year": 2011,
 "founded_month": 1,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "supply-chain-management, localvore, business-to-business, ecommerce, software-as-a-service, supply-chain-as-a-service, information-technology",
 "alias_list": null,
 "email_address": "info@econtechsys.com",
 "phone_number": "",
 "description": "Enabling an Effective Supply Chain",
 "created_at": "Sun Jul 29 16:16:31 UTC 2012",
 "updated_at": "Thu Aug 09 11:19:55 UTC 2012",
 "overview": "\u003Cp\u003EWe combine supply chain management consulting services and the latest in web-technology to create an effective supply chain helping large businesses discover, connect and engage in Business-to-Business commerce with small businesses supplying products to them from their local area.\u003C/p\u003E\n\n\u003Cp\u003EThe clients we work with start by requesting a supply chain assessment and problems that we can help them fix through our consulting and thought leadership. However, we created a web-based application called Localvore which is an affordable, high quality, Business to Business (B2B), supply chain management application that enables small businesses to collaborate with large retailers to build a more self-reliant, locally based economy in their geographic area. Localvore helps support the movement towards local purchasing and local economies that not only benefit the producer of goods and consumer but supports socially responsible supply chains. Localvore is a tool that will provide visibility of local suppliers to retailers in their area and help the two businesses establish a connection through Localvore’s “Social Media” features designed for businesses. Additional features that Localvore supports include robust search capabilities based on the type of product the retailer is looking for or by suppliers in the area. Once a retailer found what they are looking for Localvore can create and allow the user to manage online transactions for purchases made through Localvore’s virtual marketplace. Suppliers can also manage their entire inventory online, in addition to their company profile and user’s access. Localvore is built using the latest technology for web application development and is hosted using cost effective cloud computing services to keep our infrastructure costs low so we can pass along our savings to the user.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0020/3378/203378v2-max-150x150.jpg"],
     [[250,
       79],
      "assets/images/resized/0020/3378/203378v2-max-250x250.jpg"],
     [[450,
       143],
      "assets/images/resized/0020/3378/203378v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "25350 Curiosity Sq",
    "address2": "",
    "zip_code": "20105",
    "city": "Aldie",
    "state_code": "VA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        76],
       "assets/images/resized/0020/3377/203377v2-max-150x150.jpg"],
      [[250,
        127],
       "assets/images/resized/0020/3377/203377v2-max-250x250.jpg"],
      [[450,
        228],
       "assets/images/resized/0020/3377/203377v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}