{"name": "Edenbrook Limited",
 "permalink": "edenbrook-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/edenbrook-limited",
 "homepage_url": "http://www.edenbrook.co.uk/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2001,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "44 20 8528 1025 ",
 "description": "IT Consulting Company",
 "created_at": "Mon Sep 13 15:47:55 UTC 2010",
 "updated_at": "Mon Sep 13 15:53:24 UTC 2010",
 "overview": "\u003Cp\u003EEdenbrook Limited operates as an information technology (IT) consultancy company that helps organizations to evaluate, select, and manage advanced technology solutions. It offers Epicentre, a packaged payroll intelligence solution that provides reporting tools; DataLoad, a data migration tool that converts and loads existing data into new applications; Legacy Migration Framework that includes an upgrade modeling tool, code generation tools, and a code base; and warehouse templates for retail, finance, insurance, and utilities sectors. The company also offers application development framework, a suite of tools developed in .NET and Java J2EE that provide the standard plumbing for custom solutions. In addition, the company offers Hindsite, a business process automation tool, which comprises a suite of software components, including Questionnaire module that provides a wizard driven approach to capturing specific inputs into the project process; and Documentation Generator that supports the production of various documentation throughout the project modeling process. Further, it offers IT strategy, project and change management, budgeting and planning, ERP and CRM, creative design, license management, knowledge management, custom software development, business process management, and managed services, as well as business intelligence services, including management information strategy, data warehouse architecture, master data management, data cleansing and alignment, and advanced reporting services. The company offers its solutions to finance and insurance, telecommunications and media, retail, hospitality, leisure, travel, transport, logistics, utilities, commercial, public sector, and not for profit industries. Edenbrook Limited was formerly known as Edenbrook Solutions Limited. The company was founded in 2001 and is based in London, the United Kingdom. As of April 6, 2009, Edenbrook Limited operates as a subsidiary of Hitachi Consulting UK.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$1.89M",
 "funding_rounds":
  [{"round_code": "unattributed",
    "source_url": "",
    "source_description": "EDGAR",
    "raised_amount": 1890000.0,
    "raised_currency_code": "USD",
    "funded_year": 2005,
    "funded_month": 5,
    "funded_day": 3,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "Elderstreet Investments",
         "permalink": "elderstreet-investments",
         "image":
          {"available_sizes":
            [[[150,
               56],
              "assets/images/resized/0010/1862/101862v1-max-150x150.png"],
             [[150,
               56],
              "assets/images/resized/0010/1862/101862v1-max-250x250.png"],
             [[150,
               56],
              "assets/images/resized/0010/1862/101862v1-max-450x450.png"]],
           "attribution": null}},
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "88 Wood Street",
    "address2": "Edenbrook ",
    "zip_code": "EC2V 7RS",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}