{"name": "Education Times",
 "permalink": "education-times",
 "crunchbase_url": "http://www.crunchbase.com/company/education-times",
 "homepage_url": "http://www.educationtimes.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": 1995,
 "founded_month": 2,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "study-in-india, study-abroad, international-business-education, education-abroad, distance-learning-education-programs, india-education-abroad, mba-programs, mba-in-india, college-education-loans, abroad-scholarship-study, ancient-india-education, distanc",
 "alias_list": null,
 "email_address": "educationtimesdelhi@gmail.com",
 "phone_number": "",
 "description": "Weekly Supplement of The Times of India",
 "created_at": "Mon Jun 10 09:43:10 UTC 2013",
 "updated_at": "Mon Jun 10 20:15:36 UTC 2013",
 "overview": "\u003Cp\u003EEducation Times is a weekly broadsheet with a focus on higher education in both India and abroad and is circulated with The Times of India every Monday. Every week, Education Times comes out with 25 editions, covering the entire nation.\u003C/p\u003E\n\n\u003Cp\u003EWhen The Times of India, more than a decade ago, launched Education Times there was a need for a friend, philosopher and guide to introduce students to fresh options and growing academic opportunities. Today, things have changed \u0026#8212; especially, the way in which knowledge is delivered. Hence, the birth of www.educationtimes.com \u003C/p\u003E\n\n\u003Cp\u003Ewww.educationtimes.com is the interactive face of the weekly broadsheet. It provides additional services for students. Now students don’t have to wait for Mondays, as Education Times is 24x7, catering to the ever-expanding needs of a new breed of digital learners. It is a one-stop shop for information related to ‘study in India and overseas,’ as well as career guidance.\u003C/p\u003E\n\n\u003Cp\u003EThe site flaunts a four-member specialized counseling forum, comprising top professionals, answering queries from study abroad to study in India, careers to soft skills and also on special educational needs. Students can log in and get more guidance on visa interviews and national competitive exams from experts on ‘Live Chat.’ The site has an aptitude test to further help students with self-evaluation.\u003C/p\u003E\n\n\u003Cp\u003EThe portal provides exclusive information on new courses and scholarships; test tips and mock papers; exam planner to help track key academic dates. The brand is also active on social networking sites.\u003C/p\u003E\n\n\u003Cp\u003EIn keeping with the times, Education Times is trying to work through a synergy between print and its portal. This gives students the option to read about a wide range of topics in print, identify their needs, and then move on to the portal for more specific information suited to their individual needs.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[110,
       150],
      "assets/images/resized/0027/3515/273515v2-max-150x150.jpg"],
     [[183,
       250],
      "assets/images/resized/0027/3515/273515v2-max-250x250.jpg"],
     [[330,
       450],
      "assets/images/resized/0027/3515/273515v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        108],
       "assets/images/resized/0027/3514/273514v2-max-150x150.jpg"],
      [[250,
        180],
       "assets/images/resized/0027/3514/273514v2-max-250x250.jpg"],
      [[450,
        325],
       "assets/images/resized/0027/3514/273514v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}