{"name": "ConsultAtutor.com",
 "permalink": "eduhub-consultancy",
 "crunchbase_url": "http://www.crunchbase.com/company/eduhub-consultancy",
 "homepage_url": "http://www.consultatutor.com",
 "blog_url": "http://consultatutorblog.wordpress.com",
 "blog_feed_url": "http://consultatutorblog.wordpress.com/feed",
 "twitter_username": "consultatutor",
 "category_code": "consulting",
 "number_of_employees": 2,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-tutoring, online-tutors, online-tutoring-website-online-tutoring-services, private-home-tutor-singapore, tutor, tutoring, math-tutoring, on-line-homework, online-tution, learning-online, private-tutors, personal-tutoring, homework-help, home-tutori",
 "alias_list": null,
 "email_address": "support@consultatutor.com",
 "phone_number": "(+65) 6425 9328",
 "description": "Online tutoring website",
 "created_at": "Thu Jun 10 12:26:18 UTC 2010",
 "updated_at": "Sat Feb 19 01:22:12 UTC 2011",
 "overview": "\u003Cp\u003EConsultAtutor.com - A Learning Portal for Everyone!\u003C/p\u003E\n\n\u003Cp\u003EConsult a Tutor provides professional and efficient personal home tutor matching services for parents and tutors in Singapore. Our one to one tutoring program is aimed to help students improve their grades, learn effective study skills, build up their confidence and to reach their full potential. \u003C/p\u003E\n\n\u003Cp\u003EConsult a Tutor tutors are certified undergraduates, teachers or degreed professionals with a passion for teaching. They are all screened and rated with their profiles displayed clearly on our superb web interface. By customising the tutorial curriculum according to each student and supplementing their existing curriculum in schools, students are able to learn comfortably at their own pace.\u003C/p\u003E\n\n\u003Cp\u003EConsult a Tutor schedules tutorials timings convenient to the parents. This provides the benefit of one to one instruction and individualised attention to your child away from classroom distractions in a secure and comfortable learning environment at your own home without the hassles of travelling \u003C/p\u003E\n\n\u003Cp\u003EConsult a Tutor offers the most competitive rates in the industry for both parents and our tutors. You can be assured there are also no long term contracts or minimum number of tutorials whatsoever. Our one to one tutoring program is also highly flexible for parents to decide on the frequency of tutorials required for their child\u0026#8217;s learning. \u003C/p\u003E\n\n\u003Cp\u003EAt ConsultAtutor.com, we are proud to offer our quality premium service with our Online Tutoring- Assignment Help feature designed for users and ExpertTutors from all over the world to interact and learn! It uniquely combines characteristics of a social network with an effective and safe e-learning environment with the aim for tutees (users) to shorten their learning curve for a particular topic and acquire the specific knowledge fast at a relatively inexpensive fee. \u003C/p\u003E\n\n\u003Cp\u003EConsultAtutor.com is based in Singapore and our management team comprises of IT professionals, trained coordinators and education consultants based locally and overseas; our services have a global reach with students worldwide using our portal. We are also involved in research and development of e-learning technology and constantly strive to improve on its services and platform. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0009/0124/90124v2-max-150x150.png"],
     [[249,
       79],
      "assets/images/resized/0009/0124/90124v2-max-250x250.png"],
     [[249,
       79],
      "assets/images/resized/0009/0124/90124v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0009/0123/90123v2-max-150x150.jpg"],
      [[250,
        156],
       "assets/images/resized/0009/0123/90123v2-max-250x250.jpg"],
      [[450,
        281],
       "assets/images/resized/0009/0123/90123v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}