{"name": "eightpointnine",
 "permalink": "eightpointnine-2",
 "crunchbase_url": "http://www.crunchbase.com/company/eightpointnine-2",
 "homepage_url": "http://eightpointnine.com",
 "blog_url": "http://eightpointnine.tumblr.com",
 "blog_feed_url": "",
 "twitter_username": "eightpointnine",
 "category_code": "ecommerce",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "coffee, personalisation, bespoke, customised, ecommerce, uk",
 "alias_list": null,
 "email_address": "mgmt@eightpointnine.com",
 "phone_number": "",
 "description": "online personalised coffee",
 "created_at": "Fri Nov 02 09:40:36 UTC 2012",
 "updated_at": "Mon Nov 05 23:57:35 UTC 2012",
 "overview": "\u003Cp\u003Eeightpointnine is a UK based artisan coffee company which sells delicious fairtrade coffee to customers who want to create their own personalised blend of coffee beans from around the world via a series of sliding scales, adjusting levels of body from rich to light and flavours from fresh to spicy to suit.\u003C/p\u003E\n\n\u003Cp\u003EFor those who find it hard to make their minds up or need a little help to get going, eightpointnine also offer a grandCRU programme, which delivers a different hand-blended coffee each week.\u003C/p\u003E\n\n\u003Cp\u003Eeightpointnine operate a subscription service and offer deliveries at the start and/or the end of a week on either a weekly or a fortnightly basis. Additionally, customers can buy one-off boxes. Customers can choose to take advantage of the flexibility on offer and change their blend or pause their order so their coffee blend arrives when it suits them.\u003C/p\u003E\n\n\u003Cp\u003EThe main headquarters are in London and eightpointnine also have a production centre in the Cotswolds and a Scandinavian office in Trondheim. All eightpointnine employees are coffee disciples with most claiming to be addicted to the brown stuff! A passion for great coffee is at the heart of the company culture and is supported by regular cupping sessions and visits to some of the world\u0026#8217;s bests producers and cafes.\u003C/p\u003E\n\n\u003Cp\u003EAll the coffee is blended and shipped from our Cotswold production centre in letter-box sized boxes. Inside the box is a small tasting card to give the customer an idea of what to expect from their chosen coffee blend and instructions on how best to enjoy it.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/8435/218435v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0021/8435/218435v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0021/8435/218435v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}