{"name": "Electrical Cable Suppliers",
 "permalink": "electrical-cable-suppliers",
 "crunchbase_url": "http://www.crunchbase.com/company/electrical-cable-suppliers",
 "homepage_url": "http://electrical-cable.made-from-india.com/",
 "blog_url": "http://electrical-cable.made-from-india.com/",
 "blog_feed_url": "http://electrical-cable.made-from-india.com/",
 "twitter_username": "mayurdicosta",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "electrical-cable, electric-cable",
 "alias_list": null,
 "email_address": "johansegal2@gmail.com",
 "phone_number": "",
 "description": "Electrical Cable and Electric Cables Sup",
 "created_at": "Mon Apr 29 09:57:50 UTC 2013",
 "updated_at": "Mon Apr 29 22:02:00 UTC 2013",
 "overview": "\u003Cp\u003EElectrical Cables are used for transmitting electricity, and consists of two or more wires joined together through twisting or braiding. The electrical cables or electrical wires are covered by a protective and insulating material. Electrical cables are generally categorized based on their electrical conductivity, insulation type, type of protector, weight, cost, and other specific uses. Electric cables are primarily used for installation in buildings and industrial sites.\u003C/p\u003E\n\n\u003Cp\u003EElectrical cables can be generally classified according to their purpose and the kind of material used.\u003C/p\u003E\n\n\u003Cp\u003EAccording to use:  \u003C/p\u003E\n\n\u003Cp\u003EDirect-buried or underground cables are intended to be buried below the ground. They are specifically  designed in such a manner that they have high tolerance for factors such as soil acidity, heat and moisture. Mineral-insulated copper-clad cables have the distinct advantage of circuit integrity, i.e; they have the capability to withstand extreme conditions such as a fire. They are, therefore, used in devices like fire pumps, fire alarm systems, power stations, tunnels and mines.\u003C/p\u003E\n\n\u003Cp\u003EAccording to material:\u003C/p\u003E\n\n\u003Cp\u003ECables could be categorized depending on the material used as conductor. This includes aluminum cable, copper cable, teflon cable, tungsten cable \u0026amp; so on.\u003C/p\u003E\n\n\u003Cp\u003EAluminum cable is widely used because of its signiifcant properties. Aluminium is an extremely good conductor of electricity, offers high resistance to corrosion, has lightweight and could be easily manufactured and recycled. It is a high voltage cable and has the ability to efficiently transport power even through long distances.\u003C/p\u003E\n\n\u003Cp\u003ETeflon cables have tremendously high melting temperatures. So they are generally used to provide insulation to other cables.\u003C/p\u003E\n\n\u003Cp\u003ETungsten cables are known for their resistance to high temperatures as well as extreme durability in unfavourable climates. Owing to its strength and ductility, Tungsten cables can be easily made into filament coils.\u003C/p\u003E\n\n\u003Cp\u003ECopper cables are regarded as the finest material for the manufacture of electrical connectors as it is a good conductor of electricity and exhibits certain outstanding properties that includes malleability, ductililty, high resistance to corrosion and light weight.\u003C/p\u003E\n\n\u003Cp\u003EOther than this, there are other types of cables too such as coaxial cables, armored cables, fiber optic cables and ribbon cables used for different purposes.\u003C/p\u003E\n\n\u003Cp\u003EMore information at: http://electrical-cable.made-from-india.com/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0025/5867/255867v2-max-150x150.png"],
     [[200,
       200],
      "assets/images/resized/0025/5867/255867v2-max-250x250.png"],
     [[200,
       200],
      "assets/images/resized/0025/5867/255867v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}