{"name": "Electric Motors- Essential Part of Machines",
 "permalink": "electric-motors-essential-part-of-machines",
 "crunchbase_url": "http://www.crunchbase.com/company/electric-motors-essential-part-of-machines",
 "homepage_url": "http://electric-motor.made-from-india.com/motor-shaft.php",
 "blog_url": "http://electric-motor.made-from-india.com/motor-shaft.php",
 "blog_feed_url": "http://electric-motor.made-from-india.com/motor-shaft.php",
 "twitter_username": "mayurdicostagm",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "motor-shaft, motor-shafts, motor-shaft-manufacturers, motor-suppliers, motor-shaft-exporters, made-in-india-motor-shaft",
 "alias_list": null,
 "email_address": "mayurdicosta@gmail.com",
 "phone_number": "",
 "description": "Electric Motor Shaft Manufacturers and S",
 "created_at": "Mon Dec 12 11:35:50 UTC 2011",
 "updated_at": "Sun Dec 18 10:57:29 UTC 2011",
 "overview": "\u003Cp\u003EElectronic devices almost all the machineries operated by electricity can stand out of work without having an electric motor. It is a fact that no commercial or industrial setup can run its machineries without having unique and high-quality electric motors. In other words, this essential part of machines is found in almost all the applications such as blowers, pumps, machine tools, household appliances, power tools, disk drivers, industrial fans and all the tools operated by electric. Yes, it is true that this unique electronic gadget is the ultimate source of converting electrical energy into mechanical energy in an efficient manner; thus, keeping the work in flow.\u003C/p\u003E\n\n\u003Cp\u003EThe processing of these motors is extremely simple. When the electric current is passed through a wire loop (that is in a magnetic field), the loop starts rotating and thus the rotating motion is transmitted to a shaft, providing a useful mechanical work. These motors consist of a conducting loop that is mounted on a rotatable shaft. Machinery even big or small runs with the help of electric motors. They are generally divided into several types such as alternative current (AC) motors, direct current (DC) motors and universal motors. Strength of all types of motors is usually measured in horsepower.\u003C/p\u003E\n\n\u003Cp\u003EApart from the aforesaid motors, stepper motors are also available that are special type of brushless motors used primarily in automation systems. When it comes to speed ratings, electric motors are available in various speed ratings; while the speed is usually specified as rotations per minute or RPM. Interestingly, the speed in RMP format is specified at no load condition. In fact with the loading down of motor the speed starts slowing down automatically. In case the electric motor is loaded too heavily, the motor shaft will stop. This situation is defined as stall speed that should be avoided.\u003C/p\u003E\n\n\u003Cp\u003EIt is clear that these motors are the essential requirement of electronic gadgets, but before purchasing them you should keep some points in mind. You should select the motor as per the requirement of machines that need these motors. Apart from this, proper maintenance is also essential to increase the life cycle of these motors. When it comes to buy these motors, numerous suppliers and manufacturers are also supplying them online.\u003C/p\u003E\n\n\u003Cp\u003EMore information at: http://electric-motor.made-from-india.com/motor-shaft.php\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0016/6104/166104v2-max-150x150.jpg"],
     [[225,
       225],
      "assets/images/resized/0016/6104/166104v2-max-250x250.jpg"],
     [[225,
       225],
      "assets/images/resized/0016/6104/166104v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}