{"name": "Elevated Packaging",
 "permalink": "elevated-packaging",
 "crunchbase_url": "http://www.crunchbase.com/company/elevated-packaging",
 "homepage_url": "http://www.elevatedpackaging.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "ElevatedPkg",
 "category_code": "other",
 "number_of_employees": 200,
 "founded_year": 2007,
 "founded_month": 2,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "custom-boxes, custom-packaging, box-printing, custom-box, custom-gift-boxes, custom-retail-packaging, custom-packaging-boxes, custom-box-printing, product-boxes, soap-boxes, custom-printed-boxes, retail-boxes, gift-boxes-wholesale, custom-made-boxes, prin",
 "alias_list": "",
 "email_address": "info@elevatedpackaging.com",
 "phone_number": "",
 "description": "Custom Boxes Printing and Packaging.",
 "created_at": "Sat Jun 18 19:53:54 UTC 2011",
 "updated_at": "Wed Apr 10 19:43:48 UTC 2013",
 "overview": "\u003Cp\u003EElevated Packaging contributes a lot in making of your product by delivering amazing designing, printing and packaging at lowest rates. Custom Boxes, Custom Packaging, Product Boxes, Soap Boxes, Custom Box Printing, Retail Boxes, Gift Boxes Wholesale and Custom Made Boxes are available at Elevated Packaging at cheap prices.\u003C/p\u003E\n\n\u003Cp\u003ECustom Boxes are used to gather various scattered things of your need at one place. Whether you need to organize office supplies, such as pens; staples; paper clips; fasteners; file folders; custom clips and ink cartridges, or hinges; drawer handles; door knobs; lag bolts; wall plates and electric components, Custom Boxes give you the capability to organize your items in a logical, and easily accessible manner. . \u003C/p\u003E\n\n\u003Cp\u003ECustom Boxes typically come in flat bundles, so there\u0026#8217;s no need to worry about adding clutter to your storage area until ready for use. Simplicity also contributes to time saving and efficiency. Elevatedpackaging.com produces Custom Boxes, Product Boxes, Wholesale Shoe Boxes, Custom Corrugated Boxes, Hat Boxes Wholesale, Candle Boxes, Custom Cardboard Boxes and Coaster Printing with free designing as per your specifications.\nCustom Boxes and Custom Dividers are constructed to be sturdy, self locking, and assemble in mere seconds, without the need for tools, tape, glue or staples. \u003C/p\u003E\n\n\u003Cp\u003EWe produce Custom Boxes and Product Boxes with quality printing and packaging. We deliver Custom Boxes, Product Boxes, Coaster Printing, Cardboard Hat Boxes, Cardboard Printing, Cheap Boxes and Custom Box Printers up to full color printing of your choice in a variety of styles and patterns. We provide free designing and we don’t have any hidden charges\u003C/p\u003E\n\n\u003Cp\u003EWe make Custom Boxes and Product Boxes innovative and attractive. Elevatedpackaging.com offers professional and skilled services to all our valued customers regarding printing and packaging requirements. We print Custom Boxes, Product Boxes, Custom Packaging, Box Printing, Custom Box, Custom Gift Boxes, Custom Retail Packaging and Custom Packaging Boxes.\u003C/p\u003E\n\n\u003Cp\u003ECustom Boxes can be custom crafted to fit your specialized needs. Custom boxes and other modern shipping and packaging supplies allow people and businesses to send items worldwide. It used to be that valuable or delicate objects were not easily entrusted to the mail service. We only had boxes and inferior fillers, and there was much shifting and resultant damage of products. Custom Boxes and Custom Packaging Boxes designed and printed by us in full color printing at cheap rates. We offer innovative and attractive designs for your products. Excellent designing and printing brings surprising results in the market. We deliver quality Custom Boxes, Custom Packaging Boxes, Soap Packaging, Shoe Boxes Wholesale, Cardboard Shoe Boxes, Packaging Printing, Wholesale Shoe Boxes and Custom Corrugated Boxes.\u003C/p\u003E\n\n\u003Cp\u003ECustom Boxes and Product Boxes according to your product’s requirement Elevatedpackaging.com provides stupendous printing on all products with the help of Professional Printing and Packaging System that is the reason people prefer our printing and packaging solutions. We make Custom Boxes, Product Boxes, Custom Printed Boxes, Soap Boxes, Retail Boxes, Gift Boxes Wholesale, Custom Made Boxes and Printed Boxes.\u003C/p\u003E\n\n\u003Cp\u003ECustom boxes are the best solution to avoid time consuming process and also to avoid irritation. One modern organizational analyst writes \u0026#8220;One hour spent organizing prevents three hours of confusion.\u0026#8221; Keeping a good stock of custom boxes and other packaging supplies allows companies to stay on top of tasks and orders and prevents wasting time and energy having to clean up and reorganize.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       34],
      "assets/images/resized/0013/9874/139874v3-max-150x150.jpg"],
     [[240,
       55],
      "assets/images/resized/0013/9874/139874v3-max-250x250.jpg"],
     [[240,
       55],
      "assets/images/resized/0013/9874/139874v3-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Custom Boxes",
    "permalink": "custom-boxes",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Aaron",
      "last_name": "Brian",
      "permalink": "aaron-brian",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Elevated Packaging.",
    "address1": "Saghyan Bypass,",
    "address2": "Ring Road,",
    "zip_code": "54000",
    "city": "Lahore",
    "state_code": null,
    "country_code": "PAK",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.elevatedpackaging.com/customboxes.htm",
    "title": "Custom Box Printing in different sizes."}]}