{"name": "Elite Personal Search",
 "permalink": "elite-personal-search",
 "crunchbase_url": "http://www.crunchbase.com/company/elite-personal-search",
 "homepage_url": "http://www.elitepersonalsearch.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 25,
 "founded_year": 1980,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dating, dating-service, reviews, matchmaking, matchmaker, singles",
 "alias_list": null,
 "email_address": "info@elitepersonalsearch.com",
 "phone_number": "800.411.3327",
 "description": "Premier Matchmaking Services",
 "created_at": "Thu Apr 29 09:46:17 UTC 2010",
 "updated_at": "Mon May 14 23:41:44 UTC 2012",
 "overview": "\u003Cp\u003EElite Personal Search is the one dating service that the high majority of singles in America who are looking for love prefer over any other service. With over a decade of successfully matching their clients together for marriage, this service continues to add to their high success rate. Elite Personal Search has earned the blessing of having an extremely limited amount of complaints and negative reviews by working hard to perfect their matchmaking job.\u003C/p\u003E\n\n\u003Cp\u003EThe staff at Elite Personal Search provides and requires a few things before your membership is finalized. The first is the application that needs to be filled out and the next is the fee. The personal background check is the main thing that decides weather or not you can become a member. This process will uncover any criminal, marital, and financial records that you might have so that they can guarantee the safety of their clients. After the background check, the interview given by your own personal matchmaker will follow. The information you give during this interview will be the foundation of your personal profile which is the key to a successful match.\u003C/p\u003E\n\n\u003Cp\u003EYour matchmaker will call you as soon as he/she finds a match for you. It may take a while for you to receive a phone call or e-mail due to the fact that it takes time to process all your information into their archives and files. This is the time where patience is most needed, but when you do receive a call, you will learn everything you need to know about the other person. The date will be arranged after both sides agree to meet. \u003C/p\u003E\n\n\u003Cp\u003EEach date will also follow with an e-mail or phone call from your matchmaker to discuss the date and how it went. You will talk about any comments, complaints, question and any other reviews about your previous introduction. This makes it easier for your matchmaker to set you up with a better person or to help you through the next date.\u003C/p\u003E\n\n\u003Cp\u003EElite Personal Search is Americas top dating service and has helped thousands of people find their soul mates by setting up branches in: Denver, Boston, Los Angeles, Orange County, Dallas, Phoenix, Palm Springs, Las Vegas, Washington DC, San Diego, and San Francisco. This Dating service is the reason for many of successful marriages in the land of the flying eagle.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       68],
      "assets/images/resized/0008/5314/85314v6-max-150x150.jpg"],
     [[250,
       113],
      "assets/images/resized/0008/5314/85314v6-max-250x250.jpg"],
     [[450,
       204],
      "assets/images/resized/0008/5314/85314v6-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.elitepersonalsearch.com",
    "title": "Elite Personal Search "}]}