{"name": "Elizabet",
 "permalink": "elizabet",
 "crunchbase_url": "http://www.crunchbase.com/company/elizabet",
 "homepage_url": "http://www.qwinelizabet.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "qwinelizabet",
 "category_code": "games_video",
 "number_of_employees": 3,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-betting, betting, social-game, mobile-app, webapp",
 "alias_list": null,
 "email_address": "me@qwinelizabet.com",
 "phone_number": "+351938472964",
 "description": "social casual betting",
 "created_at": "Tue Apr 03 15:38:25 UTC 2012",
 "updated_at": "Fri Apr 06 23:07:04 UTC 2012",
 "overview": "\u003Cp\u003E**What?\nElizabet is the Qwin of Challenge and brings you a social betting game (web\u0026amp;mobile) where you\u0026#8217;ll have fun challenging your friends on any topic or challenge.\nAll your bets are done with crowns, the kingdoms virtual money.\u003C/p\u003E\n\n\u003Cp\u003EChallenge your friends by placing different kinds of bets:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EUser Bets - create your own bets and define the outcome - bet on fact or on a challenge - \u0026#8220;I bet that this will happen…\u0026#8221; or \u0026#8220;I bet I can dare to do this…\u0026#8221;\u003C/li\u003E\n\u003Cli\u003ETopic Bets - choose from a multitude of facts that you can bet on against your friends - from Football to Tennis, from Reality Shows to News - the world is your playground you just have to bet on it… against your friends.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EThe Social Game - Elizabet becomes a Social Game where you\u0026#8217;ll earn points, achieve goals and progress in the kingdom social ladder by becoming knight, duke, count,… To progress every action will give you points but you will also have to buy different virtual items to achieve the levels - check out the Store where you can buy houses, boats, watches and improve your life as a member of the kingdom.\u003C/p\u003E\n\n\u003Cp\u003E**Why I think you should like this?\nElizabet was born social! - Mashable is all about Social Networks and everything power by them, right?\nAnd specially because is relevant, innovative and inspirational - now, let me try to back-up these claims!\u003C/p\u003E\n\n\u003Cp\u003E**Relevant?\ncompetition and challenge is a primate human behaviour - from the dark ages to the 21st century men and women (yes! women also compete among them!) have always competed and aimed to be on top - do you need examples?! Betting is not Horse betting or Football betting, is above all something friends do over a coffee table, in a bar,… they place bets with each other - Elizabet is all about this - bring betting back to the people, between friends - no money, no drama, more fun!\u003C/p\u003E\n\n\u003Cp\u003E**Innovative?\nIntegrating the primate competitive behaviour with social networks we created a platform where friends can challenge each other wherever they are, whenever they want - the power of social digital networks! By removing money from the equation we turn the betting fun and remove the issues associated with hard-betting and gambling. By including a gamification dynamics with a character (HM The Qwin) we keep it engaging and remarkable (Purple Cow).\u003C/p\u003E\n\n\u003Cp\u003E**Inspirational?\nBy building a character - HM Qwin Elizabet - we built a plot and storytelling component that builds into a gamification dynamics - we are sick of sterile apps that do not engage users in a more compelling design and story - games do not have to have the monopoly of imagination - we believe that the divide between games and apps is bluring and is not only points or badges, is context, story, characters. \u003C/p\u003E\n\n\u003Cp\u003EDetails:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003Esoft launched in 29th Feb 2012\u003C/li\u003E\n\u003Cli\u003EConceived\u0026amp;Design\u0026amp;Developed in Portugal\u003C/li\u003E\n\u003Cli\u003Elegal company name ViewDo,S.A. (Portugal)\u003C/li\u003E\n\u003C/ul\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "Crowdpark",
      "permalink": "parklabs",
      "image":
       {"available_sizes":
         [[[150,
            28],
           "assets/images/resized/0007/2570/72570v4-max-150x150.png"],
          [[250,
            47],
           "assets/images/resized/0007/2570/72570v4-max-250x250.png"],
          [[450,
            85],
           "assets/images/resized/0007/2570/72570v4-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [{"title": "Development",
    "is_past": false,
    "provider":
     {"name": "ThinkOrange",
      "permalink": "thinkorange",
      "image": null}},
   {"title": "Brand\u0026Communication",
    "is_past": false,
    "provider":
     {"name": "NormaJean",
      "permalink": "normajean",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "Amoreiras - Torre 2, 17º ",
    "address2": "",
    "zip_code": "1070-102",
    "city": "Lisbon",
    "state_code": null,
    "country_code": "PRT",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}