{"name": "Ellohim Cashews",
 "permalink": "ellohim-cashews",
 "crunchbase_url": "http://www.crunchbase.com/company/ellohim-cashews",
 "homepage_url": "http://www.indiamart.com/ellohimcashews/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cashew-nuts, organic-cashews, pistachio-nuts, almond-nuts-and-organic-raisins-",
 "alias_list": null,
 "email_address": "ellohimcashews@tradepassport.org",
 "phone_number": "9488185804",
 "description": "We are a leading trader and supplier  ",
 "created_at": "Thu Apr 04 16:18:27 UTC 2013",
 "updated_at": "Thu Apr 04 16:18:29 UTC 2013",
 "overview": "\u003Cp\u003EEllohim Cashews was set up in 1996 as a sole proprietorship firm. Our firm is based in Coimbatore, Tamil Nadu (India). We are a prominent leader in trading and supplying of comprehensive range of Cashew Nuts, Organic Cashews, Pistachio Nuts, Almond Nuts and Organic Raisins. The entire range of products offered by us is of excellent quality, known for its taste and nutritional value. Owing to the excellent quality, our food products have longer shelf life. Our products are in huge demand in market for their taste and health benefits. We are seasoned in cherry picking of products from vendors.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOur business is highly dependent on our vendors and realizing the importance of relation we make no compromises in choosing them. Our vendor base is vast and scattered across the country. We choose vendors who have excellent track record in the market of supplying best quality products. We prefer to partner those vendors who believe in honest business practices.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOurs is a client centric firm, all our activities are directed towards ensuring they are the happy lot. Stringent quality testing of all the products on various parameters has been incorporated owing to this very reason. Our policy of conducting fair business practices gets huge appreciation from clients. All our products are offered in various sizes and packaging to ensure they get an opportunity to choose as per their suitability. Our timely delivery is another feature for which clients appreciate us.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur quality is amongst the best in the whole industry. This has been possible as our vendors deliver the premium quality range to us. Vendors are well aware about our commitment towards delivering quality, hence they ensure the delivery of only quality product range. All procured items are tested on various parameters before they get packed for final delivery. Our quality auditors leave no room for any compromised quality product.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nCashew Nuts, Organic Cashews, Pistachio Nuts, Almond Nuts and Organic Raisins. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8074/248074v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8074/248074v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8074/248074v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}