{"name": "EMG (ElcaMediaGroup)",
 "permalink": "emg-elcamediagroup",
 "crunchbase_url": "http://www.crunchbase.com/company/emg-elcamediagroup",
 "homepage_url": "http://www.emg-csr.com",
 "blog_url": "http://www.emg-csr.com/blog",
 "blog_feed_url": "",
 "twitter_username": "elcamedia",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2004,
 "founded_month": 4,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "the-closed-loop, cradle-to-cradle, sustainability-consultancy, csr-consultancy, european-sustainable-investment-forum, environmental-responsibility, csr-communications",
 "alias_list": null,
 "email_address": "info@emg-csr.com",
 "phone_number": "uk 0800 9756153",
 "description": "CSR Sustainability management consulting",
 "created_at": "Thu Jan 31 15:51:29 UTC 2013",
 "updated_at": "Sun Feb 03 06:33:07 UTC 2013",
 "overview": "\u003Cp\u003EEMG is a leading international CSR and sustainability management consultancy helping companies drive profit and growth from Sustainability and beyond. Today EMG has consultants in Amsterdam, London, Cambridge and New York.\nIn 2008 EMG became the world’s first consultancy with accredited consultants for the marketing of Cradle to Cradle ®, the closed loop/ circular economy model developed by William McDonough and Prof. Michael Braungart. EMG is the first CSR and sustainability management consultancy to be a member of the European Sustainable Investment Forum (EUROSIF).\nOver the years, EMG has received numerous international awards in recognition of its quality and effectiveness including most recently the American Summit International Leader Award and the Communitas Award for Leadership in Ethical and Environmental Responsibility. Publications include “How to do business in China” and “Sustainable Development in China’s 12th Five Year Plan”, both written by EMG’s Senior Consultant for China Projects, the former Counsellor for Science and Innovation at the British Embassy in Beijing.\nIn November 2012, EMG launched a new series of CSR Thought Leadership interviews with the goal of inspiring more people about the benefits of integrating CSR into profitable business. The first interviews have included CEOs, senior government and non-government officials, prominent financiers and heads of CSR for some of the world’s largest multinationals.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       96],
      "assets/images/resized/0023/2792/232792v2-max-150x150.jpg"],
     [[250,
       160],
      "assets/images/resized/0023/2792/232792v2-max-250x250.jpg"],
     [[450,
       288],
      "assets/images/resized/0023/2792/232792v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}