{"name": "Empire Eden",
 "permalink": "empire-eden",
 "crunchbase_url": "http://www.crunchbase.com/company/empire-eden",
 "homepage_url": "http://www.empireeden.com",
 "blog_url": "http://www.empireeden.com/blog",
 "blog_feed_url": "http://www.empireeden.com/blog",
 "twitter_username": "empireeden",
 "category_code": "games_video",
 "number_of_employees": 3,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "empire, eden, game, indie, video, steam, green, light, kickstart, kick, start",
 "alias_list": null,
 "email_address": "support@empireeden.com",
 "phone_number": "",
 "description": "Indie video game",
 "created_at": "Tue Feb 12 06:08:01 UTC 2013",
 "updated_at": "Fri Mar 01 05:57:15 UTC 2013",
 "overview": "\u003Cp\u003EEmpire Eden is a hyrbrid Run N\u0026#8217; Gun/ARPG. \u0026#8211; Very similar feel to Contra Hard Corps, Metal Slug, Metroid, Castlevania, etc\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EA little about the story:\nYou the player will experience an action packed adventure in the form of a tribal native who\u0026#8217;s tribe was swept away by the Empire\u0026#8217;s soldiers. Unaware of who the Empire is, and why they have done this sinister act, your main concern is to rescue captured tribesmen/women.\u003C/p\u003E\n\n\u003Cp\u003EYou set your mark on the looming tower in the East. This is the headquarters of the Empire.\u003C/p\u003E\n\n\u003Cp\u003EAs you progress, you uncover the dark secrets of the Empire, and why they have been capturing natives from neighboring tribes across the lands.\u003C/p\u003E\n\n\u003Cp\u003ETraveling you will meet people who have been affected by the Empire\u0026#8217;s wicked tools of war, and help them rebuild their communities, fight off the enemy, or escape certain death.\u003C/p\u003E\n\n\u003Cp\u003EYou will build meaningful and lasting relationships with numerous individuals, including a few you never thought you would.\u003C/p\u003E\n\n\u003Cp\u003EIf you make it to the tower, many mysteries will be revealed..but to uncover them all, you must make the right choices. There are multiple endings, which one will you experience?\u003C/p\u003E\n\n\u003Cp\u003EMechanics:\nCheck out the game mechanics video.\nhttp://www.youtube.com/watch?v=rTW2pqEfP70\u0026amp;feature\u003C/p\u003E\n\n\u003Cp\u003EI think the video speaks for itself. It\u0026#8217;s hard to explain what we were going for in words, but this is pretty much it. There are still some more mechanics being added to the game. Feedback is important to us guys. Check out our website and join the forums! Let us know what you think.\u003C/p\u003E\n\n\u003Cp\u003EA little about us:\nMy name is Ryan, I\u0026#8217;m the artist and creator of this game/story. All of the art I use for Empire Eden is classic Pixel Art! I think its the most nostalgic, and makes for the best games.\u003C/p\u003E\n\n\u003Cp\u003EChris is the resident programmer. I actually found him on TigSource around a month ago. As you can see, he works extremely fast. He is very proficient at his trade. Without him, this project would only be a dream of mine.\u003C/p\u003E\n\n\u003Cp\u003ELuke is the map maker, and also a big part of story/quest contribution. I\u0026#8217;ve known him for years, and we have always talked about making games..So we finally attempted it with this one.\u003C/p\u003E\n\n\u003Cp\u003EHelp us!:\nWe need your support guys! Follow us on our developers blog, www.empireeden.com/blog post feedback. Tell us what we need to change. This game is for you, not for us. We really want the customer to have the most say in this project.\u003C/p\u003E\n\n\u003Cp\u003EFeel free to ask as many questions as you want! Also please help us spread the news if you feel like this is the kind of game you want to see completed.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       112],
      "assets/images/resized/0023/5289/235289v2-max-150x150.png"],
     [[250,
       187],
      "assets/images/resized/0023/5289/235289v2-max-250x250.png"],
     [[450,
       337],
      "assets/images/resized/0023/5289/235289v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}