{"name": "Empowerment Technology",
 "permalink": "empowerment-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/empowerment-technology",
 "homepage_url": "http://empowermenttech.com/",
 "blog_url": "http://empowermenttech.blogspot.in/",
 "blog_feed_url": "",
 "twitter_username": "Empowermenttech",
 "category_code": "software",
 "number_of_employees": 21,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "summer-training-lucknow, industrial-training-lucknow, android-training-lucknow, java-training-lucknow, php-training, web-design-company-lucknow, web-development-company",
 "alias_list": null,
 "email_address": "arvind@empowermenttech.com",
 "phone_number": "05224000052",
 "description": "Web Design Company, SEO Company,Training",
 "created_at": "Thu May 30 09:14:39 UTC 2013",
 "updated_at": "Fri May 31 19:49:35 UTC 2013",
 "overview": "\u003Cp\u003EABOUT EMPOWERMENT:\u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology is a well growing web and software development company and providing technical training on various technology in Lucknow.\u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology is one of the largest software Development ,SEO Services Company and IT Training Provider Company in Lucknow.\u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology is a established and registered Company Which is founded by two talented Engineers. Mr. Arvind Kumar Attri and Mr. Hari Shanker Traipathi are founder of this Organisation. They are well qualified and having sufficient Knowledge about IT Field.\u003C/p\u003E\n\n\u003Cp\u003EThe Management Team at Empowerment Technology comprises of experts in business consulting, technology strategy, marketing and sales, with experience in diverse sectors. They bring with them sound knowledge of the Software industry with focus on innovation and business results.\u003C/p\u003E\n\n\u003Cp\u003EMISSION AND VISION:\u003C/p\u003E\n\n\u003Cp\u003EOur mission and vision are depends on our respected clients.It means our mission is providing full Sanctification to clients. Empowerment Technology believes in getting good feedback.\u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology management has been inventing new and better ways to help company to achieve business results faster.\u003C/p\u003E\n\n\u003Cp\u003EOur Ability to deliver first to end Business process. We believes in providing best services in market in comparison  of others.\u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology  has apply work strategically  customers to deliver end-to-end services and products.\u003C/p\u003E\n\n\u003Cp\u003EOUR SERVICES:\u003C/p\u003E\n\n\u003Cp\u003EWEB DESIGN AND DEVELOPMENT:\u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology deals in software development. We works on different platform like PHP, Dot Net Framework,JAVA etc..We provides best services in Website Designing , Web Application Development, Dynamic Website Designing, e-commerce Website design, SEO Website Design,PSD to XHTML conversion,Readymade PHP Scripts/Software and logo \u0026amp; brocher design in Lucknow India.\u003C/p\u003E\n\n\u003Cp\u003EINDUSTRIAL TRAINING: \u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology provides best IT Training on various technology like Dot Net framework, PHP , JAVA, SEO, Internet Marketing, Embedded System, Android, Iphone, VLSI, SQT, Ethical Hacking in Lucknow.\u003C/p\u003E\n\n\u003Cp\u003EWe have Skilled trainer of each technology.Our all Faculty are BE/M.tech Qualify. We trained our trainee on live projects that provides live experience of industry environment.\u003C/p\u003E\n\n\u003Cp\u003ESEO SERVICES AND TRAINING:\u003C/p\u003E\n\n\u003Cp\u003EEmpowerment Technology is an  SEO Company Lucknow that provides best Search Engine Optimization and Internet marketing Solution. Our dedicated team of SEO Analyst gives guaranteed top 10 search engine ranking on Google, Yahoo and MSN and other search engines.\u003C/p\u003E\n\n\u003Cp\u003EOur SEO team follows Guidelines of Google and other search engines. We work on White hat SEO techniques and avoid the Black hat SEO. Our clients give good feedback because they get best results in targeted traffic and ranking. Our clients are from world over like India,Nepal,UK,Australia.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0026/9120/269120v2-max-150x150.png"],
     [[250,
       67],
      "assets/images/resized/0026/9120/269120v2-max-250x250.png"],
     [[271,
       73],
      "assets/images/resized/0026/9120/269120v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Empowerment Technology",
    "address1": "3rd Floor, Deva palace, Viram Khand",
    "address2": "Gomti Nagar",
    "zip_code": "226010",
    "city": "Lucknow",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://empowermenttech.com/industrial-training/",
    "title": "Summer Industrial Training Company"}]}