{"name": "Endless Electronics",
 "permalink": "endless-electronics",
 "crunchbase_url": "http://www.crunchbase.com/company/endless-electronics",
 "homepage_url": "http://www.endlesselectronics.org/",
 "blog_url": "http://www.endlesselectronics.org/blog/",
 "blog_feed_url": "http://www.endlesselectronics.org/blog/feed/",
 "twitter_username": "endlesselectron",
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 30,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ps3-repair-services, iphone-repair-services, xbox-360-repair-services, printed-circuit-board-repair, smt-device-repair, consumer-electronics-repair",
 "alias_list": null,
 "email_address": "support@endlesselectronics.org",
 "phone_number": "314-732-1358",
 "description": "Electronics Repair, PS3 Repair",
 "created_at": "Thu Sep 06 17:15:59 UTC 2012",
 "updated_at": "Sun Sep 09 19:34:45 UTC 2012",
 "overview": "\u003Cp\u003EEndless Electronics offers professional electronics repair services. \nAt this time the company focuses on consumer electronics including Sony Playstation 3 Repair Services, Apple Iphone Repair Services, Microsoft Xbox 360 Repair Services and others. Many of the devices repaired by Endless Electronics are specialized consumer electronics. As more consumers shift from personal computers into mobile devices and console computing there is a growing demand for repair services providers for these devices. \nEndless Electronics is capable of handling a diverse number of issues and repairs that plague modern devices. From replacing a broken iPhone screen to repairing a PCB board\u0026#8217;s SMT components on a Playstation 3 motherboard, Endless Electronics experience allows the company to offer a wide range of specialized repair services. \nEndless Electronics is most known for their Sony Playstation 3 repair services. The PS3 experiences many issues including, the \u0026#8220;Yellow Light of Death\u0026#8221; aka YLOD, blu-ray diode replacements, power supply repair, and other less common issues. Our technicians specialize in fixing the error known as the YLOD or Yellow Light of Death. The most common source of this error is the solder joints under the RSX Chip (Graphics Chip). Endless Electronics has experience in repairing the solder joint that commonly fails. In addition the company offers various upgrades and modifications for the PS3 in order to fortify it against failure. \nEndless Electronics is also know for their iPhone repair services. iPhones take a fair amount of wear and tear. The most common problem with the iPhone is damage to the LED screen. Endless Electronics has experience in replacing these screens and other delicate components inside the iPhone. For many users in a contract an iPhone repair services is much cheaper than buying a new iPhone out of contract without an upgrade credit. Thus, demand is growing for smart phone repair services. \nEndless Electronics offers a one year warranty on all of their work and by the customer reviews, has a good reputation. Endless Electronics is continuing to grow and hopes to expand into industrial electronics repair in the near future. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       73],
      "assets/images/resized/0021/0119/210119v2-max-150x150.png"],
     [[250,
       122],
      "assets/images/resized/0021/0119/210119v2-max-250x250.png"],
     [[450,
       220],
      "assets/images/resized/0021/0119/210119v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "315 Lemay Ferry Rd.",
    "address2": "Ste. 105",
    "zip_code": "63125",
    "city": "Saint Louis",
    "state_code": "MO",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://www.facebook.com/endlesselectronics",
    "title": "Endless Electronics - Facebook Page"},
   {"external_url": "http://www.tumblr.com/blog/endlesselectronics",
    "title": "Endless Electronics - Tumblr Blog"}]}