{"name": "EnergyGuardian",
 "permalink": "energyguardian",
 "crunchbase_url": "http://www.crunchbase.com/company/energyguardian",
 "homepage_url": "http://www.energy-guardian.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": 10,
 "founded_year": 2009,
 "founded_month": 10,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "clean-tech",
 "alias_list": null,
 "email_address": "info@enistic.com",
 "phone_number": "08448751600",
 "description": "Energy Management",
 "created_at": "Wed Jun 15 14:28:19 UTC 2011",
 "updated_at": "Fri Jun 17 23:51:11 UTC 2011",
 "overview": "\u003Cp\u003EEnergy Guardian provides a simple energy management and savings solution for the enterprise.\u003C/p\u003E\n\n\u003Cp\u003EEnergy Guardian is a fully-managed energy-saving service. Designed to meet the needs of your organisation, we offer a flexible modular approach.\u003C/p\u003E\n\n\u003Cp\u003EMost clients use our smart metering and energy coaching modules as a starting point:\u003C/p\u003E\n\n\u003Cp\u003EAdvanced smart metering and sub metering - our energy diagnosis module, giving us a detailed picture of your energy use. We typically fit around 25, 50, 100 or 250 real-time smart meters into your building and get the information flowing back to our energy management portal. This enables us to analyse your energy use remotely and produce reports showing exactly how your energy budget is being spent. Read more\u0026#8230;\nEnergy coaching - our category 4 commercial energy assessors are available for you to call on whenever you wish. They will mentor and guide you through the detailed data that the smart metering module generates. The coach typically spends a few hours per month looking through your data remotely, analysing how your energy reduction plan is stacking up against your agreed targets and helping you decide on practical steps to reach and exceed your targets.\nWe have an extensive range of additional modules to help you increase your savings further in specific areas:\u003C/p\u003E\n\n\u003Cp\u003ELighting energy-saving solutions - with meters analysing your lighting energy use in real-time, our systems can identify the savings you would make through improvements to your lighting systems. We have tools available that can reduce your lighting voltage, saving around 18% of your lighting spend, without any noticeable change in light quality.\nAir conditioning energy-saving solutions - most companies spend a fortune on air conditioning and ventilation. With recent advances in energy-efficient systems for use with your A/C chiller units and fans, we can save you between 15 to 25% of your energy without any degradation in cooling performance. Additional by-products of our solutions are an extended operational life and less maintenance. Read more\u0026#8230;\nChiller energy-saving solutions - chillers such as drinks cabinets for restaurants, bars and cafes are hugely inefficient and our simple-to-install solution can cut around 25% of your energy spend without affecting the temperature of the chilled products. Read more\u0026#8230;\nSite voltage optimisation solutions - with the UK, North America and most European countries operating at voltages in excess of that needed to operate machinery efficiently, a reduction of your incoming mains voltage by 10-20% is simple and leads to instant energy savings of a similar percentage. Our solutions come in a range of sizes and are easily installed and have a low ongoing maintenance cost. Plus, by using a better quality of mains supply, your electrical equipment should last longer. Read more\u0026#8230;\nPC power-off solutions - if, like us, you hate it when people go home at the end of the day and leave their PCs switched on, you should consider our PC Power Off solution which will automatically turn off unused Windows PCs at the end of the day, saving any work the user was doing before they left, ready to restart the next day. Read more\u0026#8230;\nMachinery and motor energy-saving solutions - in most machinery, motors are typically specified to deliver a maximum performance closely matched to the maximum capability of the machine in question. For example, escalator motors will normally be designed to carry two full-sized male passengers per step for 24 hours a day, 7 days a week. Most machines, however, usually run either in bursts or run significantly less than fully loaded for most of the time. Our machinery and motors module uses advanced smart meter information to determine whether we can fit additional equipment to significantly reduce the energy used by these motors in partial load conditions. Read more\u0026#8230;\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head office ",
    "address1": "10 Wornal Park",
    "address2": "Worminghall",
    "zip_code": "Hp18 9PH",
    "city": "",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}