{"name": "ENIET Systems",
 "permalink": "eniet-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/eniet-systems",
 "homepage_url": "http://eniet.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "ENIETSYSTEMS",
 "category_code": "software",
 "number_of_employees": 15,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it-outsourcing, software-development, web-development, mobile",
 "alias_list": null,
 "email_address": "info@eniet.com",
 "phone_number": "",
 "description": "Ukrainian software development company",
 "created_at": "Thu Jan 10 19:13:08 UTC 2013",
 "updated_at": "Mon Jan 14 07:39:28 UTC 2013",
 "overview": "\u003Cp\u003EEniet Systems is a IT outsourcing company, with the single aim of helping our customers build remote software development teams. The segments that we provide our services to are inclusive of, but not limited to gaming, e-commerce, software development, healthcare, tourism, and banking etc. We are professionals in the field and wish to make it possible for our clients to benefit from the goodness of IT outsourcing. We do so by delivering to them scalable, flexible and professional remote teams of software developers that are located in Ukraine. \nOur nearshore and offshore IT outsourcing services are based on one core offering - Eniet Client Team - also called Client Own Software Development Team - which stands for your IT software development or support team with Eniet, primarily in Eastern Europe. We establish interactive IT software development teams in Ukraine and Belarus to enable our clients to work directly with developers to reach a high level of productivity. \nOur skilled HR team finds the best team extension solution for your needs while you stay in control of the costs. Eniet simply invoices you for the employee salary and our service fee. You save 40 to 60 percent of your total budget - even when the economy shifts down all over the world. Thus you have your own in-house IT specialists simply sitting in Ukraine and/or Belarus but for a significantly lower cost and less administrative nuisances. \nEniet Client Own Software Development Team Eastern Europe - It is like all working around the same table\nOur clients also have an option to establish fully or partially their own development team in our Pakistan offices (also can be an add on option to the team in Ukraine or Belarus), though in the latter Eniet offers a Managed Team concept, where the team is managed by a Project Manager from Eniet. \nClient Own Software Development Team comes fully loaded with a range of built-in services as part of the core offering, such as:\n• Finding, selecting and hiring the best IT professionals for your team\n• Semiannual development interviews and employee performance appraisals, education for Project Managers, Eniet knowledge sharing environment\n• Provisioning and rental of the technical infrastructure\n• Start-up support and consulting with best practices for setting up client own development team \n• Management of all administrative and operational issues\n• Securing all IP and exit opportunities if client wants to go it alone \nWhen you choose Eniet Client Own Software Development Team model, you also have access to a wide variety of additional resources to help you expand and stay in step with market demands. \nYour Benefits with Eniet Client Own Development Team Model\n• Control outsourcing costs and increase time to market With a blend of technical, human and administrative elements\n• Focus on profit and productivity With a highly qualified IT talent pool\n• Directly oversee performance and rewards With a transparent business model\n• Share, teach and learn From cross-team expertise and experience\n• Create synergy and close relationships With dedicated client teams that are part of your corporate culture\n• Keep developers focused on the work With end-to-end comprehensive HR management\n• Achieve administrative efficiencies With simplified universal administrative features\n• Build sustainability with minimal investment or risk With Eniet\u0026#8217;s scalability and flexibility that evolves as markets shift\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[148,
       52],
      "assets/images/resized/0022/9107/229107v2-max-150x150.png"],
     [[148,
       52],
      "assets/images/resized/0022/9107/229107v2-max-250x250.png"],
     [[148,
       52],
      "assets/images/resized/0022/9107/229107v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}