{"name": "Eniware, LLC",
 "permalink": "eniware-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/eniware-llc",
 "homepage_url": "http://eniwaresterile.com/",
 "blog_url": "http://eniwaresterile.com/latest-news-and-press-releases/",
 "blog_feed_url": "",
 "twitter_username": "Eniware",
 "category_code": "biotech",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "medical-device, sterilization, infection-control, disruptive-technology, developing-world, disaster-relief, emergency-response, military",
 "alias_list": null,
 "email_address": "eric.verkerke@eniwaresterile.com",
 "phone_number": "(202) 556-1350",
 "description": "Portable power-free sterilization",
 "created_at": "Wed Aug 01 14:11:29 UTC 2012",
 "updated_at": "Mon Aug 06 18:54:04 UTC 2012",
 "overview": "\u003Cp\u003EABOUT ENIWARE\nFounded in 2011, Eniware, LLC is poised to provide portable, power-independent sterilization of medical equipment for existing and expanding healthcare anywhere, at any time. Eniware has secured an exclusive proprietary license to Noxilizer, Inc.’s patented nitrogen dioxide (NO2) gas sterilization technology for Africa, Asia (except Japan), and the Middle East, as well as a global license to develop portable sterilization solutions for military and disaster relief applications. Eniware capitalizes on over $17 million invested in Noxilizer’s basic and applied research, which has documented and brought to market the underlying technology. Eniware will provide portable, power-free, low-cost sterilization of medical instruments in resource-limited environments from disaster areas to conflict zones and from urban hospitals to rural clinics around the world.\u003C/p\u003E\n\n\u003Cp\u003EHEALTH PROBLEM ADDRESSED \nInfection and disease transmission in clinics and hospitals afflict millions in the developing world. Sterile medical instruments can mean the difference between life and death. Reported healthcare-related infection (HRI) rates in developing countries range from 15% to 40%. This problem only grows as access to healthcare grows, particularly with the expansion of simple, basic surgery in under-resourced settings. Potentially lifesaving procedures tragically cripple or kill millions of men, women, and children due to lack of affordable, effective sterilization of medical equipment.\u003C/p\u003E\n\n\u003Cp\u003EPRODUCT DESCRIPTION\nA portable, table-top sterilization system consisting of a case equipped with a simple valve which will sterilize a wide range of medical equipment using ampules of nitrogen dioxide gas and a filter to deactivate the gas at the end of the cycle. The system will enable healthcare workers to safely sterilize vital instruments and supplies anywhere, at any time.\u003C/p\u003E\n\n\u003Cp\u003EIn resource-limited and remote environments NO2 sterilization provides the ability to truly sterilize instruments and equipment independent of access to water or electrical power and other fuel sources. The system is compatible with a much wider array of medical equipment than competing options such as autoclaves. The characteristics of the gas itself also provide considerable benefits: NO2 can penetrate packaging and complex devices, it does not leave residue, it is not explosive, and it sterilizes completely even at low concentrations. These traits allow for an affordable, effective, and adaptable sterilization system that requires very little training and can be easily deployed by disaster relief teams, military first responders, and community health workers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       44],
      "assets/images/resized/0020/3912/203912v2-max-150x150.jpg"],
     [[250,
       74],
      "assets/images/resized/0020/3912/203912v2-max-250x250.jpg"],
     [[450,
       134],
      "assets/images/resized/0020/3912/203912v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}