{"name": "Ennovance Capital",
 "permalink": "ennovance-capital",
 "crunchbase_url": "http://www.crunchbase.com/company/ennovance-capital",
 "homepage_url": "http://www.ennovance.com/",
 "blog_url": "http://ennovance.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "private-equity, lbo, buyout",
 "alias_list": null,
 "email_address": "info@ennovance.com",
 "phone_number": "+1-800-901-1006",
 "description": "PE buy-out firm",
 "created_at": "Thu Apr 23 04:50:31 UTC 2009",
 "updated_at": "Wed Oct 19 22:36:38 UTC 2011",
 "overview": "\u003Cp\u003EEnnovance Capital is a niche industry-focused investor in middle market products and services companies. We exclusively focus on the chemical, allied product and related specialty material sectors.  \u003C/p\u003E\n\n\u003Cp\u003EChemical is the foundation of modern life with addressable market value over $3 trillion. End markets for this industry related products and services vary widely such as: water and waste treatment, functional additives for renewable energy, pharmaceutical fine chemicals, specialty material for medical device or electronics, biodegradable plastics, coatings, organic chemistry for food, flavor, fragrance and beverage, beauty \u0026amp; personal care, hygiene \u0026amp; cleaning solutions for hospitals or general application, preservatives, fertilizer, catalyst and so on.  We also like niche manufactured equipment, and services business related to chemistry such as contract manufacturing, contract research (CRO), laboratory supplies, safety or security solutions etc.  \u003C/p\u003E\n\n\u003Cp\u003EWe focus on structuring acquisitions that meet the unique requirements of each strategic seller, navigating all aspects of deal complexities. From public-to-private transactions to corporate divestitures of non-core assets, we\u0026#8217;re skilled at mitigating all degrees of risk when extracting a non-core division from its parent, maintaining business momentum, and ensuring business continuity.  We utilize a multi-disciplinary approach to investing, and implement various growth and margin initiatives in combination with the operating management team. \u003C/p\u003E\n\n\u003Cp\u003EEnnovance Capital has been founded by a group of senior chemicals industry executives with complementary, sector-focused experience in investment banking, operations, management and private equity. Most importantly, they have a long working history together as a high performing team.  \u003C/p\u003E\n\n\u003Cp\u003EOur primary objective is to buy niche industry focused specialty product and service companies, operate, build, and create TRUE long-term value (instead of only financial Hodgepodge)! \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Miroslaw",
      "last_name": "Nowoszewski",
      "permalink": "miroslaw-nowoszewski-2",
      "image":
       {"available_sizes":
         [[[150,
            104],
           "assets/images/resized/0010/3475/103475v2-max-150x150.jpg"],
          [[250,
            174],
           "assets/images/resized/0010/3475/103475v2-max-250x250.jpg"],
          [[428,
            298],
           "assets/images/resized/0010/3475/103475v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Philadelphia Office",
    "address1": "1880 John F Kennedy Blvd",
    "address2": "701",
    "zip_code": "19454",
    "city": "Philadelphia",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": 40.2090785,
    "longitude": -75.2309109}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}