{"name": "Enterprise Den",
 "permalink": "enterprise-den",
 "crunchbase_url": "http://www.crunchbase.com/company/enterprise-den",
 "homepage_url": "http://www.enterpriseden.com",
 "blog_url": "http://www.enterpriseden.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "EnterpriseDen",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-funding, ange-investment, start-ups, funding, enterprise, entrepreneurs, investors, venture-capital, business-angels, entrepreneurship, angel-investing, raising-business-finance, small-business-grants, small-business-finance",
 "alias_list": null,
 "email_address": "media@enterpriseden.com",
 "phone_number": "",
 "description": "Connecting Entrepreneurs \u0026 Investors",
 "created_at": "Tue Jun 12 12:33:13 UTC 2012",
 "updated_at": "Mon Oct 15 06:31:24 UTC 2012",
 "overview": "\u003Cp\u003EEnterprise Den is the free online business funding and investment market place where entrepreneurs and investors meet to exchange exciting investment opportunities for Angel Investment funding and expertise.\nhttp://www.enterpriseden.com \u003C/p\u003E\n\n\u003Cp\u003EMission\nEnterprise Den is the premier marketplace where successful entrepreneurs and Angel investors meet to exchange exciting investment opportunities for Angel Investment funding and expertise. Free to all, means no charges. Entrepreneurs simply create a pitch including a video presentation for the best impact. Anyone can join - it\u0026#8217;s free, fast, easy and effective. It could lead to the next google, ebay or facebook - so why not try it out today?\u003C/p\u003E\n\n\u003Cp\u003EDescription\nIf you\u0026#8217;re an entrepreneur with a great business idea, or are already established or even if you are looking to sell your business, Enterprise Den can help you upload your business proposal and add a video pitch, in order to generate angel investor interest and obtain business funding. Its fast, simple and effective.\u003C/p\u003E\n\n\u003Cp\u003EIf you own a business and have exciting ideas about how to elevate it to the next level and beyond, but are strapped for cash, then we can help you find a reliable business partner with business funding support to help your business thrive and realise its full potential.\u003C/p\u003E\n\n\u003Cp\u003EWith Enterprise Den there are NO BANK LOANS INVOLVED! Our formula is simple - connecting entrepreneurs and angel investors who exchange equity for business funding. This approach enables true business partnership and avoids the risk of bankruptcy or recalled bank loans.\u003C/p\u003E\n\n\u003Cp\u003EAngel Investors get immediate access to untapped investment opportunities with exciting, fresh growth potential. We will alert you to business pitches matching your preferences as they are uploaded.\u003C/p\u003E\n\n\u003Cp\u003EWe are 100% FREE to all users.\u003C/p\u003E\n\n\u003Cp\u003EAt Enterprise Den our free to all web platform provides entrepreneurs and angel investors with:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cp\u003EA fast and simple process to upload your business pitch in only a few clicks.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EA chance to make a personal connection using our VideoPitchTM facility.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EAccess to our search tools to find that perfect investment. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EThe ability to compare investments side by side using our PitchCompareTM comparison tool.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EThe ability to save your search or create email alerts using our PitchAlertTM tools.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EAn opportunity to review entrepreneur business pitches and get in touch with entrepreneurs directly\u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0019/5053/195053v2-max-150x150.jpg"],
     [[250,
       68],
      "assets/images/resized/0019/5053/195053v2-max-250x250.jpg"],
     [[450,
       123],
      "assets/images/resized/0019/5053/195053v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder \u0026 CEO",
    "person":
     {"first_name": "Abdul",
      "last_name": "S. Khan",
      "permalink": "abdul-s-khan",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://news.yahoo.com/enterprise-den-launches-free-based-business-funding-aimed-072551689.html",
    "title": ""},
   {"external_url": "http://www.techradar.com/news/world-of-tech/roundup/move-over-dragons-den-heres-enterprise-den-1081394?src=rss\u0026attr=all\u0026utm_source=dlvr.it\u0026utm_medium=twitter",
    "title": ""},
   {"external_url": "http://www.prweb.com/releases/Investors_Entrepreneurs/Business_Funding/prweb9527602.htm",
    "title": ""}]}