{"name": "Entreda",
 "permalink": "entreda",
 "crunchbase_url": "http://www.crunchbase.com/company/entreda",
 "homepage_url": "http://www.entreda.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "entreda",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": 12,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it-as-a-service, hybrid-cloud-computing, backuprecovery, security",
 "alias_list": null,
 "email_address": "info@entreda.com",
 "phone_number": "",
 "description": "IT-as-a-Service Platform",
 "created_at": "Tue Oct 25 18:27:37 UTC 2011",
 "updated_at": "Wed Jul 04 08:48:31 UTC 2012",
 "overview": "\u003Cp\u003EEntreda provides next-generatioon IT-as-a-Service infrastructure and applications to telecom carriers, cloud hosting vendors and managed services providers.\u003C/p\u003E\n\n\u003Cp\u003EThe Entreda Service Delivery Platform (ESDP) enables service delivery partners to provide enterprise-grade IT to SMEs, thereby closing the SME IT support gap while laying the foundation for secure migration to a cloud future.\u003C/p\u003E\n\n\u003Cp\u003EAbout the Entreda Service Delivery Platform (ESDP)\u003C/p\u003E\n\n\u003Cp\u003EDesigned from the ground up to enable cloud services providers to deliver affordable IT-as-a-Service to SMEs, the hybrid architecture ESDP includes 4 components as follows:\u003C/p\u003E\n\n\u003Cp\u003EEntreda Connector Appliance: An intelligent, self-intalling hybrid cloud appliance that provides on-premise and remote IT services to SMEs including managed backup \u0026amp; recovery, firewall protection, network monitoring and more. The zero-touch Entreda Cloud Connector Appliance is managed by the system operator (i.e. service provider) on behalf of the SME, and can be configured and customized based on the SME\u0026#8217;s requirements.\u003C/p\u003E\n\n\u003Cp\u003EEntreda IT-as-a-Service Suite: A unified suite of must-have IT capabilities that streamlines an SME\u0026#8217;s operations and closes the SME IT support gap while eliminating the SME\u0026#8217;s dependence on legacy point solutions in backup/recovery, security, IT alerts and more. The ITaaS Suite can be customized to the needs of the system operator and upgraded to include enhanced functionality for the age of the cloud, including SaaS application acceleration, private cloud application hosting, app filtering and more.\u003C/p\u003E\n\n\u003Cp\u003EEntreda Subscriber Enrollment Engine (SEE): An authentication widget to enable SMEs to monitor, support and receive alerts on all client devices enrolled in a given service subscription. The SEE provides visibility for system operators, customers and IT staff for all enrolled devices.\u003C/p\u003E\n\n\u003Cp\u003EEntreda Management Console: A cloud management and automation portal enabling an SME or delegated IT consultant to configure and provision all services provided by the Entreda IT-as-a-Service Suite and Entreda Cloud Connector Appliance. The management console is customized for service delivery over a given provider\u0026#8217;s network.\u003C/p\u003E\n\n\u003Cp\u003EThe Entreda Service Delivery Platform (ESDP) can be white-labeled or co-branded by an Entreda IT-as-a-Service partner, consistent with a partner\u0026#8217;s enhanced cloud services strategy. Multiple business model and revenue-sharing options are available.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       51],
      "assets/images/resized/0015/9536/159536v2-max-150x150.jpg"],
     [[250,
       86],
      "assets/images/resized/0015/9536/159536v2-max-250x250.jpg"],
     [[450,
       154],
      "assets/images/resized/0015/9536/159536v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Headquarters",
    "address1": "1370 Willow Road",
    "address2": "",
    "zip_code": "94025",
    "city": "Menlo Park",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        94],
       "assets/images/resized/0015/9535/159535v2-max-150x150.jpg"],
      [[250,
        157],
       "assets/images/resized/0015/9535/159535v2-max-250x250.jpg"],
      [[450,
        283],
       "assets/images/resized/0015/9535/159535v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.mspnews.com/msp/articles/233477-entreda-rolls-out-service-delivery-platform-cloud-service.htm",
    "title": ""},
   {"external_url": "http://news.yahoo.com/entreda-spells-opportunity-cloud-services-providers-100311924.html",
    "title": ""}]}