{"name": "Envision Personalized Health",
 "permalink": "envision-personalized-health",
 "crunchbase_url": "http://www.crunchbase.com/company/envision-personalized-health",
 "homepage_url": "http://www.envisionpersonalizedhealth.com/index.php",
 "blog_url": "http://www.envisionpersonalizedhealth.com/blog.php",
 "blog_feed_url": "",
 "twitter_username": "envision_health",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "certified-personal-trainer, yoga-classes, pilates-yoga, pilates-fitness, spa-services, day-spa, day-spa-salon, spa-massage, massage-therapy, facial-treatment, wellness-center, chinese-acupuncture, health-nutrition, nutrition-diet, stress-management, fitne",
 "alias_list": null,
 "email_address": "envisionpersonalizedhealth@gmail.com",
 "phone_number": "619.229.9695",
 "description": "San Diego Personal Trainers",
 "created_at": "Fri Dec 31 13:28:35 UTC 2010",
 "updated_at": "Fri Jan 07 05:11:21 UTC 2011",
 "overview": "\u003Cp\u003EMaking Your Health and Fitness Personal\nMission Valley, San Diego Personal Fitness Trainers\u003C/p\u003E\n\n\u003Cp\u003EPersonal Trainers Help Keep You On Track\nAt Envision Personalized Health in San Diego, personal trainers are ready to help you stay on track by providing motivation, accountability and education for your health and fitness goals. Exercise, nutrition, and health programs are designed for you to help you to loose weight, gain muscle, and feel great for the Summer. Fitness programs are available for any fitness level. Specializing in Personal Fitness Training, Nutritional Counseling, Yoga, Pilates, Acupuncture, Massage along with our Day Spa, help us to customize a program for you from our range of health and fitness services.\u003C/p\u003E\n\n\u003Cp\u003EAlternative Health\nIncrease your energy, boost your immune system, stop smoking, loose weight, woman\u0026#8217;s health issues and digestive heath are a few of the health concerns that can be addressed by the alternative health care practitioners at Envision Personalized Health. Develop an alternative health plan utilizing tools such as acupuncture, nutrition, yoga, meditation, and massage to experience more energy, reduced blood pressure, lowered cholesterol, relief of muscle tension, and clearer thought processes.\u003C/p\u003E\n\n\u003Cp\u003EPersonal Training\nAt Envision Personalized Health, in San Diego, Mission Valley fitness and day spa, personal trainers will analyze your goals and fitness level to develop a personalized client program. We specialize in One on One personalized appointments, not memberships. It is important to have the experience and knowledge of a personal trainer as your personal coach, in directing a program of health. Your fitness trainer can assist your Pilates instructor, yoga practitioner, acupuncturist and nutritional counselor to create an integrated process of lifestyle change to benefit your health.\u003C/p\u003E\n\n\u003Cp\u003EDay Spa Services\nCome experience the very best in San Diego, Mission Valley Day Spa services. Whether it is after a tough workout, a stressful day at work, or for a special occasion. Ask about our special packages and our seasonal offerings that are available specifically for you. Fall is the perfect time to refresh your spirit and dry summer skin with the healthy glow of a facial peel, or body treatment.\u003C/p\u003E\n\n\u003Cp\u003ENutrition\nAt Envision Personalized Health in San Diego Mission Valley our registered dietitians and certified nutritionist can assist you in developing a comprehensive nutrition profile which includes nutrition lifestyle goals. Our nutrition professional approaches each client individually when developing a comprehensive, confidential nutritional analysis for your person health . Specializing in weight loss programs, improving metabolism, reducing cholesterol , stabilizing blood sugar, controlling cravings, managing woman\u0026#8217;s health issues, and creating a healthy diet for diabetics.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0011/5878/115878v4-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0011/5878/115878v4-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0011/5878/115878v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Owner and Weight \u0026 Lifestyle Management Counselor",
    "person":
     {"first_name": "Vickie",
      "last_name": "Nickerson",
      "permalink": "vickie-nickerson",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Envision Personalized",
    "address1": "4760 Mission Gorge Place Suite E",
    "address2": "",
    "zip_code": "92120",
    "city": "San Diego",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[98,
        150],
       "assets/images/resized/0011/5876/115876v2-max-150x150.png"],
      [[163,
        250],
       "assets/images/resized/0011/5876/115876v2-max-250x250.png"],
      [[294,
        450],
       "assets/images/resized/0011/5876/115876v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[39,
        150],
       "assets/images/resized/0011/5877/115877v2-max-150x150.png"],
      [[66,
        250],
       "assets/images/resized/0011/5877/115877v2-max-250x250.png"],
      [[119,
        450],
       "assets/images/resized/0011/5877/115877v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}