{"name": "eRoutingGuide",
 "permalink": "eroutingguide",
 "crunchbase_url": "http://www.crunchbase.com/company/eroutingguide",
 "homepage_url": "http://www.eroutingguide.com",
 "blog_url": "http://easylogisticsmanagement.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "eroutingguide",
 "category_code": "software",
 "number_of_employees": 2,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "transportation-management-software, tms, logistics-software, bill-of-lading, routing-guide",
 "alias_list": null,
 "email_address": "kkowal@eroutingguide.com",
 "phone_number": "717-371-4874",
 "description": "Easy Transportation Management Software",
 "created_at": "Fri Aug 13 19:59:38 UTC 2010",
 "updated_at": "Fri Aug 13 20:33:47 UTC 2010",
 "overview": "\u003Cp\u003EeRoutingGuide is a simple transportation management software (TMS) for any company shipping products, from small parcel to full truck loads.\u003C/p\u003E\n\n\u003Cp\u003EThe foundation of eRouting Guide is the TMS functionality. TMS reduces freight expense by improving routing decisions and helping to improve communication with your transportation vendors. Putting an end to old, manual ways of tendering loads and sending paperwork, The right supply chain management software automates procedures reducing time, errors and costs to perform these once arduous tasks. A TMS allows you to implement a standard process that is efficient, repeatable and consistent enough to withstand any change to your people or your business.\u003C/p\u003E\n\n\u003Cp\u003EA Routing Guide: when well executed help reduce issues with inbound shipments by preventing misrouted orders and the resulting hassles. Cost are contained when the right carrier is used the first time, and product arrives at the right place and on time. The challenge is disseminating your Routing Guide information to the parties who need it (suppliers, vendors, buyers) and keeping them updated as the Routing Guide changes.\u003C/p\u003E\n\n\u003Cp\u003EMost shipping departments waste time talking to carriers, performing the same basic tasks, and re-communicating simple information (providing directions, checking in drivers, arguing over detention and accessorial charges). Automating where possible and reducing the time spent talking to drivers and dispatchers is time better spent elsewhere. It should be every facilities goal to allow its shipping department to focus on value-add activities (like getting trucks loaded faster and more accurately).\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "17538",
    "city": "Lancaster",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://logipi.com/Logipi-SCM.aspx?newsId=254404\u0026pageId=1",
    "title": "Logipi Interview"}]}