{"name": "eSiteWorld TechnoLabs",
 "permalink": "esiteworld-technolabs",
 "crunchbase_url": "http://www.crunchbase.com/company/esiteworld-technolabs",
 "homepage_url": "http://www.esiteworld.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 50,
 "founded_year": 2005,
 "founded_month": 12,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-development-company, web-design-company, esiteworld, web-design, web-development, php-web-development, iphone, ipad, android, blackberry-apps-development-india",
 "alias_list": "",
 "email_address": "contactus.esw@gmail.com",
 "phone_number": "+91-990-926-1163, +91-79-40061163, +91-79-30494963, +91-966-256-6999",
 "description": "Web Development Company",
 "created_at": "Wed May 30 10:12:24 UTC 2012",
 "updated_at": "Tue Oct 16 16:40:31 UTC 2012",
 "overview": "\u003Cp\u003EThere are plenty of India based offshore outsourcing companies offering web application development services, but there are companies who like to push the envelope and offer application development for both the web and mobile platforms and bring forth applications that boost the business growth of their clients – eSiteWorld is one such company. This company brings to its clients a wide variety of services including PHP web development, ecommerce web\ndevelopment, ColdFusion web development, Facebook apps development, WordPress Development, Android apps development and iPhone application development amongst many more.\u003C/p\u003E\n\n\u003Cp\u003EThe company has over 6 years of hands on experience in executing client projects that confirm to the highest benchmarks of technical efficiency and functionality. Its experience allows it to handle all clients’ requirements and needs, and satisfy them with cutting edge applications specifically designed for the web or mobile.  \u003C/p\u003E\n\n\u003Cp\u003EeSiteWorld believes in adhering to a process of comprehensive development that takes client projects through all the stages of development. Its services are backed a team of developers and designers who have varying degrees of experience of using technologies like PHP, jQuery, MySQL, AJAX, Joomla, JavaScript, iOS, Android OS and many more. This allows the infusion of fresh ideas in the development of its web and mobile applications, which results in unique applications that adopt an innovative approach towards satisfying all client requirements.\u003C/p\u003E\n\n\u003Cp\u003EEverybody looking for turn key solutions for their business’s IT requirements need to take a look at the extensive portfolio of services of eSiteWorld. There is literally something for everybody, and in just a very short span of time, it has built a reputation for bringing even the most challenging client projects to fruition. More importantly, the company is fully committed to delivering its projects on time and within budget.\u003C/p\u003E\n\n\u003Cp\u003EGo to http://www.esiteworld.com/ and check out the website for yourself; you will get an idea of the credibility, professionalism and expertise of the company from the website itself. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       28],
      "assets/images/resized/0019/3112/193112v2-max-150x150.png"],
     [[238,
       46],
      "assets/images/resized/0019/3112/193112v2-max-250x250.png"],
     [[238,
       46],
      "assets/images/resized/0019/3112/193112v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}