{"name": "Essar Co",
 "permalink": "essar-co",
 "crunchbase_url": "http://www.crunchbase.com/company/essar-co",
 "homepage_url": "http://www.indiamart.com/essar-co/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "essar-co@tradepassport.org",
 "phone_number": "9944494980",
 "description": " supplier and importer of Asbestos Millb",
 "created_at": "Fri Apr 05 08:37:43 UTC 2013",
 "updated_at": "Fri Apr 05 08:37:48 UTC 2013",
 "overview": "\u003Cp\u003EEssar \u0026amp; Co. was established in the year 2010 as a partnership firm at Coimbatore, Tamil Nadu (India). We are engaged in supplying and importing a comprehensive range of Asbestos Millboard, Industrial Minerals, Refractory Material, Specialty Chemicals \u0026amp; Safety Bricks. Our range includes Boric Acid, Core Paste, Fire Clay, Graphite Powder, Cupola Bricks, Zinc Oxide, Bentonite Powder and a lot more.\u003C/p\u003E\n\n\u003Cp\u003EOur Motto:\nBest Quality products is our motto and base of our quality policy, which guides us in the right direction to end up our business day with satisfaction at our end and vice versa too at our valuable customers end.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nBeing a reliable organization, we have appointed competent and experienced staff members. Our personnel have been selected after rigorous skill evaluation tests. The procuring experts are well-versed with advanced technologies which helps them implement latest quality checking techniques with utmost ease while procuring our products.\u003C/p\u003E\n\n\u003Cp\u003EOur Vendor Base:\nWe cherish our association with the reputed vendors who have made us to be a numerous company in the industry. We have a dedicated team responsible for the selection of vendors as per international quality standards. Our vendors assure timely delivery of the products.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nThe company supply and import a sophisticated range of Asbestos Mill Boards, Industrial Minerals, Refractory Material, Specialty Chemicals \u0026amp; Safety Bricks. Our focused business approach has helped us in gaining expertise in the domain and offer fine quality products to the clients. Our prime goal is to render maximum satisfaction to clients in every possible aspect.\u003C/p\u003E\n\n\u003Cp\u003EIndustries we Serve:\nWe have range of products suitable for foundry, mini steel plants, textile processing plants, heat treatment plants, cement plants, beverages, petro chemical industry, agriculture, construction etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       100],
      "assets/images/resized/0024/8440/248440v2-max-150x150.jpg"],
     [[200,
       134],
      "assets/images/resized/0024/8440/248440v2-max-250x250.jpg"],
     [[200,
       134],
      "assets/images/resized/0024/8440/248440v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}