{"name": "EssEss Marketing",
 "permalink": "essess-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/essess-marketing",
 "homepage_url": "http://www.indiamart.com/essessmarketingagencies/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "essessmarketingagencies@tradepassport.org",
 "phone_number": "9347550815",
 "description": "",
 "created_at": "Thu Apr 04 11:09:53 UTC 2013",
 "updated_at": "Thu Apr 04 11:09:55 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in 1998, “Ess Ess Marketing Agencies” was established in Hyderabad, Andhra Pradesh, India. We are counted amongst the renowned names in the industry for manufacturing and supplying a quality assured range of Disposable Caps, Face Masks, Shoe Covers, Poly Gloves, Chef Caps and Gowns and different others.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are blessed by experienced and adroit professionals who enable us in fulfilling diverse requirements of the clients in most efficient manner.  These professionals are considered as the backbone and efficient strength of our company. Owing to the relentless efforts and support of we are able to deliver product range within well-defined time frame. Our experts hold in-depth experience in their experience that assists us to execute entire business operations in a systematic and smooth manner.  \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nBeing quality conscious firm, we are able to attain distinguished position in the industry by delivering flawless range of products to our valuable clients. We follow stringent TQM policies in the entire manufacturing process thereby catering diverse requirements of the clients in most efficient manner. We have updated tracking record system that assists us to track the path of consignments and give the regular update to our discerning clients. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Set-Up:\nWe have developed ultramodern infrastructure facility that is outfitted with advanced technologies and machinery. We regularly upgrade our machines and equipments that assist us to deliver quality approved product range that is in compliance with leading industrial standards and policies. Our manufacturing facility is monitored by a panel of diligent professionals who have in—depth experience in their concerned domain. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-focused organization, we execute our entire business activities with a prime aim to render utmost client satisfaction. We are efficient in comprehending the entire tasks and activities within specified time frame. For the easy convince of our clients we offer them easy payment modes including DD, Cheque and cash. Owing to the exceptional quality of the products we are able to attain strong foothold in the industry. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7837/247837v2-max-150x150.jpg"],
     [[225,
       225],
      "assets/images/resized/0024/7837/247837v2-max-250x250.jpg"],
     [[225,
       225],
      "assets/images/resized/0024/7837/247837v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}