{"name": "Essex Distributions",
 "permalink": "essex-distributions",
 "crunchbase_url": "http://www.crunchbase.com/company/essex-distributions",
 "homepage_url": "http://essex-distributions.com/",
 "blog_url": "http://essex-distributions.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "ESXDistribution",
 "category_code": "advertising",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "design, distributions, marketting, celebraty-events, guest-speakers, big-little-discount-book, leaflet-distribution, big-discounts-essex, big-little-discount-in-essex, castlle-point, benfleet, south-benfleet, thundersly, hadleigh, canvey, eastwood",
 "alias_list": null,
 "email_address": "talk2us@essex-distributions.com",
 "phone_number": "01268 287505",
 "description": "Design, Print, Distributions, marketting",
 "created_at": "Mon Feb 21 10:29:50 UTC 2011",
 "updated_at": "Mon Sep 19 00:59:46 UTC 2011",
 "overview": "\u003Cp\u003EWe provide a professional Design, Advertising, Marketing and distribution service in and around Essex. We offer a variety of design and marketing services tailored to your individual needs.\u003C/p\u003E\n\n\u003Cp\u003EDesign:\nWe offer Professional bespoke Design, Film and Web services and aim to deliver unique designs for each of our valued clients. Our design team is dedicated to offering top design solutions catered to all design jobs, big or small.\u003C/p\u003E\n\n\u003Cp\u003EOur designers can provide you with Corporate Identity, Branding, Design for Print, Email Marketing, Website Design/Construction \u0026amp; Maintenance, On location filming, Video editing and DVD production, brochures/magazines and other creative designs.\u003C/p\u003E\n\n\u003Cp\u003EMarketing and Advertising Consultancy:\nWe offer an efficient and high quality marketing service, providing you with the resources you need to carry out email campaigns, advertise in newspapers and magazines, set up billboard advertising and much more. Good marketing management is one of the major components of a successful business.\u003C/p\u003E\n\n\u003Cp\u003EEssex Distributions provide simple to understand guidelines on how you can increase your sales using online and offline marketing and advertising techniques. Our detailed approach to marketing will ensure your business stands out from your competitors.\u003C/p\u003E\n\n\u003Cp\u003EDistribution:\nWe are pioneers in leaflet distribution, booklet distribution and brochure distribution.\u003C/p\u003E\n\n\u003Cp\u003EDirect mail advertising via door to door distribution is still one of the most cost-effective ways to reach your target customers. With our local knowledge, we can tailor the distribution to areas of your choice, we can target specific postcodes in your area.\u003C/p\u003E\n\n\u003Cp\u003EAreas Covered (Essex): Castle point, Benfleet, Thundersly, Hadleigh, Canvey, Brentwood,  Eastwood, Basildon, Chelmsford, southend-on-sea, Thorpe bay, Shoeburyness, Leigh-on-sea, Westcliff, Uttlesford, Braintree, Colchester, Tendering, Maldon, Epping Forest, Harlow, Rochford and Thurrock.\u003C/p\u003E\n\n\u003Cp\u003EEvents:\nOur company offers a unique opportunity to make any event extra special by introducing carefully selected Celebrity Guest Speakers. We have a large portfolio of Celebrities who will bring a touch of class and fun to your planned day or evening, and support your commitment to any special promotions or activities. Professional Guest Speakers attract more attention adding a touch of spice, motivation and inspiration to any project or event.\u003C/p\u003E\n\n\u003Cp\u003EOur Celebrity Guests \u0026amp; Speakers are very carefully selected to match the type of function you may be planning, and cover a wide range of specialities, such as: Fundraisers, Corporate Entertainment, Product Endorsement, Sales Promotions, Private Parties, and VIP Events. \u003C/p\u003E\n\n\u003Cp\u003EPlease visit or website - http://essex-distribution.com/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       56],
      "assets/images/resized/0012/3170/123170v2-max-150x150.jpg"],
     [[225,
       85],
      "assets/images/resized/0012/3170/123170v2-max-250x250.jpg"],
     [[225,
       85],
      "assets/images/resized/0012/3170/123170v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Online Marketing Executive",
    "person":
     {"first_name": "Pallavi",
      "last_name": "Prasad",
      "permalink": "pallavi-prasad",
      "image":
       {"available_sizes":
         [[[99,
            150],
           "assets/images/resized/0015/6357/156357v5-max-150x150.jpg"],
          [[166,
            250],
           "assets/images/resized/0015/6357/156357v5-max-250x250.jpg"],
          [[299,
            450],
           "assets/images/resized/0015/6357/156357v5-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://biglittlediscount.com/",
    "title": "Big Little Discount"}]}