{"name": "Ethosia",
 "permalink": "ethosia",
 "crunchbase_url": "http://www.crunchbase.com/company/ethosia",
 "homepage_url": "http://www.ethosia.co.il",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "ethosia",
 "category_code": "consulting",
 "number_of_employees": 50,
 "founded_year": 2001,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "recruitment, placement",
 "alias_list": null,
 "email_address": "or@ethosia.com",
 "phone_number": "+972.37678999",
 "description": "Recruitment Agency",
 "created_at": "Sun Oct 17 10:24:00 UTC 2010",
 "updated_at": "Fri Sep 14 21:55:27 UTC 2012",
 "overview": "\u003Cp\u003EEthosia is one of most respected international executive recruitment and human resource management firms within Israel. Its professional, intelligent approach is based on uncompromising, in-depth knowledge of our client business objectives and corporate culture. With this in hand, we becomes a full partner in the process, and utilizes its rich and extensive network to enhance our clients human capital position. Ethosia brings a fresh, professional perspective to human resources and recruitment in Israel, and is redefining the industry in terms of commitment to excellence and quality. Our hands-on approach means we personally execute the assignment and utilize our entire team to gather the required resources needed to meet our clients goals.  \u003C/p\u003E\n\n\u003Cp\u003EETHOSIA | International reach Ethosia harnesses resources from the four corners of the world, to provide seamless, global solutions. Our international colleagues add local understanding of cultural sensitivities and in-depth knowledge of the local business environment. This is the foundation for an intelligent, mutually beneficial partnership to advance our clients business objectives. Ethosia strives for excellence in every aspect of its activity, and embraces the highest standards of professionalism and personal integrity in its relationships with corporations and candidates alike. Our clients needs and interests stand above all else, and we bring innovative thinking, flexibility and unrelenting attention to meet those needs. Specializing in middle management and executive recruitment in the hi-technology and biotechnology sectors, we provides clients with a critical value added services for a competitive advantage in the marketplace. \nWe understands that to build a mutually productive, strategic human resource amalgam requires nothing less than a full partner committed to protecting and nurturing the delicate balance of business, corporate culture and people.\u003C/p\u003E\n\n\u003Cp\u003EEthosia is headquartered in Tel Aviv, Israel, and maintains close network ties with leading human resources firms in Europe, the U.S. and Asia Pacific. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0010/5914/105914v2-max-150x150.jpg"],
     [[250,
       71],
      "assets/images/resized/0010/5914/105914v2-max-250x250.jpg"],
     [[435,
       125],
      "assets/images/resized/0010/5914/105914v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Eyal",
      "last_name": "Solomon",
      "permalink": "eyal-solomon",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Tel Aviv Headquarter",
    "address1": "72 Pinchas Rozen St.",
    "address2": "",
    "zip_code": "",
    "city": "Tel Aviv",
    "state_code": null,
    "country_code": "ISR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}