{"name": "eTrack Media",
 "permalink": "etrack-media",
 "crunchbase_url": "http://www.crunchbase.com/company/etrack-media",
 "homepage_url": "http://www.etrackmedia.com/",
 "blog_url": "http://www.etrackmedia.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "eTrackMedia",
 "category_code": "other",
 "number_of_employees": 5,
 "founded_year": 2013,
 "founded_month": 4,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-services-company, search-engine-optimisation-company, article-submission-services, directory-listing-services, social-bookmarking-submission-services, content-writing-services, seo-content-writing-services",
 "alias_list": "",
 "email_address": "social@etrackmedia.com",
 "phone_number": "44 (0) 1527 453 195",
 "description": "",
 "created_at": "Thu Jun 06 06:00:18 UTC 2013",
 "updated_at": "Thu Jun 06 17:07:36 UTC 2013",
 "overview": "\u003Cp\u003EeTrack Media was launched by an experienced team of business experts with almost 15 years experience of working with small to medium sized businesses – supplying a range of IT solutions and services to those businesses in that time.\u003C/p\u003E\n\n\u003Cp\u003EWith a head office based in Redditch in Worcestershire, in the UK, eTrack Media provides search engine optimisation services to several customers in Redditch and neighbouring Bromsgrove.  However, due to the accessibility of the internet, eTrack Media also provides services to customers across the US, Canada, Australia and the Middle East.  All customers benefit from our internet marketing expertise but with the added value of working with a company that understands their business and creates bespoke solutions for them.\u003C/p\u003E\n\n\u003Cp\u003ERecognising the growing need for online marketing and having carried out online marketing services for a number of companies within the group, the team set up eTrack Media as a separate enterprise.  \u003C/p\u003E\n\n\u003Cp\u003EeTrack Media now provides small and medium sized companies with a range of online marketing services that can be monitored and tracked easily.  \u003C/p\u003E\n\n\u003Cp\u003EOur aim is to provide a service that allows you to measure the return on investment (ROI) of online marketing activity in all of the mediums that it appears including PC’s, tablets and mobile phone devices.\u003C/p\u003E\n\n\u003Cp\u003EAs a dynamic team we focus on your services and goods and also your market and your competitors.  It is the time taken during this exercise that allows us to make recommendations about the online strategies that our customers should undertake.  You can read more about our approach in Why eTrack Media.\u003C/p\u003E\n\n\u003Cp\u003EAt eTrack Media we know that online marketing has become almost scientific but we aim to de-jargonise all aspects of our communications by speaking to you and explaining how the use of tools such as Facebook and Twitter coupled with changes to your website can make a lot of difference to your visibility on the internet.\u003C/p\u003E\n\n\u003Cp\u003EPlease contact us for more information about services such as Website Optimisation, Link Building, Facebook Marketing and Twitter Marketing.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0027/1937/271937v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0027/1937/271937v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0027/1937/271937v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}