{"name": "Euvision Technologies",
 "permalink": "euvision-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/euvision-technologies",
 "homepage_url": "http://www.euvt.eu",
 "blog_url": "http://www.euvt.eu/",
 "blog_feed_url": "http://www.euvt.eu/",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": 12,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 20,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "image-video-retrieval, computer-vision, object-recognition, interactive-image-search, interactive-video-search, image-moderation",
 "alias_list": null,
 "email_address": "h.stokman@euvt.eu",
 "phone_number": "0031206636467",
 "description": "Image video retrieval",
 "created_at": "Mon Jun 03 09:10:46 UTC 2013",
 "updated_at": "Mon Jun 03 23:52:09 UTC 2013",
 "overview": "\u003Cp\u003EEuvision Technologies is a spin-off from the University of Amsterdam dedicated to image and video retrieval.\u003C/p\u003E\n\n\u003Cp\u003EComputer software can do wonderful things. It can forecast the weather. It can correct the spelling errors as you type. It can put a satellite into orbit. But it cannot understand the content of images or videos. At Euvision Technologies, we believe this needs to change.\u003C/p\u003E\n\n\u003Cp\u003EThink of it: Social media websites are moderated in low-wage countries. These operators have the inhumane task of clicking day in and day out on a reject/accept button. They have to screen beheadings, amputations, sadism, and other content inappropriate for social media. In contrast, fraud investigation is performed by 500 dollar an hour lawyers, who need to be paid to click through thousands of images per day, searching for Excel screenshots or patent drawings that should never have been emailed. And we ourselves then? We waste quality time browsing the image gallery of our mobile phone for a particular image to show to our friends, only to discover that we cannot find it anymore.\u003C/p\u003E\n\n\u003Cp\u003EIn short: At Euvision Technologies, we make the world a better place by making computers see.\u003C/p\u003E\n\n\u003Cp\u003EAs a spin-off company from the University of Amsterdam, we invented our own computer vision algorithms, scanning each and every scientific publication in our field along the way. If it was good, we absorbed it, improved it, and integrated it into our Impala software code base. We had our software benchmarked at the renowned NIST video search competition. For nine years consecutive years, our software was recognized as one ot the top three programs worldwide. At Euvision, we had and we have the best computer vision software in the world. And Euvision has the best computer vision team in the world, as well.\u003C/p\u003E\n\n\u003Cp\u003EWe bring to the market the Impala Image and Video Tagger. In a few months, we’ll introduce the Impala Image Miner. These are the first software applications that can see beyond license plates and face recognition (yawn). Our software recognizes twelve different types of child pornography. It does not depend on the Interpol database, it also works for new never seen before material. And it recognizes ID cards, checks, Excel screenshots, sunsets and beaches, cats and dogs, and much more. Our software saves you time, resources and lots of frustration. And it gets your user generated content website off the Adsense black list.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       46],
      "assets/images/resized/0027/0525/270525v2-max-150x150.jpg"],
     [[250,
       76],
      "assets/images/resized/0027/0525/270525v2-max-250x250.jpg"],
     [[300,
       92],
      "assets/images/resized/0027/0525/270525v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Harro",
      "last_name": "Stokman",
      "permalink": "harro-stokman",
      "image": null}},
   {"is_past": false,
    "title": "CCO",
    "person":
     {"first_name": "Jan",
      "last_name": "Willem Klerkx",
      "permalink": "jan-willem-klerkx",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Euvision Technologies",
    "address1": "Science Park 400",
    "address2": "Matrix II",
    "zip_code": "1098 XH",
    "city": "Amsterdam",
    "state_code": null,
    "country_code": "NLD",
    "latitude": 52.356449,
    "longitude": 4.9556889}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[63,
        150],
       "assets/images/resized/0027/0714/270714v2-max-150x150.png"],
      [[106,
        250],
       "assets/images/resized/0027/0714/270714v2-max-250x250.png"],
      [[191,
        450],
       "assets/images/resized/0027/0714/270714v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}