{"name": "Evoke Pharma",
 "permalink": "evoke-pharma",
 "crunchbase_url": "http://www.crunchbase.com/company/evoke-pharma",
 "homepage_url": "http://evokepharma.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "7604871255",
 "description": "",
 "created_at": "Fri May 31 05:47:12 UTC 2013",
 "updated_at": "Fri May 31 06:01:27 UTC 2013",
 "overview": "\u003Cp\u003EEvoke Pharma, Inc. is a privately held specialty pharmaceutical company focused on treatments for gastrointestinal (GI) diseases. The Company was established by experienced specialty pharmaceutical executives with a successful track record of acquiring, developing, registering, and marketing pharmaceutical products in the US.\u003C/p\u003E\n\n\u003Cp\u003EEvoke has concentrated on the gastroenterology field due to the significant unmet medical needs, the opportunity to improve known products and its focused physician base. Despite the relatively high number of patients suffering from gastrointestinal diseases and disorders, there are only about 12,000 gastroenterologists in the U.S. These physicians conduct over 31 million patient visits and write almost 40 million prescriptions each year valued at $4.8 billion. Also, GI diseases may limit or alter the effectiveness of traditional oral therapies due to the disease for which the product is intended to treat. By developing enhanced versions of currently approved drug products, through novel delivery formats or formulations, Evoke intends to provide patients additional treatment options.\u003C/p\u003E\n\n\u003Cp\u003EEvoke\u0026#8217;s lead product candidate, EVK-001, is in late stage clinical testing. The company has exclusive rights to a novel formulation and delivery of a currently marketed GI product. The product is intended for the treatment of diabetic gastroparesis.\u003C/p\u003E\n\n\u003Cp\u003EEvoke has advanced its product development activities by leveraging several corporate relationships with many external clinical, CMC, and regulatory experts. Evoke plans to continue this strategy of developing acquired products in partnership with various global organizations depending upon new acquisitions and appropriate asset investment. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[132,
       97],
      "assets/images/resized/0026/9579/269579v1-max-150x150.png"],
     [[132,
       97],
      "assets/images/resized/0026/9579/269579v1-max-250x250.png"],
     [[132,
       97],
      "assets/images/resized/0026/9579/269579v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "12555 High Bluff Drive",
    "address2": "Suite 385",
    "zip_code": "92130",
    "city": "San Diego",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo":
  {"valuation_amount": null,
   "valuation_currency_code": "USD",
   "pub_year": 2013,
   "pub_month": 5,
   "pub_day": 30,
   "stock_symbol": "NASDAQ:EVOK"},
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}