{"name": "Evroshipping",
 "permalink": "evroshipping",
 "crunchbase_url": "http://www.crunchbase.com/company/evroshipping",
 "homepage_url": "http://www.evroshipping.com/",
 "blog_url": "http://www.evroshipping.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "viagra, buy-viagra, cheap-viagra, cialis, buy-cialis, cheap-cialis, cheapest-cialis",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Our main priority - is the low prices an",
 "created_at": "Sun Jul 01 10:39:55 UTC 2012",
 "updated_at": "Sun Jul 01 22:26:27 UTC 2012",
 "overview": "\u003Cp\u003EEvroshipping is worldwide online pharmacy drug store recommendation service based in USA.\u003C/p\u003E\n\n\u003Cp\u003EThe Company has Provide with an international shipping solution to bring many of the top selling products in the United States to customers all over the world. As a leading online health \u0026amp; beauty retailer in the US. You can access our online services at your home and enjoy our facility.\nOur main priority - is the low prices and the highest quality!\u003C/p\u003E\n\n\u003Cp\u003ELow price is formed by the minimum margin at the expense of many years of experience with wholesale suppliers of medicines.\u003C/p\u003E\n\n\u003Cp\u003EWith the convenient search engine to our online pharmacy you can instantly find exactly what you need by typing in the search box the name of the drug, or a phrase from the description (for which the drug is used).\nOnline - Pharmacy: useful innovation.\nParticularly useful and necessary of these stores are online - pharmacy. Advantages over conventional, fixed them quite a lot. Imagine a situation - you need to quickly acquire a large number of expensive drugs (tablets, ampoules) and related products. On the street - the night, and drugs are needed urgently.\nInternet - a pharmacy in this case is much more profitable option. First, you can not leave home, and even without leaving your computer, choose the most appropriate in terms of price and product range, distribution network. Second, the sites of pharmacies drugs, cosmetics and any other goods supplied with detailed descriptions, and attached to drugs, even an electronic version of the instructions. So if you\u0026#8217;re looking for is not something specific, and a cure for colds and flu, then read several different descriptions can pick the best product for you.\nThird, you do not need to go anywhere, the entire order delivered to your home. This is especially convenient for the elderly, seriously ill, or people with disabilities. Do not be afraid that you will be deceived, provide the \u0026#8220;wrong\u0026#8221; drugs, or shortchange. Courier, who will bring you the goods ordered, they will check the list for you. For quality products and do not worry - our pharmacy is equipped with a license to operate. In addition to permanently protect yourself, before you place an order, you can read reviews of the firm and the quality of services provided.\nLow prices at our online pharmacy due to the fact that the owners of the Internet - portals do not have to pay for the work of pharmacists, as well as spend a lot of money on rent. Due to this, and there is a price difference, which can reach several tens of dollars. This, you see, a very noticeable amount. High competition in the pharmaceutical industry - a pledge of quality products and services.\ncompetition in the sector of trade is quite high, so the owners of the Internet - pharmacies are constantly competing to see who would make a better offer to the client. The struggle for the consumer - is an essential aspect of trade, and the example of pharmacy chains can be seen particularly clearly. Regular promotions and discounts, discount cards, which are provided to clients, convenient terms of delivery of drugs (most often free), a nice web interface, online - consultant, who in real-time is ready to answer all your questions - all this is an attempt to gain new customers who will give preference to the firm.\nThe range of our pharmacies is growing and far exceeds the amount of goods on the shelves of a traditional pharmacy. On our site you can choose any you need medicines and drugs, all FDA-approved.\n.\u003Cstrong\u003E\u003Cem\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003C/em\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003Cem\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003C/em\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003Cem\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003C/em\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003Cem\u003E\u003C/strong\u003E\u003Cstrong\u003E\u003C/em\u003E\u003C/strong\u003E_\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}