{"name": "ewebbers studio",
 "permalink": "ewebbers-studio",
 "crunchbase_url": "http://www.crunchbase.com/company/ewebbers-studio",
 "homepage_url": "http://www.ewebbersstudio.com/default.aspx",
 "blog_url": "http://blog.ewebbersstudio.com/",
 "blog_feed_url": "http://feeds.feedburner.com/EwebbersStudio?format=xml",
 "twitter_username": "ewebbersstudio",
 "category_code": "advertising",
 "number_of_employees": 20,
 "founded_year": 2006,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "brand-building, website-design, logo-design, booth-design, company-profile, cartoon, animation, multimedia-services",
 "alias_list": null,
 "email_address": "info@ewebbers.com",
 "phone_number": "",
 "description": "Creative Brand Building: Website Design,",
 "created_at": "Mon May 27 12:03:42 UTC 2013",
 "updated_at": "Tue May 28 14:57:11 UTC 2013",
 "overview": "\u003Cp\u003Eewebbers Studio is a Creative Brand Building company in Egypt for Website Design, Logo Design,  Booth Design, Stationaries, Company Profile, Cartoon, Animation, Multimedia Services with neat, remarkable and creative designs located in Egypt since 2006. Our professional designs and technical expertise translate into real business value for our clients.\u003C/p\u003E\n\n\u003Cp\u003EWe create, develop and execute the full mix of our customer’s digital advertising campaigns, starting from developing customer’s website, online marketing for the websites, Stationeries, Giveaways, Indoor and Outdoor Digital Signage Networks, Multimedia development, and any other digital solutions that may exist.\u003C/p\u003E\n\n\u003Cp\u003EWe believe that the world is changing every second in every aspect. Our major challenge is to bridge the divide among time, cost \u0026amp; quality factor into a well molded alloy of an applicable piece of art that delivers our client’s message or services. The Advertising business is coming to a major milestone; every aspect of advertising is evolving, from broadcasting to narrowcasting, from Static to Dynamic and from analog to digital. Information technology and communication is leading the change. ewebbers studio through its accumulated experience in mastering both Information Technology and Advertising, we are hoping to be one of the leaders of the Advertising change in MENA region (Middle East North Africa) and expanding to worldwide market.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0026/7508/267508v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0026/7508/267508v2-max-250x250.png"],
     [[300,
       300],
      "assets/images/resized/0026/7508/267508v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}