{"name": "ExampleMotion",
 "permalink": "examplemotion",
 "crunchbase_url": "http://www.crunchbase.com/company/examplemotion",
 "homepage_url": "http://www.examplemotion.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "examplemotion",
 "category_code": "legal",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "legal, file-sharing, filings, pleadings, motions",
 "alias_list": null,
 "email_address": "contact@examplemotion.com",
 "phone_number": "",
 "description": "Legal pleadings file sharing",
 "created_at": "Mon Sep 14 22:15:36 UTC 2009",
 "updated_at": "Wed Sep 16 23:31:16 UTC 2009",
 "overview": "\u003Cp\u003EExampleMotion.com is a file sharing website for legal professionals. \u003C/p\u003E\n\n\u003Cp\u003EYou can search for documents without creating an account. Go to the examplemotion.com search page and start with keywords, or by jurisdiction and type of law. Then filter your results by stage of the proceedings, and by the type of document you are seeking. Finally, check if your document type is further subdivided by a more specific type of document. All of these filters are optional, and you can browse the entire examplemotion.com database, or use these filters to intuitively find the document you are looking for. Once you find a document that has a fitting description, see a preview of the document to make sure it is exactly what you want. After finding your example motion, add it to your cart and check out. Finding an example motion to assist with what you are writing will take less time than it did to read this paragraph!\u003C/p\u003E\n\n\u003Cp\u003EAs a legal practitioner, you likely possess many, many documents written for past cases that lay dormant on your computer. ExampleMotion.com is the opportunity to give those documents new life. Simply delete any information from the document that is private or confidential, and use the Upload tab to describe the document, and upload it to the ExampleMotion.com database. In order to promote the objective of this site to promote the free flow of legal ideas and save time for our fellow lawyers, we suggest setting a nominal price for the document of $10.00 to $50.00. Each annual quarter you will receive a check from ExampleMotion.com for half of the sales price of all the documents sold that you uploaded. The other half goes to maintaining and developing the site.\u003C/p\u003E\n\n\u003Cp\u003EQuality control is important to us at ExampleMotion, therefore we have a ratings system and comments section connected to each document. If you have an opinion about the quality of a document that you have purchased, we encourage you to rate and post comments about the brief on our comments board. That way, in addition to the significant internal efforts conducted at ExampleMotion.com to ensure quality control, you, our users, will also be an invaluable resource to make sure that only the most quality briefs are exchanged on our site.\u003C/p\u003E\n\n\u003Cp\u003EUnfortunately, ExampleMotion.com has not yet compiled legal briefs for every aspect of every type of litigation. Therefore we have a Document Requests section where you can request a brief on a specific topic from other ExampleMotion.com users, and converse with potential authors via our pricing and message boards to make sure you get what you want, at a price you can afford. When users post replies to document requests that you have written, you will be informed via email, and can purchase their document if you choose.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0005/9745/59745v2-max-150x150.jpg"],
     [[250,
       55],
      "assets/images/resized/0005/9745/59745v2-max-250x250.jpg"],
     [[317,
       70],
      "assets/images/resized/0005/9745/59745v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder and President",
    "person":
     {"first_name": "Valerio",
      "last_name": "Romano",
      "permalink": "valerio-romano",
      "image": null}},
   {"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Daniel",
      "last_name": "O'Shea",
      "permalink": "daniel-oshea",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Public Relations",
    "is_past": false,
    "provider":
     {"name": "Mulberry Marketing Communications",
      "permalink": "mulberry-marketing-communications",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}