{"name": "Exim Expertize",
 "permalink": "exim-expertize",
 "crunchbase_url": "http://www.crunchbase.com/company/exim-expertize",
 "homepage_url": "http://www.exportimportconsultants.biz/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Duty Drawback, Duty Exemption Scheme",
 "created_at": "Sun Apr 15 17:18:47 UTC 2012",
 "updated_at": "Thu Apr 19 01:26:18 UTC 2012",
 "overview": "\u003Cp\u003EOffering SEZ consultancy services, DEPB licensing services, EPCG licensing services, DFRC licensing services and export import licensing services in India meeting the demands of EXIM regulatory based services.\u003C/p\u003E\n\n\u003Cp\u003EIncepted in the year 1989, Exim Expertize is a time-honored organization excelling in import export licensing services like approvals debonding, EOU approvals debonding and SEZ approvals debonding. We are moving at par with excellence providing the best professional services in terms of consultancy in export - import regulatory based services.\u003C/p\u003E\n\n\u003Cp\u003EBased at Ahmedabad (Gujarat), we efficiently carter to our domestic clients and meet their queries rendering effective solutions with appropriate consultancy for import and export. Our specialized area is Foreign Trade Policy and Procedures and we take necessary steps to obtain Importer Exporter code number, amendments, changes etc. to licensing.  Commitment, dedication, devotion and involvement are the key factors behind our success over the years. In order to serve our clients better we offer the following:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EInformation on changes and amendments are periodically and instantly offered based on the seriousness of the matters.\nRapid communication to reach out a quick solution.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ESince the very inception, we have been performing excellently in this realm. The able guidance of our mentor Mr. Babu Ezhumavil has significantly helped us in the long run. Owing to his tremendous efforts, we have been able to win the appreciation of our clients nationwide. Besides we nurture the Motto is to see our clients successful and hence analysis, in-depth study and inclination to research help to draft a road map and to achieve the goal.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}