{"name": "eyeconit",
 "permalink": "eyeconit",
 "crunchbase_url": "http://www.crunchbase.com/company/eyeconit",
 "homepage_url": "http://www.eyeconit.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "eyeconit",
 "category_code": "mobile",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "qr, icon, icons, app, apps, iconit, code, recognition, cv, vision, image, processing",
 "alias_list": null,
 "email_address": "info@eyeconit.com",
 "phone_number": "+972-54-9197967",
 "description": "Icons scanners",
 "created_at": "Mon Dec 26 10:58:54 UTC 2011",
 "updated_at": "Tue Dec 27 08:36:55 UTC 2011",
 "overview": "\u003Cp\u003Eeyeconit was founded with the belief that Apps and Icons are playing a big part in our lives, and that this part will grow larger as more great Apps, Icons and brands will be introduced into our lives. In eyeconit we wanted to create a simple and fast way for people to connect with Apps and icons, to get them, explore them and last but not least, enjoy them. Our team is made of computer vision and image recognition specialists, php, perl and pyton avan-gardalists, and plain ordinary app fans, all working together with a common goal, to conquer the world, .. of icons. \u003C/p\u003E\n\n\u003Cp\u003Eeyeconit offers the most powerful leading icon detection and recognition technology for camera phones or any platform produces such icons. Our scalable and robust technologies are capable of detecting icons in a dynamic image (real-time) and recognize them out of millions of icons database.\u003C/p\u003E\n\n\u003Cp\u003EDetecting icons on a screen is a problem of knowing when the icon appears in the screen and how to capture it efficiently and accurately. Icon matching is the problem of efficiently matching a query icon (such as a low quality camera phone icon and/or photo taken from a screen) against a database of icons. eyeconit has created a core proprietary technology for icon detection and recognition with extremely high success rate out of millions of icons. Our technology works with a variety of different quality cameras. In addition, our robust matching and recognition system can handle pictures taken in real life conditions that may have lighting artifacts, focus/motion blur, perspective distortion etc. The technology works in a wide variety of real life scenarios including print advertisements, websites, iPhones, LCD screens and more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[119,
       39],
      "assets/images/resized/0016/7680/167680v2-max-150x150.png"],
     [[119,
       39],
      "assets/images/resized/0016/7680/167680v2-max-250x250.png"],
     [[119,
       39],
      "assets/images/resized/0016/7680/167680v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}