{"name": "EYEMAGINE",
 "permalink": "eyemagine",
 "crunchbase_url": "http://www.crunchbase.com/company/eyemagine",
 "homepage_url": "http://www.eyemaginetech.com",
 "blog_url": "http://www.eyemaginetech.com/blog",
 "blog_feed_url": "",
 "twitter_username": "eyemagine",
 "category_code": "ecommerce",
 "number_of_employees": 21,
 "founded_year": 2003,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ecommerce, ecommerce-agency, ecommerce-design, ecommerce-development, magento-development, magento-gold-solution-partner, magento-solution-partner, magento-agency, web-design, web-development, systems-integration, responsive-design, magento, mobile-commer",
 "alias_list": null,
 "email_address": "marketing@eyemaginetech.com",
 "phone_number": "9492181331",
 "description": "An eCommerce Agency",
 "created_at": "Mon May 13 22:26:32 UTC 2013",
 "updated_at": "Thu May 16 05:29:20 UTC 2013",
 "overview": "\u003Cp\u003EEYEMAGINE is an E-commerce and web development agency that specializes in designing and developing eCommerce storefronts for use by businesses and consumers. EYEMAGINE operates as a Magento Gold Solutions Partner for eCommerce design and development, having created a number of custom Magento applications and extensions tailored for the eCommerce and mobile application industries. EYEMAGINE has most recently expanded into Magento Mobile Applications compatible with Apple iPhone devices.\u003C/p\u003E\n\n\u003Cp\u003EThe company also performs client-based services in creative design, branding and marketing, software development, and Magento web design and development. EYEMAGINE has worked with TOYOTA, The Walt Disney Company, Hewlett-Packard, Cisco, Metallica, Hard Rock Hotel and Casino, and small businesses such as The Persimmon Tree Tea Company, INKnBURN, ArtDen, and Universal Audio.\u003C/p\u003E\n\n\u003Cp\u003EEYEMAGINE was founded in 2003 by Andy Etemadi and within three years the company progressed to performing Open-source software development and web design.\nIn 2008, EYEMAGINE began focusing on eCommerce web projects and partnered with Magento, a now popular open source eCommerce platform, before its initial version 1.0 launch. EYEMAGINE became a Magento Solutions Partner in 2012.\u003C/p\u003E\n\n\u003Cp\u003ESince 2008, EYEMAGINE has diversified its operations to include SEO services, User Experience and logo design services, web development, iPhone/Android application development, and a module store selling custom Magento extensions.\u003C/p\u003E\n\n\u003Cp\u003ESome of its more notable projects during this time included developing Bath Simple, a custom bathroom configurator that allows users to visualize and order all materials necessary to remodel their home bathroom, mobile game application Dabball, and a mobile website for TOYOTA dealers.\u003C/p\u003E\n\n\u003Cp\u003EEYEMAGINE redesigned their website in June 2012 and rebranded itself as a premier eCommerce web development agency and Magento Solutions partner. The company also earned Magento Gold Level Solutions Partner status in 2012 and began requiring its developers to pass the certification test administered by Magento. In 2011 and 2012, the agency doubled in size and added more clients to its portfolio, including Metallica, GroVia and Jones Soda. EYEMAGINE has acted as the Magento Subject Matter Experts for large firms including Disney and Hewlett-Packard.\u003C/p\u003E\n\n\u003Cp\u003EIn 2013, EYEMAGINE won a Webby Honoree Award in the consumer electronics category in the 17th Annual Webby Awards. \u003C/p\u003E\n\n\u003Cp\u003EA portion of all development revenue earned by EYEMAGINE is donated to Love Mercy, a non-profit organization supporting over 40 poverty relief projects in Kitale, Kenya and Haiti.\u003C/p\u003E\n\n\u003Cp\u003EEYEMAGINE performs a number of client-based services in the eCommerce industry, including:\nMagento Certified Development and Design\nEthical Software Development\nCross-Platform and Systems Integration\nCustom Magento Theme Design\nUser Experience Design\nWeb and Logo Design\nSEO\nUsability and A/B Testing\nCompetitive Analysis\nQuality Assurance\nUI/UX Design and Development\nCustom Module Development\nResponsive Design and Development\nMobile Commerce Applications.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [{"description": "EYEMAGINE distinguished as a Webby Award Honoree in consumer electronics in the 17th Annual Webby Awards. ",
    "stoned_year": 2013,
    "stoned_month": 4,
    "stoned_day": 9,
    "source_url": "http://winners.webbyawards.com/2013/web/general-website/consumer-electronics/honorees",
    "source_text": null,
    "source_description": "Consumer Electronics | The Webby Awards",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "EYEMAGINE",
      "permalink": "eyemagine"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://winners.webbyawards.com/2013/web/general-website/consumer-electronics/honorees",
    "title": "Webby Honoree Award"}]}