{"name": "FACT Systems",
 "permalink": "fact-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/fact-systems",
 "homepage_url": "http://www.indiamart.com/factsystems/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "factsystems@tradepassport.org",
 "phone_number": "9849070138",
 "description": "leading trader of Access Control Systems",
 "created_at": "Fri Apr 05 09:45:08 UTC 2013",
 "updated_at": "Fri Apr 05 09:45:14 UTC 2013",
 "overview": "\u003Cp\u003EFACT Systems is a company formed by Mrs. Vijaya Reddy, and managed by Mr. Prakash Reddy with 16 years of cumulative experience in the field of Building Automation, Security and Fire Protection Solutions. The company promises to her customers by delivering best services \u0026amp; support in the said field. The FACT employs the best technology and engineering practices at work, and provides seamless support to customers\u0026#8217; requirements. We do design, supply, installation, testing, commissioning, documentation, handing over \u0026amp; Annual Maintenance Contracts of the following systems to her valued customers. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur infrastructure spreads over a large area and allows us to perform the most difficult tasks with the utmost ease. There are various departments in our facility like sales \u0026amp; marketing, warehousing facility, R \u0026amp; D department etc. to enable effective functioning of all the business operations as there is no chaos or confusion amongst the workforce. \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy / Process:\nQuality has always been the top priority for our organization and it has helped us set benchmarks in the industrial sector. Stringent quality parameters are followed in the procurement process adhering to international quality standards. Our quality experts supervise all the business operations to ensure the delivery of quality approved products and services. \u003C/p\u003E\n\n\u003Cp\u003EOur Aim:\nPremier aim of our organization is to render ‘Total Customer Satisfaction’. We offer our clients finest quality products that are in line with set industrial standards. We offer our products in large volumes keeping in mind the needs and demands of our clients.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOur organization is growing by the support of colossal vendor base, which enables us to provide our patrons a wide range of products. We make sure that these products are in compliance with global quality standards and to ensure the same, before delivery, we check these products at our premises using modern machinery.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nBuilding Automation Systems\nPublic Addressing Systems\nInergen Systems\nWater Leak Detection Systems\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8499/248499v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8499/248499v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8499/248499v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}