{"name": "Faichi Solutions",
 "permalink": "faichi-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/faichi-solutions",
 "homepage_url": "http://www.faichi.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "faichisolution",
 "category_code": "software",
 "number_of_employees": 100,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "outsourced-product-development-company, agile-company, mobile-application",
 "alias_list": null,
 "email_address": "info@faichi.com",
 "phone_number": "",
 "description": "Agile,ODC Company",
 "created_at": "Thu Feb 21 05:03:54 UTC 2013",
 "updated_at": "Fri Feb 22 22:50:45 UTC 2013",
 "overview": "\u003Cp\u003EFounded in 2009, Faichi Solutions is a Pune, India-based leading software services provider. We specialize in outsourced product engineering and offshore development centers. \u003C/p\u003E\n\n\u003Cp\u003EWith outsourced product engineering, our customers accelerate software development using our end-to-end, integrated solution that enables better alignment of resources, agile development, improved cost containment, all while providing greater visibility and helping organizations better manage their business.\u003C/p\u003E\n\n\u003Cp\u003EFor companies trying to setup their own offshore development centers,  we provide them with consultation, management services and end to end ODC setup and operational  services. \u003C/p\u003E\n\n\u003Cp\u003EOur service portfolio spans across multiple domains. Faichi Solutions has 4 defined technology focused Centers of Excellence— Drupal, Java , Mobile Applications and UI.  We have expertise in opensource frameworks such as Drupal, web technologies such as PHP and Java, Mobile development in Android and iOS, UI development using HTML, CSS, ExtJS, JQuery XSL, XML.\nWhat makes us different, is our approach, attitude, technology edge, and focus. We don\u0026#8217;t just believe in the power of technology, we believe in the power of people who enable technology to work for you.\nOur unique model of operational efficiency helps improve client business processes and provides the best value per unit cost. Our operational excellence model ensures that each dollar our clients spend on an outsourcing engagement, buys them an enhanced ROI that is tangible and measurable. Discover our passion for helping companies around the world by visiting us at www.faichi.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "504, Accord IT Park,",
    "address2": "Baner Road",
    "zip_code": "411045",
    "city": "Pune",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}