{"name": "Family Foundations",
 "permalink": "family-foundations",
 "crunchbase_url": "http://www.crunchbase.com/company/family-foundations",
 "homepage_url": "http://www.famfound.net/",
 "blog_url": "http://www.famfound.net/blogs/news",
 "blog_feed_url": "",
 "twitter_username": "familyfounds",
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "parenting, education, children, child, parents",
 "alias_list": null,
 "email_address": "outreach@famfound.net",
 "phone_number": "",
 "description": "Educative Parenting Resource",
 "created_at": "Thu Jan 03 21:44:22 UTC 2013",
 "updated_at": "Sat Jan 05 06:31:14 UTC 2013",
 "overview": "\u003Cp\u003EAbout Us\u003C/p\u003E\n\n\u003Cp\u003EDeveloped and researched by Mark Feinberg, Ph.D., Family Foundations is the result of years of his work as a clinical psychologist, family therapist, and prevention scientist at Penn State University.  Many colleagues, professionals, and families contributed to the development and testing of Family Foundations. We appreciate all of their support.  NIH provided funding for the development and research.\u003Cbr/\u003E\nCommunity Strategies is the name of our small business devoted to rolling out evidence-based family and community prevention and support resources. We\u0026#8217;re located in State College, PA.  A great family town!\u003C/p\u003E\n\n\u003Cp\u003EOur Core Values:\u003C/p\u003E\n\n\u003Cp\u003EEvidence \nWe develop educational and support materials for families with a commitment to making sure they work. This is what sets us apart from most other developers of products and services for families: We are committed to an evidence-based approach.  This means that we rely on research studies to indicate whether or not programs are actually helpful.  Just as you want to know that the medicine your doctor prescribes has been tested and found effective, we also think that health-promoting programs should be supported by rigorous research.\u003C/p\u003E\n\n\u003Cp\u003ESafety\nSome educational and support programs that have been widely distributed were actually later found to be harmful to children or families. Because we have conducted research on Family Foundations before offering it to the public, you can be sure that the program does not cause harm. And because our results have been published in high quality, peer-reviewed scientific journals, you can be confident that the program produces the benefits we describe.\u003C/p\u003E\n\n\u003Cp\u003EFlexibility\nOur philosophy in developing materials is that you are the expert on what works best for you and your family. We provide enough flexibility within the materials and exercises so that you can bring your wisdom and values to the experience and develop a path that will work for your family. We provide tools and information based on research with families and children.  But it is up to you to adapt these tools for your own family\u0026#8217;s needs and values.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}