{"name": "Farmeto",
 "permalink": "farmeto",
 "crunchbase_url": "http://www.crunchbase.com/company/farmeto",
 "homepage_url": "http://farmeto.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "colin.shaw@yale.edu",
 "phone_number": "",
 "description": "tool for connecting small farmers with b",
 "created_at": "Mon Sep 24 18:42:09 UTC 2012",
 "updated_at": "Thu Oct 11 16:55:10 UTC 2012",
 "overview": "\u003Cp\u003EFarmeto is a tool for connecting small farmers with buyers to create Pareto efficient markets via advanced forecasting and pricing models.\u003C/p\u003E\n\n\u003Cp\u003EFarmeto is a software tool that fills the gap for large retailers interested in buying local crops to bring to market. Consumers demand local crops because they like supporting their local community, supporting their local economy, and having quality produce that is more fresh and able to be produced without the burden of pesticides. This is possible in the local market due to the reduced time requirements for distribution. With the cost of fuel rising, the premium paid for locally grown crops that take less advantage of economies of scale is offset by the distribution cost from larger farms that are more aware of the economics of production. Large retailers generally have evolved to deal with large vendors who represent their products rather than myriad small producers. This industry evolution represents a difficulty with an unmet solution in this market. There are no tools similar to Farmeto in the market. The most similar structure is that of the regional co-op, where an entity represents various regional farms. There is no direct competition with these entities and Farmeto, as co-ops would be valid users of the software, or farmers could use the service directly.\u003C/p\u003E\n\n\u003Cp\u003EThe founders of Farmeto are David Tanner and Colin Shaw. We met in the late \u0026#8217;90s while we were finishing our undergraduate degrees at UA. David was finishing in Architecture and Colin was finishing in Mathematics and Physics. We have worked together on numerous projects, particularly over the last four years, as well as previous to this on a less frequent basis (both of us having moved to other areas in the years prior). We have found that we work well together, both being able to objectively contribute to projects without the hindrance of hurt feelings when changes need to be made or strategies altered from what we first considered. We also have the enthusiasm to see projects through.\u003C/p\u003E\n\n\u003Cp\u003ENotable projects that we have worked on include Factiki, which was a search engine tool where a user would suggest a topic and Factiki would crawl the web producing sound byte fact abstractions including citations. These facts were ranked and voted on by active users to assess, for a specific topic, what information was most important about the topic. Users were paid proportional to the ad revenue displayed by topics they suggested. Additional revenue was derived from consumers wanting specific information about user impressions of facts (as opposed to the default page view which simply ranked the facts). Factiki went offline in 2011. \u003C/p\u003E\n\n\u003Cp\u003EWe have also worked on Esprit Audio (http://www.espritaudio.com), which is a public information tool for audio design, and advertising for our own audio products. \u003C/p\u003E\n\n\u003Cp\u003EWe have worked to bring a robotics project to market. This project is an autonomous robot capable of subterranean geometry measurement, creating CAD drawing output of subterranean features. The prototype is currently in the late stages of development and the details are not up for significant discussion.\u003C/p\u003E\n\n\u003Cp\u003EWe have worked on other, smaller projects, and have assisted as consultants on projects beyond those that we have developed ourselves. In each situation we have been able to work effectively together and generate new ideas, find clever solutions, and see projects through.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co Founder",
    "person":
     {"first_name": "David",
      "last_name": "Tanner",
      "permalink": "david-tanner",
      "image": null}},
   {"is_past": false,
    "title": "Co Founder",
    "person":
     {"first_name": "Colin",
      "last_name": "Shaw",
      "permalink": "colin-shaw",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}