{"name": "Fasdec",
 "permalink": "fasdec",
 "crunchbase_url": "http://www.crunchbase.com/company/fasdec",
 "homepage_url": "http://www.fastdecisive.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Fastdecisive",
 "category_code": "software",
 "number_of_employees": 29,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it-service-company, web-designing-service, it-service, application-development, software-development, mobile-application-development, crm",
 "alias_list": null,
 "email_address": "fastdecisive@gmail.com",
 "phone_number": "080-22444711",
 "description": "IT Service, Software development,",
 "created_at": "Sat Dec 24 07:51:28 UTC 2011",
 "updated_at": "Sat Dec 24 22:46:34 UTC 2011",
 "overview": "\u003Cp\u003EFasdec Services that We Offer\u003C/p\u003E\n\n\u003Cp\u003EWeb designing, website re designing, Crm software development, Application Development, Search engine optmization, IT-Counsulting and Staffing, mobile web development, Mobile App Development, Software Testing, Ecommerce Solutions\u003C/p\u003E\n\n\u003Cp\u003EDelivering Optimum results with Client Centric model!\u003C/p\u003E\n\n\u003Cp\u003EWe provide complete IT services in every sector that is required for the overall growth for a company towards reaping in maximum benefits by using our services.\u003C/p\u003E\n\n\u003Cp\u003EFasdec accords a diversified range of conventional yet professional software services based on proven methodologies and practices to industry leaders, both large and small.\u003C/p\u003E\n\n\u003Cp\u003EOur approach and ability to deliver quality driven software and web solutions has helped us to earn a name which speaks for its realistic approach in the IT services domain.\u003C/p\u003E\n\n\u003Cp\u003EWe bring all our expertise and domain knowledge in the IT services which includes software applications and web development and yes it is true that learning does help to build a success road map. With our in-depth knowledge it allows us to quickly understand the specifications, requirements of our clients and deliver desired solution with quick turnaround to name a few.\u003C/p\u003E\n\n\u003Cp\u003EWe also offer services in IT consulting and staffing and have a proven track record capable of delivering all kinds of solutions that are required by our esteemed clients. Our record in staffing and recruiting is phenomenal and our growing list of clients speaks itself of our quality and promise in this regard.\u003C/p\u003E\n\n\u003Cp\u003EWe have earned a good reputation in terms of providing IT services and IT consulting and staffing and have carved a niche in this sector and are scaling a greater echelons in the IT domain.\u003C/p\u003E\n\n\u003Cp\u003EOur IT service offerings concentrate on our clients specific requirements in the perspective of each development cycle, thus ensuring finest and professional utilization of available resources. We deliver application engineering services and software development in the following areas of IT Service Offerings includes:All our IT services are of unrivalled solutions, sustainable pricing and deliver solution to earn your credence!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       68],
      "assets/images/resized/0016/7592/167592v2-max-150x150.jpg"],
     [[180,
       82],
      "assets/images/resized/0016/7592/167592v2-max-250x250.jpg"],
     [[180,
       82],
      "assets/images/resized/0016/7592/167592v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/note.php?note_id=113615078757059",
    "title": "It service company"}]}