{"name": "FastTopTen",
 "permalink": "fasttopten",
 "crunchbase_url": "http://www.crunchbase.com/company/fasttopten",
 "homepage_url": "http://www.FastTopTen.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 7,
 "founded_day": 21,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web, top-ten-lists, social-networking, recommendations",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Dynamic Top Ten Lists",
 "created_at": "Thu Nov 11 06:42:02 UTC 2010",
 "updated_at": "Mon Nov 15 00:05:35 UTC 2010",
 "overview": "\u003Cp\u003EFastTopTen is a young budding website catering to the ever growing popularity of top ten lists blogs and articles.\u003C/p\u003E\n\n\u003Cp\u003EThe unique thing about FastTopTen is that the site allows anyone to submit in their own top ten list under any topic they so choose.  If the topic they want does not exist, users are encouraged to also submit in their topic.  All of the lists on FastTopTen are dynamic, meaning that users can not rank their lists to the order of their choosing, rather, the community decides which item are good or bad and the items are ranked based on the ratings given by the community.\u003C/p\u003E\n\n\u003Cp\u003EThe entire site is designed to \u0026#8220;go\u0026#8221; where the community wills it to.  Besides having dynamic rankings in the lists and dynamic lists, FastTopTen\u0026#8217;s forums are also dynamic such that the community can create new forum topics at will.  In the long run, the items/topics/forums that are rated poorly by the community consistently gets dropped, thereby the site stays fresh with only the things important to the community.  Even the upper tabs are dynamic and shows only the top topics that are rated well by the community.\u003C/p\u003E\n\n\u003Cp\u003EFastTopTen\u0026#8217;s future features include social networking for users to be able to see and follow their friends lists, ratings, forum posts, etc.  A recommendation engine is also in the works.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}