{"name": "Fast Foundry, LLC",
 "permalink": "fast-foundry-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/fast-foundry-llc",
 "homepage_url": "http://www.fastfoundry.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software, development, enterprise, consulting",
 "alias_list": null,
 "email_address": "tim@fastfoundry.com",
 "phone_number": "208.991.3320 ",
 "description": "Technology Consultants",
 "created_at": "Mon Feb 18 22:12:04 UTC 2013",
 "updated_at": "Tue Feb 19 21:45:38 UTC 2013",
 "overview": "\u003Cp\u003EFast Foundry is a Northwest U.S. based solutions company delivering quality Business Applications and Services while adding value clients at realistic and affordable prices.\nAt Fast Foundry we have tailored our proven in-house methodologies to each unique client need in order to provide world class solutions.  This approach has allowed us to provide reliable real world solutions which meet present needs and are saleable to address the future demands of a broad range of clients from startups and small businesses to mid-sized to enterprise class organizations.\nFast Foundry delivers excellence in terms of dedicated business – centric solutions.  We are specialists in customized, simple to use systems that integrate with your business and existing systems.  We believe your applications and information should be available anywhere and everywhere your people are doing business.\nIt is not just about technology.  The Fast Foundry team is comprised of skilled professionals who have experience working in a variety of business segments.  Our cross-industry experiences provide us the ability to understand our client’s business as well as technology requirements. This insight allows us to determine how clients can best benefit from using our services as a true Business Solutions Development Partner.\nOur unique blend of experts with proven track records, web designers, network engineers, software developers, graphic designers, project managers and software testers makes it possible to offer our clients affordable web and business solutions that are both innovative and influential.\nFast Foundry services include:\n• Consulting and Planning Services: Business Requirements Evaluation; Strategic Website Evaluation; Technical Architecture Planning; Content and Application Analysis; and Usability Testing.\n• Design and Development Services: User Interface Design; Wireframe and Templates; Creative Graphic Design; Content Management; System Architecture Design; and Video Delivery Systems.\n• Web Application Development Services: Custom Business Applications; Custom Application Integration; Social Media; Mobile Device Applications; E-Commerce Applications; and Training \u0026amp; Knowledge Transfer Applications.\n• Innovation and Dreaming: Innovative Discussion; Brainstorming; Technology Consulting; \u0026#8220;Outside the Box\u0026#8221; Innovation.\nAll of our products exhibit an exceptional record of success and are backed by our professional team.  We firmly believe that a working partnership with our clients is the best way to stay in tune with your business needs and ongoing requirements.  We not only build solutions, we build relationships with our clients which allow us to move forward together toward successes.\nWe look forward to discussing the possibilities with you.\nSincerely,\nThe Fast Foundry Team\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co Founder",
    "person":
     {"first_name": "Jeff",
      "last_name": "Bull",
      "permalink": "jeff-bullock",
      "image": null}},
   {"is_past": false,
    "title": "Co Founder",
    "person":
     {"first_name": "Robert",
      "last_name": "Carrico",
      "permalink": "robert-carrico",
      "image": null}},
   {"is_past": false,
    "title": "Project Manager",
    "person":
     {"first_name": "Dan",
      "last_name": "Roberts",
      "permalink": "dan-roberts-2",
      "image": null}},
   {"is_past": false,
    "title": "Sales Consultant",
    "person":
     {"first_name": "Tim",
      "last_name": "Wright",
      "permalink": "tim-wright",
      "image":
       {"available_sizes":
         [[[101,
            101],
           "assets/images/resized/0004/4432/44432v1-max-150x150.jpg"],
          [[101,
            101],
           "assets/images/resized/0004/4432/44432v1-max-250x250.jpg"],
          [[101,
            101],
           "assets/images/resized/0004/4432/44432v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Fast Foundry",
    "address1": "3006 E. Goldstone Drive",
    "address2": "Suite 201 ",
    "zip_code": "83642",
    "city": "Meridian",
    "state_code": "ID",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}