{"name": "FATbit Technologies",
 "permalink": "fatbit-technologies-2",
 "crunchbase_url": "http://www.crunchbase.com/company/fatbit-technologies-2",
 "homepage_url": "http://www.fatbit.com",
 "blog_url": "http://www.fatbit.com/fab",
 "blog_feed_url": "",
 "twitter_username": "fatbit_tech",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2004,
 "founded_month": 10,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design-company, web-development-company, ecommerce-web-development-company, groupon-clone-script, seo, mobile-application-development",
 "alias_list": null,
 "email_address": "info@fatbit.com",
 "phone_number": "91-95555-96666",
 "description": "Design Ecommerce Development SEO Company",
 "created_at": "Thu Oct 04 13:40:00 UTC 2012",
 "updated_at": "Fri Feb 15 03:05:38 UTC 2013",
 "overview": "\u003Cp\u003EFATbit Technologies is a web services firm with global client base. It offers services in the field of design, development and SEO.  It is also known for its feature rich and dynamic Groupon script.\u003C/p\u003E\n\n\u003Cp\u003EFATbit Technologies is celebrated as the best website design company amongst its clients, as it renders creative as well as intuitive design works. Besides being high on eye grabbing elements, FATbit professionals make sure that technical aspects like navigation and usability are also given their share of attention. The other element that makes the company popular is its affordable web design packages that fit in the pocket of all business segments. \nFATbit has a global presence in the field of development. It has proved its mettle in the development field by rendering best Groupon clone script to its clients at unbelievable prices. By offering custom design and 12 month support for its premium script, it has helped entrepreneurs in making web brands with unique identity and long term prospects. FATbit has also proved its development prowess through its project management system with the name, BIZixx.\u003Cbr/\u003E\nThe company offers services of dedicated developers to its clients. Since 2004, it has been helping global companies in attaining cost effectiveness. By offering services of experienced programmers at flexible prices, it helps young firms in keeping the investment low in fixed assets and workforce. By offering varied talent in the development field, it services different needs of the market.\u003Cbr/\u003E\n Global brands also turn to FATbit when they wish to make their presence felt on search engines. As an experienced SEO company India, it helps firms in increasing first page visibility on Google and major search giants through advanced web techniques.\u003Cbr/\u003E\nFATbit has been active in the web services field since 2004. Its experience is certainly an added advantage to the company which has seen phenomenal growth in the past couple of years. It has a workforce of more than 50 web experts who are in love with everything that has the web element in it. \nBesides, design, development and SEO, it also offers web reputation and content services. Its presence in variety of fields and excellence shown in each of them makes FATbit truly a dynamic web solutions company.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       72],
      "assets/images/resized/0021/4217/214217v2-max-150x150.jpg"],
     [[233,
       113],
      "assets/images/resized/0021/4217/214217v2-max-250x250.jpg"],
     [[233,
       113],
      "assets/images/resized/0021/4217/214217v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "FATbit Technologies",
    "address1": "",
    "address2": "",
    "zip_code": "160062",
    "city": "Mohali",
    "state_code": null,
    "country_code": "IND",
    "latitude": 30.6780203,
    "longitude": 76.7307663}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"242\" src=\"http://www.youtube.com/embed/6AeGDrJKW1M\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003Ehttp://www.fatbit.com/ marks the end of your search. FATbit Technologies has been active in the web design industry for more than eight years. With rich client base in US, UK, Australia and parts of Africa, our team of experienced web professionals has he\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.fatbit.com/resources/",
    "title": "FATbit Blog"},
   {"external_url": "http://www.facebook.com/bestwebsitedesigncompany",
    "title": "Facebook Page"},
   {"external_url": "http://in.linkedin.com/pub/fatbit-technologies/33/703/41b",
    "title": "Linkedin Profile"}]}