{"name": "fe-el web agency",
 "permalink": "fe-el-web-agency",
 "crunchbase_url": "http://www.crunchbase.com/company/fe-el-web-agency",
 "homepage_url": "http://www.fe-el.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "public_relations",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-agency, web-agency-milano, web-marketing, infographics, digital-agency, new-media-agency",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "web agency Milano",
 "created_at": "Fri Nov 02 13:37:04 UTC 2012",
 "updated_at": "Wed Dec 12 07:30:58 UTC 2012",
 "overview": "\u003Cp\u003EFe-el srl renews itself by providing the highest quality solutions at a lower cost compared to its competitors. Based on a streamlined and dynamic structure, fe-el web agency distinguishes itself for having structured efficient workflows and which are capable of improving work quality without wasting time and money.\u003C/p\u003E\n\n\u003Cp\u003ECompared to big agencies, it offers the same good quality products and services at a lower cost. Compared to small web agencies (or freelance) it offers guaranteed high quality products, the professionalism of various professional experts in their field, as well as security in the continuity of services.\u003C/p\u003E\n\n\u003Cp\u003EThe many services offered allow fe-el web agency to propose its customers a full service and, at the same time, ensure punctuality and quality.\nFrom the study of interaction design and web design, to usability, fe-el web agency offers tailor-made solutions such as web sites, e-commerce, cms (highly customized custom and open source) with a high emotional impact and which are able to transmit the company’s philosophy and to make the user experience positive and useful for maximizing the ROI.\u003C/p\u003E\n\n\u003Cp\u003EFe-el web agency also specializes in Digital marketing, from the creation of DEMs which are compatible with all browsers and able to ensure traffic thanks to a kind of creativity which is always in line with general communication and heavily based on call to action, on landing pages that are able to increase the conversion of any marketing campaign. As far as social medias, like facebook, google+ and twitter are concerned, fe-el web agency offers ad hoc solutions to generate conversation and to sell or launch a product, by directly managing the publications. Fe-el web agency offers a SEO service in order to be well indexed on search engines and improve one’s position on serps. Fe-el web agency also develops php and dotnet web applications in order to ensure maximum coverage and to offer its customers the best solution based on their project and budget. \u003C/p\u003E\n\n\u003Cp\u003EFe-el web agency also proposes the study of your brand identity according to the core business and is able to get you to distinguish yourself by placing you in a well-defined commercial context.\u003C/p\u003E\n\n\u003Cp\u003EFe-el srl provides services to big and small businesses that intend to develop themselves on the web in a professional and constant way.\u003C/p\u003E\n\n\u003Cp\u003ESince 2012 infrastructure improvement and the new organization have improved the company’s performance and quality by pushing the business towards a competition among big multinational companies while maintaining much lower costs. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "via friuli 80",
    "address2": "",
    "zip_code": "20135",
    "city": "Milano",
    "state_code": null,
    "country_code": "ITA",
    "latitude": 45.4576325,
    "longitude": 9.215999}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.fe-el.com/servizi.html",
    "title": "services"}]}