{"name": "Feeding Edge",
 "permalink": "feeding-edge",
 "crunchbase_url": "http://www.crunchbase.com/company/feeding-edge",
 "homepage_url": "http://www.feedingedge.co.uk",
 "blog_url": "http://www.feedingedge.co.uk/blog",
 "blog_feed_url": "feed://www.feedingedge.co.uk/blog/feed/",
 "twitter_username": "epredator",
 "category_code": "other",
 "number_of_employees": 1,
 "founded_year": 2009,
 "founded_month": 2,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "metaverse, virtual-world, second-life, social-media, futurist, strategy, enterprise, education, programmer, presenter, innovation",
 "alias_list": null,
 "email_address": "epredator@feedingedge.co.uk",
 "phone_number": "+447710820725",
 "description": "Metaverse Consulting and Development",
 "created_at": "Sat Sep 26 17:51:22 UTC 2009",
 "updated_at": "Sun Sep 27 20:56:09 UTC 2009",
 "overview": "\u003Cp\u003ETaking a bite out of technology so you don\u0026#8217;t have to.\nFeeding Edge is a consulting company.\u003C/p\u003E\n\n\u003Cp\u003EFounded by epredator (Ian Hughes) metaverse evangelist, tribal leader and public speaker and developer with over 18 years experience in a single large corporation. Half of that time has been spent on leading edge, initially scary, technology and solutions in customer facing engagements\u003C/p\u003E\n\n\u003Cp\u003EEpredator led the way for enterprises to explore virtual worlds and new communication technologies in a way that made sense. Passionately evangelising and gathering support speaking to over 40,000 people in 2 years, not including tv, books and blogging.\u003C/p\u003E\n\n\u003Cp\u003EThe technology we are faced with today is not just about version numbers, specifications and function points, it is about integrating with people and with real lives.\u003C/p\u003E\n\n\u003Cp\u003EThere is a radical change occuring to the industrialized corporate entity and all businesses and individuals need to be aware of whats coming their way and how to engage sensibly.\u003C/p\u003E\n\n\u003Cp\u003EFeeding Edge provides services to companies, conferences and individuals who need:\u003C/p\u003E\n\n\u003Cp\u003ETo know why virtual worlds and metaverse make sense for business\nTo hear the story of the creation of an enterprise wide tribe using social media\nThe personal story of a digital native (a.k.a. my life online as epredator)\nPresentations, talks, formal and informal on all aspects of emerging technology\nGames to augmented reality to 3d printing/rapid fabrication changing manufacturing are just some of the topics that can be brought to you.\nA rare mixture of technical delivery and thought leadership can be applied to any project.\u003C/p\u003E\n\n\u003Cp\u003EIf you think a way people are using a technology is either a joke or a threat, Feeding Edge will aim to make it obvious for you and help you make the most of it from then on.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "4 Spinnaker Mews",
    "address2": "Warsash",
    "zip_code": "SO31 9LJ",
    "city": "Southampton",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}