{"name": "Fekra²",
 "permalink": "fekra",
 "crunchbase_url": "http://www.crunchbase.com/company/fekra",
 "homepage_url": "http://www.fekra2.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Fekra2",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 6,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "innovation, academia, industry, match-making, mediator, consultancy, open, open-innovation, middle-east, idea, patent, research",
 "alias_list": null,
 "email_address": "sabrine.assem@fekra2.com",
 "phone_number": "",
 "description": "Crowd Innovation",
 "created_at": "Sun Jun 10 18:48:34 UTC 2012",
 "updated_at": "Mon Jun 11 18:08:05 UTC 2012",
 "overview": "\u003Cp\u003EFekra² is launching a platform where businesses, non-profits, and governments post challenges related to R\u0026amp;D, product/service development, market research, and business process optimization seeking innovative crowd solutions in exchange for incentives. \u003C/p\u003E\n\n\u003Cp\u003EThe challenges are well-formulated problems that are hard to efficiently solve internally, or better outsourced to an open community of potential solvers who will come up with innovative solutions benefiting the solution seekers. The platform includes an Idea Marketplace where the solvers network does not only work on challenges but also contributes with useful findings whether patents to license, prototypes to showcase, research papers, graduation projects and more. \u003C/p\u003E\n\n\u003Cp\u003EFekra² is the first application of a crowd-driven innovation model in the entire Middle East. A belief in the ability of the masses to collectively work on challenges that would otherwise be very costly to tackle especially in times of economic downturns and low investments in human capital is enforced. The platform follows a unique approach to find a pool of qualified problem solvers which comprises primarily of university students, academics, and entrepreneurs who run start-ups, SMEs, or NGOs with the ability to solve posted challenges and in some cases partner as suppliers with the solution seekers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       94],
      "assets/images/resized/0019/4754/194754v2-max-150x150.png"],
     [[250,
       157],
      "assets/images/resized/0019/4754/194754v2-max-250x250.png"],
     [[450,
       282],
      "assets/images/resized/0019/4754/194754v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Sabrine",
      "last_name": "Assem",
      "permalink": "sabrine-assem",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}