{"name": "Find a Place To Stay",
 "permalink": "find-a-place-to-stay",
 "crunchbase_url": "http://www.crunchbase.com/company/find-a-place-to-stay",
 "homepage_url": "http://www.findaplacetostay.uk.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "findplacetostay",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rent-villa-spain, rent-apartment-spain, self-catering-holidays, advertise-holiday-home, rent-luxury-villa, rent-villa-orlando",
 "alias_list": null,
 "email_address": "info@findaplacetostay.uk.com",
 "phone_number": "01618502022",
 "description": "Online Travel Agent",
 "created_at": "Tue Oct 09 23:38:58 UTC 2012",
 "updated_at": "Wed Dec 12 07:03:57 UTC 2012",
 "overview": "\u003Cp\u003ERent a holiday home in the UK, Europe and America direct with the owner today using our easy to use website. www.findaplacetostay.uk.com\u003C/p\u003E\n\n\u003Cp\u003ETired of paying for overpriced hotel rooms? These days, more and more people are turning to vacation rentals when going on long breaks. Vacation rentals come in all sizes, from one bedroom apartments to sprawling villas which makes it a practical lodging option for large groups. If you\u0026#8217;re considering choosing a vacation rental on your next getaway, you may want to check these tips first before closing the deal.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EChoose a home that is near the place you plan to spend your vacation. Do you want to explore more of the city or do you want to be closer to nature? Knowing where you want to go will help you narrow your rental options.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ECheck all the amenities of the house. A working kitchen and laundry area are a must, but perhaps you may want some extra amenities such as a pool or a hot tub or a high speed internet connection to make your vacation extra comfortable. It\u0026#8217;s important not to settle for anything less than what you need. Make sure all the basics are there to avoid unnecessary stress.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ECheck the price. Vacation rentals may be more affordable than staying in hotel rooms, but their rates still vary depending on its size and amenities. Most rentals are priced by the week or month so when choosing vacation homes, break the price down to a nightly rate and compare it to get the best deal.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ELook for hidden costs. You may not be aware of but most rentals require initial deposit. Fees may vary so you may want to check it with the owner or your agent.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ECheck for multiple photos. When you\u0026#8217;re choosing vacation rentals online, make sure to check all the interior and exterior photos of your chosen home. Beware of photography tricks that can make the house look different as it is in real life.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EOnce you have decided on a vacation house, book it right away. Good vacation rentals can go fast especially during summer and holidays, so once you find something that you like then you shouldn\u0026#8217;t wait too long to book it.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Grant",
      "last_name": "Barker",
      "permalink": "grant-barker",
      "image": null}},
   {"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Leon",
      "last_name": "Hawkins",
      "permalink": "leon-hawkins",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Office",
    "address1": "23 Outwood House",
    "address2": "Griffin Farm Drive",
    "zip_code": "SK8 3AN",
    "city": "Stockport",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 53.3624248,
    "longitude": -2.2156815}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}