{"name": "Finseen Group Company Limited",
 "permalink": "finseen-group-company-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/finseen-group-company-limited",
 "homepage_url": "http://www.finseen.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "security",
 "number_of_employees": 560,
 "founded_year": 1998,
 "founded_month": 10,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "16ch-hd-sdi-dvr, 868mhz-alarm-manufacturers--868mhz-alarm-suppliers, 1080p-hd-sdi-cctv, speed-dome-camera, analog-cameras",
 "alias_list": null,
 "email_address": "security1999@gmail.com",
 "phone_number": "008613824363401",
 "description": "868mhz GSM Alarm,HD SDI Camera,SDI DVR",
 "created_at": "Tue Jan 15 06:56:36 UTC 2013",
 "updated_at": "Thu Jan 17 07:56:44 UTC 2013",
 "overview": "\u003Cp\u003EFinseen Group Company Limited is a high-tech enterprise which specializes in researching ,developing , manufacturing and selling CCTV system surveillance alarm products. Till now, our products have been steadily realized digitalized, networked, integrated, industrialized after established, and successfully finish the strategic change from domestic markets to international markets.\u003C/p\u003E\n\n\u003Cp\u003EWe have a high-quality R\u0026amp;D team for CCD camera and experienced technical support engineer and Production Management Personnel. Which has been laid a stable foundation in producing and distributing high-quality products for us. After years’ production experience accumulation, now we have our own production line, independent research and development of products are: HD SDI CCTV System, Home  burglar GSM PSTN Alarm System with 868mhz, IR Waterproof Camera, PTZ IR Speed Dome Camera,Security Surveillance DVR, Our products have passed ISO9001:2000,3C,CE and ROHS certifications. Which are widely used in Airport, Road Traffic, Bank Building, Hotel, Factory, Intelligent Residential District, School, and other important places. Meanwhile, we are able to supply independent, pertinent and advanced technology, products and solutions to the customers meeting various industrial applications. Such as Peaceful City System, Intelligent Transport System, Electronic Invigilating System, Digital Surveillance System, Remote Unattended System, etc. Now our products are well distributed to all over the world, as well as Europe, US, Middle East, Southeast Asia and so on. And get a great reputation from our dear customers.\u003C/p\u003E\n\n\u003Cp\u003EFinseen Group Company Limited adhering to the Policy of “Integrity, Professional and Innovation”, making feasible solution and better service with high quality product and advanced technology! \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[100,
       80],
      "assets/images/resized/0022/9739/229739v2-max-150x150.jpg"],
     [[100,
       80],
      "assets/images/resized/0022/9739/229739v2-max-250x250.jpg"],
     [[100,
       80],
      "assets/images/resized/0022/9739/229739v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}