{"name": "FireDaemon",
 "permalink": "firedaemon",
 "crunchbase_url": "http://www.crunchbase.com/company/firedaemon",
 "homepage_url": "http://www.firedaemon.com/",
 "blog_url": "http://blog.firedaemon.com/",
 "blog_feed_url": "",
 "twitter_username": "fire_daemon",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2001,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "run-application-as-service, firedaemon, run-any-app-as-windows-service",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Application Uptime and Continuity",
 "created_at": "Thu Aug 12 06:16:55 UTC 2010",
 "updated_at": "Mon Aug 16 18:10:44 UTC 2010",
 "overview": "\u003Cp\u003EFounded in 1999, FireDaemon Technologies Limited is the is the #1 vendor of Windows Service management software for professional and hosting use. We are a privately held corporation and have been successful in identifying and providing commercial and FOSS products such as FireDaemon Lite, FireDaemon Pro and FireDaemon Fusion, PanelDaemon and daeMON.\u003C/p\u003E\n\n\u003Cp\u003EWe are based in Cambridge, UK with our primary development office in Minsk, Belarus and a global network of resellers and partners to continually expand and support worldwide sales.\u003C/p\u003E\n\n\u003Cp\u003EWho Are Our Customers\u003C/p\u003E\n\n\u003Cp\u003EGoogle, NASA, Microsoft, Coca-Cola, FedEx, Harvard University, IBM, Honda and EA are amongst more than 40,000 organisations using FireDaemon to achieve 100% uptime and availability of their applications.\u003C/p\u003E\n\n\u003Cp\u003EOver 90% of the Fortune 500 trust FireDaemon along with thousands of major organizations, institutions, universities and government agencies worldwide.\u003C/p\u003E\n\n\u003Cp\u003EHow did it get the name: FireDaemon?\u003C/p\u003E\n\n\u003Cp\u003EA daemon is UNIX parlance for a computer program that runs in the background, rather than under the direct control of a user; they are usually instantiated as processes. Computer systems often start (or \u0026#8220;launch\u0026#8221;) daemons at boot time: they often serve the function of responding to network requests, hardware activity, or other programs by performing some task. Daemons can also configure hardware, run scheduled tasks, and perform a variety of other tasks.\u003C/p\u003E\n\n\u003Cp\u003EDaemons are characters in Greek mythology, some of whom handled tasks that the gods couldn\u0026#8217;t be bothered with, much like computer daemons often handle tasks in the background that the user can\u0026#8217;t be bothered with. Later daemon was rationalized to the acronym: Disk And Execution MONitor.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "St Johns Innovation Center",
    "address2": "Cowley Road",
    "zip_code": "CB4 0WS",
    "city": "Cambridge",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.washingtonpost.com/wp-dyn/content/article/2009/01/02/AR2009010202152.html",
    "title": "Washington Post"}]}