{"name": "FissionLink",
 "permalink": "fissionlink",
 "crunchbase_url": "http://www.crunchbase.com/company/fissionlink",
 "homepage_url": "http://www.fissionlink.com",
 "blog_url": "http://www.fissionlink.com/blog",
 "blog_feed_url": "http://fissionlink.com/blog/feed/",
 "twitter_username": "fissionlink",
 "category_code": "advertising",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-media-marketing, web-marketing, abu-dhabi, united-arab-emirates, social-media, internet-marketing, advertising-and-marketing, marketing, internet",
 "alias_list": null,
 "email_address": "info@fissionlink.com",
 "phone_number": "+971 2 444 6613 ‎ ",
 "description": "Social Media Marketing Company Abu Dhabi",
 "created_at": "Wed Mar 13 10:24:55 UTC 2013",
 "updated_at": "Thu Mar 21 08:32:12 UTC 2013",
 "overview": "\u003Cp\u003EFissionLink is a real life interactive social media marketing platform. It is a set of tools to market a product or business on top social media marketing networks. It has extra capabilities and features as an internet marketing platform because we have incorporated the real life experience of social media networking. With our unique interactive social media marketing platform, we combine exciting features to keep the user or customers engaged in a product or brand while creating loyalty and advocates out of their usage. This will subsequently initiate a viral marketing campaign as they share with their “friends” or “contacts” on social networks about the brand. \u003C/p\u003E\n\n\u003Cp\u003EBy “real life interactive social media marketing platform”, we mean that we are able to bring customers and prospects to a business\u0026#8217;s door and not just advertise a brand online. FissionLink is not just a mobile application that users can access remotely. We bring them to a store or establishment by requiring a card to swipe on FissionLink terminals or kiosks in order to earn points. This makes it exciting for the customer because of the rewards he can redeem upon accumulation of certain amount of points and for the business owner; more prospects are pulled to a business’s door. We also feature geotagging for customers and prospects to find your business more conveniently by adding location information of your stores. Unlike conventional social media marketing tools, we are not just offering marketing strategies that are available online only. We redefine social media marketing by involving the user himself and bringing him to the establishments rather than just promoting or advertising online. \u003C/p\u003E\n\n\u003Cp\u003EFissionLink offers a responsive design that makes interactive online experiences with easy navigation possible. This will keep prospects and existing customers engaged with the brand. With FissionLink, customers can enjoy the interactive platform by:\u003C/p\u003E\n\n\u003Cp\u003Ei. Sharing Messages on Social Networks\nThrough social media networks such as Facebook, a user is able to post status messages or articles with links leading to the business’s website. This message is fully customizable by the business with an inclusion of a thumbnail for visual presentation. Furthermore, this message engages the audience or “friends” of the customer with “likes” and “shares” on the social networking site, sparking a viral marketing campaign for a brand. As customers turn into advocates, they will recommend a business to others and this endorsement is very powerful. It can influence their family and friends and ignite an advertising campaign. Best of all, this word-of-mouth campaign via social networks goes on round-the-clock at no extra cost. \u003C/p\u003E\n\n\u003Cp\u003Eii. Finding offers\nA FissionLink card enables a user to be up-to-date with the latest discounts, special offers, sales, and events of a business establishment. These offers can be found on the official FissionLink website as well. \u003C/p\u003E\n\n\u003Cp\u003Eiii.    Games\nFissionLink offers fun interactive games as part of engaging customers to promote brand retention. These games will also attract users to keep coming back because points can be earned as they play. These points can be accumulated and then redeemed when they have reached a certain amount. \u003C/p\u003E\n\n\u003Cp\u003Eiv. Search location\nGeotagging is marking a photo, video, text, and other form of web content with location information. This helps prospects and current customers find the location of business shops or establishments conveniently. A lot of businesses lose prospects because of lack of information on directions or location of their shops. By being easily found, businesses have higher chances of drawing in more customers to their doorsteps. \u003C/p\u003E\n\n\u003Cp\u003ESocial Media Marketing Platform\u003C/p\u003E\n\n\u003Cp\u003EThe following are the capabilities of FissionLink as a social media marketing platform:\u003C/p\u003E\n\n\u003Cp\u003Ei.  Promote viral marketing\nSocial media marketing makes it possible to reach the target market in top social media websites to keep people engaged and encourage them to talk about the brand. Word-of-mouth from trusted people is highly effective when it comes to marketing because on social networks people like to interact and listen to people whom they trust. This can help start a viral marketing campaign about a brand and this increases Return of Investments (R.O.I.) effectively.  \u003C/p\u003E\n\n\u003Cp\u003Eii. Data Analytics\nSocial media marketing allows businesses to listen to what people are talking about in social networks and allows data gathering of valuable insights. Businesses are able to look into data analytics to study historical data to research potential trends, effects of events and actions that have been recently executed, and to evaluate performance to new or existing tools. Data analytics is important for the growth of a business in order to make necessary improvements or changes. It helps the company gain knowledge from its actions and finds its strengths and weaknesses. \u003C/p\u003E\n\n\u003Cp\u003Eiii.    Loyalty Program\nA loyalty program is an effective way to establish a relationship between a business and a customer. Know what they want and reward them as they are being loyal. In order to win the loyalty of customers, businesses need to offer rewards and perks. The loyalty program is an effective way in business to improve retention levels because it is easy for a customer to decide to go somewhere else if they choose to. They need to be offered with added extra—special discounts, offers, and rewards to make them keep coming back. It has been established that it is far more costly to bring new business compared to retaining existing clients, therefore there is an effective raise in profits once increasing customer retention becomes effective. \u003C/p\u003E\n\n\u003Cp\u003EFissionLink does all these, it allows you to give your loyal customers incentives and delight them to be your business’s advocates. The loyalty program also gives a business competitive advantage over competitors because customers will keep coming back to their establishment or shop in order to claim points, shun competitors, make frequent purchases, or purchase more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/3928/243928v14-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0024/3928/243928v14-max-250x250.png"],
     [[403,
       403],
      "assets/images/resized/0024/3928/243928v14-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "Integrated Social Media Marketing Platform",
    "permalink": "integrated-social-media-marketing-platform",
    "image": null},
   {"name": "Social Networks ID Card",
    "permalink": "social-networks-id-card",
    "image": null},
   {"name": "Loyalty/Rewards Program",
    "permalink": "loyalty-rewards-program",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Chief Technical Officer",
    "person":
     {"first_name": "Ron",
      "last_name": "Fredrick Del Rosario",
      "permalink": "ron-fredrick-del-rosario",
      "image": null}},
   {"is_past": false,
    "title": "Social Media Specialist",
    "person":
     {"first_name": "Gail Monique",
      "last_name": "Mallo",
      "permalink": "gail-monique-mallo",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0024/3939/243939v2-max-150x150.jpg"],
          [[250,
            250],
           "assets/images/resized/0024/3939/243939v2-max-250x250.jpg"],
          [[296,
            296],
           "assets/images/resized/0024/3939/243939v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Social Media Marketing",
    "address1": "Room 1001, 10th Floor C-54 Building, Muroor Road",
    "address2": "Al Nahyan Area, Abu Dhabi",
    "zip_code": "60601",
    "city": "Abu Dhabi",
    "state_code": null,
    "country_code": "ARE",
    "latitude": 24.445022,
    "longitude": 54.4027067}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/1rKUypkgZxs\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EFissionLink: Abu Dhabi\u0026#8217;s Integrated Social Media Marketing Platform\u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[150,
        91],
       "assets/images/resized/0024/3933/243933v2-max-150x150.png"],
      [[250,
        152],
       "assets/images/resized/0024/3933/243933v2-max-250x250.png"],
      [[450,
        274],
       "assets/images/resized/0024/3933/243933v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}