{"name": "Fitscape",
 "permalink": "fitscape",
 "crunchbase_url": "http://www.crunchbase.com/company/fitscape",
 "homepage_url": "http://www.fitscape.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 1995,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "health, healthcare, wellness, fitness, diet, exercise, weight-loss",
 "alias_list": null,
 "email_address": "info@fitscape.com",
 "phone_number": "",
 "description": null,
 "created_at": "Mon Nov 10 01:39:01 UTC 2008",
 "updated_at": "Sat Nov 15 14:26:56 UTC 2008",
 "overview": "\u003Cp\u003EFitscape is a healthcare software company committed to innovation and total body well-being. Founded in 1995, we were one of the first companies to recognize the benefit of bringing health and wellness solutions online. We continue to pioneer new products and concepts to shape the wellness industry online. \u003C/p\u003E\n\n\u003Cp\u003EiWell, a wellness platform created by Fitscape, builds on a decade of technological exploration and advancement. Developed by respected healthcare providers, NASA-level technology experts and university scientists, iWell uses sophisticated artificial intelligence and extensive 3D animation. Its scalable platform understands and adapts to qualitative factors such as pre-existing health issues and individual preferences. iWell also combines its leading-edge technology with expert advice from our Board of Specialists and an impressive wealth of health, nutrition and fitness information. For the end-user, the result is a comprehensive, integrated and truly personalized program for achieving total wellness. \u003C/p\u003E\n\n\u003Cp\u003EAdvanced technology and a scientific approach are just some of the reasons iWell has been chosen by major healthcare, biotech and Fortune 100 companies. High levels of client/user satisfaction, actionable reporting and a strong value-to-cost pricing structure have resulted in unsurpassed client retention.\u003C/p\u003E\n\n\u003Cp\u003EUltimately, however, we measure our success in the success of our members. We\u0026#8217;re proud that thousands of people rely on Fitscape every day to help them achieve total wellness.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       59],
      "assets/images/resized/0002/8153/28153v2-max-150x150.png"],
     [[250,
       98],
      "assets/images/resized/0002/8153/28153v2-max-250x250.png"],
     [[450,
       177],
      "assets/images/resized/0002/8153/28153v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        102],
       "assets/images/resized/0002/8152/28152v2-max-150x150.jpg"],
      [[250,
        170],
       "assets/images/resized/0002/8152/28152v2-max-250x250.jpg"],
      [[450,
        306],
       "assets/images/resized/0002/8152/28152v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}