{"name": "Fitzwilliam Business Centre",
 "permalink": "fitzwilliam-business-centre",
 "crunchbase_url": "http://www.crunchbase.com/company/fitzwilliam-business-centre",
 "homepage_url": "http://www.fitzbiz.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 25,
 "founded_year": 1995,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-centre, office-space, meeting-rooms, virtual-office, business-address, office-space-ireland, virtual-office-ireland, virtual-office-dublin",
 "alias_list": null,
 "email_address": "info@fitzbiz.com",
 "phone_number": "+353 1 640 1800",
 "description": "Business Centre",
 "created_at": "Wed Oct 26 09:13:36 UTC 2011",
 "updated_at": "Wed Nov 02 02:24:51 UTC 2011",
 "overview": "\u003Cp\u003EFitzwilliam Business Centre is Ireland\u0026#8217;s leading provider of professional office space, virtual office solutions and meeting rooms with locations in Dublin, Drogheda, Navan, Naas and Prague. Fitzwilliam Business Centre\u0026#8217;s serviced offices offer turn-key office space for small and medium enterprises supported by a state of the art IT infrastructure and innovative communications technology solutions.\u003C/p\u003E\n\n\u003Cp\u003EFitzwilliam Business Centre\u0026#8217;s virtual office solutions are designed to appeal to small businesses who want to convey a professional image, but who do not want the overheads associated with renting office space and hiring dedicated staff. They are also ideal for companies wishing to setup a presence in Ireland without requiring physical office space. A range of virtual office plans are available including Bronze, Silver and Gold plans.\u003C/p\u003E\n\n\u003Cp\u003EThe Bronze Virtual Office plan is our entry level plan and offers incredible value for money. It is ideal for professionals working from home who do not require a dedicated telephone number and wish to avail of an exclusive business address to enhance their business image.\u003C/p\u003E\n\n\u003Cp\u003EThe Silver Virtual Office plan is our mid-level plan and offers a business address at an exclusive Fitzwilliam Business Centre location along with a dedicated telephone number with call forwarding to your preferred destination.\u003C/p\u003E\n\n\u003Cp\u003EThe Gold Virtual Office plan is a premium plan designed for businesses who want a turn-key business identity solution. With a business address, dedicated phone number and personalised call answering, you can always create the right impression.\u003C/p\u003E\n\n\u003Cp\u003Ewww.fitzbiz.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       81],
      "assets/images/resized/0015/9618/159618v2-max-150x150.png"],
     [[163,
       89],
      "assets/images/resized/0015/9618/159618v2-max-250x250.png"],
     [[163,
       89],
      "assets/images/resized/0015/9618/159618v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}