{"name": "FiveSeven Studios",
 "permalink": "fiveseven-studios",
 "crunchbase_url": "http://www.crunchbase.com/company/fiveseven-studios",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "fiveseven@57studios.com",
 "phone_number": "1.866.535.0913",
 "description": null,
 "created_at": "Wed May 28 18:28:51 UTC 2008",
 "updated_at": "Thu Jan 17 03:55:17 UTC 2013",
 "overview": "\u003Cp\u003EFiveSeven Studios is a small branding and marketing agency founded by Jason VanLue, dedicated to building brands through crafting memorable brand experiences. At FiveSeven we help small to medium sized organizations practically apply niche-specific brand strategy to create opportunities for growth in the marketplace.\u003C/p\u003E\n\n\u003Cp\u003EAs a small, close-knit branding and marketing agency, we are dedicated to helping small and medium sized organizations distill high-level brand practices into practical, relevant, and effective branding solutions that actually make a difference. Effective brand design and development is not just for large organizations, and through our proven Brand-Aid process, we apply the best practices of global brand leaders to a localized niche model. Whether you are a small business, church, non-profit, or professional organization, we\u0026#8217;ll help position your brand for success and growth.\u003C/p\u003E\n\n\u003Cp\u003EOur clients are our highest priority. We believe that effective marketing and branding solutions are those that are functionally applied to the individual client — so rest assured that we won\u0026#8217;t suggest anything that you don\u0026#8217;t need, and will seek to provide the best quality service for what you do need. We believe a successful relationship is built on communication and connection. This is achieved through clear, upfront, and meaningful dialogue from the very beginning, in addition to a foundational understanding of your goals, vision, and plan for growth. We want to get to know you intimately, because from this, we can then offer creative solutions that are optimal for your individual situation.\u003C/p\u003E\n\n\u003Cp\u003ESince 2004 FiveSeven has maintained a reputation for unparalleled service, uncompromising quality, strong client relationships, and expert knowledge. As a small branding and marketing agency, we understand the challenges of building a business or organization in today\u0026#8217;s world. We would love the opportunity to show you why numerous clients from the Fortune 100 to local start-ups trust their creative strategy to us. FiveSeven Studios is privately held and located in Maitland, a suburb of Orlando in beautiful Central Florida.\u003C/p\u003E\n\n\u003Cp\u003EFiveSeven has had the opportunity to work with senior executives and top creatives at some of the world\u0026#8217;s most recognized companies including NBC-Universal, Fox News, and Yum! Brands. Our work has been recognized by some of the industry\u0026#8217;s leading authorities and has been listed on several leading gallery and award websites.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0002/1457/21457v1-max-150x150.png"],
     [[245,
       77],
      "assets/images/resized/0002/1457/21457v1-max-250x250.png"],
     [[245,
       77],
      "assets/images/resized/0002/1457/21457v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "FliteHaus Creative Agency",
      "permalink": "flitehaus-creative-agency",
      "image":
       {"available_sizes":
         [[[143,
            105],
           "assets/images/resized/0001/9551/19551v4-max-150x150.png"],
          [[143,
            105],
           "assets/images/resized/0001/9551/19551v4-max-250x250.png"],
          [[143,
            105],
           "assets/images/resized/0001/9551/19551v4-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Headquarters",
    "address1": "931 N State Road 434",
    "address2": "Suite 1201-203",
    "zip_code": "32714",
    "city": "Altamonte Springs",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": 28.681366,
    "longitude": -81.418731}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}