{"name": "FlatFeeListing.com",
 "permalink": "flatfeelisting-com",
 "crunchbase_url": "http://www.crunchbase.com/company/flatfeelisting-com",
 "homepage_url": "http://www.flatfeelisting.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sean61993220",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mls, for-sale-by-owner, real-estate, first-time-buyers, home-buyers, home-sellers, house, flat-fee-listing",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Flat Flee listings",
 "created_at": "Tue Apr 09 18:58:18 UTC 2013",
 "updated_at": "Tue Apr 09 18:58:19 UTC 2013",
 "overview": "\u003Cp\u003EFlat Fee MLS Listings - For Sale By Owner\u003C/p\u003E\n\n\u003Cp\u003EList your property in your local MLS for a flat listing fee as low as $249 instead of agreeing to pay a Realtor 6%.  Obviously you will still be responsible for paying a buyer agent commission of 2% to 3% (varies by area) to an agent who brings you a buyer. If you find a buyer, you don\u0026#8217;t pay any commission at all! \nYou get a professional MLS listing in your local MLS with all the essentials that 6% agents provide, PLUS all the cost saving benefits of selling as a \u0026#8220;For Sale By Owner\u0026#8221; for a flat fee.\u003C/p\u003E\n\n\u003Cp\u003EAFTER YOUR LISTING BECOMES ACTIVE on your local MLS, it will also appear on hundreds of other public websites that display MLS listings, including national sites such as realtor.com, msn.com, remax.com, kw.com, prudential.com, realestate.com, and 100\u0026#8217;s more.\u003C/p\u003E\n\n\u003Cp\u003EFREE - 1 YEAR PUBLIC LISTING ON OUR WEBSITE:\nOur website listing automatically populates Trulia.com, Zillow.com, Google.com and more for FREE.\nGet a FREE webpage of your property and FREE flyer maker program. Click Here for Details\u003C/p\u003E\n\n\u003Cp\u003EWhy we are the best choice for Flat Fee MLS Listing services\u003C/p\u003E\n\n\u003Cp\u003EWe are the only national company with an A Rating with the Better Business Bureau (click here for proof)\nWe are one of the first companies providing this service, so you can have a secure feeling that we won\u0026#8217;t disappear during the term of your listing. Since we started in 2000, many others have come and gone (especially the cheap-cheap ones).\nWe are easy to reach by phone. Most online companies cut costs by avoiding answering the phone, or you can only reach them by email. It can be very frustrating when you have a problem and can\u0026#8217;t talk to anyone.\n100% customer satisfaction rate.\nNO HIDDEN FEES - We let you know what\u0026#8217;s included before you sign up so there are no aggravating surprises.\nBest broker network. Most of our brokers have been handling listings for us for many years, and strive to provide excellent customer service. We guarantee that if you don\u0026#8217;t like the broker we assign to your listing, we\u0026#8217;ll assign you another one.\n4 Easy Steps to List Your Property\u003C/p\u003E\n\n\u003Cp\u003ESelect \u0026#8220;Place Order\u0026#8221; on the correct state \u0026amp; county page for your property.\nYour information will be automatically sent to our number one real estate broker in your local MLS. Within 24 hours (usually sooner), your assigned broker, will send you an email with all the neccessary forms and documents.\nComplete the forms/paperwork per instructions, and send it along with pictures of your property, to your assigned broker.\nYour assigned broker will log into your local MLS system and use these forms and pictures to populate your MLS listing. Your property will be listed in MLS by the end of the following business day, but usually the same day if received early in the day.\nFrom this point forward, your assigned broker will be your main point of contact. If there are any problems that your local broker cannot handle, call the main office at 800-477-7771.\u003C/p\u003E\n\n\u003Cp\u003ENOTE: Once the property is in MLS, it will take 2-5 days before it appears in all the other national websites, such as Realtor.com or yahoo.com. This is based on the data update cycle of when the various websites retrieve new listing information from your local MLS.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}