{"name": "Flexi Tours",
 "permalink": "flexi-tours",
 "crunchbase_url": "http://www.crunchbase.com/company/flexi-tours",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Thu Sep 27 11:02:00 UTC 2012",
 "updated_at": "Sat Oct 27 02:01:21 UTC 2012",
 "overview": "\u003Cp\u003EFlexi Tours aims to provide an unwavering commitment to customer satisfaction that leads to a mutually beneficial lifelong relationship. We place a premium on communication so our representatives can fully understand the client\u0026#8217;s needs. Getting clients to their destination and back is only half the job; we seek to provide demonstrable value for customer satisfaction. Flexi Tours is committed to be an innovative industry leader whose growth and success is anchored by our values, integrity and dedication to customer service.\u003C/p\u003E\n\n\u003Cp\u003ETravelers Benefits\u003C/p\u003E\n\n\u003Cp\u003EFlexi Tours is more than a travel agency committed to 24 hours customer care services. We are a business partner, a friend, a community resource.Our success comes from the success of our customers, their businesses, and the local economy.Integrating ourselves into these key areas, we help ourselves by helping others first. We can save businesses time and money through our worldwide affiliations and partnerships by offering a wide range of services for the corporate traveler. Our corporate account managers can implement and monitor your travel policies, as well as keep your business informed on travel industry issues through regular communication and meetings. For the individual traveler, we take the stress out of planning a vacation, so you can start relaxing before your depart. Whether you travel locally or internationally, we provide information on your destination, so you know what to expect and where to find the services you need.\u003C/p\u003E\n\n\u003Cp\u003EOur Objective\u003C/p\u003E\n\n\u003Cp\u003EComplete satisfaction of every traveler calls on Flexi Tours. We recognize that good service is more than competitive pricing; it\u0026#8217;s a near-obsessive attention to detail that transforms a good experience into an exceptional one. We don\u0026#8217;t want to sell you a travel package; we want to understand your needs, so we can custom design a travel solution that meets your specific requirements. We look at your opportunities and challenges and design a solution customized to fit you.\u003C/p\u003E\n\n\u003Cp\u003EOur Group of Companies\u003C/p\u003E\n\n\u003Cp\u003EThe conglomeration of Flexi Tours includes: - Flexi Tours Pvt. Ltd., Elite Travel and Tours - (India) and Indian Horizons. Together these three organizations are involved in various ventures of tourism activities.\u003C/p\u003E\n\n\u003Cp\u003EOur Affiliations\u003C/p\u003E\n\n\u003Cp\u003EWe are recognized by the Government of India, Ministry of Tourism and are also members of various National \u0026amp; International Associations like IATO and TAAI, besides being accredited by IATA.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0021/6785/216785v2-max-150x150.jpg"],
     [[250,
       69],
      "assets/images/resized/0021/6785/216785v2-max-250x250.jpg"],
     [[287,
       80],
      "assets/images/resized/0021/6785/216785v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Search Engine Optimizer",
    "person":
     {"first_name": "Divakar",
      "last_name": "Mishra",
      "permalink": "divakar-mishra-2",
      "image":
       {"available_sizes":
         [[[115,
            150],
           "assets/images/resized/0021/3303/213303v2-max-150x150.jpg"],
          [[192,
            250],
           "assets/images/resized/0021/3303/213303v2-max-250x250.jpg"],
          [[245,
            319],
           "assets/images/resized/0021/3303/213303v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003EDivakar Mishra\u003C/p\u003E"}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "TANEJA HOUSE I-84",
    "address2": "Lajpat Nagar II",
    "zip_code": "110 024",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}