{"name": "Flying Fashions",
 "permalink": "flying-fashions",
 "crunchbase_url": "http://www.crunchbase.com/company/flying-fashions",
 "homepage_url": "http://www.flyingfashions.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fashion-kurtis-and-ladies-casual-shirts--in-addition-to-this, we-offer-ladies-designer-shirts, ladies-printed-shirts",
 "alias_list": null,
 "email_address": "webmaster@flyingfashions.com",
 "phone_number": "",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Fri Apr 05 08:05:13 UTC 2013",
 "updated_at": "Fri Apr 05 08:05:17 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1979, we, “Flying Fashions”, are among the eminent manufacturers, suppliers and exporters of Ladies \u0026amp; Kids Wear, Undergarments and Swim Suits. We also offer Fashion Jewelry, Footwear, Bags and Allied Accessories. Our assortment consists of Ladies Designer Bags, Fashion Necklaces, Ladies Fashion Shirts, Ladies Blouses, Fashion Kurtis and Ladies Casual Shirts. In addition to this, we offer Ladies Designer Shirts, Ladies Printed Shirts, Ladies Tops, Ladies Fashion Tops, Ladies Check Shirts and Half Sleeves Shirts. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a team of professionals, which executes all the business operations in a streamlined manner. Our team of designers is creative and experienced in their respective domains. These professionals are aware of the techniques to use advanced stitching \u0026amp; cutting machines that are essential in manufacturing our collection of Ladies \u0026amp; Kids Wear, Undergarments and Swim Suits. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have established a state-of-the-art infrastructure facility at Delhi, India, which spreads over a large area. The unit is partitioned into different sections that enable us to smoothly execute all the business operations. These sections include manufacturing, quality control, warehousing \u0026amp; packaging and administrative. \u003C/p\u003E\n\n\u003Cp\u003EOur Manufacturing Facilities:\nWe possess state of the art manufacturing facility. We possess state of the art manufacturing facility. Our manufacturing unit takes care of yarn procurement, dyeing and quality control on a day to day basis. Testing is done at every stage of production of fabric right from yarn dyeing. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nSince establishment, our main aim is to offer a quality range of Ladies \u0026amp; Kids Wear, Undergarments and Swim Suits to the patrons. For this reason, we manufacture all the products using optimum grade cotton fabric, threads and other material, sourced from renowned vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nLadies Designer Bags, Fashion Necklaces, Ladies Fashion Shirts, Ladies Blouses, Fashion Kurtis and Ladies Casual Shirts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8418/248418v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8418/248418v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8418/248418v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}