{"name": "FounderHub",
 "permalink": "fndrhub",
 "crunchbase_url": "http://www.crunchbase.com/company/fndrhub",
 "homepage_url": "http://www.founderhub.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "FounderHub",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "investors, startups, accelerator, network",
 "alias_list": null,
 "email_address": "info@founderhub.net",
 "phone_number": "+4915121290911",
 "description": "Online Business Accelerator",
 "created_at": "Wed Jul 18 19:39:32 UTC 2012",
 "updated_at": "Thu Jul 19 09:52:35 UTC 2012",
 "overview": "\u003Cp\u003EThe global FounderHub network accelerates startups on their way to success. If you want to be part of the network, take your chance and invest.\u003C/p\u003E\n\n\u003Cp\u003EFounderHub solves the biggest challenge of most startup companies: Access to a powerful network for acquiring funding, entrepreneurial employees, co-founders and knowledge. FounderFunds gives startups access to a variety of investors, FounderJobs is the channel to advertise vacancies to a selected and targeted audience and FounderServices provides knowledge through a marketplace with tools, experts and agencies. \nAdditionally, the FounderBus is co-organized with the GründerBus-team and StartupBus in the US.  It’s an exclusive event once year where hundreds of entrepreneurial minds found companies during a bus ride through Europe\u003C/p\u003E\n\n\u003Cp\u003EFounderHub is special because we don’t see it as a competitor to the existing players and organizations in the startup scene. The aim is to collaborate with them and integrate them as partners in the FounderHub network. The collaboration connects the different entrepreneurship hubs and creates a significant benefit for most players in the startup scene, which leads to the USPs of FounderHub. \u003C/p\u003E\n\n\u003Cp\u003EThe biggest benefit for startups is that FounderHub not only addresses one pain they have, but it’s addressing at least the top three pains of startups.\u003C/p\u003E\n\n\u003Cp\u003EFor investors a huge advantage is that they save time and costs in the identification and selection process of startups for their portfolio. FounderHub is providing a powerful deal flow for established and well know VC-investors, business angels, family offices and also for wealthy private persons who are open to invest in startups.\u003C/p\u003E\n\n\u003Cp\u003ETalents and freelancers sign up once and get a weekly newsletter with individual job offers, individualized by location and interest. They don’t have to check other sources for finding suitable jobs in startups, because FounderHub will send them the best ones to their mailbox.\u003C/p\u003E\n\n\u003Cp\u003EFounderHub provides a marketing channel for service providers where it’s possible to reach and educate a clearly defined and targeted audience. Service providers get new and long-term customers for their services, tools and other offers through FounderServices.\u003C/p\u003E\n\n\u003Cp\u003EThe team behind FounderHub consists of three extremely focused and passionate people. \nAugustin Friedel is founder and CEO of FounderHub. He is responsible for operations, financials and together with Sebastian and Alex for the strategy of FounderHub. His passion behind FounderHub is to create a network and environment that really accelerates startups, which he has missed in recent years.\u003C/p\u003E\n\n\u003Cp\u003ESebastian Sielmann is founder and chief visionary of FounderHub. He is responsible for the \nBitte weiter ausführen…\u003C/p\u003E\n\n\u003Cp\u003EAlexander Hanschke is the third founder and CTO of FounderHub. He is responsible for the development of the FounderHub platform as well as the IT strategy of the company. Alex is highly passionate about contributing to the startup ecosystem by connecting all relevant players.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Augustin",
      "last_name": "Friedel",
      "permalink": "augustin-friedel",
      "image": null}},
   {"is_past": false,
    "title": "CMO",
    "person":
     {"first_name": "Sebastian",
      "last_name": "Sielmann",
      "permalink": "sebastian-sielmann",
      "image": null}},
   {"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Alexander",
      "last_name": "Hanschke",
      "permalink": "alexander-hanschke",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Berlin Office",
    "address1": "Danziger Str. 63",
    "address2": "",
    "zip_code": "10435",
    "city": "Berlin",
    "state_code": null,
    "country_code": "DEU",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        108],
       "assets/images/resized/0020/1763/201763v2-max-150x150.jpg"],
      [[250,
        180],
       "assets/images/resized/0020/1763/201763v2-max-250x250.jpg"],
      [[450,
        324],
       "assets/images/resized/0020/1763/201763v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}