{"name": "Foodtang",
 "permalink": "foodtang",
 "crunchbase_url": "http://www.crunchbase.com/company/foodtang",
 "homepage_url": "http://www.foodtang.com",
 "blog_url": "http://www.foodtang.com/blog",
 "blog_feed_url": "",
 "twitter_username": "foodtang",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "restaurant-guide, restaurants-in-bangalore, food-delivery, order-food-online, book-restaurant-table-booking, table-reservation, online-table-booking, corporate-booking, location-of-restaurants, restaurant-reviews, restaurant-gallery, restaurant-facilities",
 "alias_list": null,
 "email_address": "kedarchandrayan@gmail.com",
 "phone_number": "",
 "description": "Restaurant portal and fun",
 "created_at": "Sun Jan 01 13:02:23 UTC 2012",
 "updated_at": "Sat Jun 02 01:10:54 UTC 2012",
 "overview": "\u003Cp\u003EFoodtang is a restaurant portal which provides services of party planning, corporate booking, table booking and online food delivery from all good quality restaurants in major metro of India.\u003C/p\u003E\n\n\u003Cp\u003EUnder party planning, one can request quotes, describing requirements for an event. Foodtang provides packaged deals and multiple options from restaurants, party halls, out door caterers and event managers. Foodtang arranges for all type of requirements like decoration, music, dance, photography and entertainment activities.\u003C/p\u003E\n\n\u003Cp\u003EFoodtang allows one to browse through the partner restaurants to get a feel of their ambiance, pricing \u0026amp; specialty and thus helping to decide on a venue. One can also go through the complete menu, details of the buffet and accordingly make his choice about eating out or getting the gourmet food of his choice with a single click.\u003C/p\u003E\n\n\u003Cp\u003EFoodtang home page has the information about any running offers and links to featured restaurants. The three tabs on the top take you to the listing of restaurants by cuisine, area or name in the alphabetic order. Restaurants are categorized according to cuisine, genre, areas, services available.\u003C/p\u003E\n\n\u003Cp\u003EEach restaurant on the portal is given a page of itself. On a restaurant page, there are different tabs viz. Menu, Buffet, Book a Table, Info, Gallery, Corporate and Review. The Reviews tab allows the user to rate his experience and share his inputs with others. Each tab has been meant to complete the detailed info about the restaurant and to provide an online access to all the services provided by the restaurant. A service tab (Menu, Buffet, Book a Table or Corporate) is available only if that particular service is provided that particular restaurant.\u003C/p\u003E\n\n\u003Cp\u003EThus Foodtang tries to provide an online gateway to the Restaurants in your city. Presently (as on 1st June, 2012) this portal has restaurants for Bangalore, India and soon will be available in all metros of India.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       35],
      "assets/images/resized/0016/8372/168372v2-max-150x150.png"],
     [[250,
       59],
      "assets/images/resized/0016/8372/168372v2-max-250x250.png"],
     [[309,
       74],
      "assets/images/resized/0016/8372/168372v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "India Headquarter",
    "address1": "847 Vijayabank Colony",
    "address2": "",
    "zip_code": "560076",
    "city": "Bangalore",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[58,
        150],
       "assets/images/resized/0017/6532/176532v2-max-150x150.jpg"],
      [[98,
        250],
       "assets/images/resized/0017/6532/176532v2-max-250x250.jpg"],
      [[176,
        450],
       "assets/images/resized/0017/6532/176532v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}