{"name": "Fordex Industrial Group Limited",
 "permalink": "fordex-industrial-group-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/fordex-industrial-group-limited",
 "homepage_url": "http://www.igiftswholesale.com",
 "blog_url": "http://blog.igiftswholesale.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": 100,
 "founded_year": 1995,
 "founded_month": 4,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmaster@fordexgroup.com",
 "phone_number": "+86-755-86101415",
 "description": "China Electronics Wholesale",
 "created_at": "Fri Nov 02 03:17:13 UTC 2012",
 "updated_at": "Mon Nov 05 23:53:47 UTC 2012",
 "overview": "\u003Cp\u003EEstablished in 2005, located in Shenzhen, China right next to Hong Kong., Fordex Industrial Group Limited is an integrated enterprise of development, production and sales. We mainly deal with OEM and ODM business of kinds of Electronics gadgets, Consumer Electronics, and PC Accessories export to many countries around the world as a leading professional Electronics Gadgets manufacturer at cheapest factory direct price, during the years developing and our great efforts, Fordex Group now is the first ever company to offer electronics gadgets direct from China and managing the supply chain for small-volume, high-volume and chain store, time-sensitive customers \u003C/p\u003E\n\n\u003Cp\u003EWhy Choose and partner with Fordex Group ? \u003C/p\u003E\n\n\u003Cp\u003EWe manufacture \u0026amp; Supply Various of Novelty Electronics Gadgets \nWholesale / Dropship Consumer Electronics: Cell Phones, Gadgets, Car Audio / Car DVD, Digital Cameras, MP4 Players, Surveillance Cameras, Security Products and PC Accessories - Shipping / Drop Shipping Worldwide, Direct From China. \u003C/p\u003E\n\n\u003Cp\u003ECompetitive Prices \nFordex Group offers you competitive wholesale / dropship discount prices on all the products you find in our wholesale center. \nWe have our own electronics manufacturer base in BaoAn district, Shenzhen City, which is the biggest electronics manufacturing base in the world, we can supply our clients high quality products with cheapest factory direct price! \u003C/p\u003E\n\n\u003Cp\u003EStrong R\u0026amp;D Teem \nWe have strong R \u0026amp; D team and advanced technology. Electronics accessories we developed are compatible with the newest Gadgets and Technology. \u003C/p\u003E\n\n\u003Cp\u003EQuality First \nAll of the products are brand new, top quality electronics: absolutely no closeouts, used electronics, or counterfeits. We offer you a wide-selection of consumer ectronic products - all carefully selected with quality in mind, and quality controlled in our warehouse. This is your best opportunity to directly and safely access the Chinese electronics market - all in one place online, without the need to travel to China to find suppliers one by one. \u003C/p\u003E\n\n\u003Cp\u003EFast Delivery Worldwide \nShipping direct from China to worldwide typically takes only 3-to-6 days by Express Courier. Goods are sent out from our warehouse stock typically within 1 day of your order payment. \nShipping is by courier such as FedEx, UPS, DHL, by air mail, or by bulk freight forwarder. Shipping paperwork and customs clearance are taken care of by the courier companies, greatly simplifying the process for importers. \nThe delivery speed is suitable for eBay-type selling / dropship direct from China. There is no mention of \u0026#8220;Fordex group\u0026#8221; on the shipping invoice / on the goods / in the parcel so, as dropshippers, your business is protected. \nFordex Group is a trusted supplier of hundreds of ecommerce companies, small businesses, eBay PowerSellers, and local distributors in every country around the world. Drop shippers may sell internationally with no restrictions from ourselves. \nGreat Customer Support \nBefore and after sales, you have access to our polite, well-trained team of Customer Support staff, available 24/7 on live chat and answering your emails always within 1 working day. All questions are answered fully including special price quotes for larger bulk orders, and in particular we love to hear your feedback and suggestions how we can help you better! \u003C/p\u003E\n\n\u003Cp\u003EWarranty \nAll the products we sell come with a 12 month warranty. We provide full after-sales service to our wholesale customers and dropshippers. Warranty benefits apply equally to wholesaler orders and dropshipper single item orders. \u003C/p\u003E\n\n\u003Cp\u003EYour 100% Satisfaction is our TARGET!!! \u003C/p\u003E\n\n\u003Cp\u003E.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       55],
      "assets/images/resized/0021/8382/218382v2-max-150x150.jpg"],
     [[205,
       76],
      "assets/images/resized/0021/8382/218382v2-max-250x250.jpg"],
     [[205,
       76],
      "assets/images/resized/0021/8382/218382v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.igiftswholesale.com",
    "title": "China Electronics Wholesale"}]}