{"name": "Forex Founders",
 "permalink": "forex-founders",
 "crunchbase_url": "http://www.crunchbase.com/company/forex-founders",
 "homepage_url": "http://www.forexfounders.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "forex, market, forex-market, market-outlook",
 "alias_list": null,
 "email_address": "forexfounders@yahoo.com",
 "phone_number": "",
 "description": "The dynamic market place ",
 "created_at": "Tue Jan 11 13:16:12 UTC 2011",
 "updated_at": "Thu Jan 20 02:34:39 UTC 2011",
 "overview": "\u003Cp\u003EForex Founders is an organization that offers the largest part of the dynamic market place across the world. Several years back Forex had a reputation as a financial practice adopted by the bankers or even several finance associated professionals but with the advent of Technology due to its robust and vibrant presence in the World Wide Web, it has been gaining the recognition and also adopted by several individuals with a massive amount of level of education and a multitude level of knowledge of the markets.\u003C/p\u003E\n\n\u003Cp\u003EForex Founders has unlocked its doors to the Forex market online with a team of the finest experts of the world in the field of Forex trading. Now both beginners and Experts can avail the opportunity either to learn Forex or trade Forex with the help of an online account which is managed by Forex founders. They facilitate you to make trading in Forex a wonderful and money-making experience.\u003C/p\u003E\n\n\u003Cp\u003EThe kind services provided by www.forexfounders.com include daily news on Forex, daily technical analysis of Forex market, weekly articles related to Forex and as well as Forex brokers listing. The news and market section on Forex founders is a comprehensive collection of unbiased review of the prevailing market situation and it also provides you the most up-to-date market trends and winning strategies. Forex trading is much remunerative business.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}