{"name": "Formula Corporate Solutions India Pvt. Ltd",
 "permalink": "formula-corporate-solutions-india-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/formula-corporate-solutions-india-pvt-ltd",
 "homepage_url": "http://www.formulaindia.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 500,
 "founded_year": 1994,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "emarketing@formulaindia.com",
 "phone_number": "01145054425",
 "description": "corporate service solutions",
 "created_at": "Thu Jun 21 11:39:40 UTC 2012",
 "updated_at": "Sat Jun 23 04:55:35 UTC 2012",
 "overview": "\u003Cp\u003EFormula Group was incorporated in January 2004. As a provider of corporate service solutions \u0026amp; Relocation services, providing very fast and reliable customer solutions, Formula Group quickly won a lot of big international companies as customers. More and additional service components had been developed, enabling the supply of even more customer oriented solutions.\u003C/p\u003E\n\n\u003Cp\u003EToday Formula Group has a staff strength of 300 employees. Locations in Delhi, Gurgaon, Bangalore, Chennai and Pune. A 24 Hours helpline guarantee strong customer proximity and fast solutions. Through the supply of an array of crucial Relocation \u0026amp; Corporate services, Formula Group provides its customers Single Window Solutions according to their specific needs.\u003C/p\u003E\n\n\u003Cp\u003EIndia, a country that is inherently rich in culture, diverse in language is today, a potential player in the global economy. The unprecedented growth of multinational companies in India has opened doors to expatriates and foreign investors. Our wide range of Support Services and solutions have ensured many of them a smooth transition. You can rely on our owned and managed network of diverse resource for an experience that is absolutely hassle-free. We help you move on a fast track so that you can focus on your core business, while you leave the rest to us.\u003C/p\u003E\n\n\u003Cp\u003EThe Group\u003C/p\u003E\n\n\u003Cp\u003EFormula Group is a subsidiary of the renowned Narula Group - a name that has been a part of the service industry for the past two decades. The group conducts its operations through its many established ventures. Narula Travels manages both inbound and outbound travel plans of some of the most discerning corporate. Narula International represents some of the most reputed universities of Europe, USA \u0026amp; Australia and Directs overseas education aspirants towards their goals. Holiday Representation is an outbound tour organization. Formula Corporate Solutions is a part of this burgeoning empire and is the Relocation \u0026amp; Corporate Management Services arm of the Group.\u003C/p\u003E\n\n\u003Cp\u003EOur Mission\u003C/p\u003E\n\n\u003Cp\u003ETo anticipate the needs of our customers and to provide hassle-free corporate service solutions through expertise, commitment and customer proximity. Thereby it is our ambition to become outstanding experts in our chosen field of endeavor. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0019/6575/196575v2-max-150x150.png"],
     [[180,
       70],
      "assets/images/resized/0019/6575/196575v2-max-250x250.png"],
     [[180,
       70],
      "assets/images/resized/0019/6575/196575v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}