{"name": "Forsher Info Private Limited",
 "permalink": "forsher-info-private-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/forsher-info-private-limited",
 "homepage_url": "http://www.deexplorer.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Forsheripl",
 "category_code": "advertising",
 "number_of_employees": 24,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 14,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "realestate-matrimony-wedding",
 "alias_list": null,
 "email_address": "forshersasi@gmail.com",
 "phone_number": "9003111146",
 "description": "Online marketing",
 "created_at": "Tue Jan 08 07:18:03 UTC 2013",
 "updated_at": "Sat Jan 12 07:31:26 UTC 2013",
 "overview": "\u003Cp\u003EHere is the story of our evolution - No capital, no agency experience, no clients – only a near frenzied obsession for success, a frenzied passion to make a mark and a frenzied desire to rise above the odds.\u003C/p\u003E\n\n\u003Cp\u003EOur first step towards online market – under a common domain DeExplorer.com we started designing our own portals for different segments DeTechExplorer (Technology), DeRealtyExplorer (Realestate), DeWeddingExplorer (Matrimony).\u003C/p\u003E\n\n\u003Cp\u003EDeRealtyExplorer.com is the India’s largest real estate property portal – to Buy, Sell, Rent, Share and Lease residential, commercial, industrial and agriculture properties anywhere in India. You can find thousands of new properties by Builders, Property Agents, students and Individual Owners in the metro cities like Chennai, Bangalore, Delhi, Hyderabad, Mumbai, Kolkata, Ahmedabad, Surat and Pune. With the help of Locality wise free property listings, you will be able to search through the cream of the nation’s property listings and connect with builders, Individual owners, developers, promoters, investors, brokers and real estate agents to get the best value for your property \u0026amp; money. \u003C/p\u003E\n\n\u003Cp\u003EDeWeddingExplorer.com is the India’s largest Matrimony website where singles can meet their Loved ones. You can find thousands of new listings from the Individual’s, brides or grooms representatives for matchmaking and also for wedding related services. With the help of community and category wise free matrimony listings, you will be able to search through the cream of the matrimony listings and connect with your loved ones to have a meaningful and loving relationship that will last a lifetime. \u003C/p\u003E\n\n\u003Cp\u003EDeWeddingExplorer.com is also an exclusive Matrimony Portal for Divorced, remarriage, second marriage, Divorcee or Divorced, Widow, Widower, Separated people \u0026amp; Disabled. People who are looking for the above categories can register free at DeWeddingExplorer.com for a new life in their precious lives. DeWeddingExplorer.com is considered among the best free wedding sites or websites for marriage available online.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder",
    "person":
     {"first_name": "Forsher",
      "last_name": "Sasi",
      "permalink": "forsher-sasi",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Forsher Info Pvt. Ltd.",
    "address1": "No 42, MKM Chambers, 5th floor",
    "address2": "Kodambakkam high road, nungambakkam",
    "zip_code": "",
    "city": "Chennai",
    "state_code": null,
    "country_code": "IND",
    "latitude": 13.060422,
    "longitude": 80.249583}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.derealtyexplorer.com",
    "title": "Realestate"},
   {"external_url": "http://www.deweddingexplorer.com",
    "title": "Wedding"}]}