{"name": "Fortune Inc",
 "permalink": "fortune-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/fortune-inc",
 "homepage_url": "http://www.indiamart.com/fortune-inc/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "fortune-inc@tradepassport.org",
 "phone_number": "9845049847",
 "description": "manufacturing, exporting and supplying",
 "created_at": "Fri Apr 05 11:38:42 UTC 2013",
 "updated_at": "Fri Apr 05 11:38:44 UTC 2013",
 "overview": "\u003Cp\u003EFortune Inc. was established in 2000 and are engaged in manufacturing, exporting \u0026amp; supplying a wide assortment of Barcode Tags, Printed Fabric Labels and Hang Tags. Our product range comprises Garments Hang Tags, Premier Hang Tags, Clothing Hang Tags, Cardboard Hang Tags, Fancy Hang Tags, Satin Printed Labels, Taffeta Printed Labels, Cotton Fabric Labels, Barcode Stickers, Price Tickets, Plain Barcode Sticker, Thermal Transfer Ribbon and many more.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe attribute the success of our organization to highly sophisticated infrastructure as well as team, who efficiently handle it and manage all activities. Our infrastructural set-up is based upon the cutting-edge technologies consists of all advanced equipment as well as machinery. These machines are well-maintained and upgraded as per the challenges prevailing in the market. Thus, we ably meet the growing demands of clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality is most important factor for us and we are certified by NSIC (National Small Industries Corporation). The National Small Industries Corporation enlists small scale units as competent to undertake supply of various items to the Government.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team is the biggest asset of our company as they help us in achieving prescribed targets and objectives successfully. They all work in coordination with one another to provide solutions as per the exact requirements of clients. Furthermore, our team keep themselves abreast of latest advancements and ensures to provide solutions accordingly. With their relentless support, our company is successfully achieving its set targets. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur company has directed all its endeavors towards offering products according to exact requirements of clients. For this, various quality measures are undertaken and custom made solutions are provided, in order to make them completely satisfied. We also make transparency while dealing with our clients and ensure to deliver products within committed time period. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8591/248591v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8591/248591v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8591/248591v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}