{"name": "FreedomNow.org",
 "permalink": "freedomnow-org",
 "crunchbase_url": "http://www.crunchbase.com/company/freedomnow-org",
 "homepage_url": "http://freedomnow.org/",
 "blog_url": "http://freedomnow.org/blogs/",
 "blog_feed_url": "http://freedomnow.org/blogs/feed/",
 "twitter_username": "freednow",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "human-trafficking, human-traffickers, people-trafficking, human-trafficking-statistics, money-laundering, anti-money-laundering, human-rights, human-rights-violations",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+65 65360084",
 "description": "Wiki to counter human trafficking",
 "created_at": "Thu Dec 08 08:20:34 UTC 2011",
 "updated_at": "Thu Dec 15 20:11:12 UTC 2011",
 "overview": "\u003Cp\u003EFreedomNow.org – Fighting Human Trafficking the Wiki Way!\u003C/p\u003E\n\n\u003Cp\u003EHuman trafficking is one of the greatest curses of society. According to the United States government, an estimated 14,500-17,500 people are trafficked into the US every year. Many worldwide government concerns and NGOs have been working hard to stop human trafficking. FreedomNow.org has recently joined this community in order to fight against this global curse in a unique way.\u003C/p\u003E\n\n\u003Cp\u003EWhat is FreedomNow.org?\u003C/p\u003E\n\n\u003Cp\u003EFreedomNow.org is a non-profit venture started by Ethics 360, a group of companies providing services related to anti-bribery education, training and publishing for multi-nationals and their third party intermediaries.\u003C/p\u003E\n\n\u003Cp\u003EThe principal goal of this project is to collect detailed information on known traffickers and make this available to governments, banks, anti-money laundering (AML) data providers as well as general audiences around the world.\u003C/p\u003E\n\n\u003Cp\u003EIn addition, FreedomNow.org features a host of resources for trafficking victims and their advocates, including NGO directories categorized by country and a job board where NGOs can advertise vacant positions.\u003C/p\u003E\n\n\u003Cp\u003EHow will FreedomNow.org work?\u003C/p\u003E\n\n\u003Cp\u003EFreedomNow.com is a web project based on “Wiki” technology, which gives power to any individual who has relevant information regarding human trafficking to contribute for the sake of humanity. However, due to the sensitive nature of the topic, FreedomNow.org does not give full access to publish anything immediately. FreedomNow has a team of editors who review every submission made by members and promptly publish those that are relevant and accurate.\u003C/p\u003E\n\n\u003Cp\u003EMore than 13,000 trafficker and agent records are already available. FreedomNow editors and community members update site records on a daily basis.\u003C/p\u003E\n\n\u003Cp\u003EJoin FreedomNow.org\u003C/p\u003E\n\n\u003Cp\u003ETake the fight against modern-day slavery to the traffickers. Be a part of the FreedomNow.org community.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[95,
       113],
      "assets/images/resized/0016/6584/166584v1-max-150x150.png"],
     [[95,
       113],
      "assets/images/resized/0016/6584/166584v1-max-250x250.png"],
     [[95,
       113],
      "assets/images/resized/0016/6584/166584v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}