{"name": "Free Education Aid",
 "permalink": "free-education-aid",
 "crunchbase_url": "http://www.crunchbase.com/company/free-education-aid",
 "homepage_url": "http://www.freeeducationaid.com",
 "blog_url": "http://freeeducationaid.blogspot.com",
 "blog_feed_url": "http://freeeducationaid.com/home/feed",
 "twitter_username": "freeeduaid",
 "category_code": "education",
 "number_of_employees": 200,
 "founded_year": 2010,
 "founded_month": 11,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "free-education-aid, online-education, online-continuing-education-courses, campus-based-education-courses, education-courses, education-classes, higher-education-degrees, online-college-class, online-school-classes, nursing-schools, christian-schools",
 "alias_list": null,
 "email_address": "info@freeeducationaid.com",
 "phone_number": "352-410-8786",
 "description": "Colleges In USA, Universities In USA",
 "created_at": "Fri Dec 30 07:41:31 UTC 2011",
 "updated_at": "Sat Feb 18 06:15:36 UTC 2012",
 "overview": "\u003Cp\u003EIt is a knowledge sharing platform that provides information and helps the prospect get matched and connected to colleges in USA, universities in USA, community colleges in USA, different featured schools in USA, various online/campus-based degrees like undergraduate degrees, graduate degrees, post graduate degrees, online/offline certificate \u0026amp; diploma programs, study programs and free online courses. We also offer prospect the information about scholarships \u0026amp; grants, financial aid, military services, career development, career research, career advancement, planning and paying for your education.\u003C/p\u003E\n\n\u003Cp\u003EProspect can get access to all educational level from High school to Post graduate degrees and in online as well as campus-based courses/degrees. Our website not only provides information about the Community colleges/Universities and colleges that provide campus-based degree/certificate programs but also helps prospect in locating/connecting with the best USA schools, universities and colleges that have made online education possible for working students or stay-at-home adults. We offer resources and information which helps them get matched with educational programs that best fits their personal, academic and career goals.\u003C/p\u003E\n\n\u003Cp\u003EFree Education Aid is a comprehensive guide that helps student/prospect choose from best educational study programs such as aviation, business, medical, trade, law, culinary arts, beauty, computer/IT, arts/design, health-care and education. We are dedicated to provide them excellent resources and useful information that helps to make an intelligent decision about choosing the best online/campus-based schools/colleges/universities and community colleges as well as degree/certificate programs which proves to be fruitful in fulfilling their professional goals.\u003C/p\u003E\n\n\u003Cp\u003EDue to the evolution and rapid expansion of internet, Distance learning also called as online education can lead prospect to high range of career opportunities by allowing them to work at their pace. We provide information and help them to connect with Free Online educational Courses (Open-Course ware) that have made the method of teaching and learning virtual and utmost convenient for students across the world. The best beneficial part of free online course is that the prospect can get enrolled from any corner of the globe without even getting relocated.\u003C/p\u003E\n\n\u003Cp\u003EWe try our best to get you matched with various featured schools such as high school alternative, boarding schools, military schools, automotive schools, information technology schools, career schools, nursing schools, arts \u0026amp; design schools, engineering schools, legal and law enforcement schools, technical schools, computer schools, trade schools, business schools, teaching schools and beauty schools.\u003C/p\u003E\n\n\u003Cp\u003EOur full spectrum educational resource provides the prospect information and assistance on how to plan and pay for their education. We also provide career advancement; career research and career development related information and knowledge needed to secure the most rewarding opportunity which could ensure utmost success and growth in one’s career.\u003C/p\u003E\n\n\u003Cp\u003EFor making the prospects search convenient we offer various search parameters such as search by zip code, search by name, search by degree and search by states which helps them to better target their search. Our education specialist offers variety of helps to the prospect in searching the best educational program/course that fits their career field as well as in getting them connected to the colleges/universities and community colleges in USA.\u003C/p\u003E\n\n\u003Cp\u003EWe believe in Making Career aspirations a reality. Our mission is to reach and connect every prospect/student and provide them the best resources of education, knowledge and information which can help them in shaping their future, growth and career.\u003C/p\u003E\n\n\u003Cp\u003EThe current strategic plan also focuses on providing information on quality education for development for one and all. Free Education Aid believes that Education is a fundamental human right, key to the development of individual as well as of society.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       25],
      "assets/images/resized/0016/8166/168166v3-max-150x150.png"],
     [[250,
       42],
      "assets/images/resized/0016/8166/168166v3-max-250x250.png"],
     [[325,
       55],
      "assets/images/resized/0016/8166/168166v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Free Education Aid",
    "address1": "6915, South Carter Road,",
    "address2": "",
    "zip_code": "33813",
    "city": "Lakeland",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.freeeducationaid.com",
    "title": "Free Online Education"}]}