{"name": "freelocal.org",
 "permalink": "freelocal-org",
 "crunchbase_url": "http://www.crunchbase.com/company/freelocal-org",
 "homepage_url": "http://freelocal.org",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "freelocalorg",
 "category_code": "cleantech",
 "number_of_employees": 2,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "app, webpp, mobile, reuse, recycle, local, free, community, facebook, twitter, social, mapping, geolocation",
 "alias_list": null,
 "email_address": "admin@freelocal.org",
 "phone_number": "",
 "description": "find/offer free items",
 "created_at": "Thu Feb 28 03:07:53 UTC 2013",
 "updated_at": "Sun Mar 03 08:19:38 UTC 2013",
 "overview": "\u003Cp\u003EFreelocal.org allows users around the world to list or search for free items being given away in their community. Like freecyle but with photo, mapping, and social sharing capabilities, it\u0026#8217;s a neighborhood-centric initiative for reuse and recycling household items that might otherwise end up in a landfill.\u003C/p\u003E\n\n\u003Cp\u003EThe goals of FreeLcoal.org are many: to reduce waste through item re-use, to increase awareness of the environmental impact of household consumption, to foster the reuse/recycle community, to save money, and to make it easier for people to clean out and organize their living spaces.\u003C/p\u003E\n\n\u003Cp\u003EFeatures of the service include:\u003C/p\u003E\n\n\u003Cp\u003EIntegrated photo upload\nFor many tablets (including iPad and iPad2 with iOS6.0 and higher) users have the ability to photograph the item directly with their device while filling out the posting form - avoiding the nuisance of emailing yourself the photo from your phone and loading it from your desktop. (The upcoming release of the Android app will also have this built-in phone camera/gallery feature).\u003C/p\u003E\n\n\u003Cp\u003EAnonymous item listing\nOwners of items being offered are initially contacted by interested parties via a contact form on the item listing. \u003C/p\u003E\n\n\u003Cp\u003EFacebook and other social integration\nIn addition to posting on the freelocal.org service, users will also have the option to share listings to their facebook wall (or a friend\u0026#8217;s wall), on their twitter stream, or on other social channels. The facebook wall post includes the item description and thumbnail photo, as well as a link to the item on the FreeLocal.org website (non-registered users have a restricted view of the item listing). \u003C/p\u003E\n\n\u003Cp\u003EDigest Emails\nUsers also have the ability to sign up for digest emails that can provide them quick daily summaries of any newly-listed items in their search area.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Bob",
      "last_name": "Zabor",
      "permalink": "bob-zabor",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}