{"name": "FreeStudentEducation",
 "permalink": "freestudenteducation",
 "crunchbase_url": "http://www.crunchbase.com/company/freestudenteducation",
 "homepage_url": "http://www.freestudentedu.com",
 "blog_url": "http://www.freestudentedu.com/blog",
 "blog_feed_url": "http://www.freestudentedu.com/blog/feed",
 "twitter_username": null,
 "category_code": "web",
 "number_of_employees": 5,
 "founded_year": 2008,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rate-my-professor, rate-your-professors, free-essays, free-term-papers, free-research",
 "alias_list": "",
 "email_address": "info@freestudentedu.com",
 "phone_number": "",
 "description": "Research Paper Aggregation",
 "created_at": "Wed Oct 01 15:19:05 UTC 2008",
 "updated_at": "Thu Apr 02 20:07:54 UTC 2009",
 "overview": "\u003Cp\u003EFree Student Education offers rate my professor, rate your professors, free\nessays, free research papers, free term papers, calculators and free books\nclassifieds.\u003C/p\u003E\n\n\u003Cp\u003EFreeStudentEdu.com is a global leader in providing essays, research papers, and professor ratings to students.\u003C/p\u003E\n\n\u003Cp\u003EThe website continues to help students with their free essays. With our help you can quickly and easily get your assignment done by learning from the examples provided. Our essays are submitted to us by students just like you.\u003C/p\u003E\n\n\u003Cp\u003EUnlike other websites, we are committed to our promise to provide a reliable search engine with optimized results. It is our philosophy to make sure that other students learn best from other peoples examples. With optimized search results and true ratings, we are convinced that you will be more than satisfied with our website.\u003C/p\u003E\n\n\u003Cp\u003EOur rate your professors section is also a leader in providing the best user ratings for professors. Students visit our site from all of Canada, USA and UK and express their comments about their professors.\u003C/p\u003E\n\n\u003Cp\u003EThe site not only provides service but it also offers great ideas. For information about our enthusiasm of new innovative ideas please visit our blog section today. We believe in staying ahead with the cutting edge technology is the best way to help people learn and explore their options. We also accept offers and ideas from our visitors in order to better our services.\u003C/p\u003E\n\n\u003Cp\u003EWe strongly believe that the key to becoming the most popular one stop shop for free essays, professor ratings, and many other great features; is by providing unmatched quality combined with a friendly and efficient customer support.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0002/5964/25964v2-max-150x150.jpg"],
     [[250,
       50],
      "assets/images/resized/0002/5964/25964v2-max-250x250.jpg"],
     [[300,
       60],
      "assets/images/resized/0002/5964/25964v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}