{"name": "Frently",
 "permalink": "frently",
 "crunchbase_url": "http://www.crunchbase.com/company/frently",
 "homepage_url": "http://frently.com/Home.aspx",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "frently",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 10,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "friends, friends-online, rent-friends, make-friends, escort, hobby, talent, activity, skill, paid-friendship, companion, interests, likes",
 "alias_list": null,
 "email_address": "frently@live.com",
 "phone_number": "",
 "description": "Get paid for friendships",
 "created_at": "Tue Oct 19 18:10:29 UTC 2010",
 "updated_at": "Sat Oct 23 02:10:43 UTC 2010",
 "overview": "\u003Cp\u003EFrently.com allows users to be rented/hired as a friend and make money just for hanging out with someone. It also allows users to search the database of friends and pick friends to hire for any activity or event they would like. \u003C/p\u003E\n\n\u003Cp\u003EThe website allows for webcam chat, live chat, contact via email, phone, and more forms of contact between Friend and Renter. There is no reason anyone should do anything alone anymore since you can find a friend to join you in just about anything. It also help those who want to offer their friendship get out of the house and do something fun while also making some quick cash. This service can be useful for just about anyone who has ever been bored or just wanted to do something new and out of the ordinary. You can hire friends to teach you new skills, show you around an unfamiliar town, give you unbiased advice, or just have someone to talk to on a lonely day. The website allows users to list any and all things they want to be rented for and even charge separate fees for different activities. Therefore, the website can be used for just about anything. It allows users to be creative and compete for a good rating on their profile and bring themselves more business as a friend.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}