{"name": "Fresh Promotions Pty. Ltd.",
 "permalink": "fresh-promotions-pty-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/fresh-promotions-pty-ltd",
 "homepage_url": "http://www.freshpromotions.com.au",
 "blog_url": "http://www.freshpromotions.com.au/blog",
 "blog_feed_url": "http://www.freshpromotions.com.au/sitemap.xml",
 "twitter_username": "FreshPromotion1",
 "category_code": "ecommerce",
 "number_of_employees": 300,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "promotional-products, promotional-items, promotional-pens",
 "alias_list": null,
 "email_address": "info@freshpromotions.com.au",
 "phone_number": "1800129999",
 "description": "Promotional Online Merchandise Company",
 "created_at": "Fri Mar 16 07:12:28 UTC 2012",
 "updated_at": "Sat Mar 24 00:40:45 UTC 2012",
 "overview": "\u003Cp\u003EFresh promotions is one of the best merchandise e-store that offers promotional products as promotional pens, corporate gifts, promotional mugs, stylish promotional polo shirts and best promotional items. Join us for best promotional services. \u003C/p\u003E\n\n\u003Cp\u003EBranding is very imperative for all trades and definitely an essential footstep in growing a business. The rationale behind the branding efforts is to communicate the message that you wish your clients to be on familiar terms with your company and bring your products or services into your clients’ minds. One of the most successful ways to build up brand awareness for your company is to use distinctive Corporate gifts to build a long lasting impression in your clientele. Branding also incorporates few important things which help in maintaining a stronghold over your clients. Firstly, the quality of your Promotional Products should be second to none. It should set a benchmark for your customers. Secondly, the gift you are planning to promote should be distinctive, which should catch the eye of the clients. This factor can be best exploited by blending your imagination with the image of the brand. You can present a budget plan and many companies in Australia will give you bet possible solutions for your Corporate gifts Australia. \nThe advantage of these corporate gifts is that they raise the bar for your brand in the market and become your brand promoter. Its mere presence in the market will prove the very existence and dominance. Also such gifts will grasp the clients with its good quality and expediency and your brand will earn appreciation and class in the market. Thus the corporate gifts undeniably assist you in spreading awareness about your brand above your peers.\u003C/p\u003E\n\n\u003Cp\u003EWhat can be a better option for your promotion? A product or utility which strike chords in your client’s mind all the time and what can be a more useful than a simple and mighty Pen. Promotional Pens with your details on it will make an ideal marketing solution for your brand name. A pen accompanies everyone from a school going kid to a MD of a corporate world.\u003C/p\u003E\n\n\u003Cp\u003EWorking in an organization and Promotional Corporate Gifts offered to you will boost your confidence and also builds confidence in the brand you are working with. Thus they are the best bet nowadays to revive your brand’s image in market.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0017/8884/178884v2-max-150x150.jpg"],
     [[200,
       90],
      "assets/images/resized/0017/8884/178884v2-max-250x250.jpg"],
     [[200,
       90],
      "assets/images/resized/0017/8884/178884v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}