{"name": "FTFun",
 "permalink": "ftfun",
 "crunchbase_url": "http://www.crunchbase.com/company/ftfun",
 "homepage_url": "http://ftfun.com",
 "blog_url": "http://ftfun.com/news.php",
 "blog_feed_url": "",
 "twitter_username": "FTFun",
 "category_code": "public_relations",
 "number_of_employees": 5,
 "founded_year": 2010,
 "founded_month": 6,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "facetime, ftfun, facetime-app, facetime-community",
 "alias_list": null,
 "email_address": "contact@ftfun.com",
 "phone_number": "",
 "description": "A FaceTime Community",
 "created_at": "Tue Nov 02 20:51:49 UTC 2010",
 "updated_at": "Thu Nov 04 17:39:37 UTC 2010",
 "overview": "\u003Cp\u003EFTFunâ„¢ is a free service that was created to connect FaceTimeâ„¢ device owners (iPhoneâ„¢ 4, 4th Generation iPodâ„¢ Touch, etc.), around the world and to let them experience the magic that is FaceTimeâ„¢ with other eager and ready users instantly!\u003C/p\u003E\n\n\u003Cp\u003EFTFun, based in Jersey City, NJ was conceived just as Steve Jobs, the CEO of Apple, introduced FaceTime to the world at WWDC - 2010, on June 7, 2010. The service was launched on June 26, 2010, only two days after Apple\u0026#8217;s iPhone 4 was released. FTFun is a FaceTime Community that was created with the initial purpose of simply allowing iPhone 4 (now including iPod Touch and Mac) users to try out the FaceTime feature of their device. It uses a Web Application to connect its users. As of October 23, 2010, the FTFun service released an App in the Apple App Store. FTFun\u0026#8217;s population of users has since grown to span over 80 Countries (Top ten: United States, Brazil, Saudi Arabia, Thailand, China, Canada, United Kingdom, Spain, Mexico and Australia)\u003C/p\u003E\n\n\u003Cp\u003EHistory\u003C/p\u003E\n\n\u003Cp\u003EAt WWDC 2010 Apple initially announced their groundbreaking FaceTime technology that would forever change how we commonly use video conferencing. Two days after the launch of the iPhone 4 and FaceTime the founders of FTFun launched what they would hope to be the first FaceTime Community on the web. Since its inception, FTFun has steadily grown in terms of its user count. Furthermore, the service continues to regularly refine its main web application. Since its launch, 50,000 unique visitors have been reported to have visited the site with over 6 Million page views to date.\nApplication and Release\u003C/p\u003E\n\n\u003Cp\u003EThe free FTFun! App was released onto the App Store on October 23, 2010. After a long awaited approval process, the 0.3 Version was uploaded and had over 350 downloads on just the first day of its availability. The FTFun! App enables a community member to access the FTFun service and all of the features of the Web Application from the convenience of an iOS application that can be downloaded for either an iPhone 4 or a 4th Generation iPod Touch.\u003C/p\u003E\n\n\u003Cp\u003ETechnology\u003C/p\u003E\n\n\u003Cp\u003EThe iPhone 4 features a front-facing VGA camera as well as a 5-megapixel rear-facing camera, which is capable of recording HD video in 720p at 30 frames per second. These cameras provide the means for FTFun\u0026#8217;s services, as users enter FaceTime chats with other online individuals of their choice. Currently, FaceTime functions only in combination with a Wi-Fi connection, as there is no official 3G (UMTS/HSPA) data support at the moment. FaceTime can only work by connecting an iPhone 4 to another iPhone 4, 4th Generation iPod Touch or FaceTime for Mac; the previous generations of the iPhone are not supported.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[83,
       56],
      "assets/images/resized/0010/8366/108366v2-max-150x150.png"],
     [[83,
       56],
      "assets/images/resized/0010/8366/108366v2-max-250x250.png"],
     [[83,
       56],
      "assets/images/resized/0010/8366/108366v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[104,
        150],
       "assets/images/resized/0010/8365/108365v2-max-150x150.jpg"],
      [[173,
        250],
       "assets/images/resized/0010/8365/108365v2-max-250x250.jpg"],
      [[313,
        450],
       "assets/images/resized/0010/8365/108365v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://thenextweb.com/apps/2010/10/27/ftfun-links-you-to-other-facetime-users-emphasizing-community-over-creepy/",
    "title": "FTFun links you to other FaceTime users emphasizing community over creepy"},
   {"external_url": "http://www.killerstartups.com/Comm/ftfun-com-connect-with-other-facetime-device-owners",
    "title": "Connect With Other FaceTime Device Owners"}]}