{"name": "Fuel Cells Etc",
 "permalink": "fuel-cells-etc",
 "crunchbase_url": "http://www.crunchbase.com/company/fuel-cells-etc",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fuel-cell, fuel-cells, pemfc, dmfc, polymer, polymer-electrolyte, polymer-electrolyte-fuel-cell, direct-methanol, electrolyzer, electrolyser, membrane, membrane-electrode-assembly, membrane-electrode-assemblies, mea, gde, gdl, gas-diffusion-electrodes, el",
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Thu Apr 18 19:59:43 UTC 2013",
 "updated_at": "Mon Apr 22 22:46:47 UTC 2013",
 "overview": "\u003Cp\u003EFuel Cells Etc is a fuel cell manufacturer specializing in high performance custom fuel cell and electrolyzer components to product manufacturers, researchers and educators around the world. We pride ourselves on industry leading customer service and lead times. Fuel Cells Etc\u0026#8217;s primary products include Membrane Electrode Assemblies (MEA), Catalyst Coated Membranes (CCM), and Gas Diffusion Electrodes (GDE), all for a wide variety of fuel cells and Electrolyzers.\u003C/p\u003E\n\n\u003Cp\u003E== About Us ==\nFuel Cells Etc is a fuel cell components manufacturer that specializes in high performance custom fuel cell and electrolyzer components to product manufacturers, researchers and educators around the world. We pride ourselves on industry-leading customer service and lead times. Our primary products include Membrane Electrode Assemblies (MEA), Catalyst Coated Membranes (CCM), and Gas Diffusion Electrodes (GDE) all for a wide variety of fuel cells and electrolyzers. Our MEAs and GDEs are sold internationally and are globally recognized as some of (if not the) highest performing and highest quality MEAs on the market.\u003C/p\u003E\n\n\u003Cp\u003E== History ==\nFuelCellsEtc was originally part of one of the oldest and most recognized fuel cell R\u0026amp;D firms in the US, operating as Lynntech’s Commercial Fuel Cell Components Division. As a part of Lynntech, the division manufactured and sold MEAs commercially for more than 15 years. In August 2011, the current operating management of the division negotiated an exclusive license with Lynntech including all the technology, know-how, employees, etc. to transition the division into an independent company – FuelCellsEtc. FuelCellsEtc continues to keep up a close relationship with Lynntech.\u003C/p\u003E\n\n\u003Cp\u003E== The Difference ==\nOur surveys and interactions with our customers tell us that our customers choose us equally for these three qualities: our ability to offer completely custom solutions for fuel cells and components, our dedication to quality, and our commitment to providing customer service that goes above and beyond the customer’s expectations.\u003C/p\u003E\n\n\u003Cp\u003ECustomization – FuelCellsEtc is unique among other competing fuel cell companies in that our products are 100% custom for our customers. Everything from the MEA size and shape to the catalyst types and loading can be completely dictated by the customer. We can even use customer supplied materials (e.g. catalyst, membrane, etc). If help is needed in choosing or modifying specifications we also offer standard configurations or advice in order to ensure that the MEAs that are purchased are the best MEAs for the customer’s application. All of this is provided with no minimum order requirements.\u003C/p\u003E\n\n\u003Cp\u003EQuality – Our process complies with ISO9001:2008 standards but, more importantly, our customers around the world have found our MEAs to be consistently of the highest quality in their real life applications. Some of our customers use our MEAs as their gold standard when developing or testing their own products because they know they can rely on our consistent high quality.\u003C/p\u003E\n\n\u003Cp\u003ECustomer Service – We believe that customer service is the single most important aspect of our business. This means delivering on time, keeping our customers informed at critical stages, and going the extra mile if a customer needs products rushed.\u003C/p\u003E\n\n\u003Cp\u003EIt is for these reasons that FuelCellsEtc enjoys a high level of repeat (and increasing) business and is continually being recognized for providing the highest performing and highest quality Membrane Electrode Assemblies (MEA), Catalyst Coated Membranes (CCM), Gas Diffusion Electrodes (GDE) on the market. Click to learn more about our fuel cell and electrolyzer components.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Daniel",
      "last_name": "Westerheim",
      "permalink": "daniel-westerheim-2",
      "image": null}},
   {"is_past": false,
    "title": "Manager",
    "person":
     {"first_name": "Clinton",
      "last_name": "Anderson",
      "permalink": "clinton-anderson",
      "image":
       {"available_sizes":
         [[[112,
            150],
           "assets/images/resized/0025/2849/252849v2-max-150x150.jpg"],
          [[187,
            250],
           "assets/images/resized/0025/2849/252849v2-max-250x250.jpg"],
          [[337,
            450],
           "assets/images/resized/0025/2849/252849v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "World Headquarters",
    "address1": "2151 Harvey Mitchell Parkway South",
    "address2": "",
    "zip_code": "77840",
    "city": "College Station",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        76],
       "assets/images/resized/0025/3199/253199v2-max-150x150.jpg"],
      [[250,
        127],
       "assets/images/resized/0025/3199/253199v2-max-250x250.jpg"],
      [[425,
        216],
       "assets/images/resized/0025/3199/253199v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        130],
       "assets/images/resized/0025/3201/253201v2-max-150x150.jpg"],
      [[250,
        217],
       "assets/images/resized/0025/3201/253201v2-max-250x250.jpg"],
      [[450,
        390],
       "assets/images/resized/0025/3201/253201v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        126],
       "assets/images/resized/0025/3202/253202v2-max-150x150.jpg"],
      [[250,
        210],
       "assets/images/resized/0025/3202/253202v2-max-250x250.jpg"],
      [[450,
        378],
       "assets/images/resized/0025/3202/253202v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        85],
       "assets/images/resized/0025/3203/253203v2-max-150x150.png"],
      [[175,
        100],
       "assets/images/resized/0025/3203/253203v2-max-250x250.png"],
      [[175,
        100],
       "assets/images/resized/0025/3203/253203v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.fuelcelltoday.com/news-events/news-archive/2011/october/lynntech-spins-off-commercial-fuel-cell-components-division-as-fuelcellsetc",
    "title": "Lynntech Spins-off Commercial Fuel Cell Components Division as FuelCellsEtc"},
   {"external_url": "http://www.fuelcelltoday.com/news-events/news-archive/2012/april/fuelcellsetc-to-globally-distribute-pearl-hydrogen-fuel-cells",
    "title": "FuelCellsEtc to Globally Distribute Pearl Hydrogen Fuel Cells"},
   {"external_url": "http://www.fuelcelltoday.com/news-events/news-archive/2012/december/instant-online-mea-pricing-tool-now-available-from-fuelcellsetc",
    "title": "Instant Online MEA Pricing Tool Now Available from FuelCellsEtc"}]}