{"name": "FundEdu",
 "permalink": "fundedu",
 "crunchbase_url": "http://www.crunchbase.com/company/fundedu",
 "homepage_url": "http://www.fundedu.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "fundedu",
 "category_code": "web",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "p2p-lending, microfinance, education, vocational-training, social-enterprise",
 "alias_list": null,
 "email_address": "info@fundedu.com",
 "phone_number": "",
 "description": "Shopping \u0026 Lending ",
 "created_at": "Fri Feb 08 07:32:31 UTC 2013",
 "updated_at": "Fri Feb 08 23:46:27 UTC 2013",
 "overview": "\u003Cp\u003EIts Simple!\u003C/p\u003E\n\n\u003Cp\u003ENon-profits and MFIs around the world have discovered an effective way to help the world’s underprivileged people by funding them with small business loans. Several organizations have successfully helped thousands of people around the world. However, millions of others who are not entrepreneurial in nature cannot be benefited from such organizations. The only way they can alleviate out of poverty is by getting an opportunity to work or by getting a better paying job. Vocational training institutions can help such individuals to acquire a training in their area of interest and also get a relevant job. Educating these people is the only way to help them lift themselves out of poverty. \u003C/p\u003E\n\n\u003Cp\u003EMFIs and non-profits who understand the power of education need capital to reach these underprivileged individuals. At the same time, millions of everyday people in developed nations are looking for ways to do social good by either making donations, buying merchandize for social business or making investments that may not yield a financial return, however, will make a positive impact on the world. FundEdu simply weaves these contributors (investors/donors/buyers) with needy students via non-profits and MFIs. In a nutshell, FundEdu is creating an ecosystem that would empower individuals and organizations to do social good in their capacity using microfinance and social investments. \u003C/p\u003E\n\n\u003Cp\u003EFundEdu contributors can help make the cause by donating or investing as low as $0.10 a day or by buying merchandize from FundEdu\u0026#8217;s FEDU online shop.\u003C/p\u003E\n\n\u003Cp\u003ESince we are just beginning, we have announced FEDU Forerunners program for our first 1000 initial contributors. FEDU forerunners will have an opportunity to be one of the privileged members of this first FundEdu community. You can learn more details on how to join by clicking on the Tab Fedu Forerunners.\u003C/p\u003E\n\n\u003Cp\u003EWe will be sending invites to our friends and acquaintances who we believe have the passion to do a social good and help the underprivileged. First 1000 signups with contributions will receive an elite status of being lifetime privileged member of FEDU Forerunners community. Your name will be included in our founding team and will remain on our website for life! \u003C/p\u003E\n\n\u003Cp\u003EForerunners and other members can join us as contributors and community partners. Our registration will be open very soon. We need your help to ensure we are successful in empowering education with microfinance and social investments. \u003C/p\u003E\n\n\u003Cp\u003EYou can invite your trusted friends to be the FEDU Forerunner\u0026#8217;s member. Every member will have 10 invites that they can use to invite their friends/colleagues and form their own communities at FundEdu. We would also appreciate your feedback about our systems, processes and products. Please do write to us if you would be willing to help this cause before it goes live to the world. \u003C/p\u003E\n\n\u003Cp\u003EMission: FundEdu is a social business founded with mission to alleviate poverty by enabling educational non-profits and microfinance organizations with investments and donations required to fund vocational education for underprivileged individuals around the world.\u003C/p\u003E\n\n\u003Cp\u003EPrinciples: We believe that a business helping a noble cause has to be sustainable and unless this business can support itself, it can\u0026#8217;t support the cause. FundEdu is currently managed and run by Volunteers only to ensure that every dime we raise goes towards the real cause i.e. Funding Education!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       83],
      "assets/images/resized/0023/4435/234435v2-max-150x150.png"],
     [[250,
       138],
      "assets/images/resized/0023/4435/234435v2-max-250x250.png"],
     [[450,
       249],
      "assets/images/resized/0023/4435/234435v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Chet",
      "last_name": "Jain",
      "permalink": "chet-jain",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Mountain View",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://www.facebook.com/FundEdu",
    "title": "FundEdu's Facebook Page"}]}