{"name": "Furnillion",
 "permalink": "furnillion",
 "crunchbase_url": "http://www.crunchbase.com/company/furnillion",
 "homepage_url": "http://www.furnillion.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "furnillion",
 "category_code": "ecommerce",
 "number_of_employees": 1,
 "founded_year": 2013,
 "founded_month": 2,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "modern-coffee-table, modern-occasional-furniture, modern-storage-coffee-table, modern-side-table, modern-chaise-lounges, modern-lounge-chair, modern-home-furniture, modern-home-accessories, modern-rugs, modern-seating, modern-paintings, modern-club-chairs",
 "alias_list": null,
 "email_address": "furnillion@gmail.com",
 "phone_number": "9174999107",
 "description": "Modern occasional furniture",
 "created_at": "Sun May 05 07:50:24 UTC 2013",
 "updated_at": "Mon May 13 20:31:11 UTC 2013",
 "overview": "\u003Cp\u003EFurnillion.com is online store to buy modern occasional furniture and home accents.\u003C/p\u003E\n\n\u003Cp\u003EThis SMB e-commerce project features everyday renewing assortment of modern small forms of furniture and home accessories.\u003C/p\u003E\n\n\u003Cp\u003EThe main categories are  modern occasional tables (coffee tables, coffee tables sets, end tables, nesting tables, side tables, console tables, pedestal tables, accent tables) and modern and contemporary occasional seating (club chairs, chaise lounges, lounge chairs, recliners, rocking chairs, armchairs, bean bags, ottomans).\nAnother essential part of your modern interior design is home accessories. We at FURNILLION call them home accents as we think they are extremely important when creating the desired atmosphere and unique style at your home. Every day we are working hard to represent you the best samples of stylish modern wall art, vases, rugs, sculptures, clocks, room dividers and many more fine home accents.\u003C/p\u003E\n\n\u003Cp\u003EIn terms of style FURNILLION.COM is mainly focused on contemporary and modern occasional furniture. Being a young family owned business we would like to deliver and share with you our own feeling and understanding of modern design and style. Hope you like it and support us in our desire of promoting a good taste.\u003C/p\u003E\n\n\u003Cp\u003EAnother focus of our occasional furniture and home accessories is its functionality. It is always good to have some functional features in your interior objects such as additional storage or shelf in a coffee or end table, lifting top, tray table top, transformation mechanisms, lightening, inbuilt side tables in lounge chairs and many more!\u003C/p\u003E\n\n\u003Cp\u003EWe are sure that occasional tables, seating and home accents offered by FURILLION will make your home more cozy due to its nice modern style and functionality. Presence of those little accents in your interior will underline your delicate taste that will be noticed and admired by any of your guests!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       25],
      "assets/images/resized/0025/8887/258887v2-max-150x150.jpg"],
     [[250,
       41],
      "assets/images/resized/0025/8887/258887v2-max-250x250.jpg"],
     [[300,
       50],
      "assets/images/resized/0025/8887/258887v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Andrei",
      "last_name": "Liaskovich",
      "permalink": "andrei-liaskovich",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Quaters",
    "address1": "",
    "address2": "",
    "zip_code": "94102",
    "city": "San Francisco",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.7786871,
    "longitude": -122.4212424}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}