{"name": "Futures Trading Platforms",
 "permalink": "futures-trading-platforms",
 "crunchbase_url": "http://www.crunchbase.com/company/futures-trading-platforms",
 "homepage_url": "http://www.futurestradingplatforms.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "futures-trading-platforms--futures-trading-software, commodity-trading-platforms, commodity-trading-software, futures-trading, commodity-trading, trading-platforms, trading-systems-software, online-trading-platforms, online-trading-software",
 "alias_list": null,
 "email_address": "info@futurestradingplatforms.net",
 "phone_number": "516-513-0889",
 "description": ", Futures trading software",
 "created_at": "Mon Jul 12 16:21:10 UTC 2010",
 "updated_at": "Tue May 01 21:11:21 UTC 2012",
 "overview": "\u003Cp\u003EThere are many Futures Trading Platforms available today. Some of the Futures trading platforms are execution only and some come with Futures trading charts. Some of the cheaper or free Futures Trading Platforms only come with delayed quotes and are not real time. \u003C/p\u003E\n\n\u003Cp\u003EIdeally you want to find a Futures Trading Platform that is free, comes with good execution, a good data feed, both fast and reliable and a good charting package. If you do find a good Free Platform, make sure you aren\u0026#8217;t over paying on the execution of the Futures and Commodity contracts to make up for the cost of the platform. \u003C/p\u003E\n\n\u003Cp\u003EWhat to look for in a Futures Trading Platform: \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EA reliable Futures Trading Platform \u003C/li\u003E\n\u003Cli\u003EA good Futures trading data feed \u003C/li\u003E\n\u003Cli\u003ESupport for the Futures Trading Platform as long as the Futures markets are open.  \u003C/li\u003E\n\u003Cli\u003EA Futures Trading Platform that can be customized to fit your trading style. \u003C/li\u003E\n\u003Cli\u003EThe Futures Trading Platform needs to handle different types of orders, like OCO and Bracket orders as well as have stops and trailing stops. \u003C/li\u003E\n\u003Cli\u003EIf you want to program trading strategies, does the platform give you a simple front end to set up Futures Trading strategies. \u003C/li\u003E\n\u003C/ul\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}