{"name": "Gajanan Industries",
 "permalink": "gajanan-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/gajanan-industries",
 "homepage_url": "http://www.indiamart.com/gajananindustriestalwade/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "gajananindustriestalwade@tradepassport.org",
 "phone_number": "9763271111",
 "description": "Manufacturer and Supplier",
 "created_at": "Fri Apr 05 10:07:27 UTC 2013",
 "updated_at": "Fri Apr 05 10:07:29 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in the year 2011, at Pune (Maharashtra, India), we, “Gajanan Industries, Talwade”, are a well-known manufacturer and supplier of an exclusive range of Tube Bracing, Transaction Piece, Tank, Structural Column, Silo, etc. Our offered range includes Beam, Chimney, Staircase Platform \u0026amp; Railing, Dust Collector, Fabrication, Structural Bracing, etc.\u003Cbr/\u003E\nOur Vision:\nTo deliver efficient and high quality products at reasonable prices, meeting client\u0026#8217;s deadlines as well as their requirement.\nTo analyze, develop, engineer and manufacture advanced chemical plant equipment for the application, otherwise difficult to process.\u003C/p\u003E\n\n\u003Cp\u003EOur Experts:\nWe are blessed with a proficient team of dexterous employees and experienced professionals who work with their utmost concern and sincerity. With the dedicated effort of our professionals, we are capable of meeting the client\u0026#8217;s requirements in most efficient way.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nSince our inception, quality standardization has always been our prime objective. Our highly skilled quality experts make us highly efficient in delivering the best quality products to our clients. The offered products are manufactured under the strict guidance of our skilled professionals in compliance with international quality standards. Our quality controllers strictly monitor the different stages of production processes, right from procurement of raw material till the final dispatch of products.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are a leading manufacturer and supplier of an exclusive range of superior quality Process Equipment, Boiler Parts, Blender, Tank, Pressure Vessel, Silo, etc. \u003C/p\u003E\n\n\u003Cp\u003ECustomer Satisfaction:\nWe are customer-centric organization and strive hard to offer complete satisfaction to our valuable clients. The offered rage is manufactured using high grade raw material in compliance with international quality standards in order to attain maximum clients\u0026#8217; satisfaction. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8511/248511v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8511/248511v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8511/248511v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}