{"name": "Galaxy infotech",
 "permalink": "galaxy-infotech",
 "crunchbase_url": "http://www.crunchbase.com/company/galaxy-infotech",
 "homepage_url": "http://www.galaxyinfotech.net",
 "blog_url": "http://galaxyinfotechindia.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "galaxyinfotech",
 "category_code": "software",
 "number_of_employees": 4,
 "founded_year": 2004,
 "founded_month": 12,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "wordpress-developer, wordpress-designer, php-development, magento-developer, mobile-application-development",
 "alias_list": null,
 "email_address": "mail.galaxyinfo@gmail.com",
 "phone_number": "",
 "description": "Galaxy Infotech (India) is Professional ",
 "created_at": "Wed Apr 04 09:14:46 UTC 2012",
 "updated_at": "Wed Apr 11 04:00:03 UTC 2012",
 "overview": "\u003Cp\u003EGalaxy Infotech (India) is Professional Web Development and offshore outsourcing company based in Indore, India. We focus the needs of our clients to provide 100% satisfaction.Galaxyinfotech is incorporated to offer a comprehensive range of Website design, Web Development, Mobile Applications Development Solutions, Web 2.0 development, Content Management Systems Development , Search Engine Optimization ( SEO ),Internet Marketing, Portal Development, Logo Design, Brochure Design, E-Commernce Development,, Social media marketing services, Branding, Creative Graphics, 3D Animation which are market driven, cost-effective, and compliant to highest quality standards.\u003C/p\u003E\n\n\u003Cp\u003EGalaxy infotech is based in Indore city, India and having clients in USA, UK, Australia, Singapore, Canada, Dubai, Nederland, Sweden, Delhi, Middle East, Mumbai, Bangalore, Calcutta, Chennai and Vizag. We offer our services to clients who are located in San Jose,Fremont, San Francisco ( USA ), UK, Ireland, Australia, Middle East, Singapore, Malaysia,Nederlands(Netherlands), Hongkong, China, Japan, South Africa, Canada, Holland, Sweden, South Africa, Netherlands, Italy, Austria, France etc .\u003C/p\u003E\n\n\u003Cp\u003EWe promises to provide highly qualitative and cost effective Custom Application Development to our clients globally. We have extensive experience in many sectors like Mobile Application Development, .net development, Php Programming, Flash Action Script and Magento Development etc.Some of our focus industries includes Financial, Healthcare/Pharma, Media, eCommerce, Entertainment etc.  We are in business for over 4 years and have delivered over 250 websites .\u003C/p\u003E\n\n\u003Cp\u003EGalaxy infotech brings you iOS App Development exclusive iPad2, iPad, iPhone 4.0  and iPhone 3GS application development services of Apple products. We use most advanced Xcode4 platform using multiple featured iOS SDK platform 4 \u0026amp; 5 – provides an opportunity to develop amazing mobile apps that combine the power of internet with the remarkable Multi-touch technology.\u003C/p\u003E\n\n\u003Cp\u003EE-commerce websites are the latest trend in online business. If you want your business to be move smoothly and online then its a must to have an e-commerce website for your business. Now a day\u0026#8217;s people purchase everything online, which saves their valuable time.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0018/2565/182565v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0018/2565/182565v2-max-250x250.jpg"],
     [[300,
       300],
      "assets/images/resized/0018/2565/182565v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.galaxyinfotech.com/wordpress_developer.html",
    "title": "wordpress developer"}]}