{"name": "Game Mine",
 "permalink": "game-mine",
 "crunchbase_url": "http://www.crunchbase.com/company/game-mine",
 "homepage_url": "http://www.gamemine.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rent-games, buy-video-games, rent-games-online, rent-video-game",
 "alias_list": null,
 "email_address": "",
 "phone_number": "1.609.242.0043",
 "description": "Buy Rent Games Online",
 "created_at": "Tue Dec 06 19:26:53 UTC 2011",
 "updated_at": "Wed Dec 14 00:03:34 UTC 2011",
 "overview": "\u003Cp\u003EThere are now dozens of websites that allow you to rent games online, but if you want to play the latest console video games without late fees, you will need to look for a website that does not put any sort of controls on your rentals. These types of websites often charge monthly for their services, but when you subscribe, you will be able to rent video game titles from all of your favorite developers without worrying about heavy late charges.\u003C/p\u003E\n\n\u003Cp\u003EHowever, there are a few things to keep in mind when you look for a place to rent games online. Look at the titles that each rental website offers and make sure that they carry recent releases. Most websites that rent video games will have waiting lists for their most recent titles, as these are in high demand, so you should check to see how long these wait times will be before you sign up. You should also find out where the rental company is headquartered. This will help you anticipate shipping and receiving times, which could affect the value of a monthly video game rental subscription.\u003C/p\u003E\n\n\u003Cp\u003EIt can be helpful to look for a website that will also allow you to trade in games for money or for credit towards future purchases. Some websites will even let you trade games directly with other players, and if you are a regular gamer, this can be a great, inexpensive way to get used games. You will want a website that offers you a variety of options for finding and playing games, because while you will be renting more games than you buy or trade, there will certainly be a few titles that you will want to add to your collection.\u003C/p\u003E\n\n\u003Cp\u003EWhen you rent games online, you get to play some of the hottest titles available anywhere without spending much money. However, you will need to avoid late fees to really enjoy your games. Evaluate rental websites before subscribing and you will have a much better experience than what you could find at a local physical game rental store.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       116],
      "assets/images/resized/0016/5451/165451v2-max-150x150.jpg"],
     [[250,
       194],
      "assets/images/resized/0016/5451/165451v2-max-250x250.jpg"],
     [[400,
       312],
      "assets/images/resized/0016/5451/165451v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}