{"name": "Gandhinagar Mega Mall",
 "permalink": "gandhinagar-mega-mall",
 "crunchbase_url": "http://www.crunchbase.com/company/gandhinagar-mega-mall",
 "homepage_url": "http://www.gandhinagarmegamall.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "gnagarmegamall",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@gandhinagarmegamall.com",
 "phone_number": "+91-79-30487861",
 "description": "",
 "created_at": "Thu Dec 13 08:52:59 UTC 2012",
 "updated_at": "Tue Dec 18 08:56:24 UTC 2012",
 "overview": "\u003Cp\u003EGandhinagar Mega Mall is an online marketplace, featuring a wide assortment of products across like Mobiles, Computers, Electronics, Fashion accessories, Gifts \u0026amp; Toys, Packaged Food and Stationery\u003C/p\u003E\n\n\u003Cp\u003EGandhinagarmegamall is owend by Technomeet Solutions Pvt. Ltd.,  an ISO 9001:2008 certified company based in Gujarat having more than six years of experience in IT domain. We are a total solution provider for Web Design \u0026amp; Development, e-Commerce Development, and Consulting Services.\u003C/p\u003E\n\n\u003Cp\u003EWe believe in keeping pace with the ever changing technology thereby enabling us to provide our customers with innovative services backed with trust and hence, building a long-term relationship. Our unique services make us stand tall in this hugely competitive domain, with the aid of our team of expert professionals. We aim at designing business requirements with technological enabled solutions which would cater our client’s every requirement into meaningful solutions. Our dedicated technical team works in every manner to satisfactorily fulfill our client’s mission-critical business challenges enabling our organization to surpass all leading providers in IT industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision:\u003C/p\u003E\n\n\u003Cp\u003EQuality approach work with timely delivery is the most important element of our organization. Our commitment involved with integrated values makes us strong and determinant to take huge leaps contributing towards growth.\u003C/p\u003E\n\n\u003Cp\u003E100% Customer Satisfaction\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to provide a holistic shopping experience to each one of our customers and ensure 100% satisfaction, be it in terms of best prices, a comprehensive web experience, on-time delivery \u0026amp; friendly after-sales support or our bespoke services such as Cash on Delivery, 7 day return policy, and free shipping choices. You can be assured of 100% authenticity every time you shop with us - We only sell genuine merchandise and all our products come with the complete manufacturer warranties. We strive to bring you the best value deals while never sacrificing on quality and take immense pride in our transparent order fulfillment process.\u003C/p\u003E\n\n\u003Cp\u003EHassle Free Shopping\u003C/p\u003E\n\n\u003Cp\u003EOur 7 day easy return policy and reverse pick up procedures aim to provide you a hassle free shopping experience. In addition, we ensure complete transactional security with our state of the art Payment Gateway which offers complete transparency for your transactions. All online payment transactions are VeriSign secured making your purchases 100% safe. We ensure order delivery within 5 business days for all locally procured merchandise.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/5172/225172v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0022/5172/225172v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0022/5172/225172v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        100],
       "assets/images/resized/0022/5171/225171v2-max-150x150.jpg"],
      [[250,
        166],
       "assets/images/resized/0022/5171/225171v2-max-250x250.jpg"],
      [[450,
        300],
       "assets/images/resized/0022/5171/225171v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.facebook.com/Gandhinagarmegamall",
    "title": "Facebook"}]}