{"name": "Ganesh Plasto",
 "permalink": "ganesh-plasto",
 "crunchbase_url": "http://www.crunchbase.com/company/ganesh-plasto",
 "homepage_url": "http://www.indiamart.com/ganeshplastopack/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bag-closure, cham-cham-tray, mita, plum-cake-tray, nacho-tray-and-small-ampoule-tray-",
 "alias_list": null,
 "email_address": "ganeshplastopack@tradepassport.org",
 "phone_number": "9892429840 ",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Sat Apr 06 05:33:56 UTC 2013",
 "updated_at": "Mon Apr 08 00:13:41 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, we, “Ganesh Plasto Pack”, are one of the leading names that are engaged in manufacturing, supplying and exporting a wide array of superior quality PVC Disposable Products, Pharmaceutical Tray, Ampoule Tray, Salad Tray and Allied Industrial Tray. In this range, we offer PVC Ampoule Tray, HIPS Ampoule Tray, Mava Cake Tray, Small Biscuit Tray, Small Flower Bowl Metalized and Big Flower Bowl Metalized. Apart from this, we offer Bag Closure, Cham Cham Tray, MITA, Plum Cake Tray, Nacho Tray and Small Ampoule Tray.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIn the success journey of organization, our highly experienced \u0026amp; skilled professionals play an important role. Our team of highly competent professionals is hired by top management on the basis of their knowledge, experience and requisite skills. Further, our professionals put their sincere efforts to manufacture and offer a qualitative range of Pharmaceutical, Ampoule, Salad and Allied Industrial Tray. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur organization has developed a state-of-the-art infrastructure facility, which supports us in performing all business processes with ease. Sprawling across vast area, our sophisticated facility helps us in manufacturing and exporting a comprehensive range of high-grade Pharmaceutical, Ampoule, Salad and Allied Industrial Tray. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nOwing to the excellent quality of offered Ampoule Trays, we have been able to gain a reputed stature in this domain. For manufacturing high grade Pharmaceutical, Ampoule, Salad and Allied Industrial Tray, we make use of superior quality PVC, HIPS,PET and other basic raw material. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client oriented organization, which works with the prime goal of acquiring higher level of clients satisfaction. For the same, we are manufacturing and exporting a comprehensive array of Pharmaceutical, Ampoule, Salad and Allied Industrial Tray. \u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nwe offer PVC Ampoule Tray, HIPS Ampoule Tray, Mava Cake Tray, Small Biscuit Tray, Small Flower Bowl Metalized and Big Flower Bowl Metalized. Apart from this, we offer Bag Closure, Cham Cham Tray, MITA, Plum Cake Tray, Nacho Tray and Small Ampoule Tray.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/9052/249052v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/9052/249052v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/9052/249052v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}