{"name": "Ganesh Marketing",
 "permalink": "ganesh-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/ganesh-marketing",
 "homepage_url": "http://www.indiamart.com/ganeshmarketingassociates/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ganeshmarketingassociates@tradepassport.org",
 "phone_number": "9855999946",
 "description": "Manufacturer and Supplier of Bar Break",
 "created_at": "Fri Apr 05 11:52:37 UTC 2013",
 "updated_at": "Fri Apr 05 11:52:44 UTC 2013",
 "overview": "\u003Cp\u003EIntegrated in Chandigarh (India), “Ganesh Industries”, is a well-known organization engaged in manufacturing and supplying a constructive range of various types of Bar Break Couplers, Rebar Couplers, Position Couplers, Taper Couplers and Threading Equipment. Additionally, Ganesh Marketing Associates is our group company. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIt is the untiring efforts and wide industry knowledge of our workforce that our company is giving tough competition to rivals in the production of this high quality Bar Break Couplers, Rebar Couplers, Position Couplers, Taper Couplers and Threading Equipment. Our team members are well-aware about the production processes to fabricate the offered range in various sizes and dimensions. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nIn order to thrive in this extremely competitive global market, we have constructed state-of-the-art infrastructural base that is equipped with various requisite amenities. It consists of hi-tech production unit that is spread over a large area of land and is installed with necessary machines and equipment.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur firm is popular all over the globe for its customer oriented work polices as our efforts are guided towards presenting products that cater to the interests of customers in the best possible way. These products are at par with the international standards and bless us with an edge over our rivals.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have emerged as the leading manufacturer and supplier of a broad gamut of extremely useful range of Bar Break Couplers, Rebar Couplers, Position Couplers, Taper Couplers and Threading Equipment. Apart from this, our client centric practices make us the most favourable in the industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       130],
      "assets/images/resized/0024/8606/248606v2-max-150x150.jpg"],
     [[230,
       200],
      "assets/images/resized/0024/8606/248606v2-max-250x250.jpg"],
     [[230,
       200],
      "assets/images/resized/0024/8606/248606v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}