{"name": "Gardnyr Michael Capital",
 "permalink": "gardnyr-michael-capital",
 "crunchbase_url": "http://www.crunchbase.com/company/gardnyr-michael-capital",
 "homepage_url": "http://www.gardnyrmichaelcapital.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 1991,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Gardnyr Michael Capital",
 "created_at": "Wed May 30 15:24:46 UTC 2012",
 "updated_at": "Fri Jun 08 01:58:24 UTC 2012",
 "overview": "\u003Cp\u003ENatural disasters and elemental wear and tear pay no heed to the budgetary restrictions of a town or community.  When the time is ripe, problems will strike without warning and devastate community projects.  Often times, these crippled projects are vital for the functionality of a town.  So when they’re in need of repair, communities must act fast to secure the finances required to fix them.  And that’s why Gardnyr Michael Capital takes great pride in providing communities with the funding they need.  \u003C/p\u003E\n\n\u003Cp\u003EHistory\u003C/p\u003E\n\n\u003Cp\u003EGardnyr Michael Capital was founded over twenty years ago just outside of Orlando in Winter Park, Florida.  The firm is the brainchild of Jim Pietkiewicz and Pfilip Hunt, both of whom had loads of experience in the field prior to founding GMC.  Before creating their own firm, both men worked for Southeastern Municipal Bonds, Inc.  Mr. Pietkiewicz was employed as a Senior Trader and underwriter, while Mr. Hunt worked as a research analyst and investment banker.  \u003C/p\u003E\n\n\u003Cp\u003ESince its inception, the rapid yet responsible growth of Gardnyr Michael Capital has been nothing less than impressive.  Shortly after opening their first office in Winter Park, GMC expanded its reach by adding another office in Flagler Beach.  But the expansion wasn’t limited to Florida.  Over the past several years, GMC has opened offices in Alabama, Texas, Louisiana, New York and New Jersey. \u003C/p\u003E\n\n\u003Cp\u003EAreas Of Expertise\u003C/p\u003E\n\n\u003Cp\u003EGardnyr Michael Capital specializes in public finance, a form of lending that empowers communities to handle problems immediately.  If a sewer system is somehow damaged and in desperate need of repair, a fix cannot wait.  However, sometimes the financial resources required to fix the problem aren’t within the means of the budget.  And because the contractors who fix these problems do not work for free, this presents a problem.\u003C/p\u003E\n\n\u003Cp\u003EPublic finance firms like GMC provide communities with the monetary resources they need when they need them.  This capital investment enables communities to grow a stable infrastructure that fosters economic growth.  And over time, that economic growth allows communities to return the investment to the lender.  For over two decades, Gardnyr Michael Capital has successfully helped build communities through this practice.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}