{"name": "GeeGroup Industries",
 "permalink": "geegroup-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/geegroup-industries",
 "homepage_url": "http://www.indiamart.com/geegroupindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "geegroupindustrie@tradepassport.org",
 "phone_number": "9988565580",
 "description": "Manufacturer and Supplier of Hex Head  ",
 "created_at": "Fri Apr 05 14:05:56 UTC 2013",
 "updated_at": "Fri Apr 05 14:05:59 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2007, at Mohali (Punjab, India), we, “Gee Group Industries,” are one of the reckoned enterprises involved in manufacturing and supplying a broad gamut of Hex Head Screws, Industrial Screws, Industrial Nuts and Bolts. In our wide product array, we provide Metal Nuts, Metal Bolts, Hex Head Bolt, CSK Combination Pan Head Screw, Combination Washer Head Screws, Pan Combination Head Screw, Stainless Steel Self Tapping Screws, Golden plated Screws, Zinc Plated Screws, etc. These products are manufactured by making use of supreme grade basic material in the manufacturing process. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Facilities:\nIn order to assure a streamlined and hassle free production of our range of industrial fasteners, we have stationed a sound infrastructural facility. Segregated into different departments like manufacturing, R\u0026amp;D, quality testing and warehouse, our infrastructure is backed by requisite machines, tools and equipment.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nAs we are an ISO 9001:2008 certified company, we are progressing in the industry due to our commitment towards providing our clients a superior quality product gamut. Our complete product range is precision engineered under the supervision of our experienced professionals using optimum grade basic material and components in accordance with the international standards. At our quality testing unit, we conduct multi-level inspection procedures on the fasteners to ensure that offered products are free from all kinds of defects.  \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are manned by an efficient team of the most dedicated and brilliant professionals. These professionals possess vast industry exposure. With an intention to achieve defined organizational goals, our professionals perform to their best of abilities in close cohesion with each other. The quality controllers of our team strictly check the product assortment on well-defined parameters in order to deliver flawless products at the clients’ end. Our experienced packaging professionals handle the appropriate packaging of the consignments as suitable for clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric organization, we always give our best possible efforts to satisfy our clients at all costs. Our well developed infrastructure is installed with the latest technology that helps us to offer quality products and maintain a satisfied clientele. The stringent quality policy followed has earned us a lot of appreciation and trust from our customers. For the fabrication of our product array, we procure optimum quality raw material from the most trusted sources of the industry to make sure that we match the standards our clients expect.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nIndustrial Nuts \u0026amp; Bolts\nHex Head Bolt\nMetal Bolts\nMetal Nuts\nHex Head Screws\nIndustrial Screws\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8744/248744v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8744/248744v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8744/248744v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}