{"name": "Gemoto Engineering",
 "permalink": "gemoto-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/gemoto-engineering",
 "homepage_url": "http://www.indiamart.com/gemotoengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "gemotoengineering@tradepassport.org",
 "phone_number": "",
 "description": "GEMOTO ENGINEERING is a world leading .",
 "created_at": "Fri Apr 05 04:26:02 UTC 2013",
 "updated_at": "Fri Apr 05 04:26:05 UTC 2013",
 "overview": "\u003Cp\u003EGEMOTO ENGINEERING are designers and manufacturers of equipment for the metal strip processing industry.The competitive advantage of GEMOTO ENGINEERING stems from being able to offer the world\u0026#8217;s best technology at competitive pricing, with the backup of full \u0026amp; ongoing specialist support. In short, we offer a world class supply solution that is second to none. Our In-house design and manufacture assets allow us fully control of the complete supply process from engineering through manufacturing and shipping.\u003C/p\u003E\n\n\u003Cp\u003EMission:\nOur mission is to offer total Customer satisfaction. We will accomplish this mission by producing excellent products that give maximum value of our customer with a team of highly experienced and creative people of high integrity.We will advance our competitive advantage by continually developing new products and technologies. \u003C/p\u003E\n\n\u003Cp\u003EOur Environment:\nIt is a defined objective of GEMOTO ENGINEERING to assist customers to achieve their goals in regard to sustainability, and environmental targets, whilst reducing overall production costs.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a healthy inter department coordination essential in the dispensation of production work. The production managements is experienced in handling staff issues and encourage optimization of work among working groups. With advanced precision CNC machines, our maintenance engineers coordinate with technicians for recurring down time problems. Having to manufacture Metal Strip Processing Equipment the quality control team has a demanding time frame to maintain standardized output.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe provide a state-of-the-art R\u0026amp;D facility for in-depth raw material analysis. Being accredited wit ISO 9001:2008 certification, our quality control works diligently to maintain this high standardization. From reliable procurements to stable and durable finished products, the Quality team has an extra responsibility to maintain the ISO quality management system.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8192/248192v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8192/248192v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8192/248192v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}