{"name": "Genie Bazaar",
 "permalink": "genie-bazaar",
 "crunchbase_url": "http://www.crunchbase.com/company/genie-bazaar",
 "homepage_url": "http://www.geniebazaar.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "geniebazaar",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 8,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "services, freelance, service-marketplace, contractors, outsourcing, service-providers, plumbers, web-designers, electricians, temporary-staffing",
 "alias_list": null,
 "email_address": "support@geniebazaar.com",
 "phone_number": "+1 50-I-AM-GENIE",
 "description": "Online Service Marketplace",
 "created_at": "Mon Feb 27 20:04:58 UTC 2012",
 "updated_at": "Tue Mar 13 05:35:49 UTC 2012",
 "overview": "\u003Cp\u003EGenie Bazaar connects small business owners and home owners with trusted contractors and service providers. It aspires to become the most trusted marketplace for services be it local or online gigs.\u003C/p\u003E\n\n\u003Cp\u003EBazaar means \u0026#8220;Marketplace\u0026#8221; and \u0026#8220;Genie\u0026#8221; is a person known for providing free services to their master. Genie Bazaar was found in 2010 with the thought of creating a marketplace for over 500 services. Local services include Plumbing, Roofing, Electrcial, Tiling, Siding, Senior Care, Remodeling, Installing Applicances, and more. Online Services inlclude Legal Services, Consulting, Web Programming/Designing, Search Engine Optimization, Marketing/Sales, Graphic Designing, Adminitrative Support, Writing, Translation, Engineering, and more.\u003C/p\u003E\n\n\u003Cp\u003EEmployers can make a wish (Describe their project), hire a Genie (service provider), and monitor the job (Genie snap).\u003C/p\u003E\n\n\u003Cp\u003EGenie Bazaar provides Escrow services for increasing the confidence between contractors and employers. They also offer Paypal payments, credit card payments, direct deposit, etc. In addition, employers are certain that they are dealing with trusted freelancers because of the verification process of Genie Bazaar which includes verifying Licenses, Certifications, Insurances, etc. So, if the profile of a contractor says that they are certified, then they are actually certified.\u003C/p\u003E\n\n\u003Cp\u003EAll contractors are rated using a proprietary formula called \u0026#8220;Trust Rating\u0026#8221;. It tries to guage the amount of trust an employer could put in a contractor and is visible on all contractor\u0026#8217;s profile. It is based on various measures such as \u0026#8220;Repeat Business\u0026#8221;, Licensing information, Certifications, Peer reviews, \u0026#8220;actual\u0026#8221; customer reviews, affiliations, etc. Basically, all parameters a customer would consider before hiring a contractor for online or local services.\u003C/p\u003E\n\n\u003Cp\u003ECorporate account customers can manage multiple projects and get reports by category and by projects for no charge. Freelancers or Contractors can measure their performance against average of all service providers and check whether Genie Bazaar is working for them or not! In addition, they are provided with reports on return on investment, 1099 Tax management services, statistical reports on number of visits and profile searches, and immediate leads through their free SMS notification system. \u003C/p\u003E\n\n\u003Cp\u003ETalk Freelance, Talk Genie! is one of their tagline.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       29],
      "assets/images/resized/0017/6010/176010v2-max-150x150.png"],
     [[250,
       49],
      "assets/images/resized/0017/6010/176010v2-max-250x250.png"],
     [[286,
       57],
      "assets/images/resized/0017/6010/176010v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "Local Services",
    "is_past": true,
    "provider":
     {"name": "http://geniebazaar.wordpress.com/2010/09/26/genie-bazaar-local-services/",
      "permalink": "http-geniebazaar-wordpress-com-2010-09-26-genie-bazaar-local-services",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}