{"name": "INTRO Labs",
 "permalink": "getintro",
 "crunchbase_url": "http://www.crunchbase.com/company/getintro",
 "homepage_url": "https://getintro.net",
 "blog_url": "http://blog.getintro.net",
 "blog_feed_url": "",
 "twitter_username": "GetIntro",
 "category_code": "mobile",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "contact@getintro.net",
 "phone_number": "",
 "description": "",
 "created_at": "Tue Mar 06 18:26:35 UTC 2012",
 "updated_at": "Mon Apr 02 07:49:59 UTC 2012",
 "overview": "\u003Cp\u003E\u003Cem\u003EAs seen in NY Times, The Guardian, Techcrunch and Springwise\u003C/em\u003E\nINTRO helps grow your business network by making the right introductions for you. It matches you to the people nearby that you need to meet.\u003C/p\u003E\n\n\u003Cp\u003EINTRO also matches Freelancers to projects they have the right skills for. It’s the fastest and easiest way to find work. No more online applications, recruitment agents or list searching. And for Small Businesses, you’re matched to the best people for your project. \u003C/p\u003E\n\n\u003Cp\u003EINTRO:\u003C/p\u003E\n\n\u003Cp\u003E• Creates a customized and ranked list of the most relevant business people nearby now. \u003C/p\u003E\n\n\u003Cp\u003E• Uses info from your current networks (Linked In, Twitter, Facebook and Foursquare), and your contacts info (so you don’t need to do anything - just add your networks).\u003C/p\u003E\n\n\u003Cp\u003E• Shows exact overlaps you share Eg. people you both know, places you’ve worked at, universities, clubs, or networks you both belong to (and the industry you’re in).\u003C/p\u003E\n\n\u003Cp\u003E• Allows you to set who you’re looking for Eg. a graphic designer.\u003C/p\u003E\n\n\u003Cp\u003E• Reach Out, Connect and Chat in real time.\u003C/p\u003E\n\n\u003Cp\u003E• Stores contacts and updates them automatically. INTRO tells you when a current contact or new INTRO is close enough to shake hands and grab a drink with (but only if you want it to).\u003C/p\u003E\n\n\u003Cp\u003E• Is ever new and dynamic - new introductions are triggered automatically as you move about the city. Intros aren’t dependant on being in a specific place or time - but works well before, during or after a conference or event.\u003C/p\u003E\n\n\u003Cp\u003EINTRO - Business networking just became a whole lot easier\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003ENOTE: INTRO requires a LinkedIn account to log in.\u003C/p\u003E\n\n\u003Cp\u003ENOTE: If you choose to have the location running in the background (off by default) then the continued use of GPS running in the background can dramatically decrease battery life.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0017/7263/177263v1-max-150x150.png"],
     [[250,
       71],
      "assets/images/resized/0017/7263/177263v1-max-250x250.png"],
     [[279,
       80],
      "assets/images/resized/0017/7263/177263v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}