{"name": "Getkart.com",
 "permalink": "getkart-com",
 "crunchbase_url": "http://www.crunchbase.com/company/getkart-com",
 "homepage_url": "http://www.getkart.com",
 "blog_url": "http://www.getkart.com",
 "blog_feed_url": "",
 "twitter_username": "Getkartonline",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 2,
 "founded_day": 23,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-shopping-india, buy-mobile-phones, computer, free-shipping, daily-deals, discounts, getkart-sale, online-sale",
 "alias_list": null,
 "email_address": "support@getkart.com",
 "phone_number": "01642246584",
 "description": "Online Shopping India: Buy Computer, Lap",
 "created_at": "Tue Oct 09 13:02:52 UTC 2012",
 "updated_at": "Thu Oct 18 00:10:11 UTC 2012",
 "overview": "\u003Cp\u003EGetkart is fastest growing online shopping portal, Founded by experienced management to provide best online experience in shopping \u0026amp; offers. Getkart helps users to optimize their Online Existence.\u003C/p\u003E\n\n\u003Cp\u003EGetkart is an exciting and engaging online fun shopping platform offering significant daily deals, discounts and great prices on premium products when compared to the retail \u0026amp; regular price. We work with the customer’s best interest in mind, and would strive to be synonymous with transparency, excellent service quality and reliability.\u003C/p\u003E\n\n\u003Cp\u003EMain motto of Getkart is “Customer’s Satisfaction from every Corner” and we leverage this with power of having huge collection of products \u0026amp; brands. Basically Getkart is your platform which gets great prices and best customer experience.\u003C/p\u003E\n\n\u003Cp\u003EIndia, Feb 23, 2011- Getkart.com is a startup in e-Tail business offering electronics goods \u0026amp; deals up to 90% off across various cities. The company started operations in 2012 in Jaipur with a small office space and expanded their operations in Delhi, Mumbai, Kolkata, Agra, Bangalore, Chandigarh, Bathinda .  \u003C/p\u003E\n\n\u003Cp\u003EGetkart aims to strength three facets of e-Commerce (User Interface, Supply Chain Management \u0026amp; Delivery) according to Indian ecosystem and they are investing time \u0026amp; money in that only.  Company believe, they cannot have one solution for all, but needs to be tailor made for the specific customer in mind. Not only they realize that they can carve a niche for our chosen customer, but also realize how strong they can build their business based on their suppliers and the value chain. Because, like different customer, they also have different \u0026#8220;types of suppliers and vendor\u0026#8221;. They opted to go for horizontal play rather than going in one vertical space and focusing on the processes, customers as well as their vendors \u0026amp; partners. Team believes that there is no need to do Rocket Science - just to do the normal things in better way.\u003C/p\u003E\n\n\u003Cp\u003EThe company has tied up with more than 100 of suppliers and growing their supplier’s network monthly.  Getkart.com selling all big brands on their online shop like Dell, Samsung, HCL, Apple, Lenovo, HP, Espirit, Fastrack, Funskool etc. and working hard to tie-up with more large consumer companies to increase their portfolio. Their rich experience, customer centric approach, dual flexibility and fastest delivery track record makes them stand apart which gives an edge over others to deal successfully with real time challenges of online shopping. At the same time, they would also like to sense opportunities in the Indian Retail sector, as Indian market can see some Government policy shift.  \u003C/p\u003E\n\n\u003Cp\u003EGetkart core team members have rich experience of entrepreneurship in retailing solutions business. Getkart team present in 10 major cities and working hard to deliver the best customer experience to their existing and new customers. And like any startup, they all work from Customer support, Business development , Logistics\u0026#8230;and everything. \nCompany officials believe that to sustain long term in the market, they have to develop their own logistics \u0026amp; delivery system in coming years to achieve the profitability and have plan to share these services to other players also through their “Resource Sharing Program” \u0026amp; “Vendor Education Program”. Company core strength is dedicated customer service and implementing corporate culture in the organizations, which helps them to acquire the large customer base.  Getkart believes that customer service is first for them and doing number of different ways to improve the quality of service day by day. Getkart aims to use power of internet \u0026amp; technology to provide best platform to their customers, vendors, partners \u0026amp; promoters. Getkart is aiming to grow as #1 technical \u0026amp; service oriented company in e-Tail Business.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0021/4875/214875v2-max-150x150.jpg"],
     [[250,
       62],
      "assets/images/resized/0021/4875/214875v2-max-250x250.jpg"],
     [[450,
       112],
      "assets/images/resized/0021/4875/214875v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Shivanshu",
      "last_name": "Bansal",
      "permalink": "shivanshu-bansal",
      "image": null}},
   {"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Sampat",
      "last_name": "Singh Shekhawat",
      "permalink": "sampat-singh-shekhawat",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Getkart.com",
    "address1": "Plot 84",
    "address2": "Bharat Nagar",
    "zip_code": "151001",
    "city": "Bathinda",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null},
   {"description": "Getkart.com",
    "address1": "Plot 28A, Brij Lal Pura",
    "address2": "Gopal Pura Bye Pass",
    "zip_code": "302020",
    "city": "Jaipur",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        84],
       "assets/images/resized/0021/4874/214874v2-max-150x150.jpg"],
      [[250,
        140],
       "assets/images/resized/0021/4874/214874v2-max-250x250.jpg"],
      [[450,
        253],
       "assets/images/resized/0021/4874/214874v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}