{"name": "Getting-in",
 "permalink": "getting-in",
 "crunchbase_url": "http://www.crunchbase.com/company/getting-in",
 "homepage_url": "http://www.getting-in.com",
 "blog_url": "http://www.getting-in.com/blog/",
 "blog_feed_url": "http://www.getting-in.com/blog/",
 "twitter_username": "gettingin2",
 "category_code": "education",
 "number_of_employees": 16,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "education, student-advertising, marketing",
 "alias_list": null,
 "email_address": "info@getting-in.com",
 "phone_number": "01225430643",
 "description": "The UK's leading educational website",
 "created_at": "Fri May 17 09:53:35 UTC 2013",
 "updated_at": "Fri May 17 14:31:50 UTC 2013",
 "overview": "\u003Cp\u003EGetting-in reinvents online educational advice and proves a hit with students\u003C/p\u003E\n\n\u003Cp\u003EThe world of education is moving increasingly online, with students, teachers and parents alike now making heavy use of educational resources on the web to study and plan their next career, training or educational steps.\nNowhere can this trend be seen more clearly than through the example of Getting-in, an educational portal that caters for every conceivable area of life that secondary-level children, students and career-minded young people could need as they prepare themselves for their futures.\u003C/p\u003E\n\n\u003Cp\u003EIt has already enjoyed phenomenal success, building up a dedicated online following and experiencing an explosion in its readership base. This hasn’t just taken the form of visitors to the site, but also students getting involved through its social media presence, such as its Twitter feed, which keeps students updated with crucial information about areas such as open-day dates and other developments in the world of careers and education.\nIn part the popularity of the site is down to the quality of the resources that it offers. Created by professional writers and careers and education experts, the quality of its advice articles and study resources is unparalleled. Students looking for advice on where to apply to university get insightful and practical advice from is Applying section, while GCSE and A-Level students have access to revision guides for all of the most popular secondary-level subjects that bring the curricula to life. Students can book on to open days all over the UK and courses.\u003C/p\u003E\n\n\u003Cp\u003EHowever, what has really set Getting-in apart from other educational sites and made it such a hit with young people is that it pays every bit as much attention to the needs of young people who want to head into the world of work or training rather than continue with their studies, or people who have not yet made up their minds about such dilemmas. It offers a huge range of articles and guides on finding job opportunities, taking a gap year, exploring training options and even setting up a business. In an age where higher education carries a considerable financial burden, young people are looking more than they have done for several generations for equally rewarding opportunities, something that Getting-in seems to be one of the very first sites to recognize.\nGetting-in has also made itself popular through some highly innovative extra features, such as an extensive database of university and college profiles profiles. Also a calendar of open days with a booking system, and a wide selection of special offers for students at the UK’s most popular high-street stores and restaurants.\nWith the momentum behind Getting-in looking to be unstoppable—the site has been receiving more and more visitors every single month since it was launched—not only is it proving that the future of education advice and resources lies online, but it is also leading the way in defining the possibilities of how the Internet can help young people best prepare for their futures in an ever-more competitive job market and an increasingly expensive educational world.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "£160k",
 "funding_rounds":
  [{"round_code": "unattributed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 160000.0,
    "raised_currency_code": "GBP",
    "funded_year": 2012,
    "funded_month": 1,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "17 Belmont Street",
    "address2": "57 Chester close South, London",
    "zip_code": "BA1 5DZ",
    "city": "Bath",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.3866367,
    "longitude": -2.3611116}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.innovatemyschool.com/blog/item/539-new-resource-website-for-gcse-a-level-and-beyond.html",
    "title": ""}]}