{"name": "Ghanshyam Enterprise",
 "permalink": "ghanshyam-enterprise",
 "crunchbase_url": "http://www.crunchbase.com/company/ghanshyam-enterprise",
 "homepage_url": "http://www.indiamart.com/ghanshyamenterprise-ahmedabad/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "regular-clear-solvent, upvc-tank-adapter, female-adapter-brass-threaded, ball-valve",
 "alias_list": null,
 "email_address": "ghanshyamenterprise-ahmedabad@tradepassport.org",
 "phone_number": "9898570154",
 "description": "We, Ghanshyam Enterprise are a respecte,",
 "created_at": "Thu Apr 04 06:30:50 UTC 2013",
 "updated_at": "Thu Apr 04 06:30:52 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1987, we, \u0026#8220;Ghanshyam Enterprise\u0026#8221; are an established organization engaged in distributing, wholesaling and trading an impeccable assortment of UPVC, CPVC, G.I. Pipes \u0026amp; Fittings. Products that we cater to our patrons with comprises Galvanized Cross Tee, Galvanized Side Outlet Tee, Regular Clear Solvent, UPVC Tank Adapter, Female Adapter Brass Threaded, Ball Valve, CPVC Elbow Fitting, CPVC Coupler, CPVC Reducer Bushing, Bronze Gate Valve, Supertite Liquid Sealant and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are assisted by a team of highly experienced and determined professionals, who strive hard to accomplish goals and objectives of the organization in a systematic manner. Professionals, whom we hire, accomplish all business and managerial activities in an affluent manner within the time frame. They execute entire production process of Galvanized Malleable Cast Iron Pipe Fittings, UPVC Pipes \u0026amp; Fittings, CPVC Pipes \u0026amp; Fittings, Valves and Liquid Sealants in accordance with the industry laid parameters at the vendors end. Furthermore, they maintain close bonds to apprehend their exact demands and expectations.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are backed by a sophisticated infrastructure, which is equally divided into various segments that carry out business activities in a smooth and swift manner without any hassle. Moreover, we are equipped with advanced technology, cutting edge machinery and mechanical tools, which enable us to deliver a qualitative range of Galvanized Malleable Cast Iron Pipe Fittings, UPVC Pipes \u0026amp; Fittings, CPVC Pipes \u0026amp; Fittings, Valves and Liquid Sealants.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe are a well known firm of this domain, engaged in delivering a quality assortment of Galvanized Malleable Cast Iron Pipe Fittings, UPVC Pipes \u0026amp; Fittings, CPVC Pipes \u0026amp; Fittings, Valves and Liquid Sealants to the deemed customers. Quality being our topmost priority, for the same we undertake stringent quality measures to deliver an error free range at the patrons end. Our team of experienced professionals strictly evaluate the offered range of products as per quality parameters of the industry. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nLocated at Ahmedabad, Gujarat (India), we have a state-of-the-art infrastructure unit, which is equipped with all the high-tech machines and tools. The high production rates machine ensure smooth production of our entire manufacturing process. Our machines are frequently updated to keep in pace with latest technological advancements.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nGalvanized Cross Tee, Galvanized Side Outlet Tee, Regular Clear Solvent, UPVC Tank Adapter, Female Adapter Brass Threaded, Ball Valve, CPVC Elbow Fitting, CPVC Coupler, CPVC Reducer Bushing, Bronze Gate Valve, Supertite Liquid Sealant and many more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7583/247583v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/7583/247583v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/7583/247583v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}