{"name": "Ghostwriter North",
 "permalink": "ghostwriter-north",
 "crunchbase_url": "http://www.crunchbase.com/company/ghostwriter-north",
 "homepage_url": "http://www.ghostwriter-north.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 3,
 "founded_year": 2010,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ghostwriting, writer, ghostwriter, writing, write, edit, editor, editing, proofreader, proofread, proofreading",
 "alias_list": null,
 "email_address": "linnes10@aol.com",
 "phone_number": "(+44) (0)752 898 6476",
 "description": "Writing, editing, proofreading services",
 "created_at": "Wed Feb 20 19:22:21 UTC 2013",
 "updated_at": "Mon Feb 25 04:47:09 UTC 2013",
 "overview": "\u003Cp\u003EWe write for you, when words fail you, or there\u0026#8217;s no time to spare! \nWriting \u0026amp; ghostwriting of both fiction \u0026amp; non-fiction books, blogs, web content, business and marketing materials.\nFull proofreading \u0026amp; editing service for your writing as above, and letters, reports, theses \u0026amp; essays.\nNo job too large or small.\nHigh quality work, excellent reputation and highly reliable.\nPayment by the hour or per job.\u003C/p\u003E\n\n\u003Cp\u003ECommercial and private clients\u0026#8217; testimonials available. We can work from your notes or drafts, or from your brief.\u003C/p\u003E\n\n\u003Cp\u003EGHOSTWRITING of books:\nGhostwriting is usually done on a \u0026#8216;services for hire\u0026#8217; basis - whereby your name, all rights and royalties go to you, and I am paid a one-off fee (or in instalments). You gain all rights, credits, sales and royalty payments thereafter.\nIf it is a very interesting or commercial story likely to sell, we could make arrangements to share writing credits or royalties, although a fee payment is still required.\u003C/p\u003E\n\n\u003Cp\u003EThe cost also varies depending on the way we work. Some ways are more expensive or time-consuming than others.\nWe can either:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003Epass drafts between us by email if you\u0026#8217;d like to write your own first draft \u003C/li\u003E\n\u003Cli\u003Ework from your notes, which I can expand if you wished\u003C/li\u003E\n\u003Cli\u003Etranscribe audio tapes, if you\u0026#8217;d rather dictate\u003C/li\u003E\n\u003Cli\u003Ework via skype or telephone, and chat\u003C/li\u003E\n\u003Cli\u003Ework from diaries, journals, media extracts or other sources\u003C/li\u003E\n\u003Cli\u003Ework face to face (subject to time/ travel expenses etc.)\u003C/li\u003E\n\u003Cli\u003Ework via interview (I ask a series of questions, and you answer them)\u003C/li\u003E\n\u003Cli\u003Eor any combination of the above.\nI am entirely flexible, and would rather do a brilliant job for you in whichever way you\u0026#8217;d like, than not!\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EI will go out of my way to suit your circumstances and budget.\nI have some clients who pay me monthly, some who pay an up-front fee, and then an instalment or two. Again, happy to go with whatever arrangement suits you.\u003C/p\u003E\n\n\u003Cp\u003EDo you have a certain deadline in mind? An average book would usually take anywhere between two and six months, depending on the amount of material available and whether or not I work on it full-time. Again, I am flexible, and will always aim to meet your requirements or wishes.\u003C/p\u003E\n\n\u003Cp\u003EOnce you\u0026#8217;ve decided on how you\u0026#8217;d like to work, I can give you an accurate quotation. Or you can tell me the budget you\u0026#8217;d like it to fit into, if you prefer - and I can tell you what I can do for that sum.\nIf you have any questions, feel free to drop me an email, or give me a call. Happy to talk.\nOtherwise, let me know what you think!\u003C/p\u003E\n\n\u003Cp\u003EMany thanks for your interest!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}