{"name": "GiftConnected",
 "permalink": "giftconnect",
 "crunchbase_url": "http://www.crunchbase.com/company/giftconnect",
 "homepage_url": "http://giftconnected.com/",
 "blog_url": "http://giftconnected.com/blog",
 "blog_feed_url": "",
 "twitter_username": "giftconnected",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-commerce, social-shopping, gift-giving, gifts, wish-list, gift-recommendations, reminders",
 "alias_list": null,
 "email_address": "wally@giftconnected.com",
 "phone_number": "5406313516",
 "description": "simple social shopping tool",
 "created_at": "Sun Oct 17 01:31:26 UTC 2010",
 "updated_at": "Sat Oct 23 00:52:40 UTC 2010",
 "overview": "\u003Cp\u003EGiftConnected.com is intended to be a simple social shopping tool for managing your gift-giving plans relative to the important events of your world.\u003C/p\u003E\n\n\u003Cp\u003EFor GiftConnected.com Users\nEver forgotten a birthday, anniversary, or person on your holiday gift list?  Worse, was your forgetfulness compounded by indecision about what to get?  With GiftConnected.com you, and others through the concept of social sharing, can create event-based (e.g., birthday, holiday, etc.) lists, with the ability to organize and update items over time.  With social media at it\u0026#8217;s core, GiftConnected.com allows users to network with one another, specifically with the people that you would want to either purchase for or receive gifts from.  This will allow you to have direct access to the things they\u0026#8217;ve added to their lists.  Networking and sharing is the heart of GiftConnected.com, which also extends to Facebook.  Because events are inextricably linked to dates, our Gift Event Management feature serves as a reminder tool (i.e., provides alerts of upcoming events) for the people that are on your gift giving roster.  Find something on the web you like?  Quickly save it to one of your wishlists using the \u0026#8220;Add to GiftConnected.com\u0026#8221; browser button.  Finally, we allow users to create and join groups, ask the community, post polls and create discussions.  Combining these features provides GiftConnected.com users with a tool that will keep them aware of life\u0026#8217;s significant events and relevant gift ideas desired by the people associated with that event.\u003C/p\u003E\n\n\u003Cp\u003EFor GiftConnected.com Retailers\nRather than attempt to be a product warehouse, GiftConnected.com is a social-enabled application that allows people to create shareable lists of things that they both have and want.  This eliminates product clutter and allows us to catalog only products that really matter.  Creating and maintaining statistics for every available product is an insurmountable task, however with GiftConnected.com users can tell us, specifically, about the things that are of interest to them.  Combine this information with user-populated demographics data and GiftConnected.com becomes a multi-dimensional tool for making relevant gift recommendations.  Since GiftConnected.com is not an e-commerce site, we will provide unbiased information that will help users identify retailers that provide items of interest.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       126],
      "assets/images/resized/0010/5899/105899v2-max-150x150.png"],
     [[165,
       139],
      "assets/images/resized/0010/5899/105899v2-max-250x250.png"],
     [[165,
       139],
      "assets/images/resized/0010/5899/105899v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[79,
        150],
       "assets/images/resized/0010/5897/105897v2-max-150x150.png"],
      [[133,
        250],
       "assets/images/resized/0010/5897/105897v2-max-250x250.png"],
      [[239,
        450],
       "assets/images/resized/0010/5897/105897v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[122,
        150],
       "assets/images/resized/0010/5898/105898v2-max-150x150.png"],
      [[204,
        250],
       "assets/images/resized/0010/5898/105898v2-max-250x250.png"],
      [[368,
        450],
       "assets/images/resized/0010/5898/105898v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}