{"name": "Giriraj Industries",
 "permalink": "giriraj-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/giriraj-industries",
 "homepage_url": "http://www.indiamart.com/giriraj-industries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fixed-wheel-castor, four-wheel-castor, f-bracket",
 "alias_list": null,
 "email_address": "giriraj-industries@tradepassport.org",
 "phone_number": "9825208272",
 "description": "Manufacturing and supplying a vast array",
 "created_at": "Thu Apr 04 06:14:29 UTC 2013",
 "updated_at": "Thu Apr 04 06:14:31 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, we, “Giriraj Industries”, are an illustrious organization that is engaged in manufacturing and supplying a broad array of Industrial Castor Wheel. Our range of products encompasses Moving Four Wheel Castor, Twine Wheel Nylon Castor, Fixed Wheel Castor, Four Wheel Castor, F Bracket, SS Vacuum Bat, Fixed Castor Wheel, Fixed Castor and Double Fixed Castor Wheel. Also, we offer Fixed Wheel Castor, Moving Mini Sixer Wheel Castor, Mini Sixer Wheel Castor, Baby Sixer Wheel Castor, Sixer Wheel Castor and Moving Sixer Wheel Castor. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have established a state-of-the-art infrastructure facility at our premises for streamlined execution of the business process. Sprawling across a vast area, this facility is equipped with latest machines and advanced technology that help in judicious utilization of resources.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have recruited a competent team of professionals, which greatly supports us in all the activities of our trade. Our sincere, dedicated and hardworking professionals are masters of their respective fields of specialization. These employees put in their immense domain expertise and rich industry experience to successfully accomplish the assigned tasks. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nSince commencement, quality has been the main motto of our organization. The range offered by us is manufactured using finest quality material that is sourced from vendors of high repute after scouring the market.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric organization, we strive to maximize the contentment level of our esteemed clients in the best possible manner. For this reason, we make sure that superior quality products are offered to them at incomparable prices. All our offered products are manufactured using finest quality material so that these are in tandem with international quality standards. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n Fixed Wheel Castor, Four Wheel Castor, F Bracket, SS Vacuum Bat, Fixed Castor Wheel, Fixed Castor and Double Fixed Castor Wheel.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7571/247571v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7571/247571v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7571/247571v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}