{"name": "Giriraj Metal",
 "permalink": "giriraj-metal",
 "crunchbase_url": "http://www.crunchbase.com/company/giriraj-metal",
 "homepage_url": "http://www.indiamart.com/girirajmetal/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "modular-furniture-part, drawer-bracket-and-others--in-addition-to-this, we-also-offer-door-closer-arm, door-closer-part",
 "alias_list": null,
 "email_address": "girirajmetal@tradepassport.org",
 "phone_number": "9978880909",
 "description": "Manufacturing and supplying Modular  ",
 "created_at": "Thu Apr 04 16:13:17 UTC 2013",
 "updated_at": "Thu Apr 04 16:13:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, we, “Giriraj Metal”, have gained immense expertise in manufacturing and supplying an excellent assortment of Modular Furniture Corner Bracket, Door Closer Part, Washer and Aluminium Profile Connector. Product line that we come up with comprises Corner Bracket Part, Corner Bracket Mounting, Folding Bracket, Modular Corner Bracket, Modular Furniture Part, Drawer Bracket and others. In addition to this, we also offer Door Closer Arm, Door Closer Part, Hydraulic Door Closer Part, Wall Mount Bracket, Stainless Steel Bracket, Corner Bracket, L Bracket and others. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a team of diligent professionals recruited under us who are well versed with the industry set patterns and work as a driving force for our organization. Comprising of a qualified and enthusiastic team of professionals, we are able to accomplish all our tasks and priorities in a suitable manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality is the foremost aim that we aim to achieve in our offered range of Modular Furniture Corner Bracket, Door Closer Part, Washer and Aluminium Profile Connector. We mainly focus on the quality to fabricate our range in accordance with the industry laid parameters that ensures their error free nature. In addition to this, to meet the various demands and needs of our esteemed clients, make sure to procure qualitative range of raw material from authentic vendors of the industry. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have developed at our end a sound and spacious infrastructure unit that is outfitted with all the prerequisite technologies and machines that enables us to work in an organized manner. The entire unit is manned under the surveillance of our adroit team members who are well versed with the market trends and make sure to work as per the same. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client-oriented organization manufacturing and supplying a superior grade range of Modular Furniture Corner Bracket, Door Closer Part, Washer and Aluminium Profile Connector to the esteemed clients. Our professionals work in accordance to maintain cordial relationship with the clients and serve them in an appropriate manner with the best possible assortment. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8070/248070v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8070/248070v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8070/248070v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}