{"name": "Girnar Fabrics",
 "permalink": "girnar-fabrics",
 "crunchbase_url": "http://www.crunchbase.com/company/girnar-fabrics",
 "homepage_url": "http://www.indiamart.com/girnarfabrics/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "violet-italian-crepe-fabric, maroo-n-italian-crepe-fabric, orange-italian-crepe-fabric, window-knitted-curtain-fabric",
 "alias_list": null,
 "email_address": "girnarfabrics@tradepassport.org",
 "phone_number": "9825121951",
 "description": "manufacturer, supplier and wholesaler ,",
 "created_at": "Thu Apr 04 16:00:29 UTC 2013",
 "updated_at": "Thu Apr 04 16:00:33 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1998, we, “Girnar Fabrics”, are one of the reputed organization successfully engaged in manufacturing, supplying and wholesaling a wide range of Italian Crepe Fabric, Knitted Crush Fabric and Grey Fabric. Under this range, we Red Italian Crepe Fabric, Violet Italian Crepe Fabric, Maroon Italian Crepe Fabric, Orange Italian Crepe Fabric, Window Knitted Curtain Fabric and many more is designed and crafted using optimum-grade yarns and treads sourced from the authorized dealers of the market under the supervision of our experienced team of craftsmen and designers.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have constructed a state-of-the-art infrastructure, which aids us in handling the business related activities in an effective manner. The facility is equipped with all the essential amenities that are needed for offering a comprehensive, highly innovative and good quality Italian Crepe Fabric, Knitted Crush Fabric and Grey Fabric and is segregated into individual departments to carry out different activities in a streamlined manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIn order to carry out all our organization activities in a streamlined manner, we have hired a competent team of hard working professionals on the basis of their industrial experience and knowledge. Recruited through varied tough tests, our team consists of hardworking, sincere and dedicated team of professionals who are experts of their respective domain. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe have been able to become of the reputed organization in the market, by offering an unparalleled range of products at our clients doorstep. We considered quality as a an impeccable aspect and thus strive to manufacture a quality-approved range of products as par the quality parameters set by the industry. All the products offered by us are manufactured using optimum-grade fabrics and yarns procured from the authorized dealers of the market, in adherence with the strict quality policy set by our sincere management team in compliance with the international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EItalian Crepe Fabric:\nItalian Crepe Fabric, Knitted Crush Fabric and Grey Fabric. Under this range, we Red Italian Crepe Fabric, Violet Italian Crepe Fabric, Maroon Italian Crepe Fabric, Orange Italian Crepe Fabric, Window Knitted Curtain Fabric.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       114],
      "assets/images/resized/0024/8053/248053v2-max-150x150.jpg"],
     [[230,
       175],
      "assets/images/resized/0024/8053/248053v2-max-250x250.jpg"],
     [[230,
       175],
      "assets/images/resized/0024/8053/248053v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}