{"name": "Global Business Chamber",
 "permalink": "global-business-chamber",
 "crunchbase_url": "http://www.crunchbase.com/company/global-business-chamber",
 "homepage_url": "http://www.globalbusinesschamber.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "globalchamber",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gbo, global-business-association, international-business-organization, organization, gbchamber, business-chamber, business-partner, business-consulting, advise, advisory, association, internationalization, global-chamber, usa, europe, global-organization",
 "alias_list": null,
 "email_address": "info@globalbusinesschamber.com",
 "phone_number": "",
 "description": "International Business Organization",
 "created_at": "Tue Feb 28 01:27:54 UTC 2012",
 "updated_at": "Mon Jan 07 04:42:47 UTC 2013",
 "overview": "\u003Cp\u003EGBC is an international membership organization comprised of the world\u0026#8217;s most promising professionals, mentors, experts, inventors, investors, venture capitalists, entrepreneurs, start ups, tech and other companies, institutions, schools universities, chambers of commerce and non profit organizations, that represents and supports everybody who is interested in grow, internationalize, finance or promote their business in any markets, safeguarding the interests of the entire international business community. \u003C/p\u003E\n\n\u003Cp\u003EGBC believes that the future economic prosperity will be created by companies which international relationships and promotions are becoming an important pillar in achieving their success.\u003C/p\u003E\n\n\u003Cp\u003EThis young and progressive association is becoming very fast the largest and most influence international organization representing the interests of its members throughout the world. \u003C/p\u003E\n\n\u003Cp\u003EGBC DIRECTORY offers to all our members an access to absolutely free biggest and latest directory of the top companies and professionals from around the world that have something to do with tech companies, start ups, seed and venture capital and international business. Worldwide best resource for your international business.\u003C/p\u003E\n\n\u003Cp\u003EGBC DIRECTORY is manually created, daily updated and contains more then 3.100 of Seed Capital, Capital Angels, Venture Capital and Private Equity firms, International organizations and Institutions, Chambers of Commerce, Law Firms and Attorneys specialized in start ups,  international business and immigration, International companies, Franchisors, Start Ups, International Trade Shows and Fairs, Schools and Universities, etc.\u003C/p\u003E\n\n\u003Cp\u003EMatching services, international summits and events for start ups and investors. Our latest addition is the Directory of job offers of the best Start Ups and Tech Companies.\u003C/p\u003E\n\n\u003Cp\u003EThe company has been sold on 3rd of January, 2013.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[60,
       60],
      "assets/images/resized/0017/6063/176063v2-max-150x150.jpg"],
     [[60,
       60],
      "assets/images/resized/0017/6063/176063v2-max-250x250.jpg"],
     [[60,
       60],
      "assets/images/resized/0017/6063/176063v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}