{"name": "GlobalCompliancePanel",
 "permalink": "globalcompliancepanel",
 "crunchbase_url": "http://www.crunchbase.com/company/globalcompliancepanel",
 "homepage_url": "http://www.globalcompliancepanel.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "GCPanel",
 "category_code": "consulting",
 "number_of_employees": 100,
 "founded_year": 2009,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "risk-management, risk-assessment, management-process, risk-identification, risk-management-plan, risk-manager, risk-management-strategies, quality-guidelines, pharmaceutical-technology-europe, fda-inspections, regulatory-environment, pharmaceutical-manufa",
 "alias_list": null,
 "email_address": "webinars@globalcompliancepanel.com",
 "phone_number": "800-447-9407 ",
 "description": "Corporate Compliance Training",
 "created_at": "Mon Sep 13 05:25:40 UTC 2010",
 "updated_at": "Mon Sep 13 23:29:24 UTC 2010",
 "overview": "\u003Cp\u003EGlobalCompliancePanel is an online training gateway delivering high quality regulatory \u0026amp; compliance trainings in a simple, cost effective and in a user friendly format.\u003C/p\u003E\n\n\u003Cp\u003EGlobalCompliancePanel offers a broad range of channels for broadcasting and exchange of information through web based training, web alerts \u0026amp; discussion forums.\u003C/p\u003E\n\n\u003Cp\u003EGlobalCompliancePanel imparts knowledge of best practices in industry to guarantee effective implementation of compliance programs for meeting regulatory demands. The key focus of GlobalCompliancePanel is to provide extensive and quality training for risk management, regulatory compliances, corporate governance and quality management. Apart from providing excellent training to compliance professionals by compliance \u0026amp; consulting experts, GlobalCompliancePanel would also focus on providing:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Information to ensure compliance and enhance quality with regulations for individuals as well as the organizations\n* Latest updates on industry trends, industry best practices and any modifications in the regulatory affairs\n* One stop destination for all your queries and to share and discuss issues, ideas and best practices and\n* A resource on the data sheets, whitepapers, articles, books on industry standards, training kits, software tools, insights, press releases, etc on governance, regulatory, compliances and quality management across different industries.\n\u003C/code\u003E\u003C/pre\u003E",
 "image":
  {"available_sizes":
    [[[150,
       44],
      "assets/images/resized/0010/1466/101466v2-max-150x150.jpg"],
     [[250,
       74],
      "assets/images/resized/0010/1466/101466v2-max-250x250.jpg"],
     [[280,
       83],
      "assets/images/resized/0010/1466/101466v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}