{"name": "Global Forestry Investments",
 "permalink": "global-forestry-investments",
 "crunchbase_url": "http://www.crunchbase.com/company/global-forestry-investments",
 "homepage_url": "http://www.globalforestryinvestments.com",
 "blog_url": "http://global-forestryinvestments.com",
 "blog_feed_url": "",
 "twitter_username": "globalforestry",
 "category_code": "other",
 "number_of_employees": 18,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "global-forestry-investments, gfi, teak-trees, brazil, ethical-investments",
 "alias_list": null,
 "email_address": "globalforestryinvestments1@yahoo.com",
 "phone_number": "02077540493",
 "description": "Global Forestry Investments (GFI)",
 "created_at": "Mon Jun 25 07:13:06 UTC 2012",
 "updated_at": "Sun Mar 17 09:24:02 UTC 2013",
 "overview": "\u003Cp\u003EGlobal Forestry Investments\u003C/p\u003E\n\n\u003Cp\u003EGlobal Forestry Investments (GFI) is a company that is doing its part in the fight against climate change by offering ethical investments that are extremely competitive in the marketplace and are proven to have positive risk/return characteristics. By working with the local government of Paragominas, Brazil, the UK based company offers investments in Brazil\u0026#8217;s forestry, which has been consistent in its high performance over a period of the past 100 years. It\u0026#8217;s a win-win situation that ultimately builds and strengthens the local community and its infrastructure while providing consistent profits for the investor. The investment in Brazil\u0026#8217;s forestry helps to support the regeneration of rainforests that are deforested as well as establishing a higher degree of stability for the local communities.\u003C/p\u003E\n\n\u003Cp\u003EInvestment in Brazil\u0026#8217;s Economy\u003C/p\u003E\n\n\u003Cp\u003EThere are a number of factors that went into Global Forestry Investments\u0026#8217; choice to invest in Brazil. Brazil is home to one of the largest of the world\u0026#8217;s economies and has been a major attraction to foreign investors. The political system is stable, the number of those unemployed is dropping, the currency is strong and inflation is low.\u003C/p\u003E\n\n\u003Cp\u003EAddressing Climate Change and Carbon Offsetting with Trees\u003C/p\u003E\n\n\u003Cp\u003EThe continual increase in greenhouse gases due to climate change affects the amount of carbon dioxide present in the environment. GFI understands that investment in land that has been deforested and planted with living trees helps the process of carbon offsetting by absorbing carbon dioxide that is within the surrounding atmosphere. In this way, the investment helps to reduce the amount of carbon dioxide and other greenhouses gases.\u003C/p\u003E\n\n\u003Cp\u003ETeak Trees as an Investment\u003C/p\u003E\n\n\u003Cp\u003EThrough Global Forestry Investments, investors can buy plots in Brazil that have been planted with well-established teak trees on land that was previously deforested in the Brazilian tropics. After allowing the trees to grow for some twenty-five years, they can be harvested and sold for a generous profit. During that time, the land can be leased out to local companies that will carry out maintenance and oversee the growing process. At different stages of maturity, the trees are thinned to leave room for the more mature trees, which is a process that generates additional income for the plot owner.\u003C/p\u003E\n\n\u003Cp\u003EImproving Living Conditions for Local Residents in Brazil\u003C/p\u003E\n\n\u003Cp\u003EBy investing in Brazil\u0026#8217;s forests, Global Forestry Investments has the opportunity to create jobs for the local residents of Para, which improves their standard of living.  Another plan that has not yet been implemented is to build a Performing Arts and Sports Academy. Known as “Sky\u0026#8217;s the Limit”, it will extend the children\u0026#8217;s education into the arena of the arts and sports.\u003C/p\u003E\n\n\u003Cp\u003EStocks vs. Timber\nThe global economic atmosphere has given rise to international insecurity in financial affairs. Individuals and companies crave the stability of time-tested investment opportunities while observing ethical and social responsibility. The volatility of the stock market, particularly in recent times, cannot compete with the stability timber investments provide. Simply put, timber has consistently outperformed every major equity. The continuous population expansion throughout the world creates consistent demand for timber. Investing in this sector with a reputable company such as Global Forestry Investments awards the investor with relative certainty of return. This is due to the fact that demand exceeds supply and has done so for many years. Investing in timber provides a level of security and the opportunity for investors to contribute positively to the ecology of the country invested in. \u003C/p\u003E\n\n\u003Cp\u003EGlobal Forestry Investments Links:\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.global-forestryinvestments.co.uk\nhttps://twitter.com/GlobalForestry\nhttp://www.visualcv.com/globalforestryinvestments\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       108],
      "assets/images/resized/0019/7083/197083v2-max-150x150.jpg"],
     [[250,
       180],
      "assets/images/resized/0019/7083/197083v2-max-250x250.jpg"],
     [[450,
       324],
      "assets/images/resized/0019/7083/197083v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Omari",
      "last_name": "Bowers",
      "permalink": "omari-bowers-2",
      "image": null}},
   {"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Andrew",
      "last_name": "Skeene",
      "permalink": "andrew-skeene-2",
      "image":
       {"available_sizes":
         [[[100,
            100],
           "assets/images/resized/0019/8931/198931v3-max-150x150.jpg"],
          [[100,
            100],
           "assets/images/resized/0019/8931/198931v3-max-250x250.jpg"],
          [[100,
            100],
           "assets/images/resized/0019/8931/198931v3-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "London Office",
    "address1": "",
    "address2": "",
    "zip_code": "EC4N 7AE",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.global-forestryinvestments.co.uk",
    "title": "Global Forestry Investments"},
   {"external_url": "http://blogs.forbes.com/people/globalforestryinvestments2/",
    "title": "Global Forestry Investments on Forbes"}]}