{"name": "Global Infosoft Solutions",
 "permalink": "global-infosoft-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/global-infosoft-solutions",
 "homepage_url": "http://www.globalinfosoftsolutions.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 9,
 "founded_year": 2006,
 "founded_month": 1,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "software development company",
 "created_at": "Fri Feb 12 05:22:05 UTC 2010",
 "updated_at": "Fri Jun 22 20:21:35 UTC 2012",
 "overview": "\u003Cp\u003EGlobal Infosoft Solutions - software development company established in the year 2006.Our core competencies are PHP, MySql, OsCommerce, Joomla, WordPress, ZenCart in the web designing and development.\u003C/p\u003E\n\n\u003Cp\u003EThe professionals at GIS are skilled and will help to build a competitive solution from the client\u0026#8217;s perspective.\u003C/p\u003E\n\n\u003Cp\u003EWe have expert resources in the following areas,\u003C/p\u003E\n\n\u003Cp\u003EPHP: We have trained and certified PHP developers. They have handled all kinds of PHP related coding, Bug Fixing, and have innovative ideas on bringing the logical outputs required for the critical project.\u003C/p\u003E\n\n\u003Cp\u003EMySql: Our Certified MySql database developers and administrators have brought in many normalized databases with minimal time periods for many projects involving PHP and MySql.\u003C/p\u003E\n\n\u003Cp\u003EOpen Source Products: GIS has experienced people in handling the open source products such OsCommerce, Drupal, WordPress, Joomla and Zencart. Have accomplished many customization and the work done by them so far had been organized in the portfolio section of the profile. The clients can have a look at the portfolio items for a detailed study on the products customized by our GIS consultants.\u003C/p\u003E\n\n\u003Cp\u003EPhotoshop: We have an innovative team of web designing who can bring out an excellent design items with the help of the Photoshop Software tool. All GIS Web Designers are certified professionals.\u003C/p\u003E\n\n\u003Cp\u003ELogo Designing: GIS have skilled persons in bringing out a good logo, based on the clients requirement and thoughts. We promise a delivery of the product with client\u0026#8217;s full satisfaction o the logo.\u003C/p\u003E\n\n\u003Cp\u003EMS Office experts: All Our GIS employees are experienced in handling the MS office based projects. We deal in both the versions (2003 and 2007) of MS Office packages and the details of the individual services provided are as follows,\u003C/p\u003E\n\n\u003Cp\u003EMS Office Excel\nMS Office Word\nMS Office Access\nMS Office Powerpoint\nMS Office Visio\u003C/p\u003E\n\n\u003Cp\u003EGIS helps in managing your project from concept to completion with a proper communication and adhering to the Project scope, Time and Budget. We deliver a quality product fulfilling the client\u0026#8217;s expectation.\u003C/p\u003E\n\n\u003Cp\u003EGIS professionals are available round the clock to meet the clients and gather requirements. Our professionals make a thorough analysis on the requirements and carry on with the development work.\u003C/p\u003E\n\n\u003Cp\u003EAll projects will have a design documents on how the requirements are to be carried forward.\u003C/p\u003E\n\n\u003Cp\u003EWe follow a strict time sheet, to track the work done for a project, on a daily basis. We submit the timesheets to the clients for all the projects, based on their requests.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[112,
       102],
      "assets/images/resized/0007/6852/76852v2-max-150x150.png"],
     [[112,
       102],
      "assets/images/resized/0007/6852/76852v2-max-250x250.png"],
     [[112,
       102],
      "assets/images/resized/0007/6852/76852v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Global Infosoft Solutions",
    "address1": "No 62/2, 2nd Floor,adjacent to murugan idly kadai",
    "address2": " Purasaiwakam High Road",
    "zip_code": "600084",
    "city": "Chennai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        114],
       "assets/images/resized/0007/7020/77020v2-max-150x150.jpg"],
      [[250,
        191],
       "assets/images/resized/0007/7020/77020v2-max-250x250.jpg"],
      [[439,
        336],
       "assets/images/resized/0007/7020/77020v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}