{"name": "Globe Icons Interactive",
 "permalink": "globe-icons-interactive",
 "crunchbase_url": "http://www.crunchbase.com/company/globe-icons-interactive",
 "homepage_url": "http://www.globeicons.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "globe_icons",
 "category_code": "advertising",
 "number_of_employees": 3,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "advertising, marketing, strategy, campaign, startup, creative, medium, coffee, brand-marketing, brand-advertising",
 "alias_list": null,
 "email_address": "ronaldsimons@globeicons.com",
 "phone_number": "267-357-3856",
 "description": "Interactive Advertising Mobile Marketing",
 "created_at": "Wed Dec 07 18:51:44 UTC 2011",
 "updated_at": "Sun Mar 31 14:56:09 UTC 2013",
 "overview": "\u003Cp\u003EGlobe Icons Interactive is a full service new media interactive advertising agency that specializes in sales of advertising space on coffee cups to B2B and B2C for Brand Advertisers, Brand Marketers, Media Buyers, Manufacturers and Service providers. Our coffee cup ad space is acquired through our corporate barter exchange with retail coffee manufacturers, coffee retailers and coffee roasters throughout the USA. For your convenience and immediate attention contact Globe Icons Interactive today at 267-357-3856\u003C/p\u003E\n\n\u003Cp\u003EWe currently offer a few simple yet astoundingly innovative advertising packages to choose from\nCoffee cup ads by brand advertisers, brand marketers and media buyers will be distributed to the public consumer audience your manufacturer or service provider needs to target and reach through coffee shops, coffee houses, retail stores, convenience stores, gas stations, coffee kiosks, delis, bagel shops, bakeries and many food and beverage venues. Coffee cup advertising space provides the perfect communications medium for your advertiser to convey its message to a target consumer audience, receive a maximum return on investment (ROI) and pinnacle brand exposure to your target consumer audiences eye throughout 37 minutes of average coffee consumption time. This also provides an exponential benefit known as the Dovetail Effect. Whereas the coffee cup will also be viewed by an average of six other people where the consumer will travel with the cup during consumption.\u003C/p\u003E\n\n\u003Cp\u003EWe Put Your Brand In Their Hand And Social Media Word Of Mouth Directly On Their Lips! We Then Guide Your Customer Directly To Your Site!\nGlobe Icons Interactive can place an ad with your company message, logo or brand on coffee cups with a FREE QR code that can be distributed to coffee shops, coffee houses, retail stores, convenience stores, gas stations, coffee kiosks, delis, bagel shops, bakeries and many food and beverage venues within the geographic location of your choice to advertise in. Each client will receive a FREE QR code that will be placed on the coffee cup with their company logo. Customers can also scan the QR codes and will be routed directly to our client’s website via the use of their cellular phone. Globe Icons Interactive will also create the link to your company website or social media website FREE of charge.\u003C/p\u003E\n\n\u003Cp\u003ECoffee cup advertising with interactive mobile marketing, bar code coupons, links to your business website and/or social media page\u003C/p\u003E\n\n\u003Cp\u003EGlobe Icons Interactive can also place call to action CTA ads on coffee cups that will allow your target audience to interact with your brand advertisement by sending a text message with their mobile phone to receive a mobile marketing text message coupon. They can also scan the FREE QR code that will guide the consumers mobile device directly to your website for redemption or more information about the product and/or redeem the coupon at the point of sale (POS) in person. The QR Code can also be configured to guide consumers mobile devices to your social media sites for further brand marketing engagement, exposure and other special offers you may offer. The coffee cups with your advertisement will be distributed through coffee shops, coffee houses, retail stores, convenience stores, gas stations, coffee kiosks, delis, bagel shops, bakeries and many food and beverage venues within the geographic location, region or zip codes of your choice. Our more complex coffee cup marketing and advertising packages offer a full spectrum of marketing analytics for your maximum ROI.\u003C/p\u003E\n\n\u003Cp\u003EAdvantages over traditional media\nCoffee cups are a blank canvas, a mobile billboard, a coffee cup can provide your business with a one-on-one interaction with a potential customer, help your business achieve brand recognition; reduce your businesses advertising expenses, increase revenue and overall profits. Coffee Cup Advertising offers many other advantages over other traditional and nontraditional forms of advertising.\u003C/p\u003E\n\n\u003Cp\u003ECost\nThe cost of advertising on coffee cups are considerably less than most other forms of advertising. At about ten cents ($0.10) US per ad, which is less than the cost paid for most outdoor, indoor, digital, PPC, CPM, newspaper, magazine or any other advertising medium.\u003C/p\u003E\n\n\u003Cp\u003ETarget\nAdvertising on coffee cups allow you to target your advertising audience within a very specific geographical location. Other traditional forms of advertising, such as television commercials and newspaper ads do not take into consideration the fact that your target customers may be limited to specific neighborhoods.\u003C/p\u003E\n\n\u003Cp\u003EExposure\nPlacing your company advertisement on a coffee cup guarantees that your ad, message, brand or logo will be viewed by the consumer who is a potential customer. Each consumer will spend approximately 37 minutes with a coffee cup during consumption time and will encounter an average of six other potential customers while drinking the cup of coffee this is known as the Dovetail Effect. Your customers will view your ad, message, brand or logo! Your advertising dollars do not get wasted.\u003C/p\u003E\n\n\u003Cp\u003EReturn on investment (ROI)\nOur innovative two way balanced inbound marketing analytic strategy and new media outbound coffee cup advertising medium earns your customer\u0026#8217;s interest instead of buying it. This allows serious customers to come to you, rather than an intrusive outbound advertising approach driving your valuable consumers away. Our Coffee Cup Advertising marketing strategy works in tandem with your print, indoor and outdoor, social media and internet advertising for an exponential synergy of added value to maximize what matters most your return on investment (ROI).\u003C/p\u003E\n\n\u003Cp\u003ECorporate barter advertising exchange\nGlobe Icons Interactive Advertising Agency offers virtually free cups to coffee roasters, coffee manufacturers and coffee suppliers. We acquire coffee cup advertising space through corporate barter exchange solutions offered to coffee roasters, coffee manufacturers, coffee distributors and other food and beverage vendors of Hot and Cold beverage cups. We sell advertising space on your byproduct\u0026#8217;s, branded or unbranded coffee cups to 3rd party manufacturers and service providers who need to advertise. The sale of the ad space we sell pays for the coffee or beverage cup you distribute making the cost of the cup virtually free. For your convenience and immediate attention contact Globe Icons Interactive today at 267-357-3856\u003C/p\u003E\n\n\u003Cp\u003EThe Globe Icons Interactive Advantage\nWe offer innovative futuristic advertising solutions. Each year advertisers lose millions of dollars due to lack in-ability to effectively measure their promotional ad campaign progress. Globe Icons Interactive provides an advertising solution to effectively and efficiently analyze marketing data for monetization. This allows you to track the progress of your promotional ad campaign, and make adjustments to your ad campaign to demographically, psychographically target and focus on what matters most; following up on leads generated and increasing sales performance by expanding your reach through access to a new customer base.\u003C/p\u003E\n\n\u003Cp\u003ECorporate barter exchange Solutions\nWe acquire ad space through corporate barter on coffee cups distributed by branded coffee roasters, coffee manufacturers, food and beverage distributors and vendors in trade for virtually free coffee cups to distribute with the purchase of coffee from their in store coffee service vendors.\u003C/p\u003E\n\n\u003Cp\u003ECurrent available coffee cup advertising space\nWe are currently offering available OOH Ad space on 25 Million coffee cups distributed by a North East Regional Coffee Distributor. The cups are distributed to retail vendors and sold with coffee by the cup in Gas Stations, Coffee Kiosks and Cafe\u0026#8217;s in MA, NY, NJ, PA, DE, MD and VA under annual terms.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0016/5610/165610v8-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0016/5610/165610v8-max-250x250.jpg"],
     [[400,
       400],
      "assets/images/resized/0016/5610/165610v8-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder \u0026 CEO",
    "person":
     {"first_name": "Ronald",
      "last_name": "Simons",
      "permalink": "ronald-simons",
      "image":
       {"available_sizes":
         [[[54,
            150],
           "assets/images/resized/0016/5598/165598v2-max-150x150.jpg"],
          [[90,
            250],
           "assets/images/resized/0016/5598/165598v2-max-250x250.jpg"],
          [[163,
            450],
           "assets/images/resized/0016/5598/165598v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "IP and Patent Officer",
    "person":
     {"first_name": "Scott",
      "last_name": "Scioli",
      "permalink": "scott-scioli",
      "image": null}},
   {"is_past": false,
    "title": "General Counsel",
    "person":
     {"first_name": "Ted",
      "last_name": "Costa Esq.",
      "permalink": "ted-costa-esq",
      "image": null}},
   {"is_past": false,
    "title": "Office Manager",
    "person":
     {"first_name": "Michelle",
      "last_name": "Simons",
      "permalink": "michelle-simons",
      "image": null}},
   {"is_past": true,
    "title": "",
    "person":
     {"first_name": "Michell",
      "last_name": "Simons",
      "permalink": "michell-simons",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$60k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "http://angllist.co",
    "source_description": "Angel List",
    "raised_amount": 60000.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 3,
    "funded_day": 23,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}