{"name": "Glorious Himalaya Trekking (P.) Ltd.",
 "permalink": "glorious-himalaya-trekking-p-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/glorious-himalaya-trekking-p-ltd",
 "homepage_url": "http://www.holidays-adventure.com",
 "blog_url": "http://www.holidays-adventure.com",
 "blog_feed_url": "http://www.holidays-adventure.com",
 "twitter_username": "tournepal",
 "category_code": "advertising",
 "number_of_employees": 4,
 "founded_year": 2011,
 "founded_month": 5,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "holidays-adventure-in-nepal, hiking, trekking, tour-operator-agency-in-nepal-",
 "alias_list": null,
 "email_address": "info@holidays-adventure.com",
 "phone_number": "0097714365453",
 "description": "Namaste, We holidays-adventure team ",
 "created_at": "Sun Jun 02 13:27:51 UTC 2013",
 "updated_at": "Mon Jun 03 14:34:51 UTC 2013",
 "overview": "\u003Cp\u003ENamaste, We holidays-adventure team heartily welcome to you in Himalaya Kingdom country of Nepal! We offer the best Trekking, Hiking, Mountaineering and lot of Adventure Activities  in Nepal. Holidays adventure is dependable Nepal trekking and Tibet Tour operator Agency by well experience as well as  professional working team. Our team members are familiar with the culture of Nepal and respect for our holy mountain in Nepal.  we take satisfaction responsibility to protect our nature, culture heritage, life of people. We are leading team of the country to provide full satisfaction to the adventure travelers. We provide to our clients best care for every once, as well as ensure proper elevation acclimatization and provisions for carefully prepared food in camping site. Our smiling porter’s talented support crews, professional trekking guide and reliable tour operator ensure that your each experience with us, that yours every need is catered to \u0026amp; fine your own tempo, either in group or alone, the amazing thing in Himalaya. Such like your trekking interest welcome to Nepal we can help you, have a time of yours life for trekking in Nepal?  Look at our featured treks \u0026amp; preparing to go trekking, vision normally asked questions or make an inquiry. Decide  treks like; Everest Base Camp Trek, Annapurna base Camp Trek, Langtang Gosainkund Trek, Dolpo Trekking, Manaslu Trekking, Makalu Trekking or less popular trekking options including Mustang or Kanchenjunga Base Camp. From short, easy treks to month long expeditions, from tea-house trekking to camping, Nepal has it all. Then, what are you waiting for? Take a break and be part of adventure. We welcome you to such interested individual or group and we proud to be at your service \u0026amp; look forward to gathering you.  page contents\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}