{"name": "Go Speak English Ltd",
 "permalink": "go-speak-english-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/go-speak-english-ltd",
 "homepage_url": "http://gospeakenglish.com/",
 "blog_url": "http://www.gospeakenglish.com/en/blog",
 "blog_feed_url": "",
 "twitter_username": "GoSpeakEnglish",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "english, english-language, english-teachers, english-language-exchange, english-conversation, business-english, english-online, english-lessons-via-skype, interpreters, translators, students, language-schools, english-networking, sign-language, asl, bsl, ",
 "alias_list": null,
 "email_address": "info@gospeakenglish.com",
 "phone_number": "",
 "description": "English Language Networking website",
 "created_at": "Tue Jan 29 14:30:15 UTC 2013",
 "updated_at": "Fri Feb 01 17:00:09 UTC 2013",
 "overview": "\u003Cp\u003EThe Go Speak English website helps students, companies, teachers, interpreters, translators, and language schools to connect with each other.\u003C/p\u003E\n\n\u003Cp\u003EMany people all over the world speak some English, however, the English language is spoken in many different countries and cities, with many different accents. \nThis makes the understanding of different accents difficult for all of us; even for native speakers of English! \u003C/p\u003E\n\n\u003Cp\u003EGo Speak English offers the possibility for you to find exactly the type of language professional for your requirements, either locally in your own city, or anywhere in the world, 24/7 (24 hours a day, 7 days a week).\u003C/p\u003E\n\n\u003Cp\u003EOn the website you can\u0026#8230; \u003C/p\u003E\n\n\u003Cp\u003ESearch for teachers with the characteristics which you are looking for, including: \u003C/p\u003E\n\n\u003Cp\u003EAccent – for example: British, American, Canadian, South African, Australian, or New Zealand. \u003C/p\u003E\n\n\u003Cp\u003EAge – you can decide to learn and practise English with a teacher in your age range. \u003C/p\u003E\n\n\u003Cp\u003EGender – you can choose to have English lessons with a male or female teacher.\u003C/p\u003E\n\n\u003Cp\u003ETeaching qualification – you can search for a teacher who has a professional teaching qualification. \u003C/p\u003E\n\n\u003Cp\u003ELocation – you can study face to face with a teacher in the town or city where you study, work, or live. \u003C/p\u003E\n\n\u003Cp\u003ETime zone – you can choose a teacher in a different time zone so you can have lessons online via Skype at any time of day or night. \u003C/p\u003E\n\n\u003Cp\u003ESign Language – you can study either online via Skype using video and written chat text or in the town or city which is most convenient for you. \u003C/p\u003E\n\n\u003Cp\u003ESearch for Language Schools either online or in the town or city where you study, work, or live. \u003C/p\u003E\n\n\u003Cp\u003ESearch for Interpreters of any language to English, in the town or city where you require an interpreting service. \u003C/p\u003E\n\n\u003Cp\u003ESearch for Translators to translate documents or books from any language to English, either online via email or in the town or city where you study, work, or live. \u003C/p\u003E\n\n\u003Cp\u003ESearch for Students (people who want to learn or practise English) or Clients and Companies who require language services including English lessons and courses, interpreting or translation services.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       64],
      "assets/images/resized/0023/2347/232347v2-max-150x150.jpg"],
     [[250,
       106],
      "assets/images/resized/0023/2347/232347v2-max-250x250.jpg"],
     [[450,
       192],
      "assets/images/resized/0023/2347/232347v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Steven",
      "last_name": "Walthew",
      "permalink": "steven-walthew",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "World Headquarters",
    "address1": "Penhurst House",
    "address2": "352-356 Battersea Park Road, Suite 11",
    "zip_code": "SW11 3BY ",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}