{"name": "GoldCoinGain",
 "permalink": "goldcoingain",
 "crunchbase_url": "http://www.crunchbase.com/company/goldcoingain",
 "homepage_url": "http://www.goldcoinsgain.com/",
 "blog_url": "http://goldcoinsgain.wordpress.com/",
 "blog_feed_url": "http://feeds.feedburner.com/GoldCoinsBlog",
 "twitter_username": "GoldCoinsGain",
 "category_code": "consulting",
 "number_of_employees": 50,
 "founded_year": 1990,
 "founded_month": 2,
 "founded_day": 20,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gold-coins, gold-bullion, gold-bullion-coins, buy-gold-coins, buy-gold-bullion, gold-coin, gold-ira, gold-american-eagle, gold-maple-leaf, gold-buffalo, gold-401k",
 "alias_list": null,
 "email_address": "",
 "phone_number": "3105569667",
 "description": "an aurum Advisor website",
 "created_at": "Wed Jul 29 16:01:01 UTC 2009",
 "updated_at": "Tue Feb 02 22:41:17 UTC 2010",
 "overview": "\u003Cp\u003EOUR CLIENTS\u003C/p\u003E\n\n\u003Cp\u003EOur clients are comprised of individuals, families, and institutional investors interested in preserving wealth and adding growth to their existing portfolio.  Here at Aurum Advisors we understand the importance of providing protection to one\u0026#8217;s assets, especially in such an uncertain world.  From the latest stock market fiasco to tension in the Middle East to currency problems, our advisors know the role precious metals should play in any investor\u0026#8217;s portfolio.  From the beginner investment to complex family trusts, we know which metal and which amount will allow you to use the world\u0026#8217;s ultimate form of wealth to preserve and grow your assets for generations to come.\u003C/p\u003E\n\n\u003Cp\u003EOUR PERFORMANCE\u003C/p\u003E\n\n\u003Cp\u003EAurum Advisors lets gold\u0026#8217;s 5,000 year old track record speak for itself.  From the pharaohs in Egypt, gold has had value and performed well for investors throughout the rise and fall of every civilization known since the beginning of recorded time and will continue to perform well for investors for centuries to come.\u003C/p\u003E\n\n\u003Cp\u003EOver the last 10 years gold has outperformed virtually every other investment out there.  From stocks to bonds to real estate, there has not been any other investment that not only provides an above average return but also the feeling of security associated with just leaving your money in a savings account.\u003C/p\u003E\n\n\u003Cp\u003EOUR TRACK RECORD\u003C/p\u003E\n\n\u003Cp\u003EAurum Advisors has an unrivaled track record that you can count on.  We know how to deliver precious metals in the safest most reliable and affordable manner possible.  Weather you are local or anywhere nationwide Aurum Advisors can provide gold right to your doorstep.  Its service you can rely on and an asset you can trust.  So pick up the phone and give one of our advisors a call today.  The experience is world class and world known.  See for yourself!\u003C/p\u003E\n\n\u003Cp\u003EOUR PEOPLE\u003C/p\u003E\n\n\u003Cp\u003EEach of our employees goes through a rigorous screening process before becoming a member of the team.  From financial consultants to analysts to senior management, each and every member that encompasses a part of the team has as a part of their character one of the most important aspects of our firm - excellence.\u003C/p\u003E\n\n\u003Cp\u003ENot only does Aurum Advisors pick the best of the best to work with, we also provide a strenuous standard of performance each and every one of our employees must meet on a monthly basis.  There is an acceptable small margin of error in terms of performance to ensure each and every member is functioning at their absolute highest level at all times.\u003C/p\u003E\n\n\u003Cp\u003EBack up systems are in place to serve as \u0026#8220;safety nets\u0026#8221; insuring clients always get their metal, they always receive a call the moment a significant market move occurs, and when you are ready to sell, we are able to get you out at the optimal time for the absolute highest liquidation price of the day, whatever the market is willing to pay.\u003C/p\u003E\n\n\u003Cp\u003EOUR LOCATIONS\u003C/p\u003E\n\n\u003Cp\u003EBecause of the physical nature of gold, the world\u0026#8217;s largest firms buy and sell gold out of one respective location.\u003C/p\u003E\n\n\u003Cp\u003EOur corporate headquarters are located in Century City, California\u0026#8217;s financial district.  Aurum Advisors\u0026#8217; location was established with California\u0026#8217;s long love and history for gold dating back to the days of Sutters Mill and the advent of the Forty-Niners.  California\u0026#8217;s long legacy of gold history served as an optimal destination for our corporate headquarters and will serve us well for decades to come.  Do you remember a time where people did not associate this precious commodity with the \u0026#8220;Golden State\u0026#8221;?  We don\u0026#8217;t either.\u003C/p\u003E\n\n\u003Cp\u003ESo give us a call today!  We can ensure your experience will be golden.\u003C/p\u003E\n\n\u003Cp\u003ECOMPLAINT HISTORY\u003C/p\u003E\n\n\u003Cp\u003EAurum Advisors has been serving the public for about a decade.  With that in mind please remain calm while we reveal the extensive nature of our complaint history.  We have had a total of 3 complains filed against us with the Better Business Bureau and because of that we have received an \u0026#8220;A\u0026#8221; rating with the Better Business Bureau.  All three complaints have been satisfied.  Thats quite a track record considering the almost 25,000 clients that have been happy with the results we have provided throughout the years. \u003C/p\u003E\n\n\u003Cp\u003EAurum Advisors has never had a single government action taken against us and the truth of any of our companies advertising practices has ever been in question.\u003C/p\u003E\n\n\u003Cp\u003EHere at Aurum Advisors we strive to insure your experience with us is monumental.  We know there are a lot of other places out there that can give you a precious metal experience but like most of our clients would agree the experience you will have with us will excede your expectations.\u003C/p\u003E\n\n\u003Cp\u003EWe look forward to hearing your feedback.\u003C/p\u003E\n\n\u003Cp\u003EEXIT STRATEGY\u003C/p\u003E\n\n\u003Cp\u003EHere at Aurum Advisors we believe it is prudent to have a portion of your portfolio in precious metals at all times.  During our current economic environment most investors decide for themselves to protect and hedge there real estate and paper assets by placing a larger percentage of gold and silver in their portfolio than during normal periods of sustained economic growth.\u003C/p\u003E\n\n\u003Cp\u003ENow, for the first time since the days of the civil war, our country is facing more threats politically. socially, educationally, and of course economically than ever before.  The wise investor factors these threats into his life strategy as well as his or hers financial strategy.\u003C/p\u003E\n\n\u003Cp\u003EBecause of the liquid nature of precious metals, investors are able to convert as much gold and silver as they see fit back over into cash with a simple phone call.  With the integrated nature of the internet and technology it is easier now than ever before to get out of a precious metal position on a moments notice if you need to.  But at the same time more and more investors are realizing the importance of storing their wealth is such a stable and profitable vehicle.  A lot has changed since the days of the spaghetti westerns.  You no longer have to find a buyer for your gold or threaten the local banker with your six shooter in order to convert your metal back into cash.  Just give Aurum Advisors a call today and we can lock in a guarenteed liquidation price at the highest bid of the day no fees to sell no questions asked.\u003C/p\u003E\n\n\u003Cp\u003EWHO WE ARE\u003C/p\u003E\n\n\u003Cp\u003EWe are a hand selected team of the world\u0026#8217;s finest precious metal asset managers.\u003C/p\u003E\n\n\u003Cp\u003EOur backgrounds include a wide array of diverse experience that we bring together in order to insure a unique approach destined to exceed each individual clients needs and expectations.\u003C/p\u003E\n\n\u003Cp\u003EHere at Aurum Advisors our asset managers have a strong financial background and are well versed in the ways of the world.  Extensive travel, experience, higher education, and a strong social network are all aspects that make up a part of each individuals place in the world.\u003C/p\u003E\n\n\u003Cp\u003EWHO WE ARE NOT\u003C/p\u003E\n\n\u003Cp\u003EAurum Advisors are not financial planners.  We do not assist investors in the purchasing of securities or facilitate investment advice.\u003C/p\u003E\n\n\u003Cp\u003EWhat we can do is assist investors that have made the decision to buy gold in the most appropriate manner possible.\u003C/p\u003E\n\n\u003Cp\u003EFrom getting you into precious metals at the right time, to getting you into the right coins or bars, to keeping you updated on the market conditions that may impact your precious metal\u0026#8217;s portfolios overall value, to assisting you with your exit strategy an Aurum Advisor becomes a valuable part of your building and preserving wealth process.\u003C/p\u003E\n\n\u003Cp\u003EWHAT TO EXPECT\u003C/p\u003E\n\n\u003Cp\u003EExpect what you know you can count on.  In todays world of unmatched stock expectation/performance issues to unpredictable rising cost of living certainty, to inflationary pressures that show no sign of slowing soon, here at Aurum Advisors we can guarentee several things.  First and foremost, we can guarentee gold will provide a valuable part of any investor\u0026#8217;s investment strategy. \u003C/p\u003E\n\n\u003Cp\u003ESecond, we can guarentee you will get gold in your protection.  This associates all of the concerns associated with \u0026#8220;storing\u0026#8221; your metal in another company\u0026#8217;s \u0026#8220;vaults\u0026#8221; or \u0026#8220;online\u0026#8221;?  However that, in theory, is done.  Knowing you have something you can count on in your possession in such an uncertain world is a great feeling especially in today\u0026#8217;s economic climate.\u003C/p\u003E\n\n\u003Cp\u003EThird, we have all gold coins you receive guaranteed and authorized by a third party grading service.  This does two things.\u003C/p\u003E\n\n\u003Cp\u003ENumber one, it gives you the peace of mind associated with knowing you are receiving is gold worth receiving.  Two, it gives you the peace of mind associated with knowing the firm you are using can be trusted because we never ask you with a wink just to trust us.  We never ask you to do that during any part of the process.  Your experience with Aurum Advisors should fall nothing short of exceptional all the time.\u003C/p\u003E\n\n\u003Cp\u003EWHAT NOT TO EXPECT\u003C/p\u003E\n\n\u003Cp\u003EYou should not for any reason expect gold to be your portfolio\u0026#8217;s or life\u0026#8217;s miracle cure.  Even though gold can eliminate many valid concerns facing our world today, it can not be perceived as \u0026#8220;the end all be all\u0026#8221; solution that satisfies all of  life\u0026#8217;s problems.\u003C/p\u003E\n\n\u003Cp\u003EWHO IS GOLD RIGHT FOR?\u003C/p\u003E\n\n\u003Cp\u003EGold is right for any individual, family, or institution concerned with the very real threats facing the world today.\u003C/p\u003E\n\n\u003Cp\u003EIf you are tired of trying to figure out who to trust, if you are tired of trying to figure out what voice to listen to for guidance, if you are tired of trying to be in the right place at the right time, what ever that means. \u003C/p\u003E\n\n\u003Cp\u003EGive gold a try.  It sounds like it maybe right for you.\u003C/p\u003E\n\n\u003Cp\u003EWHO IS GOLD NOT RIGHT FOR?\u003C/p\u003E\n\n\u003Cp\u003EGold may not be right for everyone.\u003C/p\u003E\n\n\u003Cp\u003EIf you are still looking for the next great high growth stock in an uncertain economic environment.  If you are continuing to stick with a real estate investment strategy that may have served you well during the 90\u0026#8217;s.\u003C/p\u003E\n\n\u003Cp\u003EIf you believe the best way to preserve your wealth is to leave it in savings or other interest bearing accounts.\u003C/p\u003E\n\n\u003Cp\u003EIf you want to take an \u0026#8220;all paper\u0026#8221; approach to investing gold may not be what\u0026#8217;s right for you. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Los Angeles ",
    "address1": "1801 Century Park East 25th Floor",
    "address2": "",
    "zip_code": "90067",
    "city": "Los Angeles ",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 34.062147,
    "longitude": -118.415806}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        100],
       "assets/images/resized/0005/4644/54644v2-max-150x150.jpg"],
      [[250,
        166],
       "assets/images/resized/0005/4644/54644v2-max-250x250.jpg"],
      [[271,
        181],
       "assets/images/resized/0005/4644/54644v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        100],
       "assets/images/resized/0005/4646/54646v2-max-150x150.jpg"],
      [[250,
        166],
       "assets/images/resized/0005/4646/54646v2-max-250x250.jpg"],
      [[271,
        181],
       "assets/images/resized/0005/4646/54646v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.goldcoinsgain.com",
    "title": "Gold Coins Gain Website"}]}