{"name": "Golden Surplus",
 "permalink": "golden-surplus",
 "crunchbase_url": "http://www.crunchbase.com/company/golden-surplus",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Fri Nov 06 04:19:02 UTC 2009",
 "updated_at": "Tue Feb 09 07:51:44 UTC 2010",
 "overview": "\u003Cp\u003EGolden Surplus California\u0026#8217;s premier computer wholesale liquidator, with affiliate offices nationwide, offers business technology liquidation services, disposition, asset recovery solutions for computer network hardware equipment. We specialize in remarketing and sales of open-box, pulled and refurbished personal computers, notebooks, systems, monitors, peripherals, servers, and network equipment. \u003C/p\u003E\n\n\u003Cp\u003EIs your organization upgrading to newer technology and looking to dispose of or sell used computer and network equipment? Are you downsizing, closing a business, avoiding bankruptcy and need to liquidate computer assets to satisfy creditors. Consider recycling, selling or liquidating your used surplus computers. Is it time to upgrade from outdated computer hardware to newer technology? Golden Surplus has a proven successful track record de-installing datacenter equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur asset recovery specialists make the equipment removal process quick and profitable for our selling customer. Convert surplus, excess and retired technology equipment into cash. We buy truckloads of used computer equipment, pallets, a storage room of desktops, CRT and LCD monitors and used servers.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}