{"name": "goodorgreatidea.com",
 "permalink": "goodorgreatidea-com",
 "crunchbase_url": "http://www.crunchbase.com/company/goodorgreatidea-com",
 "homepage_url": "http://www.goodorgreatidea.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "crowdsourcing, social-networking, gaming, entrepreneurship, startup, idea, innovation, innovator",
 "alias_list": null,
 "email_address": "mg@goodorgreatidea.com",
 "phone_number": "925-786-7521",
 "description": "networking, gaming for entrepreneurs",
 "created_at": "Tue Dec 06 21:24:31 UTC 2011",
 "updated_at": "Tue Dec 13 00:16:43 UTC 2011",
 "overview": "\u003Cp\u003EGoodorGreatIdea.com is a hybrid of crowdsourcing, social networking, and gaming for aspiring entrepreneurs.\u003C/p\u003E\n\n\u003Cp\u003EIt is an idea brainstorming site with gaming and social networking twist. People can not only post startup ideas but also rate and discuss an idea. People worried about their ideas getting stolen can control who can read their ideas. The rating and points system makes it fun and intellectually stimulating to discuss new business ideas. When an idea is rated, its innovator earns points, depending on the rating. As a result, both great ideas and people with great ideas bubble up over a period of time. The early adopters love the leaderboard functionality. \u003C/p\u003E\n\n\u003Cp\u003EAn idea is not enough to become an entrepreneur. After coming up with an idea, an entrepreneur needs support, validation, and a team to take an idea to the next stage. Goodorgreatidea.com can help an aspiring entrepreneur in all those areas. For example, one of the challenges that aspiring entrepreneurs run into is that they have a great idea, but do not know how to implement it or market it. They can use goodorgreatidea.com to not only validate the idea but also find people who are interested in working on it. \u003C/p\u003E\n\n\u003Cp\u003EGoodorgreatidea.com will accelerate the pace of innovation. It will enable more ideas to see the light of the day, instead of remaining locked in people’s heads.  For every startup launched, there are probably 20 that never get beyond the idea stage. A lot of people who come up with great ideas, but never take the next step. They can use goodorgreatidea.com to give life to their ideas and take the next step on their entrepreneurial journey.\u003C/p\u003E\n\n\u003Cp\u003EGoodorgreatidea.com can also help reduce unemployment. Imagine this scenario. Someone comes up with a great idea for a new business, but does not have money to hire people. He can post his idea on goodorgreatidea.com and offer part ownership of the new venture in exchange for service. It may not be a bad option for those who are unemployed. Most people would prefer to work rather than do nothing. Once a team is formed with the right members, they may be able to bring an idea to fruition. When the business starts generating revenue, they can start paying themselves salaries and perhaps hire more people to grow the business. Obviously, this would work for non-capital intensive ventures. Even for the ones that require some capital, a team may find it easier to get a loan than an individual.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[44,
       72],
      "assets/images/resized/0016/5461/165461v2-max-150x150.png"],
     [[44,
       72],
      "assets/images/resized/0016/5461/165461v2-max-250x250.png"],
     [[44,
       72],
      "assets/images/resized/0016/5461/165461v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}