{"name": "gotradelive",
 "permalink": "gotradelive",
 "crunchbase_url": "http://www.crunchbase.com/company/gotradelive",
 "homepage_url": "https://gotradelive.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "gotradelive",
 "category_code": "ecommerce",
 "number_of_employees": 20,
 "founded_year": 2006,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "free, trade, business, platform, private, buy, sell, social, ecommerce, no-fees, procure, suppliers",
 "alias_list": null,
 "email_address": "avalerio@globalfluency.com",
 "phone_number": "650-433-4148",
 "description": "free and easy way to trade ",
 "created_at": "Fri Apr 20 18:00:03 UTC 2012",
 "updated_at": "Wed Apr 25 21:03:35 UTC 2012",
 "overview": "\u003Cp\u003Egotradelive enables businesses to succeed by trading more freely. Our online and mobile social commerce platform gives small and medium sized businesses a new competitive advantage in the way they sell, source and promote products and services within their confidential customer and supplier networks. We make it easy to set up, grow and operate extended trading networks that are under the complete control of your business. There are no transaction fees or charges for using our basic free service, so you keep more of your hard-earned profits.\u003C/p\u003E\n\n\u003Cp\u003EIf your business carries inventory, gotradelive is most certainly for you. We provide a fast and efficient way to promote deals for excess, slow moving, perishable and end-of-life products. gotradelive quickly finds interested buyers within your private networks and stimulates activity with competitive bidding to establish the optimal price for your product.\u003C/p\u003E\n\n\u003Cp\u003Egotradelive is also a valuable platform for sourcing products and services. Our downward bidding and procurement management tool makes it easy to communicate with multiple suppliers and quickly finds the best terms and price from the right vendor.\u003C/p\u003E\n\n\u003Cp\u003EGrowing your business network is as simple as adding new contacts to your network and increasing the proportion of active relationships. gotradelive’s communications tools make it easy to stay in touch so your connections get relevant private messages and live trades.\u003C/p\u003E\n\n\u003Cp\u003EThe platform is designed to be intuitive and easy to use; all you have to do is register your email address. So why not go and trade live now!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}