{"name": "Gourmet Garlic Company",
 "permalink": "gourmet-garlic-company",
 "crunchbase_url": "http://www.crunchbase.com/company/gourmet-garlic-company",
 "homepage_url": "http://gourmetgarliccompany.com.au/shop-garlic/category",
 "blog_url": "http://gourmetgarliccompany.com.au/blog/",
 "blog_feed_url": "",
 "twitter_username": "gourmetgarlic",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@gourmetgarliccompany.com.au",
 "phone_number": "0418 622 336",
 "description": "Organic garlic producers.",
 "created_at": "Thu May 16 14:33:14 UTC 2013",
 "updated_at": "Fri May 17 13:55:11 UTC 2013",
 "overview": "\u003Cp\u003EGourmet Garlic Company grows certified organic garlic for both eating and planting. The company also produces a range of boutique, handmade garlic products.\u003C/p\u003E\n\n\u003Cp\u003EThe product range includes: purees, infused oils and vinegars, dressings, sauces, condiments, seasonings, chutneys, relishes, pickles and cooking wines. All products are made with Australian garlic and are preservative-, additive- and chemical-free hence the tag line: \u0026#8220;All Ingredients Supplied by Mother Earth\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EThe owner-operators of the Gourmet Garlic Company, Will \u0026amp; Vanessa Cotterill have always been passionate advocates of organic farming and quality local food products.\nAfter running a successful organic fruit and vegetable retail business in Sydney they decided they decided to move to the country to grow organic garlic and produce a range of boutique handmade garlic products.\u003C/p\u003E\n\n\u003Cp\u003EThe reason for choosing garlic as their focus was threefold: firstly there was a dramatic shortage of Australian-grown garlic, secondly there was next to no processed Australian garlic available at all and last but not least every household should be able to use quality garlic and garlic products in the kitchens, homes and gardens. It is such a wonderfully versatile plant with such potent health benefits and such a rich history of use.\u003C/p\u003E\n\n\u003Cp\u003EThe combination of Will’s organic farming experience which was developed from his earliest days living and working on his family’s organic farms in Great Britain and Vanessa’s many years experience in the hospitality industry allow them to combine the growing and processing of their garlic perfectly – a true \u0026#8216;paddock to plate\u0026#8217; partnership.\u003C/p\u003E\n\n\u003Cp\u003EProducts: Certified organic garlic for eating and growing; garlic purees; garlic-infused oils; garlic-infused vinegars; garlic dressings and sauces; garlic chutneys, relishes and pickles; garlic seasonings and meat rubs; garlic cooking wine.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0026/3110/263110v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0026/3110/263110v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0026/3110/263110v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}