{"name": "GPSTravelMaps.com",
 "permalink": "gpstravelmaps-com",
 "crunchbase_url": "http://www.crunchbase.com/company/gpstravelmaps-com",
 "homepage_url": "http://www.gpstravelmaps.com",
 "blog_url": "http://www.gpstravelmaps.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "gpstravelmaps",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gps, travel, map, maps, costa-rica, nicaragua, guatemala, el-salvador, belize, egypt, south-africa, garmin, iphone, navigation, gps-maps, thailand, new-zealand",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "GPS Map for Travelers",
 "created_at": "Fri May 14 15:38:48 UTC 2010",
 "updated_at": "Fri May 14 20:01:02 UTC 2010",
 "overview": "\u003Cp\u003EGPSTravelMaps.com provides detailed navigable maps to GPS user for developing countries.\u003C/p\u003E\n\n\u003Cp\u003EGPSTravelMaps.com was established in 2006.  The initial concept came earlier, though, when Aaron Young was traveling through Central America.  During the course of the trips, it became apparent that the GPS device that he was using was nice to have in order to see the coordinates of where he was at and to get a vague concept of where he was in relation to roads, cities, ruins, and geocaches.  However, the basemap inside the GPS was essentially worthless.  After returning from that trip, Aaron moved to Cape Town, South Africa where once again the map inside the unit was nothing more than a beige background.  He began tinkering with different GIS data and developing a local scale map of Cape Town for his own use.  After some testing and extensive on-the-ground use of this map, he offered it to others online to gauge the demand for such a product.  In January 2007, GPSTravelMaps.com opened the website with corresponding webstore to offer these maps for other travelers to use while visiting a particular place.  The demand has been high, with the website expanding its map selection and an ever increasing number of GPS users who have found the detail of the maps offered on GPSTravelMaps.com to be of exceptional value for their own travels.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}