{"name": "Grammarly",
 "permalink": "grammarly",
 "crunchbase_url": "http://www.crunchbase.com/company/grammarly",
 "homepage_url": "http://www.grammarly.com",
 "blog_url": "http://www.grammarly.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "grammarly",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 2,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "spelling, grammar, writing, vocabulary, education, editing, home-alone, letters, abc, dictionary, author, instruction, online-software, editor, blogging, media, error, dictionaries, documents, custom, development, language-learning, apps, language, thesau",
 "alias_list": null,
 "email_address": "info@grammarly.com",
 "phone_number": "(888)318-6146",
 "description": "Automated grammar checker",
 "created_at": "Sat Jan 22 00:41:00 UTC 2011",
 "updated_at": "Sun Dec 02 01:07:01 UTC 2012",
 "overview": "\u003Cp\u003EGrammarly aims to perfect written English by continuously advancing the world’s most accurate grammar checking technology. The Grammarly engine checks for more than 150 types of spelling, grammar and punctuation errors, enhances vocabulary usage and suggests citations. More than 2.5 million English writers worldwide trust Grammarly’s products, which are also licensed by leading universities and corporations.\u003C/p\u003E\n\n\u003Cp\u003EGrammarly helps users correct and learn written English. Grammarly’s core engine utilizes patent-pending algorithms to find writing issues, suggest corrections and provide context. It’s easy to use Grammarly’s subscription products. Copy and paste any piece of English writing into Grammarly’s online application, or install the Grammarly® Plugin for Microsoft® Office Software. Then, Grammarly’s algorithms will flag potential errors in the text and suggest corrections so that users can make an informed decision about whether, and how, to correct an issue.\u003C/p\u003E\n\n\u003Cp\u003EGrammarly also provides free resources to English writers, including Grammarly® Answers, an online Q\u0026amp;A community for English writing questions; Grammarly® Handbook, an online guide for English writing; Grammarly® Words, a contextual online thesaurus; and the Grammarly Facebook community, which provides fans with fun grammar tips and discussions.\u003C/p\u003E\n\n\u003Cp\u003EGrammarly uses evolving, computationally-intensive algorithms running on powerful cloud-based computers to accurately catch and correct English spelling and grammar mistakes. It reviews text from a variety of unique editing styles, including general, business, academic, technical, creative and casual.  Grammarly is available via the Grammarly® Online Application at Grammarly.com or by downloading the Grammarly® Plugin for Microsoft® Office Software.  \u003C/p\u003E\n\n\u003Cp\u003EGrammarly is not designed to replace teachers or proofreaders; rather, it serves as an automated, cost-effective and always-available tool to improve users’ writing and skills. As a result, Grammarly is licensed by many universities, corporations and government entities worldwide. It helps students achieve academic goals and improve their writing on essays, reports, theses, dissertations and college entrance applications. Professionals use Grammarly reviews to provide expert help and instant feedback on the accuracy, impact and credibility of their English writing in a variety of disciplines \u0026#8211; including legal, healthcare, academic, marketing, technical and journalism. Grammarly can be an equally powerful tool for job seekers who can use it to perfect cover letters and other related communication with potential employers. Foreign students and non-native English language speaking professionals may also benefit from Grammarly.\u003C/p\u003E\n\n\u003Cp\u003EGrammarly offers monthly, quarterly and annual subscriptions to individuals. Grammarly@EDU provides licenses directly to K-12 and higher education institutions.  \u003C/p\u003E\n\n\u003Cp\u003EGrammarly was founded in 2008 by Alex Shevchenko and Max Lytvyn, both English language learners. Alex and Max foresaw an opportunity to create a powerful tool that would instantly and accurately provide written grammar assistance to the more than one billion native and non-native English language speakers worldwide. Today, Grammarly continually improves its algorithms in order to eventually perfect all written English.\u003C/p\u003E\n\n\u003Cp\u003EGrammarly is a profitable, privately-held company with headquarters in San Francisco, California.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       73],
      "assets/images/resized/0011/8497/118497v2-max-150x150.jpg"],
     [[250,
       122],
      "assets/images/resized/0011/8497/118497v2-max-250x250.jpg"],
     [[450,
       220],
      "assets/images/resized/0011/8497/118497v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-founder, Head of Product Strategy",
    "person":
     {"first_name": "Max",
      "last_name": "Lytvyn",
      "permalink": "max-lytvyn",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "548 Market Street, #35410 ",
    "address2": "",
    "zip_code": "94104",
    "city": "San Francisco",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [{"description": "Grammarly announced that it has surpassed 3 million registered users for the website and service.",
    "stoned_year": 2012,
    "stoned_month": 10,
    "stoned_day": 30,
    "source_url": "http://www.businesswire.com/news/home/20121030005501/en/3-Million-Registered-Users-Trust-Grammarly-Perfect",
    "source_text": null,
    "source_description": "3 Million Registered Users Trust Grammarly to Perfect Their Written English",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Grammarly",
      "permalink": "grammarly"}},
   {"description": "Grammarly featured in Forbes as a critical tool for author's to improve their written word.",
    "stoned_year": 2012,
    "stoned_month": 10,
    "stoned_day": 21,
    "source_url": "http://www.forbes.com/sites/cherylsnappconner/2012/10/21/i-dont-tolerate-poor-grammar/",
    "source_text": null,
    "source_description": "I Don't Tolerate Poor Grammar",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Grammarly",
      "permalink": "grammarly"}},
   {"description": "Announcement of analysis of most frequent college Grammar Mistakes.",
    "stoned_year": 2012,
    "stoned_month": 11,
    "stoned_day": 28,
    "source_url": "http://www.huffingtonpost.com/2012/11/28/common-college-grammar-mistakes_n_2206723.html",
    "source_text": null,
    "source_description": "Top 6 Common College Grammar Mistakes from Grammarly",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Grammarly",
      "permalink": "grammarly"}}],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"450\" height=\"253\" src=\"http://www.youtube.com/embed/6tLlPvu31F0\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E\r\n\r\n\u003Ciframe width=\"450\" height=\"253\" src=\"http://www.youtube.com/embed/nymmxNvthyA\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E\r\n\r\n",
    "description": "\u003Cp\u003EGrammarly reviews and instructional video provided by Walden University\u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[150,
        94],
       "assets/images/resized/0021/8480/218480v2-max-150x150.jpg"],
      [[250,
        158],
       "assets/images/resized/0021/8480/218480v2-max-250x250.jpg"],
      [[450,
        284],
       "assets/images/resized/0021/8480/218480v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://startuptunes.com/2011/01/31/grammarly-automated-grammar-checker-and-plagiarism-detection-tool/",
    "title": ""}]}