{"name": "Grantech Engineers",
 "permalink": "grantech-engineers",
 "crunchbase_url": "http://www.crunchbase.com/company/grantech-engineers",
 "homepage_url": "http://www.indiamart.com/grantech-engineers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "grantech-engineers@tradepassport.org",
 "phone_number": "9840987534",
 "description": "manufacturing and supplying",
 "created_at": "Thu Apr 04 13:44:50 UTC 2013",
 "updated_at": "Thu Apr 04 13:44:52 UTC 2013",
 "overview": "\u003Cp\u003EGrantech Engineers is a partnership firm, established in the year 1991. The company is engaged in manufacturing and supplying a comprehensive range of Calibrating Machines, Granite Machine Spares, Granite Drilling Machines, Granite Polishing Machines and Granite Cutting Machines. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed an advanced and robustly constructed infrastructural set-up, fitted with all amenities required to carry our better operations. Various departments such as production, warehousing and packaging, quality control, administrative and others are developed to carry out each task systematically and accelerate the entire business operations. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nFocused all endeavors towards satisfying our clients, our company has become the most preferred choice of huge customers. We provide them customization facility, reliable solutions and make transparent dealings with them, which in turns allow us to expand our client base all over the nation.\u003C/p\u003E\n\n\u003Cp\u003ETeam \u0026amp; Manpower:\nOur company has employed extremely dedicated and talented team of professionals that helps us in meeting the actual specifications of clients successfully. Regular training sessions and seminars are organized to boost up our team’s efficiency and keep them abreast of the growing market specifications. Furthermore, our team is competent of undertaking all tasks and meets them accordingly. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur company has acquired a distinct place in the industry through consistently offering products as per the appropriate requirements of clients. Besides, our timely response to the queries of clients has also enabled us in acquiring their large support as well as becoming their foremost choice.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7936/247936v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7936/247936v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7936/247936v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}