{"name": "GreenMap.org",
 "permalink": "greenmap-org",
 "crunchbase_url": "http://www.crunchbase.com/company/greenmap-org",
 "homepage_url": "http://GreenMap.org",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "web@greenmap.org",
 "phone_number": "",
 "description": "",
 "created_at": "Mon Aug 10 15:30:32 UTC 2009",
 "updated_at": "Tue Aug 18 17:05:03 UTC 2009",
 "overview": "\u003Cp\u003EGreen Map System promotes inclusive participation in sustainable community development worldwide, using mapmaking as its medium.\u003C/p\u003E\n\n\u003Cp\u003EPromoting local green living, nature and culture since 1995, Green MapÂ® System has empowered a cross-cultural movement that has spread to 600 diverse cities and towns in 55 countries. Nearly 400 locally published Green Maps connect people with green living sites, nature, social and cultural resources near home and while traveling. Each map utilizes Green MapÂ® Icons to highlight both positive and challenging sites. As seen at GreenMap.org, this non-profit organization offers multi-lingual interactive websites, adaptable tools, technologies, books and workshop resources to each community\u0026#8217;s mapmaking team. The program also provides experiential tools for teaching children and young adults about sustainability issues in their community.\u003C/p\u003E\n\n\u003Cp\u003EOpen Green Map\nGreen Map System recently launched their new interactive website, the Open Green Map. This social mapmaking platform highlights a vast array of sustainability sites, routes and resources charted by local Green Mapmakers. It invites public participation and encourages people to dynamically share their insights, multimedia and impact assessments for each site on the map. Transforming local information into global interaction, Open Green Map will soon be available in mobile, widget, shared and distributed formats.\u003C/p\u003E\n\n\u003Cp\u003EImpacts of this worldwide movement\nGreen Map System is a collaborative project with important social and environmental impacts. The outcomes of their work reach far beyond the map\u0026#8217;s borders, as documented in the Green Map Impacts book. In addition to building leadership, communication and community organizing skills, Green Mapmakers promote socially responsible economies and green jobs while engaging media, policymakers as well as the public.\u003C/p\u003E\n\n\u003Cp\u003ETo find more about this global movement, go to GreenMap.org\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0005/6879/56879v2-max-150x150.jpg"],
     [[250,
       153],
      "assets/images/resized/0005/6879/56879v2-max-250x250.jpg"],
     [[450,
       276],
      "assets/images/resized/0005/6879/56879v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Board",
    "person":
     {"first_name": "Stan",
      "last_name": "Wiechers",
      "permalink": "stan-wiechers",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        70],
       "assets/images/resized/0005/6881/56881v2-max-150x150.png"],
      [[250,
        116],
       "assets/images/resized/0005/6881/56881v2-max-250x250.png"],
      [[450,
        210],
       "assets/images/resized/0005/6881/56881v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}