{"name": "Greenlife Water",
 "permalink": "greenlife-water",
 "crunchbase_url": "http://www.crunchbase.com/company/greenlife-water",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "GreenLifeWater1",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1988,
 "founded_month": 5,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Thu Jan 03 16:02:58 UTC 2013",
 "updated_at": "Thu Jan 10 05:36:47 UTC 2013",
 "overview": "\u003Cp\u003EGreenlife Water is the leading provider of water filtration systems in the Ontario area. We help make your water safer, healthier, and better tasting. With our point-of-entry system, you can enjoy filtered water throughout your home. We make water filtration systems become an affordable option for families of all sorts. We believe in making clean, healthy water accessible, affordable, and convenient for people across Ontario. Clean water should not remain a luxury. Instead, people across the world should have affordable access to it. We’re working hard to make that mission a reality.\u003C/p\u003E\n\n\u003Cp\u003EOur company is not about a “cookie cutter” formula for water filtration. We believe that each family’s unique water situation is different. That’s why we offer a wide range of available filter types and services. No matter your situation, we offer a convenient and affordable solution that best serves your family. Many of our customers opt for our filtration rental program. This convenient program brings all the benefits of our trusted filtration system without huge upfront expenses.\u003C/p\u003E\n\n\u003Cp\u003EWe offer the following benefits:\u003C/p\u003E\n\n\u003Cp\u003E• No “installation fees” or other upfront costs.\n• Lifetime service, filtration maintenance, and replacements for filters.\n• One convenient, low monthly rental payment.\n• Full ease-of-use through integration with your Enbridge Gas Distribution bill.\n• Clean, pure water at the point-of-entry. This means water available for every tap in your home.\n• Reductions from 98% to 99.9% for contaminants like chlorine, lead, arsenic, and mercury.\n• Longer lasting appliances with less maintenance thanks to cleaner water.\n• Outstanding water filtration without the loss of essential minerals in your water.\u003C/p\u003E\n\n\u003Cp\u003EFrom price to quality to environmental awareness, Greenlife Water is your best choice. Why continue risking your family’s health and safety? Our filtered water is convenient, effective, and hassle-free. Let a Greenlife Water Filtration System keep you and your family healthy and happy.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       117],
      "assets/images/resized/0022/8639/228639v2-max-150x150.jpg"],
     [[250,
       196],
      "assets/images/resized/0022/8639/228639v2-max-250x250.jpg"],
     [[450,
       353],
      "assets/images/resized/0022/8639/228639v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}