{"name": "GreenTech International",
 "permalink": "greentech-international",
 "crunchbase_url": "http://www.crunchbase.com/company/greentech-international",
 "homepage_url": "http://www.indiamart.com/greentech-international-coimbatore/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "greentech-international-coimbatore@tradepassport.org",
 "phone_number": "9894321725",
 "description": "We are engaged in supplying, exporting ,",
 "created_at": "Fri Apr 05 09:13:13 UTC 2013",
 "updated_at": "Fri Apr 05 09:13:30 UTC 2013",
 "overview": "\u003Cp\u003EGreen Tech International formulated in the year 2010 has proved itself to be the leading suppliers, exporters and traders of the wide range of Coconut Products, Coir Products, Indian Spices, Powdered Spices, Masala Powder, Chilli Powder, Fresh Vegetables, Rice and Herbal Oil. Products comprising these categories are Young Coconuts, Semi Husked Coconuts, Coir Fiber, Coir Pith Blocks, Coir Mats, Coconut Copra, Kashmiri Chili Powder, Black Pepper Powder, Coriander Powder, Fenugreek Seeds, Black Pepper, Turmeric Fingers, String Beans, Fresh Tomatoes, Brinjal, Ayurvedic Herbal Hair Oil, Aloe Vera Oil and many more. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are able to efficiently address the diverse demands and requirements of our valued clients, owing to the long lasting relationship with our vendors. Our vendors provide us immaculate quality products at industry leading prices. We have selected our vendors with utmost care after a detailed market study. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nOur quality-oriented product range has enabled us to fetch the trust of huge clientele. Products are tested on well-defined parameters, before we procure them from the vendors. Later on, packaging and delivery of the products are done as per the prescribed quality norms and standards. We ensure that pure and adulteration-free range is procured and further delivered to the clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing the customer-oriented firm, we give priority to render immense satisfaction to our clients by fulfilling their needs in most desirable manner.  Premium quality products, with customized packaging are timely delivered to their doorsteps. Prices are kept low so that everyone can afford them no matter to what class they belong to. We have good financial position and have capacity to meet the bulk demands of clients in timely manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nCoconut Products, Coir Products, Indian Spices, Powdered Spices, Masala Powder, Chilli Powder, Fresh Vegetables, Rice and Herbal Oil. Products comprising these categories are Young Coconuts, Semi Husked Coconuts, Coir Fiber, Coir Pith Blocks, Coir Mats, Coconut Copra, Kashmiri Chili Powder, Black Pepper Powder, Coriander Powder, Fenugreek Seeds, Black Pepper, Turmeric Fingers, String Beans, Fresh Tomatoes, Brinjal, Ayurvedic Herbal Hair Oil, Aloe Vera Oil and many more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8469/248469v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8469/248469v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8469/248469v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}