{"name": "Green SEO marketing",
 "permalink": "green-seo-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/green-seo-marketing",
 "homepage_url": "http://greenseomarketing.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-san-francisco, interenet-marketing-san-francisco, search-engine-optimization-san-francisco",
 "alias_list": null,
 "email_address": "greenseosanfrancisco@gmail.com",
 "phone_number": "4157243021",
 "description": "SEO San Francisco",
 "created_at": "Mon Feb 04 06:17:16 UTC 2013",
 "updated_at": "Thu Feb 07 16:55:08 UTC 2013",
 "overview": "\u003Cp\u003EWelcome to San Francisco SEO Company\u003C/p\u003E\n\n\u003Cp\u003EInternet has changed our lives. Every day hundreds of thousands of transactions are performed on-line. Companies from small start-ups to global corporations are represented on the Internet. Search Engine Optimization (SEO) is the key to success on the Internet for any type of business.\u003C/p\u003E\n\n\u003Cp\u003ESearch Engine Optimization is an action of making it easier for any search engine to find your listing and assign it higher importance, thus moving it closer to the top of the Search Engine. Have you found our web-site on the first page of you search engine? Do you know how that happened? We know!\nIf you are reading this page, it is likely you have at least some idea of what SEO and Internet marketing are all about.\u003C/p\u003E\n\n\u003Cp\u003EThe purpose of SEO is to optimize the content of your web site to ensure you get more traffic from through the multitude of search engines such as Google, BING or Yahoo. That way people searching on the web will actually find your business among hundreds or thousands of similar businesses.\u003C/p\u003E\n\n\u003Cp\u003EAt Green SEO San Francisco we know how to make your web site visible through SEO.\nIt is tough to find the right SEO Company in San Francisco Bay Area. It is also tough to make your web site visible on the Internet and be on the very top of search engine ratings. Green SEO San Francisco will help you get there.\nThis web site will introduce to you what we offer and how we conduct effective SEO.\u003C/p\u003E\n\n\u003Cp\u003ELet us, the Green SEO San Francisco, develop your business and increase your sales. Green SEO San Francisco is a small SEO company, focused on innovations in mobile applications and marketing internet technologies. The main idea of Green SEO San Francisco is to help businesses grow using organic methodology of SEO. Green SEO San Francisco is local SEO company in San Francisco. We know all problems local companies face during promotion, we faced it too! That makes Green SEO San Francisco equal participant of San Francisco and Bay area market. Let\u0026#8217;s go up together!\u003C/p\u003E\n\n\u003Cp\u003EGreen SEO Marketing San Francisco is right choice!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       31],
      "assets/images/resized/0023/3394/233394v2-max-150x150.jpg"],
     [[250,
       52],
      "assets/images/resized/0023/3394/233394v2-max-250x250.jpg"],
     [[450,
       94],
      "assets/images/resized/0023/3394/233394v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}