{"name": "GreenTronics Design",
 "permalink": "greentronics-design",
 "crunchbase_url": "http://www.crunchbase.com/company/greentronics-design",
 "homepage_url": "http://www.indiamart.com/greentronics-designlabsindia/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "energy-recorders, light-bulb-units, grid-chargers, solar-panels, extension-cables-and-led-lightings-",
 "alias_list": null,
 "email_address": "greentronics-designlabsindia@tradepassport.org",
 "phone_number": "9886393833",
 "description": "Manufacturers and suppliers,",
 "created_at": "Fri Apr 05 07:45:53 UTC 2013",
 "updated_at": "Fri Apr 05 07:45:55 UTC 2013",
 "overview": "\u003Cp\u003EGreenTronics Design Labs India Pvt. Ltd. is a Private Limited business venture, which was established in the year 2012 at Bengaluru, Karnataka. We are among the most reputed manufacturers and suppliers of the market engaged in offering an extensive range of Solar Lighting Solutions, Energy Recorders, Light Bulb Units, Grid Chargers, Solar Panels, Extension Cables and LED Lightings. Our experts use advanced production techniques and high-grade materials to develop these products.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe boast a sound infrastructural building, which is constructed over a large area of land at Bengaluru, Karnataka. It is divided into different departments, which are resourced with state-of-the-art facilities. Our in-house manufacturing unit is operational with technologically advanced machinery. This help us produce immaculate product line for the clients in large quantities at fast pace.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur dexterous team of qualified and trained professionals enables us to efficiently cater to the variegated demands of different industries based across the country.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe quality test each and every product on well defined parameters prior to the final dispatch to our esteemed clients. Our experts employ modern production techniques and high-grade materials to develop highly reliable products for the clients. We source our production materials from the certified and authentic vendors of the market. We practice stringent quality control system in our manufacturing process, in order to ensure maximum benefits of the clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nSolar Lighting Solutions, Energy Recorders, Light Bulb Units, Grid Chargers, Solar Panels, Extension Cables and LED Lightings. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/8401/248401v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/8401/248401v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/8401/248401v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}