{"name": "Greeting Cloud",
 "permalink": "greeting-cloud",
 "crunchbase_url": "http://www.crunchbase.com/company/greeting-cloud",
 "homepage_url": "http://www.greetingcloud.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "GreetingCloud",
 "category_code": "ecommerce",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "greeting-cards, paper-products, online-retail, services, retail, retail-services",
 "alias_list": null,
 "email_address": "alexchardin@gmail.com",
 "phone_number": "4148525852",
 "description": "Greeting card delivery service",
 "created_at": "Thu Mar 15 03:33:01 UTC 2012",
 "updated_at": "Fri Mar 23 03:35:22 UTC 2012",
 "overview": "\u003Cp\u003EGreeting Cloud delivers real, paper greeting cards to customers based on events that they schedule throughout the year. It is designed to provide a more streamlined approach to shopping for greeting cards instead of physically going to the store or using other large online retailers.\u003C/p\u003E\n\n\u003Cp\u003EThe value of the service to consumers is primarily convenience in a couple of forms. First, the service removes the need to visit a grocery or drug store in order to purchase greeting cards. These stores often have large aisles of cards and it is time-consuming to look through all of them. The second convenience factor is the sort of \u0026#8220;set it and forget it\u0026#8221; effect. What the service allows consumers to do is setup all of the different special occasions in their lives (birthdays, weddings, Mother\u0026#8217;s Day, etc.) months in advance, select the cards they want for those events, and then not think about it until Greeting Cloud ships them the card a few days prior to the event or whenever the customer chooses.\u003C/p\u003E\n\n\u003Cp\u003EThe functionality of the service from a user’s perspective is straightforward. Users are given an event-based approach to shopping. All interactions in the web application are in the context of either an “event” (e.g. birthday, Christmas, anniversary, etc.) or a “delivery” (e.g. 13th birthday, Christmas 2012, 2 days before 2013 anniversary, etc.) which serves to maintain focus on one task at a time.\u003C/p\u003E\n\n\u003Cp\u003EGreeting Cloud is priced using a subscription model with different price tiers based on the number of cards allotted per month. The subscription model was selected to enable a smooth and efficient experience, free from shopping carts or long checkout processes common in most online retail sites. The effect that the subscription model achieves is that customers essentially pay in advance for a certain number of greeting cards which they can schedule to be delivered whenever they wish.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       29],
      "assets/images/resized/0017/8336/178336v2-max-150x150.png"],
     [[206,
       40],
      "assets/images/resized/0017/8336/178336v2-max-250x250.png"],
     [[206,
       40],
      "assets/images/resized/0017/8336/178336v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Alex",
      "last_name": "Hardin",
      "permalink": "alex-hardin",
      "image": null}},
   {"is_past": false,
    "title": "Greeting Cloud",
    "person":
     {"first_name": "Jacob",
      "last_name": "Scherrer",
      "permalink": "jacob-scherrer",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}