{"name": "GreenTec Pest Control",
 "permalink": "greentecpc-2",
 "crunchbase_url": "http://www.crunchbase.com/company/greentecpc-2",
 "homepage_url": "http://www.greentecpc.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "security",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "florida-pest-control, pest-control-largo, clearwater-pest-control, pest-control-florida, pest-control-clearwater, pest-control-new-port-richey, hudson-pest-control, pest-control-in-florida, largo-pest-control, pest-control-pinellas-county, pest-control-sp",
 "alias_list": "",
 "email_address": "petsimcox022@gmail.com",
 "phone_number": "727-789-9305",
 "description": "GreenTec Pest Control",
 "created_at": "Tue Feb 19 09:10:01 UTC 2013",
 "updated_at": "Fri Feb 22 22:45:16 UTC 2013",
 "overview": "\u003Cp\u003EGreenTec Pest Control, Inc\u003C/p\u003E\n\n\u003Cp\u003ELiving in Florida can be a challenge when it comes to pest control in this part of the country. Customers searching for the most effective pest control agency in Florida can rest assured about pest control services from GreenTec Pest Control, Inc. that has been providing services over 20 years to home and residential areas in Florida. Home owners can rely on GreenTec to provide safe, targeted and cost effective services for pest control in Florida. The company provides a range of services which has benefited hundreds of households and businesses already in this part of the country. \u003C/p\u003E\n\n\u003Cp\u003EThe services include:\u003C/p\u003E\n\n\u003Cp\u003E• Lawn \u0026amp; Ornamental\n• Termite Control\n• Pest Control\n• Sprinkler Repair\n• Lawn Innovation\u003C/p\u003E\n\n\u003Cp\u003ELocated in Port Richey, Florida, GreenTec provides a range of services related to pest control in Florida to residents in this part of the country. Customers recommend GreenTec Pest Control to their friends and family for a variety of reasons:\u003C/p\u003E\n\n\u003Cp\u003E• Accurate and precise analysis of property conditions\n• Comprehensive Service that always provides excellent results\n• Excellent Customer Care as well as Follow Up\n• Technology notes that provide quick answers to questions\u003C/p\u003E\n\n\u003Cp\u003EThe company is a proven industry leader for effective protection as well as peace of mind.  Our customers after using our Florida pest control services can rest assured that their homes are safe from the millions of dollars of damage done by termites and other pests in this part of the country. GreenTec provides safe, targeted as well as cost effective services so that business remains undisturbed and homes can remain free of vermin, termites, rodents, and other pests. \u003C/p\u003E\n\n\u003Cp\u003EEach year, subterranean termites cause severe damage to residential and commercial properties in and around Florida. The subterranean termite service that is provided by GreenTec provides effective deterrence against termites. Additionally the company provides a termite protection plan that includes a free inspection.\u003C/p\u003E\n\n\u003Cp\u003EBesides, the company offers lawn and ornamental services that can help you make your lawn brochure perfect and become the true envy of the Florida neighborhood. The company also evaluates sprinkler systems to ensure that it supports the needs of the client’s lawn. The company will also blend your lawns with custom blend fertilizer that is specially formulated according to the lawns needs.  Then the company furthermore applies other products that protect against weeds, disease, and other insects. \u003C/p\u003E\n\n\u003Cp\u003EThe company even provides protection for lawns that were burnt out or were eaten by bugs.  The company invites you to contact them at the following address:  Corporate Headquarters GreenTec Pest Control, Inc., 8610, Oreto Drive, Port Richey, Florida 34668. Alternatively call 727-789-9305/ 727-847-6733/ 352-686-6699 or email GreenTec@tampabay.rr.com for more details.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       31],
      "assets/images/resized/0023/6875/236875v2-max-150x150.jpg"],
     [[250,
       52],
      "assets/images/resized/0023/6875/236875v2-max-250x250.jpg"],
     [[285,
       60],
      "assets/images/resized/0023/6875/236875v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.greentecpc.com/",
    "title": "pest control"},
   {"external_url": "http://www.greentecpc.com/",
    "title": "Florida pest control services"}]}