{"name": "Greenocracy",
 "permalink": "greenocracy",
 "crunchbase_url": "http://www.crunchbase.com/company/greenocracy",
 "homepage_url": "http://Greenocracy.org",
 "blog_url": "http://greenocracydevelopmentblog.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "Greenocracy",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 2,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "collaboration, social-media, social-networking, ecommerce, web-2-0, politics, game-mechanics, online-gaming, blogging",
 "alias_list": null,
 "email_address": "",
 "phone_number": "7075694546",
 "description": "Political Social Networking",
 "created_at": "Fri Jul 29 22:04:37 UTC 2011",
 "updated_at": "Wed Aug 17 18:28:47 UTC 2011",
 "overview": "\u003Cp\u003EGreenocracy is a political social networking site that facilitates user driven collaborative solutions to real life political problems.\u003C/p\u003E\n\n\u003Cp\u003EUsers create online political profiles in order to participate in a variety of Greenocracy led political challenges. Within each challenge, users have the opportunity to earn participatory points, badges, exchangeable credits and even real money by completing a defined set of actions on the site. Each challenge is based upon set group of political issues and identified problems that vary in scope and size. Greenocracy helps to organize these issues into a set group of collaborative wiki pages that enable users to contribute, edit and fact check each others submissions. Each issue, or group of issues, also has an area reserved for further discourse and opinion based dialogue. Based upon these collected facts and user generated opinions, Greenocracy creates a series of challenges that focus on accomplishing a series of broadly and collaboratively defined political goals. For instance, based upon user generated content around the federal budget, Greenocracy might initiate a challenge that calls for users to submit their own solutions as to how they would solve a budgetary shortfall. Beyond this, Greenocracy awards points, badges and credits for those solutions that gain the most on site political traction, mainly by rewarding the solution author/author teams, or those who helped in shaping and amending the most successful solutions.\u003C/p\u003E\n\n\u003Cp\u003ESolutions themselves are vetted through a user based voting process in which each user can cast one vote per solution. Users are then awarded points, credits and badges based upon the number and type of votes they cast. Thus users are given a number of dynamic and unique means of engaging with the site while simultaneously working towards solving real political problems through an open and equitable process.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[138,
       150],
      "assets/images/resized/0014/9796/149796v2-max-150x150.jpg"],
     [[230,
       250],
      "assets/images/resized/0014/9796/149796v2-max-250x250.jpg"],
     [[258,
       280],
      "assets/images/resized/0014/9796/149796v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Chief Marketing Officer",
    "person":
     {"first_name": "Robert",
      "last_name": "Singleton",
      "permalink": "robert-singleton",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Santa Cruz Headquarters",
    "address1": "877 Cedar Street, Suite 150",
    "address2": "",
    "zip_code": "95060",
    "city": "Santa Cruz",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}