{"name": "GreenEnergy",
 "permalink": "greenenergy",
 "crunchbase_url": "http://www.crunchbase.com/company/greenenergy",
 "homepage_url": "http://www.greenenergyindia.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@greenenergyindia.com",
 "phone_number": "09953352704",
 "description": "manufactures, supplies, wholesales",
 "created_at": "Wed May 01 11:01:14 UTC 2013",
 "updated_at": "Mon May 06 06:05:19 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Green Energy Solution”, are engaged in manufacturing, supplying, wholesaling and exporting a broad array of Solar Energy Devices. All our products are manufactured employing advanced technology and latest machines following industry standards \u0026amp; norms. Our range is applauded by customers for its low maintenance, Eco-friendliness, longer service life, excellent performance and compact designs.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nWe manufacture \u0026amp; supply a comprehensive range of Solar Energy Devices which consists of Solar Lantern, Solar inverters, Solar Water Pump Sets, Solar Radio, Solar Traffic Lights and Solar Home Light. The raw materials that we use in making these devices such as steel sheets, glass sheets and rubber are procured from reliable vendors which ensure its better functioning.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nEngineers\nTechnicians\nQuality controllers\nSales and marketing representative\nQuality Inspectors\nResearch Experts\nTechnicians\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have constructed a state-of-the-art infrastructure facility for streamlined execution of the business processes. Spread across a vast area, this facility is installed with advanced technology and latest machines that enable us to judiciously utilize the resources.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality is the main motto of our organization. The range offered by us is manufactured using excellent quality material that is sourced from vendors of high repute after doing an extensive market research. Latest machines and advanced technology are employed in the manufacturing process following standards \u0026amp; norms of the industry. Moreover, we have hired highly experienced quality controllers to inspect the offered range. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}