{"name": "Ground Zero Group Corporation",
 "permalink": "ground-zero-group-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/ground-zero-group-corporation",
 "homepage_url": "http://gztwincities.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "gztwincities",
 "category_code": "consulting",
 "number_of_employees": 9,
 "founded_year": 2009,
 "founded_month": 5,
 "founded_day": 25,
 "deadpooled_year": 2011,
 "deadpooled_month": 7,
 "deadpooled_day": 1,
 "deadpooled_url": "",
 "tag_list": "web-design, web-hosting, web-development, joomla-development",
 "alias_list": null,
 "email_address": "sales@gztwincities.com",
 "phone_number": "931-229-0815",
 "description": "Ground Zero is a IT Services Company.",
 "created_at": "Tue Jul 26 18:44:05 UTC 2011",
 "updated_at": "Tue Jun 05 02:08:31 UTC 2012",
 "overview": "\u003Cp\u003EGround Zero Group Corporation provides the small and medium business with best of class tools to shape and dominate the market space. From corporate web design and development featuring industry recognized professionals to on-site information technology training by certified adult educators, Ground Zero Group provides services and products which empower the small and medium business owner to educate potential customers, embrace and extend internal processes for greater efficiency and ensure its mission objectives.\u003C/p\u003E\n\n\u003Cp\u003EOur Ground Zero Design Group division exists to design and develop award winning websites for our clients to educate, market, convert, and maintain. Our Content Management System based websites allow you to work with your website in an understandable fashion, extending and shaping it to your needs with minimal intervention. Our Brochure and Marketing websites educate consumers in the consumer and corporate markets with proven marketing strategies, ensuring that your message not only gets out, but that it actually digested and understood. Our service websites help you connect with and understand your clients and potential customers, ensuring that you have an easy method of feedback.\u003C/p\u003E\n\n\u003Cp\u003EOur Ground Zero Training Group serves civic organizations, small businesses, large corporations, and associations by providing adult educators for corporate and civic events with tailored instructional materials based on your organization\u0026#8217;s training needs. Our educators have experience with Microsoft Windows, Ubuntu Linux (Desktop), Adobe Photoshop Elements, Microsoft Office, and most other major software suites, as well as training on topics of computer and IT security, social engineering, cyber-bullying, and physical security topics. Many of our adult educators are professional educators with law enforcement, corporate, or post secondary academic instruction in the education field.\u003C/p\u003E\n\n\u003Cp\u003EOur Zero Point Systems Group, operating under the Zero Point Systems brand, provides best of class on-demand / incident-based computer and IT infrastructure fault mitigation services. Our technicians are national, and ready to respond to your firm\u0026#8217;s IT infrastructure problems within 2 hours of initial call. We also perform residential IT support and repair, as well as offer small business contracts throughout the United States.\u003C/p\u003E\n\n\u003Cp\u003EGround Zero Group Corporation has been in operation since 2009 under the management of Nathan A. Corbier, a respected security consultant and protective services worker who entered the IT workforce in 2004. Mr. Corbier continues to manage Ground Zero Group as President and Chief Executive Officer, a position that allows him to oversee the general operations of the firm.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0014/6239/146239v2-max-150x150.png"],
     [[226,
       75],
      "assets/images/resized/0014/6239/146239v2-max-250x250.png"],
     [[226,
       75],
      "assets/images/resized/0014/6239/146239v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Chief Executive Officer",
    "person":
     {"first_name": "Derick",
      "last_name": "Davis",
      "permalink": "derick-davis",
      "image": null}},
   {"is_past": true,
    "title": "President",
    "person":
     {"first_name": "Nathan",
      "last_name": "Corbier",
      "permalink": "nathan-corbier",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$5k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 5000.0,
    "raised_currency_code": "USD",
    "funded_year": 2009,
    "funded_month": 5,
    "funded_day": 25,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Headquarters",
    "address1": "Ground Zero Group Corporation",
    "address2": "100 South Fifth Street",
    "zip_code": "55401",
    "city": "Minneapolis",
    "state_code": "MN",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "Sparta Operations Center",
    "address1": "GZGC-ADM-EM-1000",
    "address2": "2325 Country Club Road # B",
    "zip_code": "38583",
    "city": "Sparta",
    "state_code": "TN",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}