{"name": "Group Solar",
 "permalink": "groupsat-fzco",
 "crunchbase_url": "http://www.crunchbase.com/company/groupsat-fzco",
 "homepage_url": "http://www.groupsat.com",
 "blog_url": "http://www.groupsat.com",
 "blog_feed_url": "http://www.groupsat.com",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": 278,
 "founded_year": 1999,
 "founded_month": 6,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cigs, solar-cells, thin-film",
 "alias_list": null,
 "email_address": "info@groupsat.com",
 "phone_number": "+8615989863380",
 "description": "",
 "created_at": "Mon Dec 01 04:32:08 UTC 2008",
 "updated_at": "Wed Jul 13 17:43:54 UTC 2011",
 "overview": "\u003Cp\u003EGroupSat is actvely involved in the developing of CIGS solar cells.  Our Goal is to produce an efficient, reliable solar product that can cater to the Asian Countaries with a reasonable price.  The product is unique for it does not depend on silicon, it is flexible, not breakable and price competitive.  Global warming not only adversely affects the supply and demand of food, as well as the living conditions for human beings, but also the balance of the Earth\u0026#8217;s important ecological systems. For the future of all living things on Earth we must quickly develop other sources of energy to replace fossil fuels. The control of an energy source such as petroleum by a limited number of countries invites international warfare and can throw the global economy into turmoil. Solar power favors no single region and is a clean source of energy. Companies involved in solar power generation are helping the world to look beyond short-term profit taking, to the advancement of society from a long-term perspective. GroupSat aims to continue working to attain these lofty goals and has an important role to fulfill as a leading company in the field of generating advanced and economical solar energy.\u003C/p\u003E\n\n\u003Cp\u003EAt GroupSat, our challenge is to create a balance between work time and personal time, with leading and innovative products that can benefit people\u0026#8217;s lives at work, at home, outdoors and everywhere in between. GroupSat solar products enhance your enjoyment, add to your comfort and open new perspectives. GroupSat solar products can boost your productivity and reduce costs in your home, work, outdoors and provide you the necessary power as far as ones imagination. GroupSat products are designed to help individuals, families, governments and corporate teams connect effortlessly, communicate clearly and efficiently, and unleash creativity like never before. GroupSat Solar is dedicated to improving people\u0026#8217;s lives through the use of advanced solar, water and electronics technology and a commitment to innovation, quality, value, and design.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[105,
       150],
      "assets/images/resized/0003/0349/30349v2-max-150x150.png"],
     [[175,
       250],
      "assets/images/resized/0003/0349/30349v2-max-250x250.png"],
     [[239,
       341],
      "assets/images/resized/0003/0349/30349v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "China Office",
    "address1": "No.1315, Jinfeng Road",
    "address2": "Mudu town,Wuzhong District",
    "zip_code": "",
    "city": "Jiangsu",
    "state_code": null,
    "country_code": "CHN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}