{"name": "GroupByte",
 "permalink": "groupbyte",
 "crunchbase_url": "http://www.crunchbase.com/company/groupbyte",
 "homepage_url": "http://www.groupbyte.com/",
 "blog_url": "http://www.groupbyte.com/blog/",
 "blog_feed_url": "http://www.groupbyte.com/blog/feed",
 "twitter_username": "groupbyte",
 "category_code": "ecommerce",
 "number_of_employees": 40,
 "founded_year": 1987,
 "founded_month": 2,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "toshiba-laptop, lenovo-laptop, sony-vaio-laptops, samsung-lcd-tv, air-conditioners, whirlpool-refrigerator, samsung-refrigerators, microwave-oven, samsung-camera, cameras, dryers",
 "alias_list": null,
 "email_address": "groupbyteindia@gmail.com",
 "phone_number": "9370130130",
 "description": "Groupbyte is an online shopping site",
 "created_at": "Thu Jun 14 11:32:15 UTC 2012",
 "updated_at": "Tue Jun 19 13:03:44 UTC 2012",
 "overview": "\u003Cp\u003EWhat is Groupbyte?\nGroupbyte.com is an online shopping store, offering several products in different categories. It is one of the best internet destinations of choice for thousands of customers. Shopaholics can shop online from the latest collections of Toshiba laptop, Lenovo laptop, Sony Vaio laptops, Samsung lcd tv, air conditioners, whirlpool refrigerator, Samsung refrigerators, microwave oven, Samsung camera etc. \u003C/p\u003E\n\n\u003Cp\u003EBenefits of Groupbyte.com\u003C/p\u003E\n\n\u003Cp\u003EHottest deals and great price:\n We offer best brands at most affordable prices. Groupbyte.com aims to full customer’s satisfaction by offering hottest deals on different types of items. We provide wide range of choices for the products with heavy discounts, which means a large saving for the people.\u003C/p\u003E\n\n\u003Cp\u003EBigger choices:\n Bigger selection options make shopping more delightful. We aim to provide wide range of choices for the products to make customers happy. With plenty of options, people can make a choice as per their taste and likings.\u003C/p\u003E\n\n\u003Cp\u003EBrand assurance:\nGroupbyte.com only offers the best deal on the well known brands, assuring the customers with good quality, long term value and worthiness. We make sincere efforts to offer deals within brands, categories, models and products.\u003C/p\u003E\n\n\u003Cp\u003EProducts offered by Groupbyte.com:\nGroupbyte.com offers wide range of products in different categories.\nComputer - laptops, desktop, netbooks, printers and scanners.\nTelevision – LED, LCD, plasma.\nHome appliances - Air conditioners, washing machine, refrigerator, microwave, oven, water coolers.\nCameras - Point and shoot, camcorders, and digital frames.\nAutomobiles - Bikes, scooty, sedans, hatchbacks.\u003C/p\u003E\n\n\u003Cp\u003EBrands in Groupbyte.com\n Customers will find some of trusted brands on the groupbyte.com such as LG, Samsung, Sony, Philips, Toshiba, Videocon, Panasonic, Apple, HP, Lenovo, Asus, Hitachi, Voltas, Whirlpool, Daikin, Siemens, and Panasonic\u003C/p\u003E\n\n\u003Cp\u003EOur Mission:\nGroupbyte.com is committed to deliver the best online shopping experience. We strive to live up to the expectations of our customers. They will see the value and worthiness in shopping with Groupbyte.com. Our services surprises and delights the customers. We offer the most secure transaction system.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Mumbai Head Office",
    "address1": "4/A-1, Court Chambers, 35, New Marine Lines",
    "address2": "",
    "zip_code": "400020",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/groupbyte",
    "title": "Facebook Page"},
   {"external_url": "http://twitter.com/#!/GroupByte",
    "title": "Twitter Profile"}]}