{"name": "GroveWare Technologies",
 "permalink": "groveware-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/groveware-technologies",
 "homepage_url": "http://www.groveware.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-apps, crm, mobile-process-automation, productivity-applications",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Mobile Process Automation",
 "created_at": "Wed Jan 09 12:20:13 UTC 2013",
 "updated_at": "Sat Jan 12 07:44:38 UTC 2013",
 "overview": "\u003Cp\u003EGroveWare Technologies is a leading provider in mobile solutions to a variety of industries around the globe. Their apps are web-based and provide mobile solutions to those using Android, iOS as well as BlackBerry. The company’s top apps include MobiTask, Exforma and the XML Upload Tool\u003C/p\u003E\n\n\u003Cp\u003EThe company was founded in 1996 by Hrair Achkarian and is based in Toronto, Canada. They are a publicly traded company on the OTC markets (OTCBB: GROV).\u003C/p\u003E\n\n\u003Cp\u003EThe mobile process automation company caters to a number of industries. They have designed apps that provide solutions for the government, as well as construction, health care, education and technology industries. Particularly, their apps focus on allowing a company to go mobile with day to day tasks. The apps support time keeping, payroll, digital signatures, photo captures, GPS tracking, assessment tools and many other important functions.\u003C/p\u003E\n\n\u003Cp\u003EThe company has spent a lot of R\u0026amp;D within web technology architecture, wireless client applications, project management and custom software development. All of their solutions utilize data security with encryption as well as data integrity which also includes rules-based data conversions where applicable.\u003C/p\u003E\n\n\u003Cp\u003EOn August 6, 2012, the company entered into a merger agreement with ePhoto Image. This has allowed GroveWare to enter into North America more effectively and move into expansion within the marketplace. As a result of the merger, the company is incorporated in Nevada, which is also where their legal counsel is located.\u003C/p\u003E\n\n\u003Cp\u003EOn October 1, 2012, the company announced that they are piloting projects with state and federal departments as a scheduled supplier. They will be providing versions of their apps Exforma and MobiTask to the government. GroveWare will also become an authorized supplier to educational and health care institutions that are funded by the government.\u003C/p\u003E\n\n\u003Cp\u003EThe company has mobilized a lot of ERP implementations through ExForma and MobiTask, which allow managers to access data using apps as opposed to being tied to a computer. The apps are a cost-effective way of extending data to a mobile device, be it a smartphone or a tablet. Proven solutions have included mobilizing ADP, Kronos WFC, MS Dynamics, Oracle EBS, PeopleSoft and SAP.\u003C/p\u003E\n\n\u003Cp\u003EThe company has branched into health care, providing apps that allow doctors to access files on patients. Similar apps allow patients to access necessary forms online and complete them, eliminating the paper trail. This leads to better health care for patients. There are customized solutions within health care by GroveWare, which allows unique aspects to be added to the apps for the data integration to run more smoothly. This will prevent data entry errors, which could otherwise cost the health care facility a significant amount of money.\u003C/p\u003E\n\n\u003Cp\u003EThe company has also branched into education, where there apps can be used by all levels of the school district. This includes calendar communications, room bookings, assessments and much more. With all of the information stored on the cloud, everyone has access to real-time data to avoid any miscommunication problems.\u003C/p\u003E\n\n\u003Cp\u003EGroveWare Technologies has also addressed problems with employees who are in the field. Timesheets can be used via any mobile device, allowing employees to clock in and out in the field. This provides an accurate date stamp as well as a GPS stamp. It also provides a forum for real-time data to be shared of inspection reports and anything else. Further, a digital signature can be added to any document to ensure that it has been reviewed by a specific person.\u003C/p\u003E\n\n\u003Cp\u003EThe company feels they have positioned themselves well within the mobile process automation market to provide the necessary mobility solutions to an array of industries. They are constantly in communications with various companies to pursue custom product development.\u003C/p\u003E\n\n\u003Cp\u003EThe company’s apps are available for download at the Google PlayStore as well as Apple iTunes. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       27],
      "assets/images/resized/0022/8830/228830v2-max-150x150.png"],
     [[216,
       40],
      "assets/images/resized/0022/8830/228830v2-max-250x250.png"],
     [[216,
       40],
      "assets/images/resized/0022/8830/228830v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Hrair",
      "last_name": "Achkarian",
      "permalink": "hrair-achkarian",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "20 Eglinton Ave W",
    "address2": "Suite 10006",
    "zip_code": "M4R 1K8",
    "city": "Toronto",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}