{"name": "Guardian Watch",
 "permalink": "guardian-watch",
 "crunchbase_url": "http://www.crunchbase.com/company/guardian-watch",
 "homepage_url": "http://www.guardianwatch.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "GuardianWatch",
 "category_code": "mobile",
 "number_of_employees": 22,
 "founded_year": 2010,
 "founded_month": 7,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "emergency-response, personal-safety, mobile-applications, iphone, android, 911, neighborhood-watch, public-safety, civil-unrest, crime-stoppers, community-policing, fire-safety, flood-safety, natural-disaster-preparedness, solar-flare, rescue",
 "alias_list": null,
 "email_address": "gordon@guardianwatch.com",
 "phone_number": "888.932.0009",
 "description": "Mobile Emergency Reporting Platform",
 "created_at": "Thu Jul 07 04:33:36 UTC 2011",
 "updated_at": "Mon Jul 11 13:53:59 UTC 2011",
 "overview": "\u003Cp\u003EGuardian Watch is the first mobile app that lets you use your smartphone camera to report an emergency. \u003C/p\u003E\n\n\u003Cp\u003EGuardian Watch is a free app that lets you send alerts and warnings in real time to public safety, your neighbors, and more\u0026#8230; live from the scene. Your GPS tells them exactly where they need to go to help.\u003C/p\u003E\n\n\u003Cp\u003EAt Guardian Watchâ„¢, our mission is to save lives around the world through visual awareness. With Guardian Watch, you can capture and report emergencies in real time, all from your phone. Send live-stream video to our secure website, provide your exact GPS location and alert 911 and local law enforcement, friends, family, and neighbors of your situation.\u003C/p\u003E\n\n\u003Cp\u003EWith Guardian Watch, you also connect through social networking by creating community network groups with whom you can share alerts designed for individuals, neighborhood watch groups, campus security, and other civic crime watch organizations. You will also find tips and guides to help you prepare in advance for emergency situations.\u003C/p\u003E\n\n\u003Cp\u003EYour home is your castle, your neighborhood is your kingdom, and you want to be safe where you live. Guardian Watch can help bring your community together to create a safe and protected environment. \u003C/p\u003E\n\n\u003Cp\u003EGuardian Watch is a free service to the public and offers the following key features:\u003C/p\u003E\n\n\u003Cp\u003EInstant Alerts: Notify public safety emergency services and your neighbors in seconds.\u003C/p\u003E\n\n\u003Cp\u003EGPS Location: Feel at ease with Guardian Watch and our GPS location system. Monitoring professionals will be able to find your location when GPS is active.\u003C/p\u003E\n\n\u003Cp\u003ELive-Stream Video: A first for emergency apps, use your smartphone camera to live-stream video of your situation to monitoring public safety and first responders giving them a visual of the scene before they get there; simultaneous two way text messaging with emergency services while live-streaming video to receive directions and provide more intelligence.\u003C/p\u003E\n\n\u003Cp\u003EReports: Document your situation, journal your story, send group emails, and post links on Facebook and Twitter to stay connected. Great for documentation purposes as well as to inform your neighborhood and crime watch groups with minute-to-minute updates. \u003C/p\u003E\n\n\u003Cp\u003EProfiles: Organize your neighborhood and/or campus into a watch or public safety group. Send invitations and connect with local public safety authorities to keep on top of important local information ensuring you, your family and your community is well prepared for any event.  \u003C/p\u003E\n\n\u003Cp\u003ESafety Guides: Find vital information and resources designed to help prepare you for emergencies and natural disasters. Our Safety Guides provide the latest and most recent resources, so when an emergency strikes, you are prepared. \u003C/p\u003E\n\n\u003Cp\u003ETo learn more about Guardian Watch, please visit : http://guardianwatch.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[132,
       148],
      "assets/images/resized/0014/2825/142825v2-max-150x150.jpg"],
     [[132,
       148],
      "assets/images/resized/0014/2825/142825v2-max-250x250.jpg"],
     [[132,
       148],
      "assets/images/resized/0014/2825/142825v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President \u0026 CEO",
    "person":
     {"first_name": "Gordon",
      "last_name": "Jones, DHA",
      "permalink": "gordon-jones-dha",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": " 1030 Stevens Creek Road",
    "address2": "",
    "zip_code": "30907",
    "city": "Augusta",
    "state_code": "GA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}