{"name": "Gunnar Optiks India",
 "permalink": "gunnar-optiks-india",
 "crunchbase_url": "http://www.crunchbase.com/company/gunnar-optiks-india",
 "homepage_url": "http://www.gunnars.co.in/",
 "blog_url": "http://blog.gunnars.co.in",
 "blog_feed_url": "",
 "twitter_username": "GunnarIndia",
 "category_code": "games_video",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "computer-eyewear, gaming-eyewear, 3d-glasses, outdoor-eyewear, eye-strain",
 "alias_list": null,
 "email_address": "gunnaroptiks123@gmail.com",
 "phone_number": "912222642644",
 "description": "computer \u0026 Gaming Eyewear",
 "created_at": "Thu Apr 04 06:18:39 UTC 2013",
 "updated_at": "Thu May 30 18:10:04 UTC 2013",
 "overview": "\u003Cp\u003EGUNNAR started in the garage of one of its co-founders, Jenny Michelsen.\u003C/p\u003E\n\n\u003Cp\u003EThe idea for the glasses was born out of one woman’s frustration with her husband’s digitally induced migraines and worry about the eyes of her child who was fascinated by technology. Jenny Michelsen’s husband, Matt, was suffering from the headaches he had after hours sitting in front of six computer screens. The headaches, the Michelsens would learn, were a symptom of Computer Vision Syndrome, a collection of minor ailments that build up over time.\u003C/p\u003E\n\n\u003Cp\u003EAs the Rancho Santa Fe woman urged her husband to see a doctor, she wondered whether her 3-year-old son, Gunnar, was getting a jump-start on similar problems. If she and her husband believed the computers were getting to their eyes – and they didn’t start using electronics until they were in their 20s – what would happen to Gunnar’s generation? An estimated 125 million Americans suffer from what is now commonly referred to as Digital Eye Fatigue or Computer Vision Syndrome (CVS), according to the American Optometric Association.\u003C/p\u003E\n\n\u003Cp\u003EMatt and Jenny Michelsen reached out to their close friend, Joe Croft, a former Oakley engineer, about the issues surrounding CVS. They wanted to learn more about the effects of focusing on a digital image projected on a screen just inches from one’s face for hours at a time and years on end. The Crofts and the Michelsens began their five-year road to launch by talking to medical experts. One of those experts was Dr. Jeffrey Anschel, a Carlsbad optometrist who has become an expert in Computer Vision Syndrome and Visual Ergonomics. He noticed the problem about 17 years ago when employees of a nearby computer company began complaining about dry and tired eyes and difficulty focusing. They were problems that people generally didn’t experience until they were in their 40s, but these patients were in their early 30s. It didn’t take him long to make the connection between their work and the required time spent in front of a computer screen. “You can work, shop, communicate and do just about everything from your computer now, and people just don’t realize how much time they’re spending looking at the screen. The digital images that computers project are one factor contributing to Computer Vision Syndrome. The eye focuses on the hard edge of an image, but digital images don’t have a clean edge. As a result, the focus drifts forward and back, causing eye fatigue.” Anschel also noted, “that when people spend long periods focusing on something close to their face, eye muscles tend to lock into a singular position, which is tiring and can push the eye down the path to becoming farsighted. Meanwhile, the eye has to deal with light from conflicting sources, such as sunlight, that are much brighter than the computer screen. There’s also glare from the light shining into the eyes. And the angle of view for the computer screen, which is straight ahead, isn’t desirable. People tend to focus better at objects when looking down, such as reading a book.”\u003C/p\u003E\n\n\u003Cp\u003ECroft and Michelsen eventually took a prototype to Anschel and explained the important components of the glasses. They had amber-tinted lens, which make images appear clearer. Yellow makes images sharper by adding contrast and filtering out blue light. The lens is also shaped to pre-focus the light into the eyes, so the eyes don’t have to do all the work. There’s also an anti-glare filter that allows light from the computer in but keeps out distracting reflected light from other sources. The lenses are also designed to be fitted close to the face, creating a “micro-climate” that keeps away the dry air currents. This helps keep eyes moist by reducing squinting and maintaining a closer-to-normal rate of blinking – a leading cause of dry eyes.\u003C/p\u003E\n\n\u003Cp\u003ECroft and Michelsen set out to create a product that addresses the issues associated with digital eye-strain. They completed their first prototype in 2006. In early 2007, they founded the company and in October of 2008 they launched their first product. Investors in the company include Peter Thiel (a founder of Pay Pal and early investor in FaceBook), 50 Cent, Carl Zeiss Vision, Monster, Inc., Christopher Burch and Happy Madison Productions.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[77,
       53],
      "assets/images/resized/0024/7575/247575v2-max-150x150.jpg"],
     [[77,
       53],
      "assets/images/resized/0024/7575/247575v2-max-250x250.jpg"],
     [[77,
       53],
      "assets/images/resized/0024/7575/247575v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Sheadog Crystalline",
    "permalink": "sheadog-crystalline",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "Web designing \u0026 hosting",
    "is_past": false,
    "provider":
     {"name": "Designscape",
      "permalink": "designscape",
      "image": null}},
   {"title": "Marketing",
    "is_past": false,
    "provider":
     {"name": "Indian Video Gamers",
      "permalink": "indian-video-gamers",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Gunnar Optiks",
    "address1": "199, Ashoka Shopping Center, 2nd Floor, L.T.Marg,",
    "address2": "Mumbai - 400 001. INDIA.",
    "zip_code": "400001",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": 18.9346619,
    "longitude": 72.8367776}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"450\" height=\"253\" src=\"http://www.youtube.com/embed/BjmcKljeRz8?list=UU4IaCT4KF4tL_o0U0xpyu5g\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003ETake Your Vision to the Next Level\u003C/p\u003E"},
   {"embed_code": "\u003Ciframe width=\"450\" height=\"253\" src=\"http://www.youtube.com/embed/EoQPRuS7Go0\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EWhy You Need GUNNARS?\u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[150,
        84],
       "assets/images/resized/0024/7574/247574v2-max-150x150.jpg"],
      [[250,
        140],
       "assets/images/resized/0024/7574/247574v2-max-250x250.jpg"],
      [[450,
        253],
       "assets/images/resized/0024/7574/247574v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.indiainfoline.com/Markets/News/GUNNAR-Optiks-to-launch-nationwide-in-India/5468739738",
    "title": "Gunnar Optiks India"}]}