{"name": "Gurneh International",
 "permalink": "gurneh-international",
 "crunchbase_url": "http://www.crunchbase.com/company/gurneh-international",
 "homepage_url": "http://www.indiamart.com/gurnehinternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "gurnehinternational@tradepassport.org",
 "phone_number": "9999910013",
 "description": "manufacturing, supplying \u0026 exporter",
 "created_at": "Fri Apr 05 05:01:14 UTC 2013",
 "updated_at": "Fri Apr 05 05:01:17 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1996, at New Delhi (India), we, “Gurneh International,”is one of the leading companies engaged in the manufacturing, supplying \u0026amp; exporting of Sherwani, Indo Western Suit, Designer Suit, Kurta Pyjama, Stole, Trouser, Shirt, Women Wear \u0026amp; Wedding Accessories, etc. We offer our huge collection of designer Sherwani \u0026amp; Suits under the brand name of “DEEPINDER SINGH” in domestic as well as foreign markets.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe pay immense attention in manufacturing our entire assortments in order to provide clients with supreme quality products. In order to ensure the flawless delivery of our products, we follow strict quality measurements, which are performed by our skilled quality controllers.\u003C/p\u003E\n\n\u003Cp\u003EOur Production Unit:\nThe production unit is located in the historic city of Delhi, the India s capital  and covered area about 10000sq.ft. It is equipped with variety of machines (imported as well as indigenous) that weave beautiful dreams of our client. We are in this line from the last 11 years with rich experience.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOwing to our meticulous efforts, we have established ourselves strongly in the international market. Backed by skilled and experienced craftsmen, we are able to design our wide range of garments in compliance with client specifications. We have highly experienced quality auditors, who check the entire range on well-defined parameters to ensure flawless products.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nThe key features of our organization that have kept us ahead of our competitors in the industry are superior-quality products, reasonable prices, client-oriented approach and timely delivery. Due to our ethical business policies and loyal \u0026amp; transparent dealings, we have become the preferred choice of clients. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[119,
       125],
      "assets/images/resized/0024/8227/248227v2-max-150x150.jpg"],
     [[119,
       125],
      "assets/images/resized/0024/8227/248227v2-max-250x250.jpg"],
     [[119,
       125],
      "assets/images/resized/0024/8227/248227v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}