{"name": "Gurudev Forgings",
 "permalink": "gurudev-forgings",
 "crunchbase_url": "http://www.crunchbase.com/company/gurudev-forgings",
 "homepage_url": "http://www.indiamart.com/gurudevforgingsengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hex-bolts, half-thread-bolts, heavy-hex-bolts, t-bolts, l-bolts, u-bolts-and-carriage-bolts-",
 "alias_list": null,
 "email_address": "gurudevforgingsengineering@tradepassport.org",
 "phone_number": "9825598164",
 "description": "Manufacturer and supplier  ",
 "created_at": "Fri Apr 05 07:25:16 UTC 2013",
 "updated_at": "Fri Apr 05 07:25:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2000, we, “Gurudev Forgings \u0026amp; Engineering”, are a prominent firm, engaged in manufacturing and supplying wide assortment of optimum grade Metal Bolts, J Bolts, Metal Studs, Metal Rods, Forged Fasteners and Foundation Bolts. Under this range, we are offering Hex Bolts, Half Thread Bolts, Heavy Hex Bolts, T Bolts, L Bolts, U Bolts and Carriage Bolts. In this range, we offer Combo Head Bolts, Hex Flange Bolts, Round Head Bolts, Full Threaded Studs, Galvanized Studs and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur organization is backed by a team of experienced professionals, which enables us to come up with the qualitative range of Metal Bolts, J Bolts, Metal Studs, Metal Rods, Forged Fasteners and Foundation Bolts. Hired by a strict selection process, these professionals are well-versed with the entire process of this domain. Furthermore, our team of dedicated employees enables us to meet the every minute requirements of the esteemed customers. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nIt’s the quality of our offered array of Metal Bolts, J Bolts, Metal Studs, Metal Rods, Forged Fasteners and Foundation Bolts, which distinguish us from the other industry counterparts. To offer our customers superior-grade forged products, our professionals make use of optimum quality raw material, which is obtained from the most trusted vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have constructed a safe \u0026amp; sound infrastructure, which equipped us to manufacture and supply a comprehensive range of Metal Bolts, J Bolts, Metal Studs, Metal Rods, Forged Fasteners and Foundation Bolts. Our facility, which spreads over large area of land is installed with the latest machinery and cutting-edge technology. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nMetal Bolts, J Bolts, Metal Studs, Metal Rods, Forged Fasteners and Foundation Bolts. Under this range, we are offering Hex Bolts, Half Thread Bolts, Heavy Hex Bolts, T Bolts, L Bolts, U Bolts and Carriage Bolts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8382/248382v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8382/248382v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8382/248382v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}