{"name": "GWC Valve International",
 "permalink": "gwc-valve-international",
 "crunchbase_url": "http://www.crunchbase.com/company/gwc-valve-international",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "GWCInternation",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "internationalgwcvalve@yahoo.com",
 "phone_number": "",
 "description": "GWC Valve International",
 "created_at": "Mon Jul 23 12:21:55 UTC 2012",
 "updated_at": "Tue Mar 19 08:03:02 UTC 2013",
 "overview": "\u003Cp\u003EGWC Valve International understands that in today\u0026#8217;s economy there is a tendency to want to \u0026#8220;skimp\u0026#8221; on the expense of components to construct any industrial project. This is exactly opposite of the most prudent course of action for any company wanting to turn a profit.\u003C/p\u003E\n\n\u003Cp\u003EWhether your project is for the petrochemical, mining, marine, or power and engineering industries, the components you use will directly affect your bottom line. These industries tend to need components like line valves more than any other. Instead of trying to minimize costs and endanger the success of your project, seek out a valve manufacturer that has a proven record of producing reliable, quality service and products.\u003C/p\u003E\n\n\u003Cp\u003EFor any need from CapEx projects, to OEM, MRO and fabrication needs, you should always seek a valve manufacturer that is known for versatility, industry \u0026#8220;know-how\u0026#8221; and the confidence to guarantee their valves.\u003C/p\u003E\n\n\u003Cp\u003EGWC Valve International Knows What Quality Products You Require\u003C/p\u003E\n\n\u003Cp\u003EValves are most often the smallest components of any job, but they are undoubtedly the most important. This is especially true with industries that deal with natural resources like water, gas and oil. The company that you purchase your valves from should be able to produce quality products for all types of valves. These types include GWC, ball, globe, butterfly, check and gate styles. You cannot \u0026#8220;bypass\u0026#8221; quality component construction.\u003C/p\u003E\n\n\u003Cp\u003EThe company that your operation chooses to be its main supplier of industrial valves should have a motto that conveys their reputation and philosophy. \u0026#8220;Never compromise\u0026#8221; is a great motto for a valve manufacturer to operate by. This is especially true if that valve manufacturer has been in business for nearly a century. Imagine the quality products a company like that produces. It has had to adapt, change and innovate with every need the industrialized world has presented. \u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Never compromise\u0026#8221; is the motto of a well-respected American valve manufacturer that is excited to fill your industrial orders for sturdy, reliable valves and line components. This company is based in Bakersfield, California and is competent enough to endure any economic environment and order specification. You should order valves from GWC Valve International today! \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "The Alloy Valve Stockist",
      "permalink": "the-alloy-valve-stockist",
      "image":
       {"available_sizes":
         [[[150,
            85],
           "assets/images/resized/0024/3476/243476v2-max-150x150.jpg"],
          [[250,
            141],
           "assets/images/resized/0024/3476/243476v2-max-250x250.jpg"],
          [[254,
            144],
           "assets/images/resized/0024/3476/243476v2-max-450x450.jpg"]],
        "attribution": null}}},
   {"competitor":
     {"name": "The Alloy Valve Stockist",
      "permalink": "the-alloy-valve-stockist",
      "image":
       {"available_sizes":
         [[[150,
            85],
           "assets/images/resized/0024/3476/243476v2-max-150x150.jpg"],
          [[250,
            141],
           "assets/images/resized/0024/3476/243476v2-max-250x250.jpg"],
          [[254,
            144],
           "assets/images/resized/0024/3476/243476v2-max-450x450.jpg"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}