{"name": "gyan infotech",
 "permalink": "gyan-infotech",
 "crunchbase_url": "http://www.crunchbase.com/company/gyan-infotech",
 "homepage_url": "http://www.gyaninfotech.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "gyaninfotech1",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-india, seo-company-india, seo-outsourcing-services-india, ppc-services-india, looking-seo-company-india, website-design-company-india, seo-india-companies, how-you-promite-your-website-",
 "alias_list": null,
 "email_address": "vikas.kumar.raghav@gmail.com",
 "phone_number": "9311460990",
 "description": "seo",
 "created_at": "Wed Nov 23 14:11:46 UTC 2011",
 "updated_at": "Wed Nov 23 19:47:56 UTC 2011",
 "overview": "\u003Cp\u003ESeo Company India , Seo Services Company India , Website Designing India\nGyan Infotech India is one of the fastest growing company in India. Today it comes in deliberation of the best Website and SEO Company to provide premium services at affordable prices. Gyan have a unique ability to focus on domestic as well as International market by our team of experts. We give power to people by providing learning \u0026amp; challenging environment that continually explore our corporate strengths, through innovation \u0026amp; teamwork. We utilize resources globally with an international vision and Values integrity \u0026amp; creativity. It is because of our extensive presence at Web world over the past years that we have gained superior knowledge and diversified experiences in the business, which is confirmed by a long list of references from our global clients.\u003C/p\u003E\n\n\u003Cp\u003EWe hire candidates from educational programs with basic skills such as SEO, Content Writing, web designing, web development, programming knowledge and prepare them for our future skills. We take experienced professionals from software industries for senior positions. We provide better career and future options for experienced professionals in our client services.\u003C/p\u003E\n\n\u003Cp\u003EOur Core Strengths \u0026amp; Achievements :\nOur experience in Web Optimization, Top Search Engine Rankings, Internet Marketing and SEO services in India, for all to see. Web and SEO Company- We able to prove a healthy traffic and earn more benefits business and valuable visitor stream for our client, across the world.\u003C/p\u003E\n\n\u003Cp\u003EVision and Mission\nGyan Infotech \u0026#8216;s objective is to be the world\u0026#8217;s leading Website Designing \u0026amp; Seo Services Provider, respected and trusted for its ability to create value for owners . \nWe aim to be the benchmark of integrity, ethics, customer service and excellence throughout the industry and to make a difference in your life.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0016/3748/163748v2-max-150x150.jpg"],
     [[250,
       96],
      "assets/images/resized/0016/3748/163748v2-max-250x250.jpg"],
     [[284,
       110],
      "assets/images/resized/0016/3748/163748v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "seo",
    "address1": "sector 22",
    "address2": "",
    "zip_code": "201301",
    "city": "noida",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://plus.google.com/u/0/100876517447602944645/posts",
    "title": "SEO Outsourcing Services India"}]}