{"name": "Handmade Tents",
 "permalink": "handmade-tents",
 "crunchbase_url": "http://www.crunchbase.com/company/handmade-tents",
 "homepage_url": "http://www.luxury-tents.in/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmaster@luxury-tents.com",
 "phone_number": "9460104986",
 "description": "Manufacturer, supplier, wholesaler  ",
 "created_at": "Thu Apr 04 12:11:03 UTC 2013",
 "updated_at": "Thu Apr 04 12:11:05 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Handmade Tents”, are one of the eminent names of the industry engaged in manufacturing, supplying, wholesaling and exporting superior quality Different Types of Tents. In our range, we offer Garden Tents, Luxury Tents, Raj Tents, Mughal Tents, Wedding Tents, and Camping Tents. Moreover, we offer Indian Bagicha Tents, Unique Tents, Mughal Wedding Tents, Maharaja Tents, Large Marquee Tents, Bespoke Marquee Tent and others. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe credit for our success goes to the team of experienced professionals associated with our organisation. These professionals make sure to offer genuine quality Different Types of Tents to the customers as per the market demand. They can also customise the tents for the clients exactly as per the details provided by them.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are committed to offer premium quality Different Types of Tents to the customers. The entire range of tents is designed in compliance with the international quality standards by employing the modern facilities that are available at our end. These tents are designed by a team of highly experienced \u0026amp; talented team of professionals. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur infrastructure is spread into a wide area of 2,000 square feet. This infrastructure is equipped with all the modern facilities that allow us to offer a range of superior quality Different Types of Tents. In order to streamline production \u0026amp; other related activities, we have segregated the infrastructure into different units like designing, production, quality control, warehouse and others. \u003C/p\u003E\n\n\u003Cp\u003EClient satisfaction:\nThe ultimate goal of our organisation is to attain maximum level of client satisfaction, thus, we offer excellent Different Types of Tents as per the market demand. Our team of experts has perfect knowledge of our customers’ preferences \u0026amp; demands and it makes sure to manufacture the tents accordingly. We can also customise the tents as per the exact details provided by the valued patrons. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n Moreover, we offer Indian Bagicha Tents, Unique Tents, Mughal Wedding Tents, Maharaja Tents, Large Marquee Tents, Bespoke Marquee Tent and others. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7881/247881v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/7881/247881v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/7881/247881v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}