{"name": "HarbortouchHarbor.com",
 "permalink": "harbortouchharbor-com",
 "crunchbase_url": "http://www.crunchbase.com/company/harbortouchharbor-com",
 "homepage_url": "http://harbortouchharbor.com",
 "blog_url": "http://harbortouchharbor.com/category/best-pos-system-blog/",
 "blog_feed_url": "http://harbortouchharbor.com/feed/",
 "twitter_username": "HarbortouchHarb",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@harbortouchharbor.com",
 "phone_number": "(973) 390-0852",
 "description": "POS / merchant account company",
 "created_at": "Mon Jun 10 18:07:27 UTC 2013",
 "updated_at": "Mon Jun 10 23:30:11 UTC 2013",
 "overview": "\u003Cp\u003EThe principal of HarbortouchHarbor.com, Bill Hamilton, has worked in the merchant account field since 2001.  While there are a myriad of POS solutions providers, Mr. Hamilton noticed a void in the marketplace: The lack of affordable POS solutions with low-cost, integrated credit card\nprocessing capability.  In the quest to fill this void,\nHarbortouchHarbor.com was launched, working under the auspices of their parent company, Harbortouch.  As a result, retail, restaurant, and hospitality merchants can avail themselves to the Harbortouch Elite POS system, designed to simplify and streamline business operations.\u003C/p\u003E\n\n\u003Cp\u003EThere are a variety of software packages available, dependent on the merchant\u0026#8217;s business model.  For example, retail, convenience store, liquor store, hospitality, and quick service and delivery restaurant merchants may each obtain their own unique software, catering to the specific needs of their business entity.  The commonality is that all the\nsoftware is robust, and offers extensive reporting options, inventory tracking, employee management, sales information, remote access, etc.\u003C/p\u003E\n\n\u003Cp\u003EThere is no initial charge (no down payment required) for the POS system which comes equipped with a computer, monitor, cash Drawer and receipt printer  The service contract is $69 per month (complete hardware support), and $59 per quarter, (software support) and enables merchants to get unlimited technical support and lifetime warranty of parts (conditions apply).\u003C/p\u003E\n\n\u003Cp\u003ECredit and debit card processing capability is included with the unit and all processing rates are fully disclosed.  Gift and loyalty cards are also available.     \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}