{"name": "Hardik Enterprises",
 "permalink": "hardik-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/hardik-enterprises",
 "homepage_url": "http://www.indiamart.com/hardikenterprises-faridabad/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "hardikenterprises-faridabad@tradepassport.org",
 "phone_number": "09953357712",
 "description": "Manufacturing, Trading and Supplying",
 "created_at": "Fri Apr 05 04:45:48 UTC 2013",
 "updated_at": "Fri Apr 05 04:45:51 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, at Faridabad (Haryana, India), “Hardik Enterprises”, is emerging as the trusted manufacturing, trading and supplying in the market. We offer an extensive range of high quality Steel Pipes, All Types of Steel Tubes, Industrial Flanges, Pipe Fittings Butt-Weld \u0026amp; Socket Weld Fittings in Alloy Steel, Carbon Steel, Stainless Steel, etc. \u003C/p\u003E\n\n\u003Cp\u003EVision:\n    To achieve maximum customer satisfaction and set highest standards in manufacturing, product development and all other domains of our business.\n    To be an industry leader in all our operations.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nAt Hardik Enterprises, quality is our specialty. We use latest technology machines and comprehensive quality control systems to ensure that our customers get exactly what they want. Our commitment towards quality has earned us huge accolades from our clients and has helped us to carve a niche for ourselves.\u003C/p\u003E\n\n\u003Cp\u003EStrengths:\nA strong, intelligent and dedicated team of highly qualified and experienced professionals is the asset of the company.\u003C/p\u003E\n\n\u003Cp\u003ETeam of Experts:\nOur sophisticated manufacturing facilities are supported by a team of experienced technical and non-technical personnel who take care of various aspects of production system \u0026amp; overall operations. We recruit our team on the basis of their skills and vast industrial experience who are highly dedicated towards our organization.\u003C/p\u003E\n\n\u003Cp\u003EOur Efforts:\nWe have set a goal of maximizing profits through customer satisfaction. Our quality controllers keep an alert eye on the production process from the sourcing of raw material to the end product. As an expected outcome, our products are greatly praised for their high quality and durability.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8211/248211v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8211/248211v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8211/248211v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}