{"name": "Haritwal Industries",
 "permalink": "haritwal-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/haritwal-industries",
 "homepage_url": "http://www.indiamart.com/haritwalindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "haritwalindustries@tradepassport.org",
 "phone_number": "9810087563",
 "description": "Manufacturers and Suppliers",
 "created_at": "Fri Apr 05 13:05:05 UTC 2013",
 "updated_at": "Fri Apr 05 13:05:08 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in the year 2009, we, “Haritwal Industries”, has been proving its excellence in designing customized multicolor Offset Printed Cartons and boxes for a wide range of packing applications covering a large number of customers across the nation. We have an exclusive assortment of Multicolor Offset Printed Cartons, Corrugated Cartons and Boxes, Adhesive Stickers, Barcodes Labels, Catalogue and Paper Bags etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nSince we are backed by well-equipped infrastructural unit we are able to attain efficient and flawless production. We have a spacious factory unit wherein we encompass all the facilities those are required for qualitative production.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are blessed with a talented workforce in our organization. Our highly skilled professionals, having expertise in their respective domain, are constantly working hard to fulfill the objectives of our organization. The experts working with us are updated with every pros and cons of their specialized departments, which benefit in undertaking and completing even the challenging tasks very easily and perfectly.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nAs a customer-centric organization, we have set high standards of quality for ourselves so as to satisfy our clients. Quality for us is a higher factor, which sets us apart from our counterparts in the industry. The offered collection is fabricated in compliance with set industrial norms using supreme class factor inputs and latest techniques. \u003C/p\u003E\n\n\u003Cp\u003EApplication Areas:\n    Stainless Steel Pet Products\n    Liquor Products\n    Pharmaceutical\n    Electronic Industries\n    Publishing and Printing houses\n    Garment Exporters\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nClient satisfaction is the first and foremost objective of our organization and we are striving hard to reach the client\u0026#8217;s expectations by offering our products as per their requirements. Owing to our quality assurance policy and client centric approach, we are able to satisfy our clients by offering them best quality products.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8673/248673v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8673/248673v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8673/248673v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}