{"name": "Haryana Industries",
 "permalink": "haryana-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/haryana-industries",
 "homepage_url": "http://www.indiamart.com/haryanaindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "natural-dana, ldpe-dana, milky-dana, black-drum-hdpe-dana, blue-drum-hdpe-dana",
 "alias_list": null,
 "email_address": "haryanaindustries@tradepassport.org",
 "phone_number": "7503492322",
 "description": "We are identified as a prominent manufac",
 "created_at": "Thu Apr 04 09:19:33 UTC 2013",
 "updated_at": "Thu Apr 04 09:19:37 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2000, at Bawana (Delhi, India), we, “Haryana Industries”, are a leading Manufacturer and Supplier of superior quality range of HDPE Granules, LDPE Natural Transparent, LDPE Dana, Natural Dana, HDPE Dana, and Milky Dana. Our exclusive range includes Plastic Dana, Natural Dana, LDPE Dana, Milky Dana, Black Drum HDPE Dana, Blue Drum HDPE Dana, etc. The offered range of granules is manufactured using supreme quality plastic and other raw material which is procured from the most reliable vendors of the industry. These are fabricated using the latest technology in complete compliance with international quality standards. The offered granules are broadly acclaimed for their purity, durability, optimum performance and low melting point. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nSince the establishment of our organization, quality has always been our prime objective. Our highly skilled team of quality experts makes us efficient in delivering best quality range of granules to our esteemed clients. The offered granules are manufactured under the strict supervision of our quality controllers in complete compliance with the preset quality norms. Our quality controllers strictly monitor the different stages of production processes, right from procurement of raw material till the final dispatch of products at the clients\u0026#8217; end. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Facilities:\nWe have a high-tech manufacturing unit that spreads over a huge area of land and is well-equipped with advance manufacturing technologies and machines which enables us to manufacture the qualitative ranges of granules. We have segregated this unit into several sub-departments such as manufacturing, quality control, research \u0026amp; development, warehouse \u0026amp; packaging, sales \u0026amp; marketing, etc. to ensure hassle free and precise day-to-day operations. Our infrastructural facilities have enabled us to provide our clients with nothing but the best. \u003C/p\u003E\n\n\u003Cp\u003ETeam of Experts:\nOur highly qualified and diligent team of professionals helps us in offering best quality granules to our valuable clients, in complete compliance with international quality standards. Our professionals have vast industry experience and knowledge which enables us in meeting the variegated needs of our valuable clients. We have hired these professionals on the basis of their academic records, experience and expertise in their respective domain. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nOur exclusive range includes Plastic Dana, Natural Dana, LDPE Dana, Milky Dana, Black Drum HDPE Dana, Blue Drum HDPE Dana, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7745/247745v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7745/247745v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7745/247745v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}