{"name": "Hawaii Keller Williams Realty",
 "permalink": "hawaii-keller-williams-realty",
 "crunchbase_url": "http://www.crunchbase.com/company/hawaii-keller-williams-realty",
 "homepage_url": "http://www.pacifichomeshawaii.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 125,
 "founded_year": 2006,
 "founded_month": 6,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hawaii, real-estate, honolulu, oahu, keller, williams, realty",
 "alias_list": null,
 "email_address": "Ross@Hawaii.rr.com",
 "phone_number": "808-220-7884",
 "description": "Hawaii Real Estate Company",
 "created_at": "Thu Dec 13 15:34:06 UTC 2012",
 "updated_at": "Thu Apr 11 06:35:29 UTC 2013",
 "overview": "\u003Cp\u003EWe are a full service Hawaii real estate brokerage firm that has a team of professional and experienced Hawaii real estate agents who are both willing and able to assist you in your Hawaii real estate endeavors. Hawaii real estate is alive and well right now. There are thousands of Hawaii real estate listings, Hawaii homes for sale, and Hawaii properties for sale currently on the market and new ones being added daily. This Hawaii real estate website is designed to make it very easy for you to find the exact Hawaii homes for sale and Hawaii properties for sale that you are looking for. If you register on our site, we even allow you to search for recent Hawaii homes for sale price drops and upcoming Open Houses for Hawaii properties for sale in specific neighborhoods.\u003C/p\u003E\n\n\u003Cp\u003EOur team of Hawaii real estate agents have multiple years of experience underneath them and have successfully aided hundreds of buyers and sellers such as yourself with their Hawaii real estate transactions. We also have several Hawaii real estate agents who are multi-lingual and who can communicate fluently in Chinese, Japanese, Spanish, Korean, Pilipino, and English. Whatever your Hawaii real estate needs are, we will represent you in the professional manner that you deserve.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Keller Williams Realty",
    "address1": "725 Kapiolani Blvd C302",
    "address2": "",
    "zip_code": "96813",
    "city": "Honolulu",
    "state_code": "HI",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}