{"name": "Hawaiicarrentals",
 "permalink": "hawaiicarrentals",
 "crunchbase_url": "http://www.crunchbase.com/company/hawaiicarrentals",
 "homepage_url": "http://www.hawaiicarrentals.net/",
 "blog_url": "http://www.hawaiicarrentals.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "vacation-car-rental-hawai, hawai-vacation-car-rental, car-hire-hawaii, hawaii-car-hire, hawaii-car-rentals, hawaii-car-rental, hawaii-rental-cars",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Discount Hawaii Car Rentals",
 "created_at": "Tue Jul 13 11:00:14 UTC 2010",
 "updated_at": "Mon Jul 19 15:21:04 UTC 2010",
 "overview": "\u003Cp\u003EOpt for Vacation Car Rental Hawaii for a Relaxed Journey\u003C/p\u003E\n\n\u003Cp\u003ECar rentals can take the Hawaii vacation traveler to all the nooks, corners, and hidden places on the Islands of Hawaii. They are just perfect for sightseeing purposes. Explore the place at your own pace. These rental services are the best option for fun drives to all the popular sites of Hawaii. Rental cars do not follow any fixed schedule unlike bus and shuttle services. No need to wake up early in the morning to make it to the bus or shuttle setting off for sightseeing. Drive at any part of the day on your schedule. Visit the same place twice in the same day. This may not be possible while traveling in a tourist bus or island shuttle.\u003C/p\u003E\n\n\u003Cp\u003ESightseeing buses and shuttles restrict your visit to only a few places of attractions listed on travel brochures. Make interesting discoveries by driving beyond the conventional routes highlighted on tourist maps. Be it late night or early morning, see Hawaiian sandy beaches and feel the refreshing breeze in rented cars. Vacation car rentals allow you to travel in comfort and privacy. Drive down unknown paths and enjoy scenic beauty on the way. This is not possible in a bus since they need to stick to particular travel routes.\u003C/p\u003E\n\n\u003Cp\u003EHawaii is an excellent travel option for those who have a knack for photography. Stop as soon as you find any desired landscape or object to capture an image. Get an opportunity to experience local flavors, culture, and people. Meet a lot of locals on your way and study their dialect and language. Stop at local eating joints and taste some local food. All these experiences will help in making a memorable journey.\u003C/p\u003E\n\n\u003Cp\u003EOffering cars that best suit one\u0026#8217;s travel need, offering services of top notch car rentals in Hawaii. Get quality cars at the most affordable prices. Hawaii Car Rentals provides cost-effective rental cars for enjoying your vacations. The best part is that you can book your desired car with no pre-payment. This website allows access to car reservations at your convenience. Choose from a wide range of cars without making any effort.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       20],
      "assets/images/resized/0009/3203/93203v2-max-150x150.jpg"],
     [[250,
       34],
      "assets/images/resized/0009/3203/93203v2-max-250x250.jpg"],
     [[450,
       62],
      "assets/images/resized/0009/3203/93203v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Cobject width=\"500\" height=\"306\"\u003E\u003Cparam name=\"movie\" value=\"http://www.youtube.com/v/sJCi0HEvWDM\u0026amp;hl=en_US\u0026amp;fs=1\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"http://www.youtube.com/v/sJCi0HEvWDM\u0026amp;hl=en_US\u0026amp;fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"500\" height=\"306\"\u003E\u003C/embed\u003E\u003C/object\u003E",
    "description": "\u003Cp\u003EIf you are looking to rent a car for your vacation in Maui, Hawaii, look no further than Hawaii Car Rentals. We offer cheap luxury rental cars in Maui, Kauai, Oahu, Honolulu, Kona, Hilo, Molokai, Big Island \u0026amp; Lihue from Avis, Budget, Dollar, Thrifty \u0026amp; Ent\u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[150,
        70],
       "assets/images/resized/0009/4087/94087v2-max-150x150.png"],
      [[229,
        107],
       "assets/images/resized/0009/4087/94087v2-max-250x250.png"],
      [[229,
        107],
       "assets/images/resized/0009/4087/94087v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}