{"name": "Heart Rate Watch Company",
 "permalink": "heart-rate-watch-company",
 "crunchbase_url": "http://www.crunchbase.com/company/heart-rate-watch-company",
 "homepage_url": "http://www.heartratewatchcompany.com/",
 "blog_url": "http://blog.heartratewatchcompany.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": 150,
 "founded_year": 2006,
 "founded_month": 10,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sports, sports-gadgets, sports-watches, sports-equipment",
 "alias_list": null,
 "email_address": "heartratewatchcompany@gmail.com",
 "phone_number": "(406) 425-2742",
 "description": "sports watch seller",
 "created_at": "Fri Sep 14 11:42:56 UTC 2012",
 "updated_at": "Thu Sep 20 22:29:26 UTC 2012",
 "overview": "\u003Cp\u003EHeart Rate Watch Company sells electronic and sports gadgets and related equipment.\u003C/p\u003E\n\n\u003Cp\u003ERusty Squire is the founder of the Heart Rate Watch Company and was the first skier in history to ski more than 300,000 vertical feet in one day when he set a world record at Big Sky, Montana making 220 runs by helicopter to raise money for kids with cancer. Rusty is a former member of the U.S. Ski Team, a three-time NCAA All-American, and a former national caliber cyclist and triathlete.\u003C/p\u003E\n\n\u003Cp\u003ERusty also finished second with legendary extreme skier Doug Coombs in the 1994 ESPN \u0026#8220;24 Hours of Aspen\u0026#8221; and finished 2nd in the World Iron Skier Championships.\u003C/p\u003E\n\n\u003Cp\u003ERusty has worked on multiple feature ski films, did a ski tips segment for the Outdoor Life Network (Versus), has appeared dozens of time on ESPN, was featured in Esquire magazine, has appeared in dozens of advertisements and has appeared in dozens of other periodicals in an outdoor career spanning three decades.\u003C/p\u003E\n\n\u003Cp\u003ERusty has also worked with and coached hundreds of aspiring athletes over the years, many who went on to successful careers in  international competition. \u003C/p\u003E\n\n\u003Cp\u003EOur Goal Is Simple: To provide you with the highest quality customer service and to answer your questions personally, so that you get the right product that will best fit your needs. In fact, we don\u0026#8217;t outsource any customer service and most of the time when you call you\u0026#8217;ll probably get Rusty on the phone. This way you can get your questions answered in real-time by an expert who has been a world-class athlete and knows both physical conditioning and the products backwards and forwards.\u003C/p\u003E\n\n\u003Cp\u003EToo many American businesses don\u0026#8217;t feel this way about customer service - sad, but true. So, they send you to a foreign country where you get put on hold, can barely understand the other party, and when you do get a live person they perhaps are not that well versed in the topic at hand. We believe customer service starts at the top and stays there. It is a unique approach in today\u0026#8217;s cost-cutting world, but we feel the extra effort is worth it because we get to stay close to you - our valued customers.\u003C/p\u003E\n\n\u003Cp\u003EIt\u0026#8217;s extra work for us but we think you are worth it!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder, CEO",
    "person":
     {"first_name": "Rusty",
      "last_name": "Squire",
      "permalink": "rusty-squire",
      "image": null}},
   {"is_past": true,
    "title": "Marketing Manager",
    "person":
     {"first_name": "Rosa",
      "last_name": "Michelle",
      "permalink": "rosa-michelle",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "5195 Copeland Lane",
    "address2": "",
    "zip_code": "59715",
    "city": " Bozeman",
    "state_code": "MT",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.heartratewatchcompany.com/",
    "title": "Heart Rate Watch Company"}]}