{"name": "Hem Packaging",
 "permalink": "hem-packaging",
 "crunchbase_url": "http://www.crunchbase.com/company/hem-packaging",
 "homepage_url": "http://www.indiamart.com/hempackaging/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "hempackaging@tradepassport.org",
 "phone_number": "08377807940",
 "description": "manufacturing, supplying and exporting",
 "created_at": "Fri Apr 05 15:10:14 UTC 2013",
 "updated_at": "Fri Apr 05 15:10:20 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1991, we, \u0026#8220;HEM PACKAGING\u0026#8221; has carved a strong niche for us in the market arenas by manufacturing \u0026amp; supplying an extensive range of Corrugated Box, Paper Bag, Ball Pen, Marker and Printing Service etc. Moreover, we started exporting products such as Exercise Book, Writing Pad, PP Twine wire Pad \u0026amp; Alba Pen since 2011. In addition to these we are also obliged in offering Printing Services to our clients as per their requirements.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have hired for ourselves a team of professionals who are well versed in their organizational work-phases. Our teams of skilled professionals as well as labors have been efficiently trained in their work areas. They are fully aware of the processing and so far have kept up the standards of productions in a very organized manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Facilities:\nWe have a spacious state-of-the art-infrastructure and one of the largest manufacturing units in the country equipped with latest machinery and other equipments. We strive to take care of people health at global level. We have a team of experienced professionals engaged in manufacturing Packaging material \u0026amp; Stationary with a blend of latest science and technology.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe are a quality conscious organization and our offered range of Corrugated Box, Paper Bag, Ball Pen, Marker and Printing Service etc Items has been in wide demand by many of our consistent customers for its assured quality only. We have manufactured our products as per the guidelines of the industry and the requirements of the clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are a coveted firm who are indulged in the making of this range of Corrugated Boxes and Packaging materials, and to carry out smooth business processing of the same, we have developed for ourselves a wide and sprawling infrastructure.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8812/248812v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8812/248812v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8812/248812v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}