{"name": "Hevan Inc",
 "permalink": "hevan-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/hevan-inc",
 "homepage_url": "http://www.hevan.net",
 "blog_url": "http://hevaninc.tumblr.com",
 "blog_feed_url": "",
 "twitter_username": "hevan_net",
 "category_code": "web",
 "number_of_employees": 3,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business, startup, entrepreneurship, innovation, investing, developing, marketing, managing, social",
 "alias_list": null,
 "email_address": "evan@hevan.net",
 "phone_number": "9726898985",
 "description": "Business Social Network",
 "created_at": "Tue Mar 19 17:51:51 UTC 2013",
 "updated_at": "Tue Mar 19 17:51:57 UTC 2013",
 "overview": "\u003Cp\u003EHevan is a social network that helps you become an entrepreneur. We allow you to simply share, grow, and join the next big startup. Hevan is for everyone from innovators and investors, to developers and marketers who are looking for someone to compliment them in a business venture. \u003C/p\u003E\n\n\u003Cp\u003EUpon joining HEVAN and completing your free registration, you will characterize yourself by your greatest attribute that you feel can help a business succeed. This attribute will come to define your personal card and help to efficiently match you up with the people you are looking for and the types of projects that fit you best. \u003C/p\u003E\n\n\u003Cp\u003EAfter you have completed registration, you will be taken to your personal card. This card is essentially your profile page by which other users will get to know you and view your bio, qualifications, and previous business experiences. Everything on your profile is customizable, so be sure to keep it updated with the “Edit Menu”. The easy to use Edit Menu allows you to quickly change your profile picture, update your experiences, list websites, and link business profiles to your account.\u003C/p\u003E\n\n\u003Cp\u003EAs soon as your personal card is up-to-date you will want to jump right into exploring all of the great features that HEVAN has to offer. The main navigation on every page allows you to easily begin browsing existing projects and businesses. Projects can be filtered by the category that they fit into, the date that they were created, or by the name of the project or its creator. When you come across an interesting project, be sure to visit the creators profile page and add them to your collection of cards.\u003C/p\u003E\n\n\u003Cp\u003EAdding a user to your collection of cards is the best way to keep track of what your connections are up to and allows you to easily navigate back to their profile or to their active projects. While on a users profile, or “card” page, simply use the menu located below the users name in order to add them to your card collection or send them a quick message. You can also use the similarly located navigation on a project page to add it to your “favorite projects”.\u003C/p\u003E\n\n\u003Cp\u003EYou can then choose to create your very own project based on a great idea that you have or you can browse existing projects to discover ones that interest you. Each project has its very own forum where users can socially interact and help to evolve their idea into a solid business plan. If you feel you would be a good fit for the business, create a proposal to the project creator to either claim equity in that future business or submit a freelance bid. When you’re ready, HEVAN then creates the business for you.\u003C/p\u003E\n\n\u003Cp\u003EOnce all 100% of the equity in the business has been claimed and a $400 start-up fee is paid to HEVAN, we will legally create the business for you.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "CEO",
    "person":
     {"first_name": "Evan",
      "last_name": "Hanson",
      "permalink": "evan-hanson",
      "image": null}},
   {"is_past": true,
    "title": "Developer",
    "person":
     {"first_name": "Glenn",
      "last_name": "Potter",
      "permalink": "glenn-potter",
      "image": null}},
   {"is_past": true,
    "title": "Designer",
    "person":
     {"first_name": "Wes",
      "last_name": "Larsen",
      "permalink": "wes-larsen",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Dallas",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        86],
       "assets/images/resized/0024/3666/243666v2-max-150x150.png"],
      [[250,
        143],
       "assets/images/resized/0024/3666/243666v2-max-250x250.png"],
      [[450,
        258],
       "assets/images/resized/0024/3666/243666v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        131],
       "assets/images/resized/0024/3667/243667v2-max-150x150.png"],
      [[250,
        218],
       "assets/images/resized/0024/3667/243667v2-max-250x250.png"],
      [[450,
        393],
       "assets/images/resized/0024/3667/243667v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        68],
       "assets/images/resized/0024/3668/243668v2-max-150x150.png"],
      [[250,
        114],
       "assets/images/resized/0024/3668/243668v2-max-250x250.png"],
      [[450,
        206],
       "assets/images/resized/0024/3668/243668v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        87],
       "assets/images/resized/0024/3669/243669v2-max-150x150.png"],
      [[250,
        146],
       "assets/images/resized/0024/3669/243669v2-max-250x250.png"],
      [[450,
        263],
       "assets/images/resized/0024/3669/243669v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.hevan.net",
    "title": "Hevan"}]}