{"name": "Hindavi Technologies",
 "permalink": "hindavi-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/hindavi-technologies",
 "homepage_url": "http://www.hindavi.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 40,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo, sem, ppc, digital-marketing, seo-service, seo-india, seo-service-pune, offshore-seo-services, seo-company, internet-marketing, offshore-seo-company-pune, search-engine-optimization-pune, seo-company-india",
 "alias_list": null,
 "email_address": "hindavi09@gmail.com",
 "phone_number": "02024215324",
 "description": "Hindavi Technologies is an award winning",
 "created_at": "Thu Jun 14 06:38:02 UTC 2012",
 "updated_at": "Sun Jun 17 14:11:52 UTC 2012",
 "overview": "\u003Cp\u003EHindavi Technologies is an award winning ISO 9001:2008 certified IT Services Company offering Solutions on technologies for the Web, Mobile, Open Source, Mainframe, Embedded, Cloud Computing and Business Intelligence.\u003C/p\u003E\n\n\u003Cp\u003EHindavi has catered result-oriented and cost-effective Solutions to clients across the US, UK, Middle East, Europe, Australia and APAC regions. With a strong team of diversely skilled domain experts and IT pioneers, Hindavi has successfully delivered over 300 Projects since inception.\u003C/p\u003E\n\n\u003Cp\u003EHindavi takes pride in delivering solutions that are aligned with the strategic intent of clients and hence has been tremendously successful in fostering long term business relationships across the globe. Our fundamental philosophy of putting client success above the rest has enabled us to stay committed and deliver maximum value to our clients.\u003C/p\u003E\n\n\u003Cp\u003EHindavi co-exists with medium enterprises, large global corporations and new generation start-up companies. At Hindavi, we let our clients focus on their core business while we take care of their technological requirements. Our solutions assist organizations to optimize their business processes cost effectively without compromising on key matrix parameters like Budget, Quality and Time. With the combination of our domain expertise and competitive pricing, our business model delivers enhanced productivity resulting in cost savings of up to 50% and faster turnaround time.\u003C/p\u003E\n\n\u003Cp\u003EBy using our global-source offshore model, clients enjoy various benefits such as increased resource scalability, access to the vast technology pool and our state of the art infrastructure. With the scalability and flexibility to support long-term growth, Hindavi\u0026#8217;s IT solutions provide a single point of accountability to promote rapid return on investment and low total cost of ownership.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[105,
       149],
      "assets/images/resized/0019/5427/195427v2-max-150x150.png"],
     [[105,
       149],
      "assets/images/resized/0019/5427/195427v2-max-250x250.png"],
     [[105,
       149],
      "assets/images/resized/0019/5427/195427v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}