{"name": "Hiremall",
 "permalink": "hiremall",
 "crunchbase_url": "http://www.crunchbase.com/company/hiremall",
 "homepage_url": "http://www.hiremall.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 12,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "freelance-marketplace, outsourcing, freelancing, projects, jobs, buyer, provider",
 "alias_list": null,
 "email_address": "support@hiremall.com",
 "phone_number": "55433223322",
 "description": "Freelance Database ",
 "created_at": "Mon Oct 15 08:37:22 UTC 2012",
 "updated_at": "Tue Oct 23 21:04:31 UTC 2012",
 "overview": "\u003Cp\u003EHiremall.com is a place where businesses connect with professionals to get work done professionally and in a cost-effective way.Its an online services marketplace both buyers and providers offering a platform to Small Medium Businesses \u0026amp; Entrepreneurs looking for options to outsource or offshore. We provides quick and easy access to freelance talent. We currently allows exchange of services for Freelance professionals \u0026amp; experts across various categories such as Admin Support,Writing and Translation,Design \u0026amp; Multimedia, Graphic Designing, Finance \u0026amp; Legal services, Web design, Web development, Software Programming \u0026amp; development, Networking Solution,Sales \u0026amp; Marketing,Engineering \u0026amp; Manufacturing etc.\u003C/p\u003E\n\n\u003Cp\u003EBusinesses (“Employers/Buyers”) use hiremall to find, hire and work with qualified professionals with specialized skills. Service professionals (“Providers”) use hiremall to meet customers, produce quality work and get paid for doing what they do best.\u003C/p\u003E\n\n\u003Cp\u003EIt is free to use for both buyers and service providers. Those users who want to get additional exposure and appear on the home page and on top of all searches have an option to choose a sponsored/featured listing for a small fee. Both buyer and provider can communicate using a messaging system that is available to registered users. It is an online workplace where you can post your job or hire and work with qualified professionals to get work done for free. hiremall.com is targeting the biggest market in the world with buyers and sellers from the whole world. Post a project and let freelancers from all over the world bid on it. As a user on hiremall.com you can act as both buyer and seller. Find highly skilled programmers, web designers, writers, developers and more. Submit a project and get the best possible price from skilled developers\u003C/p\u003E\n\n\u003Cp\u003Ehiremall.com enables buyers to hire, manage, and pay technology service providers from around the world. Buyers choose hiremall for top global talent, comprehensive management tools, and a fixed or flexible hourly payment model. Service Providers choose hiremall for challenging jobs and guaranteed payment. Every day, buyers and providers work together through hiremall Inc - a unique company at the forefront of reinventing work.Our search system allows to find professionals using extensive search criteria (area of expertise, salary, age, location, experience, language skills, travel preferences, etc). Employers or Buyer can post unlimited number of vacancies and projects as well as track the number of views, receive messages and quotes from registered Service Providers, build a list of favorite freelancers and staff for future cooperation\u003C/p\u003E\n\n\u003Cp\u003Ehiremall is the great platform for small Businesses and Entrepreneurs to connect with Freelance professionals and getting Their tasks done with ease powered by effective customer facilitation being offered by hiremall support .\u003C/p\u003E\n\n\u003Cp\u003EEstablished in recently in 2009 , hiremall.com provides unique way to both Buyers and the freelance Providers or professional to connect each other in order to do business at hiremall Platform . The Hiring and Project Management Task could easily be done by any average Buyer as hiremall has very simple and Clear navigation \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}