{"name": "HM Constructions",
 "permalink": "hm-constructions",
 "crunchbase_url": "http://www.crunchbase.com/company/hm-constructions",
 "homepage_url": "http://www.hmconstructions.com",
 "blog_url": "http://www.hmconstructions.com/pressreleases.html",
 "blog_feed_url": "",
 "twitter_username": "hmconstructions",
 "category_code": "other",
 "number_of_employees": 200,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "top-10-builders-in-bangalore, builders-in-bangalore, bangalore-builders, best-builders-in-bangalore, construction-companies-in-bangalore, apartments-for-sale-in-south-bangalore, flats-for-sale-in-south-bangalore, bangalore-real-estate",
 "alias_list": null,
 "email_address": "hmconstructions123@gmail.com",
 "phone_number": "+91802238 2288",
 "description": "builders in Bangalore",
 "created_at": "Mon Jun 10 08:07:12 UTC 2013",
 "updated_at": "Mon Jun 10 20:13:35 UTC 2013",
 "overview": "\u003Cp\u003EHM Constructions is one of the Bangalore\u0026#8217;s largest real estate company in terms of revenues, earnings, market capitalisation and developable area. It has a 20 years track record of sustained growth, customer satisfaction and innovation. HM Constructions was established in the year 1991 as a private residential and commercial developer in Bangalore, India. Since then, HM Constructions has expanded rapidly in Bangalore.\nToday, HM constructions behold the flagship of a multimillion conglomerate with 57 completed projects, both residential and commercial in prime locations of Bangalore with thousands of satisfied customers. We have grown up as the number one developer in Bangalore. Our achievement is purely due to absolute professionalism, great emphasis on quality and delivering on-time schedules. Today, we are the front liners in Bangalore\u0026#8217;s building and real estate development.\u003C/p\u003E\n\n\u003Cp\u003EThe company has a diverse range of expertise that allows them to have a good oversight and management of all aspects of a project right from the acquisition of land, appointment of architects and designers, construction, sales to after sales service. The company’s projects are located in the most desirable and exclusive locations and homes are built under high quality specification that has become synonymous with the group. In addition to support services provided by our group, the company’s comprehensive customer care programm\u0026#8217;s to delight customers through its vast network with offices all across the country.\u003C/p\u003E\n\n\u003Cp\u003EHM Constructions has a strong management team complementing each other in case of opportunities. HM Constructions mission is to build a world-class real estate development company with the highest standards of professionalism, ethics, customer service to thereby contribute and benefit from the growth of the Indian economy.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.hmconstructions.com/pressreleases.html",
    "title": "HM Constructions"}]}