{"name": "HMA",
 "permalink": "hma",
 "crunchbase_url": "http://www.crunchbase.com/company/hma",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Wed Aug 29 04:12:18 UTC 2012",
 "updated_at": "Sun Sep 16 08:04:01 UTC 2012",
 "overview": "\u003Cp\u003EHMA is a software embedded in televisions and digital set-top boxes that have the function to collect data referred to the quality of the received signal, audience data and about the experience of the viewer in front of the TV programming.\u003C/p\u003E\n\n\u003Cp\u003ENowadays, the number of residences analyzed to obtain the audience data in Brazil is far below the quantity of televisions that are tuned and this analysis is restricted to the city of São Paulo, which doesn’t reflects the reality and specifics characteristics of other places of the country. Furthermore, the TV stations have troubles to find and solve some problems about the quality of the viewers received signal.\u003C/p\u003E\n\n\u003Cp\u003EHMA can be applied in all the countries that have a digital television transmission system with the appropriate technological modifications according to each country. Today, there are three different models, the north american, the european and the japanese (ATSC, DVB-T and ISDB-T respectively). In addition to these, there is the brazilian system, which is developed internally in a hybrid way with the japanese model. A 2012 research from Anatel, indicates that 433 brazilian cities have already been benefited with the digital signal, covering 45% of the population with access to this technology.\u003C/p\u003E\n\n\u003Cp\u003EIn 2016 the analogic signal will be turned off, giving total space for the digital system. This indicates that the Digital TV is a reality in Brazil and, soon, the country will be completely adapted to the model. HMA is a Digital TV technology that assists on this process of adaptation, allowing  the analysis of data related to the audience and the quality of the transmitted signal to happen. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Bruno",
      "last_name": "Lima",
      "permalink": "bruno-lima",
      "image":
       {"available_sizes":
         [[[90,
            150],
           "assets/images/resized/0020/8627/208627v2-max-150x150.png"],
          [[151,
            250],
           "assets/images/resized/0020/8627/208627v2-max-250x250.png"],
          [[155,
            256],
           "assets/images/resized/0020/8627/208627v2-max-450x450.png"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}