{"name": "Home Elan Solutions",
 "permalink": "home-elan-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/home-elan-solutions",
 "homepage_url": "http://homeelan.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "homeelan",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "lims, laboratory-software, hopital-software, pathology-management-system, laboratory-management-system, medical-software, medical-billing, practice-management-software, medical-software-free, healthcare-management-systems, healthcare-software, hospital-ma",
 "alias_list": null,
 "email_address": "info@homeelan.com",
 "phone_number": "9899590442",
 "description": "Provides software products and services",
 "created_at": "Wed May 15 14:08:50 UTC 2013",
 "updated_at": "Thu May 16 00:32:00 UTC 2013",
 "overview": "\u003Cp\u003EHome Elan Solutions provides software products and services in healthcare, ecommerce, project and program management domain. The Company uses open source technology like Java/ J2EE, MySql, Php, hibernate that reduce total cost of ownership for it\u0026#8217;s Customers. Some of the products include:\nHealthcare domain:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EElan HIS: \u0026#8220;Hospital Management ERP System / Solution\u0026#8221; is the web based ERP solution for hospitals. The solution provides centralized patient management and EMR modules.\nIntegrated with the HR module, the system provides integrated component to assess workload and assist in optimally scheduling of the workforce in hospitals. The solution provides framework that can be extended to implement processes specific to other geographies and integrate with GIS solutions for spatial analysis of data. Elan HIS solution provides integration with proprietary Inventory Management solution Elan Stock that provides management of hospital consumables and assets in multiple stores in the multilocational enterprise wide setup. Integrated with dashboards and other BI (Business Intelligence) capabilities, the solution helps effectively manage services complying to all necessary statutory requirements.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003E2.Elan Store: Elan Stock is browser based inventory management solution for managing multilocational stores of consumable and non-consumable items. It provides capability to intuitively predict stock requirements and maintain optimum level of inventory to carry out operations.\u003C/p\u003E\n\n\u003Cp\u003EBuilt in rule based discovery engine provides potential list of items for purchase and can be extended for manufacturing, retail or other types of stores. The solution provides component to easily configure industry specific processes. The solution provides integrated modules for managing purchase processes and contracts with various vendors. The solution provides easy integration with Point of Sale (PoS) systems. The solution supports printing and entry through barcode printers and scanners. The solution provides role based access for users. In the mutistore setup user can be configured to access data only from associated store.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EEaln LIMS: Laboratory information system \u0026#8220;Elan LIMS\u0026#8221; provides comprehensive patient management and workflow based test management capabilities. The system supports integration with barcode technology that helps automate the interface with various diagnostic machines. System provides capability to manage multiple templates and reduces data entry requirements.  \u003C/li\u003E\n\u003C/ol\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0026/2643/262643v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0026/2643/262643v2-max-250x250.png"],
     [[250,
       250],
      "assets/images/resized/0026/2643/262643v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Noida",
    "address2": "Gautam Budh Nagar",
    "zip_code": "201308",
    "city": "Noida",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.youtube.com/watch?v=lCubpbJSB4I",
    "title": "Watch ELan HIS demo"},
   {"external_url": "http://pressexposure.com/Home_Elan_Solutions_Releases_Online_Ecommerce_Cart_Solution_EComCart-545702.html",
    "title": "EComCart- ECommerce shopping cart solution"}]}