{"name": "Home Decor By Me",
 "permalink": "home-decor-by-me",
 "crunchbase_url": "http://www.crunchbase.com/company/home-decor-by-me",
 "homepage_url": "http://www.homedecorbyme.com",
 "blog_url": "http://rooms.homedecorbyme.com",
 "blog_feed_url": "",
 "twitter_username": "homedecorbyme",
 "category_code": "ecommerce",
 "number_of_employees": 25,
 "founded_year": 2011,
 "founded_month": 4,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "personalized-home-decor, personalized-wall-art, custom-home-decor, make-home-decor, custom-wall-art, make-wall-art, canvas-prints",
 "alias_list": null,
 "email_address": "homedecorbyme@gmail.com",
 "phone_number": "",
 "description": "Personalized Home Decor",
 "created_at": "Mon Apr 25 01:52:36 UTC 2011",
 "updated_at": "Wed Jul 18 08:44:39 UTC 2012",
 "overview": "\u003Cp\u003EBlind a viewer of the window, not allowing them to see the insides of the room. The blinds are used to reduce entering sunlight as well. Today window \u0026lt;a href=\u0026quot;www.dayblinds.co.uk\u0026quot;\u0026gt;blinds derby\u0026lt;/a\u0026gt; have become more practical with varying usage. This may be due to the advent of various technologies in materials used in creating window blinds. Blinds can be used to block unwanted heat of the summer sun but at the same time keep in the heat during the winter or colder months. The varying designs as well determine their functionality. But no matter how you they make or design window blinds, the basic function of restricting the field of vision and controlling sunlight remains. These window coverings continue to outsell all others on the market year after year. For years there have been thousands of people selling blinds but there has never been anyone effectively cleaning them.\u003C/p\u003E\n\n\u003Cp\u003ETraditional methods of cleaning mini \u0026lt;a href=\u0026quot;http://dayblinds.co.uk/blinds-Nottingham\u0026quot;\u0026gt;vertical blinds nottinghamshire\u0026lt;/a\u0026gt; are time consuming, ineffective and damaging. In fact, there really has never been a method for cleaning vertical blinds and pleated shades.Nearly 80% of people own either vertical blinds, mini blinds, pleated shades or a combination. Why not easily and profitably clean their window blinds? In addition, ceiling light lenses, in practically all buildings, have accumulated dirt and also need cleaning.The biggest problem that has existed in the blind industry for decades has been that blinds have carried a tag around with them that state: \u0026#8220;out of sight - out of mind.\u0026#8221; With blinds out-numbering drapes 5 - 1 as the consumer\u0026#8217;s choice for window coverings, the need for a blind cleaning service has never been greater.\u003C/p\u003E\n\n\u003Cp\u003EAs window coverings blinds are some of the most widely used today. They vary in design immensely from fabric sheets to materials such as metal and wood as well as rollers, track blinds and even the Venetian variety. Their name is derived from their purpose as they actively blind the vision of anyone looking through the window. Blinds have been prevalent throughout history in some of the largest and most widely known civilisations. Their first recorded use was by nomad tribes in the desert who used to cover their windows with sheets to keep the fierce desert sun out; additionally they would wet the blind to increase its cooling properties. The classic styling of the blind has remained although modern varieties tend to use metals such as aluminium \u0026amp; wood instead of fabric. This form of blind spread throughout U.K cities such as Derby, Nottingham where they became a highly fashionable window covering.\u003C/p\u003E\n\n\u003Cp\u003EModern blinds are normally fitted so they fit into the window recess, up against the wall for a snug fit that will block the largest amount of light. Not all windows will have recesses however but in this instance it is possible for a frame to be constructed for the blind, much like a curtain rail. While curtains and drapes are considered a more thermally efficient window covering modern blind variants are surprisingly adept at keeping the heat in. depending upon the materials some blinds have excellent thermal properties, keeping heat in during the winter months whilst keeping a house cool during the summer. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       85],
      "assets/images/resized/0013/1858/131858v2-max-150x150.jpg"],
     [[172,
       98],
      "assets/images/resized/0013/1858/131858v2-max-250x250.jpg"],
     [[172,
       98],
      "assets/images/resized/0013/1858/131858v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.homedecorarcade.com",
    "title": "Home decor"}]}