{"name": "Honesty Machine",
 "permalink": "honesty-machine",
 "crunchbase_url": "http://www.crunchbase.com/company/honesty-machine",
 "homepage_url": "http://www.indiamart.com/honestymachinetools/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hollow-shaft-helical-gearbox, plate-bending-machine, tefc--flame-proof-motor, medium-duty-wire-rope-hoist--",
 "alias_list": null,
 "email_address": "honestymachinetools@tradepassport.org",
 "phone_number": "9821150150",
 "description": "Honesty Machine Tools a trader of a wide",
 "created_at": "Thu Apr 04 09:12:34 UTC 2013",
 "updated_at": "Thu Apr 04 09:12:36 UTC 2013",
 "overview": "\u003Cp\u003EHonesty Machine Tools is a Mumbai, Maharastra based business venture, which entered the market in the year 1988. Today, our organization is counted among the noteworthy names engaged in the sphere of trading an incomparable array of Plate Bending Machine, Air Compressor and AC \u0026amp; DC Motor. The wide array of products offered by us comprises Helical Geared Motor, Hollow Shaft Helical Gearbox, Plate Bending Machine, TEFC \u0026amp; Flame Proof Motor, Medium Duty Wire Rope Hoist and Medium Duty Chain Electric Hoist. In addition to these, we specialize in offering a comprehensive range of Reciprocating Air Compressor, Geared \u0026amp; Flexible Coupling, Worm Wheel and Worm Shaft, Adaptable Unit Size, AC \u0026amp; DC Motor, Air Compressor and many more. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nEver since our inception, we have practised stringent quality control program inside our organization to deliver immaculate range of Plate Bending Machine, Air Compressor and AC \u0026amp; DC Motor to the clients. In order to consistently maintain the same high standards, we ensure that the complete range is carefully procured from trustworthy vendors of the nation.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nIn order to successfully fulfill the ever changing demands of our clients, we have developed an extended vendor base for ourselves. All the vendors associated with us are carefully selected after evaluating the results of extensive market surveys and researches. Backed with a team of expert engineers and sound manufacturing facilities, our vendors aid us in offering best in industry range of Plate Bending Machine, Air Compressor and AC \u0026amp; DC Motor. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client oriented organization, we lay utmost emphasis on attaining highest level of client’s contentment and nurture lasting cordial relations with them. To achieve the same, we ensure that clients receive products that are precisely manufactured using superior grade raw material and sophisticated machines.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nAir Compressor and AC \u0026amp; DC Motor. The wide array of products offered by us comprises Helical Geared Motor, Hollow Shaft Helical Gearbox, Plate Bending Machine, TEFC \u0026amp; Flame Proof Motor, Medium Duty Wire Rope Hoist and Medium Duty Chain Electric Hoist.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7735/247735v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7735/247735v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7735/247735v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}