{"name": "Houston's New Homes",
 "permalink": "houstons-new-homes",
 "crunchbase_url": "http://www.crunchbase.com/company/houstons-new-homes",
 "homepage_url": "http://www.houstonsnewhomes.com",
 "blog_url": "http://waynessullivan.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "houstonsnewhome",
 "category_code": "consulting",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "new-homes, home-builders, houston-new-homes",
 "alias_list": null,
 "email_address": "waynessullivan@gmail.com",
 "phone_number": "8324937770",
 "description": "New Home Search ",
 "created_at": "Mon Jan 28 11:55:56 UTC 2013",
 "updated_at": "Fri Feb 01 04:31:17 UTC 2013",
 "overview": "\u003Cp\u003EHouston\u0026#8217;s New Homes provide a variety of real estate services for home buyers and home builders. Our buyer\u0026#8217;s agents help you find new homes and home builders. We make the new home buying process in Houston easier. Our #1 goal is to provide you with an unparalleled home buying experience.\u003C/p\u003E\n\n\u003Cp\u003EFirst we conduct a thorough interview and consultation in person, by phone or email. During this interview we\u0026#8217;ll discover everything you may want and need in purchasing your new home. Then we conduct a thorough home and community search based on the information we\u0026#8217;ve gathered from you. During this process, we\u0026#8217;ll get you qualified for a home loan, negotiate the best price on your behalf and ensure a seamless closing process. Soon you\u0026#8217;ll be moving into your new house. Many ask: Who pays for our services? The seller or new home builder. See Buyer\u0026#8217;s Agent below for more on your Texas rights to have buyer representation.\u003C/p\u003E\n\n\u003Cp\u003EOur buyer\u0026#8217;s agents are real estate agents who work exclusively with the home buyer and never represent sellers. Working with a buyer\u0026#8217;s agent will not cost you anything; the seller/home builder, has already agreed to pay the buyer\u0026#8217;s agent once everything is final on your new home. The job of the buyer\u0026#8217;s agent is to help you find the right home, select the right builder and negotiate the best price and incentives for you. They provide the true facts involving the value of your new home, the market and neighborhood conditions and any physical defects on the property. In Houston, and other areas of Texas, buyers have certain rights; when you sign an agreement with a real estate agent, that agent then works for you and have your best interest in mind. In Texas, you are not considered represented until you\u0026#8217;ve entered an agreement with a real estate agent. Using a buyer\u0026#8217;s agent is like using an attorney, except you don\u0026#8217;t pay for the buyers agents\u0026#8217; representation. We are here to help you through the entire home buying process without you having to do much searching and hassling through the entire buying process.\u003C/p\u003E\n\n\u003Cp\u003EAfter many years visiting with home buyers We\u0026#8217;ve found a lot of their experiences have been very similar; They\u0026#8217;ve told us they were exhausted in their home search, aggravated at the home buying process, and frustrated by previous Realtor and builder experiences. While in their pursuit in purchasing their new home they felt like they were still at the beginning of the home buying process. Some have even given up on purchasing a home entirely. Even if you\u0026#8217;ve bought a home before, you probably wouldn\u0026#8217;t want to experience what you\u0026#8217;ve gone through before. Houston\u0026#8217;s New Homes is here to help find your dream home without the hassle.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[145,
       150],
      "assets/images/resized/0023/2018/232018v2-max-150x150.jpg"],
     [[243,
       250],
      "assets/images/resized/0023/2018/232018v2-max-250x250.jpg"],
     [[437,
       450],
      "assets/images/resized/0023/2018/232018v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Real Estate Assistant",
    "person":
     {"first_name": "Roni",
      "last_name": "Sullivan",
      "permalink": "roni-sullivan",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Houston Area",
    "address1": "16635 Spring Cypress Rd.",
    "address2": "",
    "zip_code": "77429",
    "city": "Cypress",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": 29.9752725,
    "longitude": -95.6799502}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}