{"name": "http://www.forsalebyownerhomes.com/",
 "permalink": "http-www-forsalebyownerhomes-com",
 "crunchbase_url": "http://www.crunchbase.com/company/http-www-forsalebyownerhomes-com",
 "homepage_url": "http://www.forsalebyownerhomes.com/",
 "blog_url": "https://www.facebook.com/pages/ForSalebyOwnerHomescom/139666972722676",
 "blog_feed_url": "",
 "twitter_username": "4SBOHomes",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mls, for-sale-by-owner, real-estate, first-time-buyers, home-buyers, home-sellers, house, flat-fee-listing",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "For Sale By Owner Homes",
 "created_at": "Tue Apr 09 18:17:03 UTC 2013",
 "updated_at": "Tue Apr 09 18:17:16 UTC 2013",
 "overview": "\u003Cp\u003EMLS listing with the savings of selling \u0026#8220;For Sale By Owner\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EList your For Sale By Owner home in MLS for a flat listing fee as low as $249 instead of paying a Agent 6%.  Get the same MLS listing, in the same Agent\u0026#8217;s MLS with all the other MLS listed homes, but without the 6% commission.\u003C/p\u003E\n\n\u003Cp\u003EMore and more For Sale By Owners are learning about this method of getting listed in MLS and are saving thousands in commissions. The internet is changing how homes are marketed and sold, and For Sale By Owner home sellers are gaining the upper hand.\u003C/p\u003E\n\n\u003Cp\u003ERegardless what you would pay a 6% real estate agent, your listing will still be in the same MLS. Anything else a 6% agent would do for you, we can do, or you can do yourself. For example, it doesn\u0026#8217;t take a genius to hold an Open House, make a flyer, or talk to buyers. In fact, most For Sale By Owner sellers do a better job at most of these things than Agents anyway.\u003C/p\u003E\n\n\u003Cp\u003EWhen you list your For Sale By Owner home in MLS through us, you are guaranteed to get additional exposure on national websites as well. These include Realtor.com®, yahoo.com, excite.com, remax.com, kw.com, msn.com, prudential.com, homegain.com, realestate.com, homeseekers.com. Many 6% Agents intentionally exclude listings from these national websites because it might hurt their chances of making a full commission.\u003C/p\u003E\n\n\u003Cp\u003EFor Sale By Owner MLS Savings\u003C/p\u003E\n\n\u003Cp\u003EHere\u0026#8217;s the simple math of when you list your For Sale By Owner home through us versus a 6% agent. Let\u0026#8217;s assume your home sells for $500,000. Here are the 3 possibilities:\u003C/p\u003E\n\n\u003Cp\u003EIf you list with a 6% agent, you pay a $30,000 commission, even if the agent didn\u0026#8217;t do anything and you sold the house yourself.\nIf you list with us, and an agent brings sells your home, you pay our listing fee plus the commission to that agent only. Assuming our listing fee of $349, and that you decided on 3% to the buyer\u0026#8217;s agent, you pay $349 plus $15,000. Your total savings is $14,651.\nIf you list with us and the buyer doesn\u0026#8217;t have an agent, you only pay our listing fee, and zero commission. Total savings is $29,651!\nFor Sale By Owner MLS Listing services – Why we are the best!\u003C/p\u003E\n\n\u003Cp\u003EThis website is owned by a large real estate company that has been helping For Sale By Owner sellers save real estate commissions for over 8 years. You don\u0026#8217;t have to worry about us going out of business during your listing term.\nWe answer our phone! That may not sound like much, but many online companies can only be reached by email or voicemail. Some can\u0026#8217;t be reached at all!\nNo company has a higher client satisfaction rate, and we are a member of the Better Business Bureau.\nThere are no hidden fees. Included and optional services are stated on our website.\nWe have the best agents and brokers across the country. Most of our brokers have been doing our listings for many years and are well established.\nOur brokers will refer buyer calls directly to you. Other companies will try to make the buyer agent commission every time a buyer calls them about your property. Calls are referred to you so you can AVOID the commission, which is the whole point of this program.\nYou get a FREE listing on this website. Click Here for Details\nSteps to List Your For Sale By Owner home in MLS\u003C/p\u003E\n\n\u003Cp\u003ESelect your State on our Map\nReview services offered and click on \u0026#8220;Place Order\u0026#8221;\nEnter order information and property address\nA receipt for your online payment will be emailed to you\nLater that day or the next business morning you will receive an email with instructions and information we need from you to enter your listing in MLS. Call us if you do not get this email within 24 hours after you place your order.\nFrom this point forward, the broker assigned to your listing will be your primary point of contact.\nOnce you submit the required information, your property will get listed in MLS, usually no later than the next business day.\nIt will take one to five days for your listing to appear in Realtor.com® and other websites after it is entered in MLS. How soon depends on how often and when the MLS feeds their data to the various websites.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       62],
      "assets/images/resized/0024/9954/249954v2-max-150x150.jpg"],
     [[250,
       103],
      "assets/images/resized/0024/9954/249954v2-max-250x250.jpg"],
     [[450,
       186],
      "assets/images/resized/0024/9954/249954v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}