{"name": "Hungama Digital Media Entertainment Pvt. Ltd.",
 "permalink": "hungama-digital-media-entertainment-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/hungama-digital-media-entertainment-pvt-ltd",
 "homepage_url": "http://www.hungama.org",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "hungama_com",
 "category_code": "games_video",
 "number_of_employees": 1080,
 "founded_year": 1999,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "newsdesk@hungama.com",
 "phone_number": "+912224903344",
 "description": "",
 "created_at": "Sat Jul 07 10:43:26 UTC 2012",
 "updated_at": "Sun Jul 08 00:12:22 UTC 2012",
 "overview": "\u003Cp\u003EHungama Digital Media Entertainment Pvt. Ltd. is the largest aggregator, developer, publisher and distributor of Bollywood and South-Asian entertainment content in the world. It is a leader in Mobile \u0026amp; Digital Entertainment solutions, Digital Advertising, Gaming and Applications. With partnerships\nwith over 400 content creators, Hungama has licensed worldwide exclusive digital rights to millions of music and video titles. The company serves content to consumers in 47 countries across Mobile, Internet, IPTV, DTH services and Applications, and has more than 150 partners across the world. Hungama has successfully managed more than 2000 mobile and digital campaigns for as many as 350\nbrands globally. Over the last 12 years, Hungama has won close to 100 international awards across Mobile Entertainment, Digital Advertising and Gaming.\u003C/p\u003E\n\n\u003Cp\u003ELeader in Mobile \u0026amp; Digital Entertainment: Today Hungama Mobile is the leader in the Mobile Entertainment and Value Added Services (VAS). Since its inception, the business has built its expertise in Mobile Content, Mobile Marketing and\nMobile Media. Its expertise lies in not only in a robust distribution network, but in market intelligence and product development for various genres of content. It powers close to 75% (circle dependent) of all mobile entertainment content in India.\nInnovative Digital Agency:\nHungama Digital is India’s No.1 digital advertising agency. Over the last decade, the Hungama Digital team has created and executed some award winning campaigns. The Hungama Promo Marketing business has been ranked as one of the best in Asia Pacific over the past decade; it uses\nExperiential Marketing tenets in creating effective and measurable programmes. Hungama Promo Marketing has an infrastructure across 60 cities in India. JWT Singapore recently acquired 51% stake in the agency.\u003C/p\u003E\n\n\u003Cp\u003EParticipating in the Gaming Revolution: Hungama Game Studio is one of India\u0026#8217;s largest gaming studios, developing gaming content across Mobile, PC, connected devices and DTH services. The studio owns IP to 600 flash games till date for over 100 brands and has pioneered the Bollywood genre of gaming. It has conceptualized and created over 100 games around Bollywood and Indian films. Hungama also owns BollywoodHungama.com, India\u0026#8217;s premiere award winning Bollywood media website. Since its launch 1997, it has become a credible source of information and entertainment for Bollywood enthusiasts all over the world. The site attracts over 7 million visitors every month,\nacross 127 countries.\u003C/p\u003E\n\n\u003Cp\u003EIndia’s largest Digital Entertainment Storefront: Hungama also launched India’s premium cross platform digital entertainment store, Hungama.com, offering full length music tracks, videos, movies, ringtones, mobile content and applications across various categories for digital downloads. Accessible from a PC \u0026amp; Mobile, users can enjoy all this\ncontent anytime, anywhere. The digital storefront won its first international award within 4 months of its inception. Hungama.com’s high end HD movies service is also exclusively available via the 2nd Generation Intel® Core processors.\u003C/p\u003E\n\n\u003Cp\u003EIt’s all about Device: Hungama also works with some of the biggest device manufacturers in the world, currently\ndeveloping Apps for over 90 manufacturers across Mobile, PC, Tablets, TVs, White Goods and Automobiles.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       45],
      "assets/images/resized/0019/9390/199390v2-max-150x150.png"],
     [[250,
       75],
      "assets/images/resized/0019/9390/199390v2-max-250x250.png"],
     [[450,
       135],
      "assets/images/resized/0019/9390/199390v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Asst Manager - Content | Consumer Business",
    "person":
     {"first_name": "Clinton",
      "last_name": "Gonsalvez",
      "permalink": "clinton-gonsalvez",
      "image":
       {"available_sizes":
         [[[150,
            112],
           "assets/images/resized/0014/2908/142908v4-max-150x150.jpg"],
          [[250,
            186],
           "assets/images/resized/0014/2908/142908v4-max-250x250.jpg"],
          [[450,
            336],
           "assets/images/resized/0014/2908/142908v4-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Mumbai",
    "address1": "F-1, First Floor, Laxmi Woollen Mills Estate",
    "address2": "Shakti Mills Lane, Mahalaxmi",
    "zip_code": "400011",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.hungama.org",
    "title": "Corporate Website"},
   {"external_url": "http://www.hungama.com",
    "title": "Consumer Website"}]}