{"name": "HVAC San Diego",
 "permalink": "hvac-san-diego",
 "crunchbase_url": "http://www.crunchbase.com/company/hvac-san-diego",
 "homepage_url": "http://www.mauzyair.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 30,
 "founded_year": 1995,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "san-diego, heating, air-conditioning, hvac",
 "alias_list": null,
 "email_address": "info@mauzyair.com",
 "phone_number": "619-583-9545",
 "description": "Residential \u0026 commercial HVAC.",
 "created_at": "Mon Oct 29 18:51:42 UTC 2012",
 "updated_at": "Wed Dec 12 07:25:58 UTC 2012",
 "overview": "\u003Cp\u003EMauzy Heating and Air, based in San Diego, California, is a recognized leader in the Southern California central air conditioning \u0026amp; heating industry serving homeowners and businesses.  Dedicated to providing ultimate heating, cooling and air conditioning solutions, Mauzy Heating \u0026amp; Air is a family-owned California heating and a/c contractor invested in providing you with the very finest strategies, heating and cooling systems at reasonable cost.\u003C/p\u003E\n\n\u003Cp\u003EAt Mauzy, the customer always comes first.  We’ve earned a premier reputation by tailoring systems specifically to each customer’s needs.  Our team of licensed, factory trained heating and air conditioning experts study your project and expectations carefully, then design and install the perfect heating or cooling system for you.\u003C/p\u003E\n\n\u003Cp\u003EWhether you need installation of a new residential heating system, cooling system, service, replacement or improvement, Mauzy Heating \u0026amp; Air makes it our priority to provide it efficiently, cost-effectively, and professionally.  We offer top brands, expertise, friendly advice and opportunities that far exceed the norm, beginning with our Always-Free In-Home Estimates for heating installations, air conditioning installations, furnace installations, and air duct cleaning/indoor air quality services throughout San Diego, California and surrounding communities in Southern California.We also offer heating repairs, air conditioning repairs and furnace repairs throughout San Diego and Southern California. We can also work with you to arrange financing on this work.\u003C/p\u003E\n\n\u003Cp\u003EFind out more about our NEW Indoor Air Quality Service, and energy efficient tax credits for new heating and air conditioning systems.\u003C/p\u003E\n\n\u003Cp\u003EOnline discount coupons available for any heating and air conditioning repair, air duct cleaning and sanitizing.  Contact  your San Diego heating experts today about a new heating system or attic insulation, and enjoy a warm winter!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Vice President",
    "person":
     {"first_name": "Gary",
      "last_name": "Mauzy",
      "permalink": "gary-mauzy",
      "image": null}},
   {"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Matt",
      "last_name": "Mauzy",
      "permalink": "matt-mauzy",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "1551 N. Cuyamaca Street",
    "address2": "",
    "zip_code": "92020",
    "city": "San Diego",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 32.814734,
    "longitude": -116.979134}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.mauzyair.com",
    "title": "Corporate Website"},
   {"external_url": "http://www.commercialhvacsandiego.com",
    "title": "Commercial HVAC Division"}]}