{"name": "Hype Energy",
 "permalink": "hype-energy",
 "crunchbase_url": "http://www.crunchbase.com/company/hype-energy",
 "homepage_url": "http://www.hype.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1994,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@hype.com",
 "phone_number": "+971 72046745",
 "description": "Energy drink producer",
 "created_at": "Mon Oct 10 12:28:23 UTC 2011",
 "updated_at": "Sat Oct 29 00:30:06 UTC 2011",
 "overview": "\u003Cp\u003EHype Energy is the registered trademark for a range of functional beverages distributed in over 40 countries across the world including the USA and Canada. First launched in 1994 by Hard Rock Cafe founder, Barry Cox, the company has been headed since May 2000 by former Formula One racing driver, Bertrand Gachot. Hype Energy is a leading energy drinks brand in Canada, USA, Middle East and South America.\nIn the early days, Hype Energy became heavily involved in motor-sport by first sponsoring the Arrows Formula One team and subsequently Benetton F1, Williams F1, a NASCAR outfit and several motorbike teams. Associated with the Formula One party lifestyle and with a strong presence in the paddock, Hype Energy committed huge funds to sponsorship in order to achieve global recognition and establish worldwide distribution. In 1997, having established a credible brand, Hype Corporation (the holding company) decided to pull back from the sport to focus on resolving manufacturing difficulties, which were restricting further growth. In 1997, former Formula One racing driver and 24 Hours of Le Mans winner, Bertrand Gachot, signed a distribution agreement with Hype Energy in order to introduce the product to France. Gachot was one of a handful of distributors who remained seriously committed to the brand and in 1998, he approached the Swiss licensor to buy the company holding the Hype Energy trademarks. In May 2000, after two years of negotiation, Gachot came to an agreement and restructured the company. Until 2000 Hype Energy had four products in its portfolio: Hype MFP with a strawberry and cranberry flavour, Hype Energy Morning Rush with a citrus flavour, Hype Passion Attack with passion fruit and Hype Night Boost with peach. In May 2000, the company launched a new version of Hype Energy into selected markets. The culmination of 18 months of development, Hype Energy now used fresh fruit juice, contained ten vitamins and had no artificial colours or preservatives, as it was pasteurized. The improved Hype Energy product gave the company a substantial boost. It was first launched in France and the Persian Gulf, then the USA and Canada, and by 2001 it had achieved significant global growth. Today, the Hype Energy range comprises Hype Energy, Hype Energy MFP, the low-calorie Hype Energy Enlite, Hype Energy Shots and, the newest flavour, Hype Energy Organic. The brand is now present in more than 40 countries across the globe from the USA, Canada, Honduras and Panama to Africa and the Middle East. Hype Energy is manufactured in the USA, Canada and the Netherlands, and has marketing headquarters in Europe and Dubai.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       106],
      "assets/images/resized/0015/7491/157491v2-max-150x150.jpg"],
     [[250,
       176],
      "assets/images/resized/0015/7491/157491v2-max-250x250.jpg"],
     [[450,
       318],
      "assets/images/resized/0015/7491/157491v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Dubai Headquarters",
    "address1": "RAK Business Center, Suite 723",
    "address2": "The Fairmont Hotel, Sheik Zayed Rd",
    "zip_code": "",
    "city": "Dubai",
    "state_code": null,
    "country_code": "ARE",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}