{"name": "i-Net Solution",
 "permalink": "i-net-solution",
 "crunchbase_url": "http://www.crunchbase.com/company/i-net-solution",
 "homepage_url": "http://www.i-netsolution.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design-and-development-company-chennai, software-company-chennai, website-design-company, web-development-company-chennai, web-page-development-company, web-design-chennai, affordable-web-design-company, professional-web-design-company-india, custom-w",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+91-(44)-42307403",
 "description": "A Professional Web Design \u0026 Development ",
 "created_at": "Sat Dec 15 10:10:47 UTC 2012",
 "updated_at": "Thu Apr 11 06:50:36 UTC 2013",
 "overview": "\u003Cp\u003Ei-Net Solution is a Professional Website Design Company in Chennai since 2005. We offer a complete range of Website Design and Development, includes Corporate Web Site , Flash Website Design , Web Hosting, Internet Marketing, Search Engine Optimization and E-Commerce Solutions. We have extended our hands across the globe in providing the World Class solutions to the clients in Web Designing and Development.\u003C/p\u003E\n\n\u003Cp\u003EAmongst many competitors in the field of Web Designing and Development i-Net Solution strives hard to excel well in its project. Most of our clients have been with us for years and keep coming back for more. We are very proud of being a customers-oriented design company, and we nurture all our business relationships with great care \u0026amp; love.\u003C/p\u003E\n\n\u003Cp\u003Ei-Net Solution designs the web sites in such a way that it will visually communicate your company’s image to exchange your professional objective to your customers and viewers and promote your business. The professional web site that we create attracts more customer to your web site thereby enhancing your company’s profit. We provide a personal service in establishing the best web site design and business development through SEO.\u003C/p\u003E\n\n\u003Cp\u003Ei-Net Solution is a unique block made of corporate values, enthusiastic, skilled and experienced staff, in providing best of breed solutions, services and products to customers across the globe round the clock.\u003C/p\u003E\n\n\u003Cp\u003Ei-Net Solution has Technology and Teamwork as a strong foundation and built in strong bond called Trust.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       81],
      "assets/images/resized/0025/0530/250530v2-max-150x150.jpg"],
     [[250,
       135],
      "assets/images/resized/0025/0530/250530v2-max-250x250.jpg"],
     [[448,
       242],
      "assets/images/resized/0025/0530/250530v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": " i-Net Solution",
    "address1": "No.1, Ayyavu Street, Opp. to Indian Bank(Aminjikarai Branch), Shenoy Nagar,  Aminjikarai P.O,",
    "address2": " Chennai - 600030 Tamilnadu State,",
    "zip_code": "600030",
    "city": "Chennai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}