{"name": "I.Systems",
 "permalink": "i-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/i-systems",
 "homepage_url": "http://www.is-brasil.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "igorsantiagoIS",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 2007,
 "founded_month": 7,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "industrial-automation, fuzzy-control, advanced-control",
 "alias_list": null,
 "email_address": "contato@is-brasil.com",
 "phone_number": "55 19 33811054",
 "description": "Industrial Automation Advanced Control",
 "created_at": "Fri Oct 15 22:29:22 UTC 2010",
 "updated_at": "Mon Oct 18 20:02:08 UTC 2010",
 "overview": "\u003Cp\u003EI.Systems is a company that provides engineering control solutions to increase efficiency of industrial automation. We provide our customers with gains in productivity, quality and efficiency due to the ability to handle complex processes with powerful advanced control systems. \u003C/p\u003E\n\n\u003Cp\u003EBusiness Description and opportunity:\nI.Systems sees an opportunity in the industrial automation market that has a gap in the development of controllers for environments that require high precision and efficiency. There is great potential for financial return for our clients, since the segments that demand this type of solution have high scalability of production such as chemical industry, food, beverages, petroleum and steel.\u003C/p\u003E\n\n\u003Cp\u003ESummary of Business Strategy:\nOur entry strategy is providing Automation Control for industrial processes as a service. Expansion of business resides in deploying the solution remotely. This new form can provide better solutions to a big base of clients with low sales costs.\u003C/p\u003E\n\n\u003Cp\u003EProducts / Services:\nThe product consists of a Intelligent Control software of high precision and efficiency that promotes a Flexible Automation, resulting in reduced use and increased efficiency for customers.\u003C/p\u003E\n\n\u003Cp\u003EBusiness risks:\nThe biggest risk is time for market entry and fragmentation of the market. The target market has a conservative tendency in relation to new technologies, but once broken this barrier, it is highly used, disseminated and recognized as good practice.\u003C/p\u003E\n\n\u003Cp\u003ETarget Markets:\nThe initial market is medium size industries and most innovators big players. The expansion strategy aims process industries, with partnership with equipment manufacturers. The company\u0026#8217;s strategy includes policy-making and investment to provide such a transition.\u003C/p\u003E\n\n\u003Cp\u003ECompetition:\nI.Systems is a step forward in technological innovation for process control. The competition operates in a standardized way using traditional solutions and human operators. To break this barrier, I.Systems focuses on other values such as continuous evolution of its solutions, maintaining close relationship to its customers.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}