{"name": "iBraggiotti Fine Jewelry",
 "permalink": "ibraggiotti-fine-jewelry",
 "crunchbase_url": "http://www.crunchbase.com/company/ibraggiotti-fine-jewelry",
 "homepage_url": "http://www.iBraggiotti.com",
 "blog_url": "http://blog.ibraggiotti.com",
 "blog_feed_url": "http://blog.ibraggiotti.com/feed",
 "twitter_username": "iBraggiotti",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "italian-fine-jewelry, bridal-jewelery, diamond-engagement-rings",
 "alias_list": null,
 "email_address": "info@iBraggiotti.com",
 "phone_number": "877-244-6558",
 "description": "True Italian Fine Jewelry Store",
 "created_at": "Wed Oct 20 02:12:52 UTC 2010",
 "updated_at": "Sat Oct 23 03:03:38 UTC 2010",
 "overview": "\u003Cp\u003EWelcome and thank you for visiting iBraggiotti.com, a family company of jewelry enthusiasts. From years spent in our hometown in Milano, to our new home in New York City, we have learned a lot about jewelry. Jewelry has long stood as a symbol of passion, affinity and wealth. To people like us, it represents who you are. In every civilization across the world, jewelry serves as a form of unique expression. Let us share ours with you.\u003C/p\u003E\n\n\u003Cp\u003EHow to Shop at iBraggiotti.com\nWe want you to love jewelry like we do. Explore our offerings, like our unique city collections. Give us with feedback. If there is anything you need, please call us today. We opened our doors on 5th Avenue in 2009, and our passion for jewelry has permeated our entire business. Our goal is simple: IB provides its valued customers with access to high quality jewelry at great prices. And we love to provide outstanding customer service. At IB, you will find exceptional customer service, helpful jewelry education and high quality products, all available to you in a safe, user-friendly website.\u003C/p\u003E\n\n\u003Cp\u003EWhy Shop at iBraggiotti.com?\nAll of our products carry a 100% Satisfaction Guarantee. If you are not completely satisfied with your jewelry, return it to us for a full refund of the purchase price, no questions asked. Combined with free shipping and our Jewelry 101 resource center, buying fine jewelry from IB has never been easier, and you will save time and money. As our friends like to say, iBraggiotti Jewelry feels right.\u003C/p\u003E\n\n\u003Cp\u003EFeel good about jewelry again with iBraggiotti.com, a family tradition you can trust. Look around, make yourself at home, and if at any time you need to speak to someone, call us or use our livechat feature. We would be delighted to meet you.\u003C/p\u003E\n\n\u003Cp\u003EFrom our family to yours,\u003C/p\u003E\n\n\u003Cp\u003EGoda della vita!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}