{"name": "iComment.com",
 "permalink": "icomment-com",
 "crunchbase_url": "http://www.crunchbase.com/company/icomment-com",
 "homepage_url": "http://icomment.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "network_hosting",
 "number_of_employees": 20,
 "founded_year": 2005,
 "founded_month": 2,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "comments, commentary, icomment, annotation, notes, new-technology, internet, social-network, web, button, internet-explorer, firefox, browser, windows, linux--chat, messenger, web-page, website, experiences, advice, opinions, reviews, vote, comment, annot",
 "alias_list": null,
 "email_address": "info@icomment.com",
 "phone_number": "954-341-6567",
 "description": null,
 "created_at": "Wed Sep 10 16:39:43 UTC 2008",
 "updated_at": "Mon Apr 27 10:42:20 UTC 2009",
 "overview": "\u003Cp\u003EiComment.com, Inc. is a sister company of Skylam.com makers of the famous Intelli-Dial-UP, Disable Plus, and Hit Generator with over 9.5 million downloads. Intelli-Dial-UP achieved numerous awards and editor\u0026#8217;s picks from CNet, ZDNet, Softseek, and others. Both iComment.com, Inc. and Skylam.com are subsidiaries of Quality Programming Corporation (QPros.com - established 1999).\nMission\u003C/p\u003E\n\n\u003Cp\u003EiComment turns the entire Internet into a huge bulletin board forum. Their mission is to become the World\u0026#8217;s first social network based on web content, similarities in user\u0026#8217;s interests, and user\u0026#8217;s insights. Each day huge numbers of people use the iComment button to read and post their opinions, viewpoints, ideas, thoughts, advice and experiences to individual web pages and their content.\u003C/p\u003E\n\n\u003Cp\u003EiComment is based on a central database that ties together user\u0026#8217;s posts no matter what web page they post it to. The database is extremely relevant because our patent pending technologies enable iComment users to bind their posts to specific keywords or pictures on the web pages of their choice.\u003C/p\u003E\n\n\u003Cp\u003EiComment is based on a single button that appears on the Internet Explorer or Firefox toolbar and enables users to \u003Cem\u003Eread and write\u003C/em\u003E comments about web pages as they surf the web from page to page.  Comments  can be made public or only visible to selected people chosen from your buddy list.\u003C/p\u003E\n\n\u003Cp\u003EUsers can also access the Global Comment Database by visiting iComment.com and utilizing the iComment search engine. There users can read comments by entering any search term and starting a query. The search results can lead to valuable web pages and to valuable people that have similar interests.\u003C/p\u003E\n\n\u003Cp\u003EExamples of uses- \u003C/p\u003E\n\n\u003Cp\u003EIf you are planning to buy a product or service, use iComment to find out if the product is good. Is it available at a lower cost on another website? Does the seller honor their warranties? Do they ship on time? Is their service good? What was that \u0026#8220;secret bonus\u0026#8221; they sent you when you ordered?\u003C/p\u003E\n\n\u003Cp\u003EOn a dating website use icomment to find out if the photo of that dater you are interested in is really her. How old is she really? Or, does HE really have a job?\u003C/p\u003E\n\n\u003Cp\u003EOn an auction website comments may include what other bidders are thinking. Perhaps they will share how much they are going to bid? Or, if the seller is legitimate.\u003C/p\u003E\n\n\u003Cp\u003EOn a news website use icomment to express your opinions about articles. Is it true? Is it gossip? Maybe you just want to gossip. That\u0026#8217;s okay too.\u003C/p\u003E\n\n\u003Cp\u003EOn a support website use icomment to solve your technical problems. Read how others solved it. Add your own solutions to problems you solve to help others.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       149],
      "assets/images/resized/0002/4940/24940v2-max-150x150.png"],
     [[157,
       156],
      "assets/images/resized/0002/4940/24940v2-max-250x250.png"],
     [[157,
       156],
      "assets/images/resized/0002/4940/24940v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Mark",
      "last_name": "Ismach",
      "permalink": "mark-ismach",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "10 Fairway Drive",
    "address2": "Suite 124",
    "zip_code": "33441 ",
    "city": "Deerfield Beach",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": 26.3186319,
    "longitude": -80.1105366}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}