{"name": "ICONICS",
 "permalink": "iconics",
 "crunchbase_url": "http://www.crunchbase.com/company/iconics",
 "homepage_url": "http://www.iconics.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "iconics",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 1986,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "real-time-visualization, hmiscada, hmi, scada, manufacturing-intelligence, analytics",
 "alias_list": null,
 "email_address": "info@iconics.com",
 "phone_number": "508-543-8600",
 "description": "HMI/SCADA \u0026 Manufacturing Intelligence",
 "created_at": "Tue May 01 19:57:50 UTC 2012",
 "updated_at": "Wed May 09 09:19:26 UTC 2012",
 "overview": "\u003Cp\u003EFounded in 1986, ICONICS is an independent software developer and Microsoft® Gold Certified Partner of award-winning real-time visualization, HMI/SCADA, manufacturing intelligence and a suite of analytics solutions for operational excellence.\u003C/p\u003E\n\n\u003Cp\u003EICONICS products are used in building automation, renewable energy, utilities, water/wastewater, oil \u0026amp; gas, pharmaceuticals, automotive and many other manufacturing applications. \u003C/p\u003E\n\n\u003Cp\u003EICONICS cultivates an international culture of innovation, creativity and excellence in product design, development, technical support, sales and service. The company is headquartered in Foxborough, Massachusetts, and has offices throughout the United States and in the Netherlands, United Kingdom, Australia, Czech Republic, China, Italy, India, France and Germany, with over 50 percent of its sales coming from its international operations. \u003C/p\u003E\n\n\u003Cp\u003EICONICS’ advanced visualization, productivity and sustainability solutions, built on its flagship GENESIS64 HMI/SCADA and AnalytiX® products, help increase production, reduce energy costs, and curtail carbon-based greenhouse gases. ICONICS products are based on open industry standards, such as OPC, OPC UA, BACnet and many others. ICONICS makes extensive use of Microsoft technology such as; .NET (WPF, WCF, WF), Silverlight, Active Directory, Windows Server, SQL Server, Windows 7, SharePoint 2010, SQL Server (including SQL Server 2012), IE9, Windows Phone 7, Bing Maps, IIS, HTML5 and Office 2010. \u003C/p\u003E\n\n\u003Cp\u003EWith more than 250,000 installations worldwide, ICONICS\u0026#8217; extensive software solutions are used in a wide variety of applications across many industries. In order to meet the high demands of many large and complex applications, ICONICS provides consulting services and extensive training to support its customers, including end users, Systems Integrators, OEM’s and channel partners\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       99],
      "assets/images/resized/0018/7440/187440v2-max-150x150.jpg"],
     [[224,
       149],
      "assets/images/resized/0018/7440/187440v2-max-250x250.jpg"],
     [[224,
       149],
      "assets/images/resized/0018/7440/187440v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}