{"name": "Icon Tech Machinery",
 "permalink": "icon-tech-machinery",
 "crunchbase_url": "http://www.crunchbase.com/company/icon-tech-machinery",
 "homepage_url": "http://www.icontechmachinery.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "machinery",
 "alias_list": null,
 "email_address": "udhay@qq.com",
 "phone_number": "",
 "description": "Machinery Suppliers",
 "created_at": "Thu Nov 08 09:40:45 UTC 2012",
 "updated_at": "Thu Nov 08 22:41:35 UTC 2012",
 "overview": "\u003Cp\u003EIcon Tech Machinery Pvt Ltd., We feel pleasure to introduce ourselves as one of the leading Importers \u0026amp; Suppliers of Fully Automatic Non Woven Bag Making Machine, Aluminium Foil Container, Paper Cup Machines, Paper Plate Machines and Paper Napkin Machines of various Sizes. Our vision to be \u0026#8220;best in the manner in which we operate , best in the products we deliver and best in our value system and ethics.\u0026#8221; \nLaying complete focus on the specifications laid down by our clients, we promise to deliver our products within specified frame of time. Our company is well capable to meet the growing demand of printing and packaging industry. \nCompany established an ultra modern hi-tech manufacturing plant and all the components are built in its own factory by a highly skilled team of engineers using most up date manufacturing method guaranteeing consistent quality and finish. To meet the growing demand of our clients.\nThe quality control policy is followed at every stage of production right from the procurement of raw material to the delivery of finished goods. Icon helps customer to create their value maximize with high technology, high quality and reliable equipments.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}