{"name": "id Software",
 "permalink": "id-software",
 "crunchbase_url": "http://www.crunchbase.com/company/id-software",
 "homepage_url": "http://www.idsoftware.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": 1991,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "game developer",
 "created_at": "Wed Jan 14 19:19:42 UTC 2009",
 "updated_at": "Fri Jun 17 19:22:16 UTC 2011",
 "overview": "\u003Cp\u003Eid Software is responsible for some of the best-selling and most critically acclaimed video games of all time. Located in Mequite Texas, since their founding in 1991. \u003C/p\u003E\n\n\u003Cp\u003EUshering in a new era of interactive entertainment with genre-defining blockbusters like Wolfenstein 3D, DOOM and QUAKE, id has secured itself a place in gaming history as one of the fathers of the modern video game. \u003C/p\u003E\n\n\u003Cp\u003EThey were one of the first game shops to make the shareware distribution model work. \u003C/p\u003E\n\n\u003Cp\u003EIt all began on May 5, 1991, when id Software, fresh off the heels of its success with the Commander Keen series of titles, gave the PC gaming world a glimpse of the future with the shareware release of Wolfenstein 3D. A shot of pure adrenaline, Wolfenstein 3D thrust gamers into a frenetic first-person universe of relentless action that would forever change the face of gaming. \u003C/p\u003E\n\n\u003Cp\u003EWidely recognized as the original first-person shooter, Wolfenstein 3D was later inducted into the Computer Gaming World \u0026#8220;Hall of Fame\u0026#8221; for shaping the overall direction of the video game industry. \u003C/p\u003E\n\n\u003Cp\u003EThen, on December 10, 1994, id unleashed DOOM on the world. A technically stunning opus of heart-stopping action, unspeakable horror and pure gaming bliss, DOOM heralded a paradigm shift in video games. Hardcore PC games were going mainstream. \u003C/p\u003E\n\n\u003Cp\u003ESelling millions of copies and chalking up tens of millions of downloads as shareware, DOOM remains one of the most popular PC games ever. And the title\u0026#8217;s impact on the gaming world is still felt today. \u003C/p\u003E\n\n\u003Cp\u003EWith DOOM, id Software put the shareware distribution model on the map, with the game\u0026#8217;s runaway success owing a debt to the growth of Internet distribution. The company has continued to support shareware and other non-traditional means of distribution, influencing the way companies market and sell video games. \u003C/p\u003E\n\n\u003Cp\u003EDOOM also introduced multiplayer gaming to the masses, allowing players to compete in intense 4-player LAN or head-to-head modem competitions. \u003C/p\u003E\n\n\u003Cp\u003Eid Software didn\u0026#8217;t stop there, the team of innovators also made DOOM\u0026#8217;s source code available to their fan base, encouraging would-be game designers to modify the game and create their own levels, or \u0026#8220;mods.\u0026#8221; Fans were free to distribute their mods of the game, as long as the updates were offered free of charge to other enthusiasts. The mod community took off, giving the game seemingly eternal life on the Internet. In fact, id discovered many of their current employees and development partners based on mods that were created and distributed over the Internet. \u003C/p\u003E\n\n\u003Cp\u003EDOOM and its sequels went on to enjoy tremendous sales on virtually every gaming platform available - from the Sega Genesis to the Game Boy Advance. \u003C/p\u003E\n\n\u003Cp\u003EThe next quantum leap in PC gaming came from id Software in 1996 with the release of QUAKE. Based on an all-new graphics engine, QUAKE was the first truly 3D video game, allowing players to interact with the virtual worlds created by id like never before. Gamers were free to look and move in any direction, giving the game designers at id the freedom and ability to create incredibly immersive environments in this epic, single-player game. \u003C/p\u003E\n\n\u003Cp\u003Eid Software continued the tradition of QUAKE, with QUAKE II in 1997. Supporting multiplay for up to 32 players simultaneously, QUAKE II was a watershed hit for the company, selling more than one million copies, despite it\u0026#8217;s steep hardware requirements. By now, it had become clear that id\u0026#8217;s games were reason enough to upgrade, or even buy, personal home computers. \u003C/p\u003E\n\n\u003Cp\u003EIn 1999, the easy-going guys from Mesquite further cemented their place in gaming lore with the ultimate deathmatch experience, QUAKE III Arena and the QUAKE III: Team Arena add-on pack. Designed to be the ultimate multiplayer experience, QUAKE III Arena has become the defacto standard for professional gamers and is the game of choice for tournaments around the world. A QUAKE III Arena tournament is the centerpiece of id\u0026#8217;s annual QuakeCon tournament and LAN party, played every summer near the company\u0026#8217;s headquarters in Mesquite. QuakeCon 2001 winners alone pulled in a combined $50,000 in cash and prizes. \u003C/p\u003E\n\n\u003Cp\u003EIn 2001, id Software teamed up with Gray Matter Interactive and Nerve Software to develop Return to Castle Wolfenstein, a re-imagining of the original classic, Wolfenstein 3D. Built around the Quake III Arena graphics engine, Return to Castle Wolfenstein introduced a new generation of gamers to the epic series that started it all. In its first two months of release, Return to Castle Wolfenstein shipped over one million units worldwide, and has been widely acclaimed as one of the best computer games of 2001. \u003C/p\u003E\n\n\u003Cp\u003EThe company also has enjoyed success licensing its revolutionary technology to other developers. To date, id\u0026#8217;s game engines have powered blockbuster titles from other producers, including Call of Duty, Soldier of Fortune, Half-Life, Medal of Honor: Allied Assault, Star Trek: Elite Force, Heretic, Hexen and more. \u003C/p\u003E\n\n\u003Cp\u003EIn August of 2004, id Software released the next chapter in the DOOM legacy, Featuring a new, mind-blowing gaming engine from John Carmack, bringing a terrifying new storyline based on the original masterpiece. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       150],
      "assets/images/resized/0003/3861/33861v1-max-150x150.jpg"],
     [[132,
       158],
      "assets/images/resized/0003/3861/33861v1-max-250x250.jpg"],
     [[132,
       158],
      "assets/images/resized/0003/3861/33861v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Quake Live",
    "permalink": "quake-live",
    "image":
     {"available_sizes":
       [[[150,
          38],
         "assets/images/resized/0003/3858/33858v1-max-150x150.jpg"],
        [[250,
          64],
         "assets/images/resized/0003/3858/33858v1-max-250x250.jpg"],
        [[410,
          105],
         "assets/images/resized/0003/3858/33858v1-max-450x450.jpg"]],
      "attribution": null}}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition":
  {"price_amount": null,
   "price_currency_code": "USD",
   "term_code": null,
   "source_url": "http://paidcontent.org/article/419-zenimax-media-buys-game-developer-idsoftware",
   "source_description": "ZeniMax Buys Game Developer id Software",
   "acquired_year": 2009,
   "acquired_month": 6,
   "acquired_day": 24,
   "acquiring_company":
    {"name": "ZeniMax",
     "permalink": "zenimax",
     "image":
      {"available_sizes":
        [[[150,
           43],
          "assets/images/resized/0000/2101/2101v1-max-150x150.png"],
         [[164,
           48],
          "assets/images/resized/0000/2101/2101v1-max-250x250.png"],
         [[164,
           48],
          "assets/images/resized/0000/2101/2101v1-max-450x450.png"]],
       "attribution": null}}},
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "1500 North Greenville Avenue",
    "address2": "",
    "zip_code": "75081",
    "city": "Richardson",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}