{"name": "IEQualize",
 "permalink": "iequalize",
 "crunchbase_url": "http://www.crunchbase.com/company/iequalize",
 "homepage_url": "http://www.iequalize.de",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": 18,
 "founded_year": 2009,
 "founded_month": 4,
 "founded_day": 30,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "energy-smart-metering-monitoring-embedded-server-multitouch-terminals-industrial",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Substainable with IQ",
 "created_at": "Mon Apr 23 13:27:31 UTC 2012",
 "updated_at": "Mon Apr 30 00:53:22 UTC 2012",
 "overview": "\u003Cp\u003EIEQualize in a nutshell\u003C/p\u003E\n\n\u003Cp\u003EOur name is our commitment:\u003C/p\u003E\n\n\u003Cp\u003EThe remote maintenance and smart-meter solutions developed by IEQualize mean extra freedom in metering, operating, controlling and optimizing.\u003C/p\u003E\n\n\u003Cp\u003EThe embedded-server systems developed by IEQualize are designed to meet the needs of all trades and can be used to control your heating system, monitor the electricity yields of a solar collector system or combined heat and power plant, or just your private power consumption.\u003C/p\u003E\n\n\u003Cp\u003EBest available technology tailored to the requirements of energy efficiency and modern communication. Directly from the telemaintenance pioneers.\u003C/p\u003E\n\n\u003Cp\u003EControl and communication:\u003C/p\u003E\n\n\u003Cp\u003EIEQualize experts develop embedded-server systems for networked communication in both industrial companies and private households ? down to the smallest entities found in private homes. No matter what application, our know-how relies on state-of-the-art communication technologies and uses the web infrastructure for accurately recording, monitoring or transmitting data.\u003C/p\u003E\n\n\u003Cp\u003EThe telemaintenance pioneers:\u003C/p\u003E\n\n\u003Cp\u003EIEQualize are pioneers in the domain of telemaintenance. For 20 years, IEQualize have developed their own innovative product series of Internet servers and their peripherals. This allows us to connect virtually every engineering facility to the Internet.\u003C/p\u003E\n\n\u003Cp\u003EOur solutions can capture and log any type of data (including meter readings, temperatures and status messages) centrally (via web portal) or locally. All you need for this is a mobile phone, PDA or any in-house display, or MID \u0026#8220;Mobile Internet Device\u0026#8221;. This is because we have found a clever way of integrating radio technology into sensor and web technologies.\u003C/p\u003E\n\n\u003Cp\u003EYour ideal technology partner:\u003C/p\u003E\n\n\u003Cp\u003EThe team of IEQualize is your ideal partner for implementing up-to-date know-how into your customer products. Our service portfolio ranges from hardware and software engineering for embedded-server systems to Internet portal applications and complete with the required data bases.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0018/5492/185492v2-max-150x150.jpg"],
     [[189,
       42],
      "assets/images/resized/0018/5492/185492v2-max-250x250.jpg"],
     [[189,
       42],
      "assets/images/resized/0018/5492/185492v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}