{"name": "iFormulary",
 "permalink": "iformulary",
 "crunchbase_url": "http://www.crunchbase.com/company/iformulary",
 "homepage_url": "http://www.fitnessformulary.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "consumer-internet, e-commerce, nutrition, fitness, wellness",
 "alias_list": null,
 "email_address": "strategy@fitnessformulary.com",
 "phone_number": "612.501.7855",
 "description": "nutrition-centric e-Commerce retailer",
 "created_at": "Wed May 15 13:48:34 UTC 2013",
 "updated_at": "Thu May 16 00:31:40 UTC 2013",
 "overview": "\u003Cp\u003EiFormulary (iF) is a disintermediation play in the vitamin, mineral, supplement (VMS) and nutritional food segment, a $41B domestic market with strong growth. More importantly, iF provides a solution for consumers who are overwhelmed with the abundance of competing nutritional claims, all clamoring for their attention. The consumer wants to know, what to eat in support of their specific health and wellness goals.\u003C/p\u003E\n\n\u003Cp\u003EThe centerpiece of the Formulary is the ability of a user, who has identified (via an easy to use menu) their health and wellness goals, to derive explicit, unbiased and customized nutritional recommendations.  Once a visitor has provided their health goals, our patent-pending Efficacy Engine™ force ranks ingredients and supplements that correlate with the underlying condition and goals as itemized by the consumer. Each of these ingredients is ranked by offering their relative value (A-F) and buttressed by immediately callable clinical studies that document each claim(s). Co-morbidities (if relevant) for each VMS product are highlighted to enable the consumer to understand that a product appropriate for one condition may be contraindicated for another. The consumer is presented with a full ingredient breakdown of both natural and commercial products which contain these ingredients that best support their stated health objectives. \u003C/p\u003E\n\n\u003Cp\u003EiF is the ‘honest broker’ in this process, the Efficacy Engine won’t rank one product over another on any criteria other than the science.  We have no ‘dog in this fight’, no private-label line we’re extolling.  Armed with the data, the consumer can decide a) what to order and b) do so in an Amazon tier fulfillment environment.  \u003C/p\u003E\n\n\u003Cp\u003EIn concert with iFormulary’s recruited channel partners (health \u0026amp; fitness clubs, health/condition advocacy associations, health insurance plans \u0026amp; providers, education), our partner and their client derive a service viewed as high value.  Our channel partner receives a profit share, augmenting their revenue stream with no incremental expense, other than working with iF to direct and incentivize their client base to the merit of the iF website and service, without a subscription expense for the consumer.\u003C/p\u003E\n\n\u003Cp\u003EThe iF leadership team is committed to demonstrate our model in a launch channel of Health \u0026amp; Fitness Clubs. Fifty million consumers are regular patrons of a health club.  Health Club patrons purchase an average of $263/year of VMS and nutritional foods. More than half of these purchases are made online via a variety of outlets (COSTCO, GNC, Vitamin Shoppe, etc.).  With the opportunity to enjoy diminished health/fitness club dues and a robust loyalty program, a dominant percentage of these patrons (survey of 5k members across 10 clubs) indicated their willingness to switch to iFormulary. By partnering with fitness chains and operators, we augment site revenue due to the profit share we provide from e-Commerce activity with their patrons. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Drew",
      "last_name": "McCartney",
      "permalink": "drew-mccartney",
      "image": null}},
   {"is_past": false,
    "title": "CIO",
    "person":
     {"first_name": "Kevin",
      "last_name": "Kruse",
      "permalink": "kevin-kruse",
      "image": null}},
   {"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Adam",
      "last_name": "Southam",
      "permalink": "adam-southam",
      "image": null}},
   {"is_past": false,
    "title": "CFO",
    "person":
     {"first_name": "Mark",
      "last_name": "Richards",
      "permalink": "mark-richards-6",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Outside legal counsel",
    "is_past": false,
    "provider":
     {"name": "FraFrank Vargas, Rincon Law",
      "permalink": "frafrank-vargas-rincon-law",
      "image": null}}],
 "total_money_raised": "$719k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 719000.0,
    "raised_currency_code": "USD",
    "funded_year": 2012,
    "funded_month": 6,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Minneapolis Office",
    "address1": "5051 Highway 7",
    "address2": "Suite 260",
    "zip_code": "55416",
    "city": "Minneapolis",
    "state_code": "MN",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}