{"name": "iHospital",
 "permalink": "ihospital",
 "crunchbase_url": "http://www.crunchbase.com/company/ihospital",
 "homepage_url": "http://www.theihospital.com",
 "blog_url": "http://www.theihospital.com/about-ihospital/blog/",
 "blog_feed_url": "http://www.theihospital.com/about-ihospital/blog/",
 "twitter_username": "iHospital",
 "category_code": "mobile",
 "number_of_employees": 50,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "apple-repair, ross-newman",
 "alias_list": null,
 "email_address": "service@theihospital.com",
 "phone_number": "(888) 407-5767",
 "description": "Tech Repair Company",
 "created_at": "Wed Oct 17 13:01:07 UTC 2012",
 "updated_at": "Wed Oct 24 23:54:47 UTC 2012",
 "overview": "\u003Cp\u003EHistory\u003C/p\u003E\n\n\u003Cp\u003EiHospital was founded by Dr. Ross Newman, D.i.D. Doctor of iDevices with one basic idea; provide a large range of repairs and services on Apple® iDevices and Computers with exemplary knowledge and customer service in a one-stop-shop atmosphere.\u003C/p\u003E\n\n\u003Cp\u003EAn Exclusive Approach to Apple Device Repair\u003C/p\u003E\n\n\u003Cp\u003ERather than repairing every make and model of electronic devices, iHospital has trained all of it’s D.i.D. Doctor of iDevices to focus on one family of products, Apple®.\u003C/p\u003E\n\n\u003Cp\u003EWe have also ensured that all repairs are done Same Day, some are done in a matter of minutes. This concept has proven to be the most successful and rewarding experience for both our customers and the iHospital family. We go above and beyond when performing any service or repair by forming relationships with each and every one of our customers for life.\u003C/p\u003E\n\n\u003Cp\u003EWhat Sets iHospital apart from the Competition\u003C/p\u003E\n\n\u003Cp\u003EiHospital uses only the highest quality of original OEM parts for all repairs backed with a One-year Warranty**. Hard drives are replaced with new, not refurbished, high-speed hard drives, and RAM (Memory) is replaced with only the highest quality of new RAM. We are experts in Data Recovery and can transfer your data from a damaged or failing hard drive to a new hard drive or computer.\u003C/p\u003E\n\n\u003Cp\u003EiHospital doesn’t only repair devices but also upgrades these devices and offers a full range of accessories for them. Why should you have to buy a new Apple computer or iDevice if it can be reconditioned or upgraded? The good news is that you don’t. iHospital Doctors can upgrade most computers to the same specs newer computers are being sold with, sometimes even better.\u003C/p\u003E\n\n\u003Cp\u003EOur stores also carry a large selection of cases and accessories. We want to prevent you from breaking your device again so we have stocked some of the best cases available. Long lines and wait times are a thing of the past here at the iHospital!\u003C/p\u003E\n\n\u003Cp\u003EWant to learn how to use your Apple Device like the pro’s do?\u003C/p\u003E\n\n\u003Cp\u003EApple devices such as the iPod, iPhone, iPad and Mac have thousands of features – why not learn how to use them all? iHospital’s D.i.D. Doctor of iDevices are proud to offer in-house, on-site and virtual online training as well as educational services for you and your team.  We look forward to helping you further your understanding of Apple devices, repairs and upgrades.  Check out more information about our D.i.D. Doctor of iDevices Training.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/5935/215935v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0021/5935/215935v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0021/5935/215935v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.tampabay.com/news/business/article1223878.ece",
    "title": "For Apple devices, Tampa's iHospital is a place of healing"},
   {"external_url": "http://online.wsj.com/article/SB10001424052702304636404577291801968977974.html",
    "title": "n This ER, Doctors Operate on Pocket-Size Patients"}]}