{"name": "ILANTUS Technologies",
 "permalink": "ilantus-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/ilantus-technologies",
 "homepage_url": "http://www.ilantus.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 1999,
 "founded_month": 6,
 "founded_day": 22,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "user-provisioning, access-management, enterprise-wide-single-sign-on, federated-identity-management, role-engineering, compliance-management, identity-access-governance, access-governance, saas, cloud-access-governance-solution, agaas, regulatory-complian",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+1 847 466 1768",
 "description": "The Identity Management People",
 "created_at": "Tue Aug 21 09:15:56 UTC 2012",
 "updated_at": "Mon Aug 27 22:33:49 UTC 2012",
 "overview": "\u003Cp\u003EILANTUS Technologies is a leading global solutions provider in the domain of end Identity, Access Management (IAM) \u0026amp; Access Governance with offices in US, Canada and India.\u003C/p\u003E\n\n\u003Cp\u003EILANTUS has a proven service track record of successful IAM implementations for Fortune 500 companies including some of the largest Banking and Financial Services, Information Technology, Telecommunication, IT Enabled Services (ITES), Manufacturing, Health care, Retail and Government sector organizations.\u003C/p\u003E\n\n\u003Cp\u003EA niche player in the domain of IAM \u0026amp; Compliance, ILANTUS has implemented over 300 projects spanning across all areas of IAM such as User Provisioning, Access Management, Enterprise Wide Single Sign-On, Federated Identity Management, Role Engineering and Compliance Management. Having been an early entrant in the IAM space, since the inception of IAM technologies, ILANTUS has evolved in scale and stature and marked itself as a clear leader in this industry segment.\u003C/p\u003E\n\n\u003Cp\u003EILANTUS in collaboration with Telus provides Identity \u0026amp; Access Management Services in SaaS (Software as a Service) mode. Customers in this mode do not have to make any investment in Identity Management software and associated hardware. The one time implementation fees can also be rolled into monthly/quarterly rentals. The L2, L3 support is also provided by ILANTUS. ILANTUS also provides complete managed services, where in the day to day administration and operation can be managed by ILANTUS for customer installations. \u003C/p\u003E\n\n\u003Cp\u003EILANTUS also provides Access Governance solution in the SaaS (Software as a Service) mode. In fact ILANTUS in partnership with Telus is the first company worldwide to provide this. \u003C/p\u003E\n\n\u003Cp\u003EBased on its extensive experience in the IAM space, ILANTUS understands the complexities and demanding issues in IAM ranging from Regulatory compliance issues, Business processes and Technology deployment. In addition to the understanding and experience of using IAM solutions to enable regulatory compliance with SOX, HIPAA, PCI etc., ILANTUS has developed vertical specific experience across various industry verticals.\u003C/p\u003E\n\n\u003Cp\u003ETo help its clients derive optimum value from their investments, ILANTUS employs a unique “Right Shoring model” that leverages on-site, off-site and off-shore resources to provide services across multiple global locations. This not only de-risks our clients’ business but also ensures cost effective delivery on a consistent basis.\u003C/p\u003E\n\n\u003Cp\u003EILANTUS has also set up ‘Global Competency Centers’ in Bangalore, India, to provide focused services and support to its clients and partners globally.\u003C/p\u003E\n\n\u003Cp\u003EILANTUS has built a post-implementation support model for clients that is ideal for speedy resolution of issues encountered during the operations phase. Providing break-fix support, periodic health checks and best practices build, ILANTUS ensures customer implementation attains higher level of maturity over a period of time. ILANTUS has built a reputation for developing products that add further value to customer deployments. These products are available in the area of integration and compliance. Products such as \u0026#8220;Password Management Portal on Active Directory\u0026#8221; are the best available in the industry from operation and functional perspective in the industry.\u003C/p\u003E\n\n\u003Cp\u003EILANTUS is one of the very few End to End Solution provisioning company in IAM \u0026amp; Compliance with more than 9 years of experience with all key technologies and solution.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       55],
      "assets/images/resized/0020/7175/207175v2-max-150x150.png"],
     [[250,
       92],
      "assets/images/resized/0020/7175/207175v2-max-250x250.png"],
     [[300,
       111],
      "assets/images/resized/0020/7175/207175v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}