{"name": "ILG Energy",
 "permalink": "ilg-energy",
 "crunchbase_url": "http://www.crunchbase.com/company/ilg-energy",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Gas",
 "created_at": "Fri Jul 27 06:38:43 UTC 2012",
 "updated_at": "Mon Jul 30 21:29:24 UTC 2012",
 "overview": "\u003Cp\u003EILG Energy: Eliminating Energy Waste\u003C/p\u003E\n\n\u003Cp\u003EWhen it comes to natural gas and oil, there is a lot of waste out there. This can be shown in commonly abandoned stripper wells. Many people don’t realize that after one of these wells has been abandoned, it can remain active for years to come. This means that a well that is not being used is still pulling natural gas or oil – and ILG sees this as wasted energy. \u003C/p\u003E\n\n\u003Cp\u003EAlthough the daily amount of energy resources a stripper well pulls is small in comparison to larger rigs, over time, the 10 to 15 daily barrels that can come from over 400,000 stripper wells nationwide can really add up. This energy company knows that every ounce of natural gas and oil that comes from US soil can help to build a stronger, healthier economy. They also know that putting abandoned stripper wells to use can help to ensure that the future of energy in the United States stays strong. \u003C/p\u003E\n\n\u003Cp\u003ETapping an unused market\u003C/p\u003E\n\n\u003Cp\u003EAs an energy company that is forward thinking, with a focus on safety, efficiency, and environmentally friendly methods, it makes sense that ILG would expand their expertise to stripper wells. ILG Energy works to find the owners of the land where these wells sit and negotiates with them to ensure that land owners, as well as oil companies can benefit from the arrangements they build. \u003C/p\u003E\n\n\u003Cp\u003EThere are many reasons to put these abandoned stripper wells back to work, and this energy company believes that putting unused resources to work is a cost effective and profitable venture. Some of the reasons for using abandoned stripper wells include:\u003C/p\u003E\n\n\u003Cp\u003E● No need to build new wells. They are already in place and will be ready to use quickly. \n● A wealth of natural gas or oil that lies beneath the soil. Although these wells are capped or abandoned, they can still produce a significant amount of valuable resources.\n● An abundance of abandoned wells ensures solid opportunities and maximum profitability for companies just like yours. \u003C/p\u003E\n\n\u003Cp\u003EThe United States needs to be able to produce enough energy for all of its needs. ILG Energy believes that stripper wells can go a long way toward providing even more energy security to the country; by eliminating wasted resources, they are working to ensure a brighter energy future for years to come.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0020/3130/203130v2-max-150x150.png"],
     [[250,
       153],
      "assets/images/resized/0020/3130/203130v2-max-250x250.png"],
     [[260,
       160],
      "assets/images/resized/0020/3130/203130v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}