{"name": "ImGuni",
 "permalink": "imguni",
 "crunchbase_url": "http://www.crunchbase.com/company/imguni",
 "homepage_url": "http://www.imguni.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Im_Guni",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": 8,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-computer-technical-support, technical-support, technical-support-services, computers-support, software-support, modem-support, router-support, printer-support, scanner-support, computer-virus-support, spyware-removal-support, computer-optimization,",
 "alias_list": null,
 "email_address": "info@imguni.com",
 "phone_number": "18778118116",
 "description": "The Warehouse of Online IT Services",
 "created_at": "Tue Mar 15 20:24:17 UTC 2011",
 "updated_at": "Mon Mar 21 20:21:19 UTC 2011",
 "overview": "\u003Cp\u003EThe Warehouse of Online IT Support And Services.\u003C/p\u003E\n\n\u003Cp\u003EImGuni computer technical support has a wide range of services wherein they provide assistance with technology products such as computers, software, modem, router, printer, scanner and any product connected with PC. In general, they help the user to solve specific problems with a product along with providing basic training of pc usage, customization or other support services.\u003C/p\u003E\n\n\u003Cp\u003EImGuni is the Online Computer Technical Support and Services organization, making sure that the customers are treated with utmost priority and care. They have highly skilled and trained Microsoft Certified Professionals, Cisco certified professionals and Backup and Recovery experts, who strive hard to resolve each and every query of the customer.\u003C/p\u003E\n\n\u003Cp\u003EHere is the glimpse of some of the services that Imguni provides : \nVirus diagnosis, virus removal, PC Tune-up, ID theft protection, email account setup, software installation, printer setup, computer troubleshooting, network setup, wireless setup, ISP support and many more.\u003C/p\u003E\n\n\u003Cp\u003EImGuni Online Computer Technical support may be delivered over the telephone, online, chat or by E-mail. Technician log a call/ incident so that if the issue persists than it can be taken to next level rather than starting whole thing again. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[70,
       40],
      "assets/images/resized/0012/6390/126390v2-max-150x150.jpg"],
     [[70,
       40],
      "assets/images/resized/0012/6390/126390v2-max-250x250.jpg"],
     [[70,
       40],
      "assets/images/resized/0012/6390/126390v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "ImGuni Ltd",
    "address1": "311 Shoreham Street",
    "address2": "",
    "zip_code": "S2 4FA",
    "city": "Shefffield",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}