{"name": "Inatech Solutions",
 "permalink": "inatech-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/inatech-solutions",
 "homepage_url": "http://www.inatech.com",
 "blog_url": "http://www.calsoftblog.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2002,
 "founded_month": 4,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "oracle, microsoft, business-consulting, e-business, crm, scm, managed-services, training",
 "alias_list": null,
 "email_address": "shwetha.bn@inatech.com",
 "phone_number": "",
 "description": "Technology Consultant",
 "created_at": "Wed Nov 18 11:36:59 UTC 2009",
 "updated_at": "Wed Nov 18 18:24:28 UTC 2009",
 "overview": "\u003Cp\u003EInatech is a global business solutions software and product engineering services company with strategic locations worldwide, and qualified consultants, working across industries. As an Oracle Certified Advantage Partner and Microsoft Gold Certified partner, Inatech works with enterprises that are re-engineering their processes and are adapting to rapid change. With its EMEA headquarters in London, UK, and offices in 16 cities in 8 countries, Inatech takes advantage of an onshore and offshore resource model to provide various services to its clients which deliver better value. Inatech is an ethical business with a shared belief that what is right for the environment and the workforce is right for the bottom line.\u003C/p\u003E\n\n\u003Cp\u003EFounded in 2002, Inatech manages solutions development, systems management, and outsourcing. In 2007, Inatech was acquired by the Calsoft Group to strengthen its Oracle solutions portfolio. An international perspective, along with a keen eye on the local goals of their individual clients, has brought them industry recognition along with business success. With a wide and comprehensive set of offerings based on Oracle and Microsoft, Inatech has been growing consistently and expanding into various territories, Middle East being the latest market where Inatech has been extremely successful in helping clients in providing Business Solutions, with agility, professionalism and innovation.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "founder",
    "person":
     {"first_name": "Srihari",
      "last_name": "Vedante",
      "permalink": "srihari-vedante",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "2 Gayton Road, Harrow, ",
    "address2": "London HA1 2XU, UK. ",
    "zip_code": "HA1 2XU",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}