{"name": "IncentiveTravel.com",
 "permalink": "incentivetravel-com",
 "crunchbase_url": "http://www.crunchbase.com/company/incentivetravel-com",
 "homepage_url": "http://www.incentivetravel.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 20,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "michael@incentivetravel.com",
 "phone_number": "",
 "description": "Community for Travel Professionals",
 "created_at": "Mon Oct 08 14:23:08 UTC 2012",
 "updated_at": "Wed Oct 17 23:54:56 UTC 2012",
 "overview": "\u003Cp\u003EIn a world that thrives off relationships IncentiveTravel.com gets you connected!\nJoin the network that matters most for the incentive and meeting travel industry -IncentiveTravel.com.\nExpanding your reach of business networks is essential for professional success, business growth and making your mark in the industry. Our mission is to provide incentive and meeting travel professionals the vehicle to drive these connections.\nConnecting the right people, information and ideas have always been essential in providing successful meeting and incentive programs. In today\u0026#8217;s complex, competitive and interconnected world, it is vital for success. Top business leaders know their networks are what create the difference.\u003C/p\u003E\n\n\u003Cp\u003EGet Connected!\nAre you connected to the most influential people in your market, industry, region etc?\nConnect or become introduced and forget about exchanging business cards. Evolve using IncentiveTravel.com to stay ahead in an ever changing world ruled by technology. After joining the Incentive Travel community you will begin by creating a profile that showcases your professional accomplishments and community achievements. Your profile will assist you in connecting to former colleagues, clients and partners. You can establish more connections by simply inviting trusted contacts to join you on IncentiveTravel.com.\u003C/p\u003E\n\n\u003Cp\u003EFollow!\nStay in touch with your suppliers. When you elect to follow, you will be eligible to receive updates and press releases in your feed as they are posted.\u003C/p\u003E\n\n\u003Cp\u003EShare!\nGive more than you take. This is best way to forge relationships and be noticed by contacts seeking business. What do you have to give? Advice, leads, links to relevant articles, compassion, your time and more. Give knowledge that will show others you are a resourceful and helpful professional who cares about others. Your contacts will soon become friends and the relationships that emerge will be mutually beneficial.\u003C/p\u003E\n\n\u003Cp\u003EReview!\nSubmit supplier reviews on industry services. Use this tool when searching for potential providers.\u003C/p\u003E\n\n\u003Cp\u003ECollaborate!\nHave a question? Participate in one of many forums listed on our peer exchange. Get the answers you need from the community you trust.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}