{"name": "IncRev",
 "permalink": "increv",
 "crunchbase_url": "http://www.crunchbase.com/company/increv",
 "homepage_url": "http://www.increvcorp.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": 8,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "product-development-services, software-development-services, outsourced-development-services",
 "alias_list": null,
 "email_address": "info@increvcorp.com",
 "phone_number": "408-689-2296",
 "description": "Software Development Services",
 "created_at": "Mon Jan 24 21:19:36 UTC 2011",
 "updated_at": "Wed Feb 02 22:26:22 UTC 2011",
 "overview": "\u003Cp\u003EIncRev has been in the software development services industry since 2006, with significant experience in developing various software packages and solutions from ground up and integrating various other software products.  IncRev is unique in its service offering that it combines Product Management expertise along with product development expertise on all development projects, providing customers a single organization to work with and assign full responsibility for overall delivery.\u003C/p\u003E\n\n\u003Cp\u003EIncRev Corporation is headquartered in Sunnyvale, California, with a full offshore development center based in Bangalore, India.  \u003C/p\u003E\n\n\u003Cp\u003EIncRev Corporation has extensive expertise in developing software using Microsoft .NET technologies, Java, Microsoft SQL Server, and Oracle Database.  IncRev has also developed solutions using PHP, Ruby on Rails along with HTML, JavaScript, JQuery and other leading edge technologies.  IncRev has developed solutions that are both hosted on-premise and in the cloud.  \u003C/p\u003E\n\n\u003Cp\u003EIncRev is one of the premier partners of Microsoft, and has developed solutions using Microsoft Azure platform, for the initial launch of the Azure platform.  IncRev has also been partners of SAP (NetWeaver program) and Oracle.\u003C/p\u003E\n\n\u003Cp\u003EIncRev has functional expertise in various industries that encompass Enterprise applications, Internet and Consumer applications, and Mobile applications.  \u003C/p\u003E\n\n\u003Cp\u003EIncRev is founded by a team professionals, who have extensive software product development and management experience from companies like, Oracel, Microsoft, i2, CommerceOne, TechMahindra and others.  IncRev team professionals have long established careers in CTO roles, Engineering Leadeship roles, International Business Operations Leadership roles, Product Management Leadership roles and Program Management roles.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[90,
       150],
      "assets/images/resized/0011/8799/118799v2-max-150x150.png"],
     [[150,
       250],
      "assets/images/resized/0011/8799/118799v2-max-250x250.png"],
     [[270,
       450],
      "assets/images/resized/0011/8799/118799v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}