{"name": "India Movers Packers",
 "permalink": "india-movers-packers",
 "crunchbase_url": "http://www.crunchbase.com/company/india-movers-packers",
 "homepage_url": "http://www.indiamoverspackers.com/",
 "blog_url": "http://www.indiamoverspackers.com/",
 "blog_feed_url": "http://www.indiamoverspackers.com/",
 "twitter_username": null,
 "category_code": "other",
 "number_of_employees": 30,
 "founded_year": 2006,
 "founded_month": 1,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "packers-and-movers, packers-movers",
 "alias_list": null,
 "email_address": "jihansharma@gmail.com",
 "phone_number": "09312072523",
 "description": null,
 "created_at": "Sat Nov 01 12:19:39 UTC 2008",
 "updated_at": "Thu Apr 30 04:06:28 UTC 2009",
 "overview": "\u003Cp\u003EPackers \u0026amp; Movers Directory of India (www.indiamoverspackers.com) expands their services to more cities. It is an online platform that provides hassle free shifting services to all the major cities of India. To strengthen their shifting services it has recently expanded their services to more cities, said the company source. Currently it is offering shifting services in all the major cities of India like Delhi, Gurgaon, Noida, Ghaziabad, Faridabad, Chandigarh, Jaipur, Bikaner, Jodhpur, Udaipur, Hissar, Jodhpur, Kolkata, Siliguri, Dehradun, Shimla, Manali, Jammu, Srinagar, Chennai, Bangalore, Mysore, Cochin, Trivandrum, Goa, Pune, Hyderabad, Baroda, Ahmedabad, Surat, Lucknow, Mohali, etc.\u003C/p\u003E\n\n\u003Cp\u003EThis online platform has listed reputed and experienced moving companies from all over the country. It offers valuable information about all the major reputed moving companies of the country. If you are planning to shift your home or office to the new destination (in any part of the country or across the country) check out this online platform of domestic and international shifting service providers. You will surly find a comprehensive solution for your all types of relocation needs. Whether it is residential relocation or commercial relocation and domestic relocation or international relocation, definitely you will find on this online platform some of reputed moving companies that can make shifting or relocation easier and hassle free. \u003C/p\u003E\n\n\u003Cp\u003EListed moving companies on IndiaMoversPackers.Com are reliable, economical and have long experience in the industry. They provide door to door consignment services. They provide hassle free shifting services. They provide economical and cost effective \u0026lt;a href=\u0026quot;http://www.indiamoverspackers.com/\u0026quot;\u0026gt;packers and movers\u0026lt;/a\u0026gt; services. They provide safe and secure moving services. Some of listed companies on this web portal also provide warehousing and storage services. They have their warehouses and storage spaces in all the major cities of the country. In this way they assist people from all over the country in their warehousing needs.\u003C/p\u003E\n\n\u003Cp\u003EListed moving companies on \u0026lt;a href=\u0026quot;http://www.indiamoverspackers.com/\u0026quot;\u0026gt;IndiaMoversPackers.Com\u0026lt;/a\u0026gt; provide full and customizable shifting services. Their full shifting services includes packing, moving, loading, unloading, unpacking and rearranging. If required they also provide warehousing facilities. Some of moving companies also provide car carrier and transportation services. If you are looking for reputed packing and moving service providers IndiaMoversPackers.Com can be best friend and platform. You can find on this platform a complete solution for all your relocation needs. Also you can find valuable information about some of reputed moving companies of the country. You can also find on this platform valuable packing and moving tips free of cost. \u003C/p\u003E\n\n\u003Cp\u003EYou can also find information about some other valuable services on this online platform like courier services, parcel services, logistic services, air cargo services, sea cargo services, insurance coverage, and international shifting services with custom clearance and documentation. For more information about packers movers services in India and across the country and information about reputed moving companies of the country, check out our complete directory of \u0026lt;a href=\u0026quot;http://www.indiamoverspackers.com/\u0026quot;\u0026gt;Packers Movers\u0026lt;/a\u0026gt;. \u003C/p\u003E\n\n\u003Cp\u003EAddress\nA2/A2 , 3rd Floor, Shiv Arcade, Acharya Niketan, Mayur Vihar, Phase - 1, New Delhi-110091, India \nPhone: +91-11-43024997\nMobile : +91-9312072523 , 9911918545\nFax: +91-11-43024997\nEmail:  dipesh@etradeservices.com\u003Cbr/\u003E\nSite: http://www.indiamoverspackers.com/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       16],
      "assets/images/resized/0004/0091/40091v1-max-150x150.png"],
     [[250,
       27],
      "assets/images/resized/0004/0091/40091v1-max-250x250.png"],
     [[450,
       50],
      "assets/images/resized/0004/0091/40091v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "A2/A2 , 3rd Floor, Shiv Arcade, ",
    "address2": "Acharya Niketan, Mayur Vihar, Phase - 1,",
    "zip_code": "110091",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": 28.7583999,
    "longitude": 77.1553903}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        94],
       "assets/images/resized/0004/0092/40092v1-max-150x150.png"],
      [[250,
        157],
       "assets/images/resized/0004/0092/40092v1-max-250x250.png"],
      [[450,
        283],
       "assets/images/resized/0004/0092/40092v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.indiamoverspackers.com/",
    "title": "Packers and Movers - Packers Movers, Movers and Packers, Packers and Movers Bangalore"}]}