{"name": "Indiacircus",
 "permalink": "indiacircus",
 "crunchbase_url": "http://www.crunchbase.com/company/indiacircus",
 "homepage_url": "http://www.indiacircus.com",
 "blog_url": "http://indiacircus.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "Indiacircus",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mediaenquiries@indiacircus.com",
 "phone_number": "91-22-43471199",
 "description": "A Contemporary Lifestyle Brand ",
 "created_at": "Tue Mar 05 11:26:38 UTC 2013",
 "updated_at": "Thu Mar 07 05:21:57 UTC 2013",
 "overview": "\u003Cp\u003ECurated Creative Contemporary Culture \nIndiaCircus A Lifestyle Label - Shop at www.indiacircus.com\u003C/p\u003E\n\n\u003Cp\u003EIndia Circus is a contemporary design label that seeks to offer affordable, Indo-centric, and sophisticated designs. The collections offer various life-style products, ranging from furniture and home decor to personal accessories. Lead by Devaki Khimji, Krsna Mehta, and Hadi Curtay, India Circus is Krsna\u0026#8217;s very first design venture for his own label. India Circus designs seek to introduce modern sensibilities to Indian aesthetic traditions. \u003C/p\u003E\n\n\u003Cp\u003EWith an All-Indian palette, India Circus draws inspiration from both Mughal Royalty as well as road-side chai, and then juxtaposes this image with that of an iPad, for instance, to create a Mughal themed iPad sleeve. India Circus is a curation of diverse and distinct moods and tones that Mr. Mehta identifies as his vision of contemporary India. The vibrancy of colors and modern sensibility, combined with the nuanced heritage of the designs, makes each piece created at India Circus exceptional. India Circus, a flamboyant act, is here! \u003C/p\u003E\n\n\u003Cp\u003EWhat sets India Circus apart is their strategy for reaching out to maximum number of customers all over the world. India Circus is available through their portal www.indiacircus.com. Each and every product from the range is available through the online sales gateway and is delivered in specially created packaging.  indiacircus.com is an exciting and user-friendly online store offering design centric lifestyle merchandise that takes further the vision of the brand: Designing, discovering and showcasing a contemporary Indian aesthetic.“With the portal, we would like to create a distinct identity of contemporary India and its myriad colours, moods, motifs and people”, adds Hadi Curtay of India Circus.  India Circus is also available in a \u0026#8220;shop in shop\u0026#8221; within Westside in their entire network of stores all over the country \u0026amp; various other online stores.  \u003C/p\u003E\n\n\u003Cp\u003EThe India Circus product range includes Home Décor, Dinning and Kitchen Accessories, personal Accessories, Stationary, Furniture, Apparel, Rugs \u0026amp; Fabrics. Every India Circus product is designed, cleverly understanding the style and sensibility of today’s customers, with something special for every corner of the home from luminescent lamps, colourful cushion covers, quirky kitchenware and picturesque pieces of art to beautiful bags and fashionable personal accessories too like laptop cases, Tablet sleeves, sippers, notebooks and more. \n‘Sophistication, with a dash of Indian-ness’ is the thought behind all each of the creations with the underlying aim being aesthetically-designed, modern day , ethnic-chic products that are the epitome of Great Style . Great Quality. Great Price \u003C/p\u003E\n\n\u003Cp\u003EIndia Circus is like a breath of fresh air in a market flooded with imports and imitations at one end of the spectrum and super premium luxury goods at the other end. India Circus is perfect for the on-going season of festive gifting, weddings and special occasions. While you could of course shop online for one off, statement pieces, special customization services by are offered by India Circus wherein a special product range can be designed depending on the customer\u0026#8217;s requirement, preference, taste, etc. to create a line of gifts that stands apart and is remembered for being special. \n The next phase will see an on ground store in South Mumbai, Goa and even Shop- In -Shops within other large format department stores. “We are a dream come true for all lovers of things Indian, people having a keen eye for design \u0026amp; quality and for colour aficionados as well “, says Devaki Khimji, one of the Founding Partners of India Circus. India Circus is for those who like a touch of style \u0026amp; design in their daily lives.\u003C/p\u003E\n\n\u003Cp\u003EIndia circus presents A Unique Gifting Innovation \u0026#8220;I Like\u0026#8221; : http://indiacircus.com/ilike/\nWhat is  exciting about indiacircus.com is iLike. It is an application unique to www.indiacircus.com, which personalizes your online-shopping experience. Incredibly easy to use, iLike serves as an interactive wish-list that can be shared with your friends \u0026amp; family. All you have to do is click on the ilike icon  ,select a board (wishlist) or create a new board, the ilike heart icon turn pink when \u0026#8216;liked\u0026#8217; ,and you can share your boards with your friends \u0026amp; family on Facebook,Twitter or via email. Ilike is perfect for brides as they can create their perfect wish list for a new journey they are going to embark. A helpful application for a couple who are redoing their home. It helps you find that perfect house warming gift, anniversary gift or get what you really want. Don\u0026#8217;t be surprised when you receive that coffee-mug you wanted in the mail from that friend you haven\u0026#8217;t seen since last summer! Other features include the easy e-gift voucher and corporate gifting.\u003C/p\u003E\n\n\u003Cp\u003EAnother good news for international customers is that , they can now shop Indiacircus products from  over 200 countries by following the URL www.indiacircus.com/world\u003C/p\u003E\n\n\u003Cp\u003ECOLLECTIONS ON INDIACIRCUS.COM \nNeo Nawab: \nNeo-Nawab resurrects India\u0026#8217;s golden dynasty- the Mughals, to bring to you an enigmatic collection replete with strong Indian motifs. The collection references various emblems of the Mughal era, such as its world renown intricate architecture, as well it\u0026#8217;s unapologetic opulence. The collection\u0026#8217;s bright and vibrant luxury is tamed by its regal and sophisticated Mughal etiquette. \u003C/p\u003E\n\n\u003Cp\u003EJalebi: \nThe Jalebi Collection maintains its composure across a tight-wire between fun and frivolity. This colorful collection features various icons of the Indian cityscape, from bicycles and rickshaws, to grandiose monuments of bygone dynasties. Jalebi captures quintessential emblems of life in India, and transcribes this loud and colorful experience into a sophisticated style for a contemporary lifestyle. \u003C/p\u003E\n\n\u003Cp\u003ETamara: \nTamara references India\u0026#8217;s extremely rich and diverse visual treasure of flora and foliage. Inspired by nature, the collection offers a bright and contemporary take on the Indian landscape. With various visually stimulating designs that lead the eye over its intricate details and patterns, Tamara has bountiful ornamentation for you, and your home! \u003C/p\u003E\n\n\u003Cp\u003EKuheli: \nKuheli pays homage to various traditional Indian arts and crafts. The designs feature graceful peacocks from the forest, as well mesmerizingly abstract visuals. Kuheli is dynamic in its color palette and detailed in its intricate referentiality, wherein lies the collection\u0026#8217;s individuality. The designs appeal to those seeking rich visuals that have a delicate history behind them.\nTo see more….. Visit us at www.indiacircus.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://thegloballocal.in/2013/02/krsna-mehtas-india-circus/",
    "title": "Spotlight - IndiaCircus"},
   {"external_url": "http://news.yahoo.com/india-circus-goes-international-customers-shop-indiacircus-com-110621770.html",
    "title": "India Circus goes International"},
   {"external_url": "http://www.spicysangria.com/shopping/ilike-at-india-circus",
    "title": "ilike"},
   {"external_url": "http://www.business-standard.com/article/companies/online-store-indiacircus-com-innovates-through-new-app-113021100757_1.html",
    "title": ""},
   {"external_url": "http://www.huffingtonpost.co.uk/ben-mirza/india-circus-lost-beauty-_b_2575205.html",
    "title": "Lost Beauty Rediscovered"},
   {"external_url": "http://www.deccanchronicle.com/130127/lifestyle-booksart/article/history-speaks",
    "title": ""},
   {"external_url": "http://articles.timesofindia.indiatimes.com/2013-01-08/homegarde/36215547_1_designshome-decor-krsna-mehta",
    "title": ""}]}