{"name": "Indian City Properties Limited",
 "permalink": "indian-city-properties-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/indian-city-properties-limited",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1929,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "real-estate",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Real Estate Development",
 "created_at": "Thu May 30 08:32:10 UTC 2013",
 "updated_at": "Fri May 31 19:49:17 UTC 2013",
 "overview": "\u003Cp\u003EIndian City Properties Ltd. (“ICP”) is concentrated on creating a portfolio of high-end iconic and landmark developments that celebrate superior quality construction, innovative design and sustainable architecture.\nICP is committed to acquiring and developing working and living spaces that are sympathetic to their surroundings and thoughtful in their design; that create an impact on the skyline; and that compromise on neither aesthetics nor functionality.  \u003C/p\u003E\n\n\u003Cp\u003EICP is the real estate arm of the Karam Chand Thapar Group (“KCT Group”), one of India’s leading business conglomerates. Incorporated in 1939, ICP remains a private limited company. \nMany of the buildings owned and managed by ICP are historic, landmark and heritage buildings that have been passed down generations of the Thapar family; many have come to define the cityscapes of Delhi, Mumbai and Kolkata.  Today ICP is led by a young and innovative team who simultaneously realise the value of its inherited assets while understanding the need for a progressive approach to business and a contemporary understanding of design.  With strong foundations and a rich history of success, ICP partners with world renowned architects and interior design firms.  It is poised to become one of today’s premier developers of high-end commercial and residential real estate in India. \nICP and the KCT Group understand that real business success cannot be measured on market share or business volume alone. They know that long-term, sustainable growth can only be achieved by real customer satisfaction, by ensuring employee welfare and by adopting a responsible attitude to the environments and societies in which they operate. This ethos sits at the heart of everything they do.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Joint Managing Director",
    "person":
     {"first_name": "Ayesha",
      "last_name": "Thapar",
      "permalink": "ayesha-thapar",
      "image":
       {"available_sizes":
         [[[107,
            150],
           "assets/images/resized/0027/2165/272165v2-max-150x150.jpg"],
          [[179,
            250],
           "assets/images/resized/0027/2165/272165v2-max-250x250.jpg"],
          [[323,
            450],
           "assets/images/resized/0027/2165/272165v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Thapar House",
    "address1": "",
    "address2": "",
    "zip_code": "110001",
    "city": "Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}