{"name": "IndiaCrane Services",
 "permalink": "indiacrane-services",
 "crunchbase_url": "http://www.crunchbase.com/company/indiacrane-services",
 "homepage_url": "http://www.indiamart.com/new-india-crane-services/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hydra-cranes-rental-services-and-manpower-solutions-to-the-clients-",
 "alias_list": null,
 "email_address": "new-india-crane-services@tradepassport.org",
 "phone_number": "9824130739",
 "description": "Hydra Cranes Rental Services and Manpowe",
 "created_at": "Thu Apr 04 14:03:05 UTC 2013",
 "updated_at": "Thu Apr 04 14:03:09 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2004, we, “New India Crane Services”, are counted amongst the leading organizations which are involved in providing world class Hydra Cranes Rental Services and Manpower Solutions to the clients. These services are highly demanded in construction and various other industries for their cost effectiveness, promptness, reliability and flexibility. We provide highly proficient manpower and well-maintained cranes to the customers on rental bases for material handling and various other applications. Our solutions prove to the highly effective for the patrons in order to achieve specific goals.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOwing to our team of dedicated professionals, we have been able to become a leading Hydra Cranes Rental Services and Manpower Solutions involved premium range of material handling as well as earth moving machinery. We are having highly diligent and dexterous professionals in our team who possess years of experience in this domain. They are well-trained and well-versed with the detailed knowledge of this domain.\u003C/p\u003E\n\n\u003Cp\u003EDomain Expertise:\nWe hold immense expertise in providing highly effective Hydra Cranes Rental Services and Manpower Solutions. By providing these solutions, we have been serving the construction and various other sectors at its best. We provide these material handling and earth moving machinery to cater to the requirements of various commercial sectors. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe pay optimum attention to the quality while providing our highly effective Hydra Cranes Rental Services and Manpower Solutions to the clients. To ensure all our business operations to be highly qualitative, we have adopted a well-researched and strict quality policy. Its each provision has to be followed at every stage of our business operations.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nSince our establishment, we have been looking forward to serve our clients at its best. For this, we are providing highly cost effective, reliable and flexible Hydra Cranes Rental Services and Manpower Solutions to them. We provide material handling and earth moving machinery to the clients in well-maintained conditions.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nCrawler Crane\nCarry Crane\nHuman Man Power Services\nLabour Man Power Services\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7948/247948v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/7948/247948v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/7948/247948v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}