{"name": "IndianRemi Hair",
 "permalink": "indianremi-hair",
 "crunchbase_url": "http://www.crunchbase.com/company/indianremi-hair",
 "homepage_url": "http://www.indiamart.com/indianremihairextensions/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "human-hair-weft, hair-extension-clip, nail-hair-weft, machine-weft-hair, remy-weft-hair-and-virgin-bulk-hair-",
 "alias_list": null,
 "email_address": "indianremihairextensions@tradepassport.org",
 "phone_number": "",
 "description": "We are one of the renowned manufacturer ",
 "created_at": "Thu Apr 04 13:44:18 UTC 2013",
 "updated_at": "Thu Apr 04 13:44:20 UTC 2013",
 "overview": "\u003Cp\u003EIndian Remi Hair Extensions is a sole proprietorship based business organization, which was incorporated in the year 2005 at Ludhiana, Punjab. Our rich domain expertise and vast industrial experience has enabled us to establish ourselves amongst the most reputed manufacturer and exporter of the market engaged in offering an extensive range of Virgin Bulk Hair, Remy Weft Hair, Nail Hair Weft and various others. Our product line are highly demanded and acclaimed amongst millions of clients based in different regions of the globe for its premium quality and exceptional features.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have developed a sound and strong infrastructural base over a massive area of land to execute our business related processes in a well organized manner. This facility is segregated into several different departments that are equipped with all the requisite amenities. Our modernized manufacturing plant holds high production capacity, which helps us maintain smooth supply chain in the market.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality-oriented business firm, we focus to design and develop immaculate products for our clients that are in compliance with prescribed industrial guidelines. We use finest quality materials in our product development process, which are procured from the reliable and authentic sources. Our entire range is manufactured under the supervision of experts at our in-house plant, where we maintain proper hygienic conditions.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe follow client-centric approaches in our business related processes, in order to render maximum level of satisfaction to our valued clients. Our professionals work with the clients in close co-ordination to provide them exact customized products as per their actual demands. We offer easy payment options facility to our valued clients, in order to make monetary transactions convenient and hassle free for them.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur strong commitment to quality and prompt delivery schedules has helped us earn the confidence and trust of our esteemed clients. We offer customized products to our valued clients, in order to meet their specific requirements and demands. Our transparent business dealings help us maintain a genial relationship with our valued clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nHuman Hair Weft, Hair Extension Clip, Nail Hair Weft, Machine Weft Hair, Remy Weft Hair and Virgin Bulk Hair. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/7934/247934v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7934/247934v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7934/247934v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}