{"name": "Influencing",
 "permalink": "influencing",
 "crunchbase_url": "http://www.crunchbase.com/company/influencing",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": null,
 "created_at": "Sat Sep 06 02:25:56 UTC 2008",
 "updated_at": "Wed Sep 17 18:22:49 UTC 2008",
 "overview": "\u003Cp\u003EInfluencing is an online PR platform connecting journalists, bloggers and other influencers with PR professionals. Combining a social networking engine with a suite of specialist on-demand applications, Influencing creates an integrated workflow that helps the media and PR communities find each other, understand each other and communicate and work with each other in a far more effective  and productive fashion.\u003C/p\u003E\n\n\u003Cp\u003EInfluencing can be found at http://www.influencing.com \nInfluencing combines a social network engine with a suite of specialist applications for both journalists and PR professionals. Think Facebook meets Salesforce.com but designed specifically for media and PR professionals.\u003C/p\u003E\n\n\u003Cp\u003EThe social networking platform allows users to map their \u0026#8220;professional graph\u0026#8221; and then use those relationships to power its application suite which includes a personalised home page, RSS reader, contact management capabilities and online messaging. Journalists have access to tools which let them define the information they\u0026#8217;re after, request information and easily and manage all of the leads and stories they\u0026#8217;re working on. Meanwhile, PR users have tools to help them build media lists, distribute press releases, manage their online newsrooms and analyse their media coverage.\u003C/p\u003E\n\n\u003Cp\u003EUsed together, the two platforms interconnect to map out an integrated workflow between the two communities that will be far more efficient than traditional communication models. \u003C/p\u003E\n\n\u003Cp\u003EInfluencing is the result of eight-years of experience in building an media relations website called MediaConnect, which is used ubiquitously by media and communicators in the Australian IT industry. \u0026#8220;MediaConnect changed the way IT media and PR professionals communicate in Australia and we believe that our new Influencing platform will have the same impact on the media and PR industries globally.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EThe Influencing platform has been designed to be \u0026#8220;white-labelled\u0026#8221; by other media intelligence content providers but can also be accessed directly via Influencing.com.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       51],
      "assets/images/resized/0002/4743/24743v1-max-150x150.png"],
     [[250,
       86],
      "assets/images/resized/0002/4743/24743v1-max-250x250.png"],
     [[304,
       105],
      "assets/images/resized/0002/4743/24743v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}