{"name": "ingenuIT",
 "permalink": "ingenuit",
 "crunchbase_url": "http://www.crunchbase.com/company/ingenuit",
 "homepage_url": "http://www.ingenuit.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "ingenuitny",
 "category_code": "consulting",
 "number_of_employees": 5,
 "founded_year": 1998,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "technology-consulting, remote-support, network-monitoring, application, network-analysis, support, email-systems, integration, thin-client, remote-access, email, cloud-computing, microsoft-sbs, managed-services",
 "alias_list": null,
 "email_address": "sales@ingenuit.com",
 "phone_number": "212.414.4715",
 "description": "Small Business IT Consulting",
 "created_at": "Sun Mar 11 17:18:18 UTC 2012",
 "updated_at": "Tue Mar 20 21:36:33 UTC 2012",
 "overview": "\u003Cp\u003EingenuIT is a New York City based IT solutions provider focused on small business.  Services include: technology consulting, technical support, network analysis, design and support, email messaging and communications system implementation and support, cloud implementations and migrations, virtualization services, remote systems management and remote network monitoring, and other technology services.\u003C/p\u003E\n\n\u003Cp\u003EingenuIT helps clients get the most from a their technology investments by focusing on their business objectives.  Implementing only proven technology solutions that meet requirements, their proven track record with solutions from Microsoft, Apple, Astaro, RIM/Blackberry, and other established companies ensures project success.\u003C/p\u003E\n\n\u003Cp\u003EingenuIT brings a specialized approach and in-depth knowledge that will improve on existing IT infrastructure, ensure effectiveness of new technology initiatives.  As a small business itself, ingenuIT understands the challenges of integrating business objectives, budgetary requirements and expected outcomes into an IT project.   \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "New York City",
    "address1": "100 5th Avenue",
    "address2": "7th Floor",
    "zip_code": "10011",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}