{"name": "Inline Textiles",
 "permalink": "inline-textiles",
 "crunchbase_url": "http://www.crunchbase.com/company/inline-textiles",
 "homepage_url": "http://www.indiamart.com/inlinetextiles/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "printed-cotton-sarees, sutee-saga-cotton-sarees, embroidery-cotton-sarees, south-cotton-sarees",
 "alias_list": null,
 "email_address": "inlinetextiles@tradepassport.org",
 "phone_number": "9327155500",
 "description": "Manufacturing and supplying ,",
 "created_at": "Fri Apr 05 13:51:05 UTC 2013",
 "updated_at": "Fri Apr 05 13:51:09 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Inline Textiles, Ahmedabad Branch of \u0026#8220;Outlook Boutique Pvt Ltd\u0026#8221;, committed towards manufacturing and supplying a remarkable collection of attractively designed hand made Cotton Suits and Sarees. Under this range, we offer Premium Cotton Dress Materials, Temptation Dress Materials, Katha Handwork Dress Materials, Printed Cotton Sarees, Sutee Saga Cotton Sarees, Embroidery Cotton Sarees, South Cotton Sarees, Novrose Cotton Sarees, Cotton Sutra Sarees, Cotton Jute Sarees and many more.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe hold a sound and sprawling infrastructure setup at Ahmedabad (Gujarat, India). To ensure speedy and hassle free execution of entire business related activities, we have systematically segregated our setup into different units such as designing unit, quality testing unit, warehouse and administration office.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nBeing a core part of the organization, team associated with us endeavors to come with attractively \u0026amp; incredibly designed collection of Cotton Suits and Sarees. The entire range is being designed under the supervision of our talented craftsmen. Our team of craftsmen precisely design products in tune with the prevailing market trends and clients’ requirements incorporating latest technology. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nSince we have started off our business, we strive to deliver our clients with uniquely designed and qualitative range of Cotton Suits and Sarees. To fulfill our objectives, we develop all our products using supreme quality cotton and other fabrics, procured from the established vendors of the markets. Furthermore, we adopt advent technology to design products as per the existing fashion trends and clients’ requirement. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have made all our striven and generous efforts focused towards acquiring maximum complacency of clients. To live up to their expectations, we are offering them a incredibly designed collection of Cotton Suits and Sarees.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nPremium Cotton Dress Materials, Temptation Dress Materials, Katha Handwork Dress Materials, Printed Cotton Sarees, Sutee Saga Cotton Sarees, Embroidery Cotton Sarees, South Cotton Sarees, Novrose Cotton Sarees, Cotton Sutra Sarees, Cotton Jute Sarees and many more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       71],
      "assets/images/resized/0024/8724/248724v2-max-150x150.jpg"],
     [[250,
       119],
      "assets/images/resized/0024/8724/248724v2-max-250x250.jpg"],
     [[284,
       136],
      "assets/images/resized/0024/8724/248724v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}