{"name": "InsideRater.com",
 "permalink": "insiderater-com",
 "crunchbase_url": "http://www.crunchbase.com/company/insiderater-com",
 "homepage_url": "http://www.InsideRater.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "InsideRater",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "www-insiderater-com, insiderater, manhattan, real-estate, brokers, nyc, residential, listings, new-york-city, apartments, coops, co-ops, condos, building, new-development, for-sale, for-rent, properties, relocation, investment, commercial, reviews, video,",
 "alias_list": "",
 "email_address": "info@InsideRater.com",
 "phone_number": "",
 "description": "Real Estate Website NYC",
 "created_at": "Fri Jun 19 21:53:51 UTC 2009",
 "updated_at": "Mon Aug 02 18:27:00 UTC 2010",
 "overview": "\u003Cp\u003EWe are a New York City real estate rating website, helping you find residential and commercial listings for sale or rent, which also provides you with real estate information at the local level to help you make better decisions in the process. Our goal is to be a smart partner when you are looking to buy or rent a space. The unique building rating section should help you find your desired space and has empowered thousands of savvy consumers by providing them with a vehicle of knowledge. You will also find data and information about your local real estate market without too much work. The delightful building rating function should make your decision making easy and fast.\u003C/p\u003E\n\n\u003Cp\u003ENow on InsideRater.com you can get access to building ratings and reviews for all Condos, Coops, Rentals and Commercial Buildings in New York City. Plus you can see videos, photos, virtual tours, and stay up-to-date with the latest listings and information using our \u0026#8220;building update system\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003EWhether you are moving down the street or to other areas in New York City, InsideRater.com is here to help you understand the New York city real estate market on a local level. When you are about to make the biggest financial decision of your life, we help you understand more about the building you are about to move in to by providing you with compared similar homes on the market, and similar homes that have recently sold in your ZIP code and neighborhood.\u003C/p\u003E\n\n\u003Cp\u003EInsideRater.com is also a tool for real estate professionals to market their listings, view real estate data and promote their services. If you are a broker, agent,  developer, landlord or a managing agent, we\u0026#8217;ve got a real estate marketing package just for you.\u003C/p\u003E\n\n\u003Cp\u003EOur long term aspiration is to be a trusted, useful, up-to-date, easy and fun-to-read source for New York City Real Estate users. Launched a number of years ago, we are now New York City\u0026#8217;s leading provider of consumer survey-based information on real estate. With ratings and reviews based on the opinions of thousands surveyors from around New York City, InsideRater\u0026#8217;s survey has become the most trusted source to help consumers make informed decisions about their real estate needs.\u003C/p\u003E\n\n\u003Cp\u003EInsideRater.com surveyors are frequent and knowledgeable in each of the categories they rate. Their real estate knowledge and market experiences are expertly reflected into ratings and concise, witty quotes, provide accurate, swift guidance for a wide variety of real estate activities. InsideRater\u0026#8217;s unique approach separately rates the distinct qualities of building categories (Amenities, Architecture, Building Staff, Cleanliness, Developer, Finishes, Lobby, Management, Neighborhood, Noise, On-Site Office, Parking, Safety) based on a grading system. InsideRater.com then calculates this information with data-based index format that allows users to search efficiently and access the rating data of interests.\u003C/p\u003E\n\n\u003Cp\u003EVisit us at: http://www.insiderater.com/\u003C/p\u003E",
 "image": null,
 "products":
  [{"name": "Top Rated New Development",
    "permalink": "top-rated-new-development",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[114,
        150],
       "assets/images/resized/0004/9734/49734v2-max-150x150.png"],
      [[190,
        250],
       "assets/images/resized/0004/9734/49734v2-max-250x250.png"],
      [[343,
        450],
       "assets/images/resized/0004/9734/49734v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        78],
       "assets/images/resized/0009/5655/95655v2-max-150x150.jpg"],
      [[250,
        131],
       "assets/images/resized/0009/5655/95655v2-max-250x250.jpg"],
      [[450,
        236],
       "assets/images/resized/0009/5655/95655v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.insiderater.com/",
    "title": "Top Real Estate \u0026 Rating Guide In New York City "},
   {"external_url": "http://www.insiderater.com/Top-Rated",
    "title": "Top Rated Buildings Guide In New York City "},
   {"external_url": "http://www.insiderater.com/New-Development",
    "title": "Top Rated New Development Buildings Guide In New York City "},
   {"external_url": "http://www.insiderater.com/Movies-And-Clips",
    "title": "Top Rated Buildings In New York City - Movies And Clips "},
   {"external_url": "http://www.insiderater.com/Coming-Soon",
    "title": "Coming Soon New Development Buildings Guide In New York City "}]}