{"name": "Insphere Insurance Solutions",
 "permalink": "insphere-insurance-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/insphere-insurance-solutions",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 1997,
 "founded_month": 2,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Wed Jul 18 15:01:51 UTC 2012",
 "updated_at": "Thu Jul 19 09:48:55 UTC 2012",
 "overview": "\u003Cp\u003EInsphere Insurance Solutions is a company devoted to providing access to the best health care insurance. There are a number of types of health insurance out there, but not everyone is taking advantage of them. Instead of wandering through life with inadequate insurance coverage, get with this company. Not having enough insurance to take care of bills can leave you in a lurch.\u003C/p\u003E\n\n\u003Cp\u003EThis applies to all aspects of health care too. When you get sick you are responsible for more than just the medical bills. You are also responsible for your own personal bills and food. Not to mention extra costs that come up when you are ill. Maybe you\u0026#8217;ll need specific foods or extra physical therapy. \u003C/p\u003E\n\n\u003Cp\u003EGetting enough insurance will help ensure that you do get all of the money needed to handle every expense. This is very important. No one wants to worry about the costs of living when sick. Setting up a good insurance plan will help make certain that you can take care of these expenses and not worry.\u003C/p\u003E\n\n\u003Cp\u003EA supplemental plan from Insphere Insurance Solutions works to cover those living expenses. It can help cover the utilities, rent or mortgage, car and even groceries. Giving you the freedom of mind to focus on your recovery. As soon as you get better, you\u0026#8217;ll be able to move forward again. Don\u0026#8217;t let the problems of paying bills hinder your recovery.\u003C/p\u003E\n\n\u003Cp\u003EThose medical expenses can also be a big worry when you end up in the hospital. Getting into a good hospital and being able to pay the associated bills can mean a great deal. Let this company help out with several levels of health and dental insurance for you and your family. A variety of plans are available to choose from for those in need of insurance.\u003C/p\u003E\n\n\u003Cp\u003EHealth insurance, supplemental insurance and dental insurance are all important to living well after injury. The daily bills can pile up when your health needs looking after. This is especially true of hospital stays and long-term care. However, you can keep up with regular and extra expenses with Insphere Insurance Solutions. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0020/1706/201706v2-max-150x150.png"],
     [[250,
       153],
      "assets/images/resized/0020/1706/201706v2-max-250x250.png"],
     [[260,
       160],
      "assets/images/resized/0020/1706/201706v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}