{"name": "Internet Online Marketing",
 "permalink": "internet-online-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/internet-online-marketing",
 "homepage_url": "http://www.internet-online-marketing.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "internet-marketing-solutions, internet-marketing-services, promotional-marketing, marketing-promotions, online-market-promotions, website-promotion, seo, search-engine-optimization, pay-per-click-management, online-advertising, press-releases, interactive",
 "alias_list": null,
 "email_address": "dave@internet-online-marketing.com",
 "phone_number": "516-459-6162",
 "description": "Internet Marketing services",
 "created_at": "Mon Jul 12 15:13:26 UTC 2010",
 "updated_at": "Thu Jul 15 23:51:54 UTC 2010",
 "overview": "\u003Cp\u003EWe have been providing Internet Marketing and online advertising for over six years with thousands of man hours figuring out what works and what doesn\u0026#8217;t. And realize; the Internet is always changing and evolving, so what worked a few years ago, only has limited success today.\u003C/p\u003E\n\n\u003Cp\u003EThis website will give you the services, tools, products and software to help you become successful. You have a choice, you can let us handle all the Internet Marketing of your website or you can pick and choose which Internet Marketing services, tools, products and software you want to use.\u003C/p\u003E\n\n\u003Cp\u003EWe do know one thing, what we do works, we have multiple websites listed at the very top of Google and Yahoo, and we have clients that were only generating a few thousand dollars per month in sales that now produce hundreds of thousands of dollars per month in sales. E-Mail or call us today and we will show you it can be done. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}