{"name": "Internet-ink",
 "permalink": "internet-ink",
 "crunchbase_url": "http://www.crunchbase.com/company/internet-ink",
 "homepage_url": "https://www.internet-ink.co.uk/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Internet_ink",
 "category_code": "ecommerce",
 "number_of_employees": 25,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ink, cartridges, toner, pens, office, arts, crafts",
 "alias_list": null,
 "email_address": "support@internet-ink.co.uk",
 "phone_number": "0115 9371520",
 "description": "Ink Cartridge Company",
 "created_at": "Thu Apr 04 15:01:06 UTC 2013",
 "updated_at": "Thu Apr 04 15:01:15 UTC 2013",
 "overview": "\u003Cp\u003ECheap Printer Ink Cartridges, Laser Toner Cartridges and high quality Writing Pens are all available from our secure online store.\u003C/p\u003E\n\n\u003Cp\u003EAfter 10 years in the ink cartridge industry, we at Abitech Systems Ltd noticed a huge change in the UK market place. Large quantities of poor quality ink cartridges from China flooded into the UK, being sold in markets, car boot sales \u0026amp; even Ebay. The low price of these cartridges was only matched by their low quality. Producing poor quality prints, and damaging printers in the process, these cartridges gave \u0026#8220;compatible\u0026#8221; ink cartridges a well earned bad name.\u003C/p\u003E\n\n\u003Cp\u003EWe decided to compete with highly priced original ink cartridges by manufacturing a high quality compatible cartridge of our own. Our unique high capacity cartridge cases are made from a large percentage of recycle plastic material. This in no way reduces the quality of the cartridge casing, just helps reduce waste.\u003C/p\u003E\n\n\u003Cp\u003EIn order to complete our high quality cartridges, we needed a partnership with a high quality ink manufacturer. Over a period of 2 years we bulk tested over 25 manufacturers inks. We soon discovered that so called \u0026#8220;universal ink\u0026#8221;, ie, a single ink that can be used in many different makes \u0026amp; models of cartridge was simply \u0026#8220;universally bad\u0026#8221; in all makes \u0026amp; model of cartridge. We settled on the largest Germany ink manufacturer OCP.\u003C/p\u003E\n\n\u003Cp\u003ENow the product was finished. Costing less than half that of an original ink cartridge, with extended print life per cartridge, we now had an excellent product at a competitive price.\u003C/p\u003E\n\n\u003Cp\u003EWith increasing levels of production over the last 5 years and the introduction of our \u0026#8220;internet-ink.co.uk\u0026#8221; website in 2003 selling directly to home, business, and trade users we have been able to reduce our prices whilst maintaining our high quality. We now hold a key position of the UK ink cartridge market by selling our own high quality compatible cartridges as well as a full range of well priced original cartridges for all major printer manufacturers such as Brother, Canon, Dell, Epson, Hewlett Packard (HP), Lexmark, Minolta, Neopost, Oki, Pitney Bowes \u0026amp; Samsung. For a supply of trade ink cartridges we can recommend TIC, also for recycling ink cartridges we recommend CashforCartridges.co.uk. And to buy empty ink cartridges you can try CartridgeStock.co.uk\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8006/248006v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8006/248006v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8006/248006v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "MD",
    "person":
     {"first_name": "Matt",
      "last_name": "Burton",
      "permalink": "matt-burton",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Internet-ink",
    "address1": "Units 2/3 Debdale Trading Estate",
    "address2": "Debdale Lane",
    "zip_code": "NG12 5HN ",
    "city": "Nottingham",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}