{"name": "Integrity Technology Specialists",
 "permalink": "integrity-technology-specialists",
 "crunchbase_url": "http://www.crunchbase.com/company/integrity-technology-specialists",
 "homepage_url": "http://www.mikestratton.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mikestrattonNET",
 "category_code": "software",
 "number_of_employees": 1,
 "founded_year": 2006,
 "founded_month": 5,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "volunteer-web-designer, disabled-owend-company",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Disabled Volunteer Web Designer",
 "created_at": "Fri Feb 12 03:27:15 UTC 2010",
 "updated_at": "Thu Feb 14 06:44:34 UTC 2013",
 "overview": "\u003Cp\u003EYou don\u0026#8217;t have to be mentally ill to do something good for society.\u003C/p\u003E\n\n\u003Cp\u003EIntegrity Technology Specialists were opened in 2006 by a disabled man with multiple IT certifications. After spending much time with little success, our path to achieve success changed. Initially focused on computer repair and small business IT support, we found that the anxiety caused by dealing with people was overwhelming.\u003C/p\u003E\n\n\u003Cp\u003EA new dream was born. Considering our limitation dealing with people, we refocused our services into the design of static html websites. After continued failure at attaining paying clients a decision was made. That decision was \u0026#8220;if they won\u0026#8217;t pay me to do it I will do it for free\u0026#8221;. The hopes was that by offering volunteer services we would turn paying clients as well.\u003C/p\u003E\n\n\u003Cp\u003EMuch failure at volunteering, it took a long time to build a strong volunteer portfolio.\u003C/p\u003E\n\n\u003Cp\u003ENow in our fifther year, we have still lost money and we are still volunteering. On occassion we recieve a paying client.\u003C/p\u003E\n\n\u003Cp\u003EWe defined ourselves as \u0026#8220;Integrity Technology Specialists\u0026#8221; when we opened our doors in 2006. Integrity Technology Specialists is a good way to hide from society that the company is owned by a man with severe mental illness. \u003C/p\u003E\n\n\u003Cp\u003EIntegrity Technology Specialists is now Web Design by MikeStratton.net. Mike Stratton has mental illness and is disabled.\u003C/p\u003E\n\n\u003Cp\u003EMike Stratton to date has volunteered over 1,200 hours of web design work for non profits. Yes Mike Stratton is mentally ill, but it is better to dream of being a success in business and volunteer then to throw in the towel and accept his own insanity as being completely disabling.\u003C/p\u003E\n\n\u003Cp\u003EMike Stratton is Integrity Technology Specialists, and Integrity Technology Specialists is doing business as Web Design by MikeStratton.net. Web Design by MikeStratton.net is a mentally ill volunteer web designer.\u003C/p\u003E\n\n\u003Cp\u003EYou don\u0026#8217;t have to be mentally ill to do something good for society.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}