{"name": "Interstate Impressions",
 "permalink": "interstate-impressions",
 "crunchbase_url": "http://www.crunchbase.com/company/interstate-impressions",
 "homepage_url": "http://www.interstateimpressions.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "advertising",
 "alias_list": null,
 "email_address": "info@interstateimpressions.com",
 "phone_number": "323.596.1625",
 "description": "Truck side advertising",
 "created_at": "Sun Sep 16 08:04:53 UTC 2012",
 "updated_at": "Mon Sep 24 16:32:16 UTC 2012",
 "overview": "\u003Cp\u003EINTERSTATE IMPRESSIONS (I2) was established to exploit substantial opportunities that exist in the $6B+ Out-Of-Home (OOH) advertising industry.\u003C/p\u003E\n\n\u003Cp\u003EI2 provides advertising on tractor-trailers, as a value-added and cost-effective alternative to traditional static billboards. I2 provides advertisers with greater reach at lower costs, while providing vehicle owner-operators with an incremental source of revenue at no additional cost. I2 also provides creative services that support this unique media channel, including interactive elements that contribute to greater consumer interaction and longer-lasting consumer impressions than traditional OOH alternatives.\u003C/p\u003E\n\n\u003Cp\u003EI2 is a cost-saver in the OOH advertising segment, providing approximately 40% more impressions than traditional OOH advertising at up-to 50% lower costs. Additionally, I2 is able to reach previously unreachable, but highly desirable, markets by circumventing market-based OOH restrictions.\u003C/p\u003E\n\n\u003Cp\u003EI2 has developed strategic partnerships with the leading vehicle-wrap businesses in both the United States and Canada, with combined production facilities in excess of 100,000 square feet and installation and removal teams in all 50 United States and 10 Canadian Provinces. I2 is focused on developing partnerships amongst advertising agencies of all sizes throughout the US and Canada to serve as a sales channel.\u003C/p\u003E\n\n\u003Cp\u003EI2 has currently secured ~1,000 trucks/trailers nationwide, representing local market, regional and cross-continental routes, with access to multiples more as demand requires. Currently I2 is exploring proof-of-concept opportunities with brands such as OAKLEY, MINI-COOPER, BUDGET and a host of other national and regional advertisers.\u003C/p\u003E\n\n\u003Cp\u003EI2 has developed a community outreach program called FUELING GOOD, in which under-utilized trailer space is allocated to worthy non-profits and social enterprises on favorable basis.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[148,
       150],
      "assets/images/resized/0021/1533/211533v2-max-150x150.jpg"],
     [[248,
       250],
      "assets/images/resized/0021/1533/211533v2-max-250x250.jpg"],
     [[400,
       403],
      "assets/images/resized/0021/1533/211533v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}