{"name": "introNetworks",
 "permalink": "intronetworks",
 "crunchbase_url": "http://www.crunchbase.com/company/intronetworks",
 "homepage_url": "http://www.intronetworks.com/",
 "blog_url": "http://intronetworks.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "introNetworks",
 "category_code": "web",
 "number_of_employees": 11,
 "founded_year": 2003,
 "founded_month": 2,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "info@intronetworks.com",
 "phone_number": "805 722 1040",
 "description": "",
 "created_at": "Thu Aug 09 03:30:34 UTC 2007",
 "updated_at": "Thu Apr 11 08:48:39 UTC 2013",
 "overview": "\u003Cp\u003E\u003Ca href=\"http://www.intronetworks.com/index.html\" title=\"introNetworks\" rel=\"nofollow\"\u003EintroNetworks\u003C/a\u003E builds social networks for businesses that can be molded to suit the needs of any type of community, including large-scale open communities and small, private ones. Corporations, organizations, event planners, trade associations, and publishers can create an innovative online community for a product launch, a user group, an annual sales meeting, or a special event to bring together customers and employees. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       29],
      "assets/images/resized/0000/4147/4147v3-max-150x150.png"],
     [[224,
       44],
      "assets/images/resized/0000/4147/4147v3-max-250x250.png"],
     [[224,
       44],
      "assets/images/resized/0000/4147/4147v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "Member Communities",
    "permalink": "member-communities",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": " President and Co-Founder",
    "person":
     {"first_name": "Kymberlee",
      "last_name": "Weil",
      "permalink": "kymberlee-weil",
      "image":
       {"available_sizes":
         [[[150,
            104],
           "assets/images/resized/0000/9433/9433v1-max-150x150.jpg"],
          [[216,
            151],
           "assets/images/resized/0000/9433/9433v1-max-250x250.jpg"],
          [[216,
            151],
           "assets/images/resized/0000/9433/9433v1-max-450x450.jpg"]],
        "attribution": null}}},
   {"is_past": false,
    "title": "CEO and Co-Founder",
    "person":
     {"first_name": "Mark",
      "last_name": "Sylvester",
      "permalink": "mark-sylvester",
      "image":
       {"available_sizes":
         [[[150,
            104],
           "assets/images/resized/0000/9430/9430v1-max-150x150.jpg"],
          [[216,
            151],
           "assets/images/resized/0000/9430/9430v1-max-250x250.jpg"],
          [[216,
            151],
           "assets/images/resized/0000/9430/9430v1-max-450x450.jpg"]],
        "attribution": null}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$2.7M",
 "funding_rounds":
  [{"round_code": "a",
    "source_url": "http://venturebeat.com/2007/05/21/intronetworks-lets-you-know-more-about-employees-customers/",
    "source_description": null,
    "raised_amount": 2700000.0,
    "raised_currency_code": "USD",
    "funded_year": 2007,
    "funded_month": 5,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Headquarters",
    "address1": "1280 Coast Village Circle, Suite B",
    "address2": "",
    "zip_code": "93108",
    "city": "Montecito",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 34.42071,
    "longitude": -119.641821}],
 "milestones":
  [{"description": "introNetworks to create a social network connecting future astronauts ",
    "stoned_year": 2008,
    "stoned_month": 6,
    "stoned_day": 25,
    "source_url": "http://newsblaze.com/story/2008062406031800014.pnw/folsom/topstory.html",
    "source_text": "SANTA BARBARA, Calif., June 24 /PRNewswire/ -- introNetworks, creators of smart social networks, will soon make history when it builds and launches a social network for Virgin Galactic, the world's first commercial spaceline. The introNetworks system will be used to connect Virgin Galactic's growing base of future astronauts, who have signed on for a sub-orbital flight aboard the soon-to-be completed SpaceShipTwo.\r\n\r\n\"Since our inception five years ago, we've created smart social networks for companies of varying sizes and personalities, but always within the confines of our planet,\" said Mark Sylvester, CEO of introNetworks. \"By working with the visionaries at Virgin Galactic we have the opportunity to use our technology and creativity to help connect individuals who share a passion to boldly go where only a handful of individuals have gone before.\"\r\n\r\nThe introNetworks deployment for Virgin Galactic will bring the future astronauts together to engage with each other, identify commonalities in careers, interests, activities and their life pursuits, through media, forums and direct communications. It will be available to paying customers of the spaceline beginning in late July.\r\n\r\n\"As a company that has always looked beyond what's attainable today, we look for partners that share our vision and introNetworks definitely fits that mold,\" said David Clark, Astronaut Relations, Virgin Galactic. \"We're looking forward to working with introNetworks to provide our future astronauts with a private and secure network around which they can build a very special community.\"\r\n\r\nUsers of the Virgin Galactic introNetworks system will need just five minutes to set up their profile and input information as well as travel photos, a video they can create on the site, and more about themselves that they want to share with the community. Then, within seconds, the introNetworks visual matching engine will create a compelling graphical view of the community, pinpointing where others who have created profiles are in relation to themselves. By clicking on an individual's \"pin\", the future astronauts can explore, discover and learn all about that person and then connect via a private, internal email system.\r\n\r\nintroNetworks Adds to its Growing Customer Base\r\n\r\nintroNetworks also proudly announced new or extended relationships with the following companies:\r\n\r\n-- ACORE: The American Council on Renewable Energy has deployed an introNetworks smart social network as an extension of its high level networking event that connects financiers, investors and renewable energy project developers to network, strike deals and drive forward the future of the industry.\r\n\r\n-- ATTA: The Adventure Travel Trade Association is extending its relationship with introNetworks, which will support two events this year, including the upcoming Adventure Travel Summit, an annual event that brings together adventure travel operators and provisioners from around the world.\r\n\r\n-- IEEE: An introNetworks smart social network has been deployed to enable expertise and knowledge location, collaboration and interaction between members and volunteers of the world's leading professional association for the advancement of technology.\r\n\r\n-- Maverick Business Adventures: introNetworks has created a smart social network to connect a small, but growing group of like-minded, high level entrepreneurs and CEOs who share a passion for experiencing once-in-lifetime adventures. These unique getaways often serve as a launching pad for new and exciting business ventures.\r\n\r\nAbout introNetworks\r\n\r\nBased inSanta Barbara, CA, introNetworks offers smart social networks that are dedicated to helping people identify, and then make meaningful connections to who and what matters to them in their work and interests. Since 2003 the company has successfully deployed over 200 introNetwork Systems across a growing customer base that includes such high profile companies as Adobe, British Airways, Starcom MediaVest, HP, Harvard, Autodesk, Fortune, CMP Media, Xerox, Ziff Davis, and Intel. These companies have learned that introNetworks' smart social networks are the best way for any organization to deploy a valuable online community that allows all of its members to identify and connect with the people and information that matters to them in business, special interest groups or at events.",
    "source_description": "From Cyberspace to Outer Space - introNetworks Creates First Social Network to Connect Growing Base of Future Astronauts for Virgin Galactic",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "introNetworks",
      "permalink": "intronetworks"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}