{"name": "Intrasol",
 "permalink": "intrasol",
 "crunchbase_url": "http://www.crunchbase.com/company/intrasol",
 "homepage_url": "http://www.intrasolnz.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "export-manager, exporter-of-new-zealand, exporters-of-new-zealand, export-company, export-business, export-certificate, export-services, export-sales, export-licence, exports-by-country, export-statistics, export-regulations, import-license, export-certif",
 "alias_list": null,
 "email_address": "info@intrasolnz.com",
 "phone_number": "+64 (0)9 889 2827",
 "description": "Export Development Company",
 "created_at": "Mon May 27 23:22:12 UTC 2013",
 "updated_at": "Tue May 28 22:16:23 UTC 2013",
 "overview": "\u003Cp\u003E﻿﻿Intrasol is an agile, results-driven export services firm. \u003C/p\u003E\n\n\u003Cp\u003EIntrasol assists businesses from New Zealand and around the globe through a range of export services to successfully pursue their international trading goals. \u003C/p\u003E\n\n\u003Cp\u003EIntrasol was founded in New Zealand in 2008 by Director Brodie Taylor. Since then, Intrasol has grown operations and helped clients based in New Zealand, Chile, and around the world realise their export potential. \u003C/p\u003E\n\n\u003Cp\u003EIntrasol is an export company with strong values and focus on sustainable products. Intrasol is passionate about seeing great products succeed - and Intrasol\u0026#8217;s values drive them to see this happen in an honest way which has a positive effect on the environment. \u003C/p\u003E\n\n\u003Cp\u003EIntrasol offers export services to entrepreneurs, individuals and businesses owners who want to take their unique products overseas. Trade agreements, offshore connections, market research, and outlining potential risks are only part of what Intrasol can help with. Exporting is a challenging process, but for those who have an exceptional product, Intrasol can help unleash its potential. \u003C/p\u003E\n\n\u003Cp\u003EFrom obtaining export licences, export certificates, researching export markets, over sourcing products and developing export sales - Intrasol can help.\u003C/p\u003E\n\n\u003Cp\u003EIntrasol can help new exporters understand what is involved and guide them through the process. Whether they need guidance on where to begin the exporting journey, are unsure if the product is ready for overseas markets or want some straightforward advice on international trading regulations, Intrasol is there to help.\u003C/p\u003E\n\n\u003Cp\u003EFor existing exporters looking to expand exports, Intrasol has developed a comprehensive market selection process to find overseas markets with demand for the products. Once Intrasol has identified the target market, their international network of import agents, distributors, and direct buyers gives clients the springboard they need to succeed. \u003C/p\u003E\n\n\u003Cp\u003EBrodie Taylor has years of hands-on experience in the import export sector and has a wide network of contacts in this area. Brodie gets really excited about the research and development phase of exporting, and enjoys being able to help clients understand exactly what is involved with the export process; saving them time and money on potential costly mistakes.\u003C/p\u003E\n\n\u003Cp\u003ECreative, reliable and solution-orientated services differentiate Intrasol - get in touch at info@intrasolnz.com or +64 (0)9 889 2827 to find out more about how Intrasol can help you take your product overseas.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       66],
      "assets/images/resized/0026/7755/267755v2-max-150x150.png"],
     [[210,
       93],
      "assets/images/resized/0026/7755/267755v2-max-250x250.png"],
     [[210,
       93],
      "assets/images/resized/0026/7755/267755v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Brodie",
      "last_name": "Taylor",
      "permalink": "brodie-taylor",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}