{"name": "ipadio",
 "permalink": "ipadio",
 "crunchbase_url": "http://www.crunchbase.com/company/ipadio",
 "homepage_url": "http://www.ipadio.com/corporate",
 "blog_url": "http://blog.ipadio.com/",
 "blog_feed_url": "http://blog.ipadio.com/feed/",
 "twitter_username": "ipadio",
 "category_code": "public_relations",
 "number_of_employees": 15,
 "founded_year": 2009,
 "founded_month": 4,
 "founded_day": 24,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "audio, phonecast, social-networking, social-media, broadcast, phlog, blog",
 "alias_list": null,
 "email_address": "info@ipadio.com",
 "phone_number": "020 33 940 840",
 "description": "Technology and Communications company",
 "created_at": "Tue Jun 16 13:15:52 UTC 2009",
 "updated_at": "Tue Apr 09 15:08:41 UTC 2013",
 "overview": "\u003Cp\u003Eipadio is a privately owned award-winning technology and communications company. \u003C/p\u003E\n\n\u003Cp\u003EFounded in 2009, ipadio began delivering live broadcasts from any kind of telephone including mobile, fixed line and satellite phones. Since then, ipadio has developed a number of services based on its core technology including their flagship ContactEngine for customer interactions, FieldTalk for workforce engagement, and HDMobileVideo for next generation video sharing.\u003C/p\u003E\n\n\u003Cp\u003EAs well as millions of users around the globe, ipadio works with multinational corporations, UK Government departments and worldwide charities.  Ipadio technology is used in a broad range of industry sectors including: telecommunications, engineering, education, gaming, healthcare, household services, media, pharmaceutical, retail, sport and transport.\u003C/p\u003E\n\n\u003Cp\u003ETechnology:\nipadio has combined the power of the Internet with the flexibility and reach of the telephony network.  The consequent cloud-hosted communications servers allow for the easy collection and distribution of any kind of digital content, be that audio, video, image or text.  ipadio makes its technology available to corporates via Software as a Service.\u003Cbr/\u003E\nipadio also makes its audio and video broadcasting services available to users around the globe via either smartphone / tablet apps, via standard telephony, or via satellite telephony.\u003C/p\u003E\n\n\u003Cp\u003ESoftware as a Service: \u003C/p\u003E\n\n\u003Cp\u003EContactEngine: ipadio’s flagship service, ContactEngine is for large-scale daily customer communications.   ContactEngine uses a combination of the following ipadio services to achieve up to 100% customer contact;\u003C/p\u003E\n\n\u003Cp\u003EInteractiveTxt – like internet chat, but via text message.  It’s an easy light touch way to have a brief but detailed conversation with a customer.  The messages are automatically personalised, with each message dependent on the response to the previous one.  Customers can easily respond even when they’re at work or travelling. \u003C/p\u003E\n\n\u003Cp\u003EVoiceForms – a form you fill in, by voice.  It’s a bit like IVR, but less annoying, since the questions are pre-set to the individual, who are taken on their own personal route with no irritating menus to select from.  \u003C/p\u003E\n\n\u003Cp\u003EApps – the latest addition to the customer service arsenal, ipadio consider it just another communications channel: alerts from your company pop up on customer’s tablets or smartphones just as they do from LinkedIn or Facebook.  \u003C/p\u003E\n\n\u003Cp\u003EEmail – you’ll be familiar with that!\u003C/p\u003E\n\n\u003Cp\u003EContactEngine is configurable to switch between the channels depending on the urgency of the contact requirement, the time of day, and any other business rules that need applying.  ContactEngine deals with wrong numbers and multiple phone numbers, duplicates and multi-day calling schedules, and a host of other complex daily communication challenges.  And of course there’s an online admin and email or text alerting for the admin staff and management.\u003C/p\u003E\n\n\u003Cp\u003EFieldTalk: One of our most popular services for Internal Communicators, it provides easy 2-way communication between multiple-layers of management \u0026amp; staff without interrupting work schedules.\u003C/p\u003E\n\n\u003Cp\u003EEBrief: It’s like web conferencing, but without the high cost, hassle, or internet bandwidth requirements, so it’s ideal for mass engagement with customers, between staff and executives, or for monthly team updates.  A great way to engage thousands of people simultaneously.\u003C/p\u003E\n\n\u003Cp\u003EHDMobileVideo: ipadio’s Apple and Android apps gather and distribute every sort of content (video, audio, phone, text, images) securely and on-brand.\u003C/p\u003E\n\n\u003Cp\u003EHistory:\nipadio’s core broadcasting technology was first used on November 1st 2008 via satellite phone from the mid-Atlantic, during the Transat Classique Lagasse race on a yacht called Infanta.  The name ipadio comes from Internet Protocol Radio – though the technology has come rather a long way since. \u003C/p\u003E\n\n\u003Cp\u003E2009: iphone app used globally for broadcasting audio, for example from the World Transplant Games on the Gold Coast of Australia.  Cross posting to social networks provided, along with embedded VoiceToText.  API developed. 2010:  Oxfam provide first broadcasts from Haitian Earthquake, and a number of charities such as The Red Cross, Amnesty International, and Great Ormond Street for Children and the Duke of Edinburgh’s Award start using ipadio as part of the broadcasting and fundraising mix.  Several Sports bodies such as the English Golf Union, the British Horseracing Authority and England Athletics also start using ipadio.  Many educators such as Scotland’s College’s begin to use ipadio for language classes in particular.  Virgin Media become the first corporate client, followed by HomeServe.  ipadio move to offices in Farringdon.  Boris Johnson became one of the first celebrity users.\u003C/p\u003E\n\n\u003Cp\u003E2011: New clients include Grant Thornton, Ladbrokes, London Midland, an International Pharmaceutical that’s too private for us to name them but gosh they’re big, The Football Association, Guinness.  Video added to ipadio’s broadcasting capabilities.  Explorers such as Mark Wood, Jordan Romero, Felicity Ashton and Sara Outen join the ipadians as ipadio gets used from the South Pole, North Pole and top of Everest.\u003C/p\u003E\n\n\u003Cp\u003E2012: Further clients include NHS and Steria, JustGiving, LOCOG, Thames Water, Sony, O2 Health, United Utilities, Calibre, London 2012 and SSP UK.  Android app with video added to previous audio and phone broadcasting features. \u003C/p\u003E\n\n\u003Cp\u003E2013: This year ipadio will get our registration for ISO/IEC 27001 for Information Security Management, as we see our flagship ContactEngine embraced by a number of existing and new blue-chip clients to allow them to interact more effectively with their millions of consumers.  New HD video sharing possibilities are being investigated, and we are expanding our team rapidly into new offices overlooking Smithfield Market.\u003C/p\u003E\n\n\u003Cp\u003EFunding ipadio was incubated by 3rd Sector digital communication specialists www.nemisys.uk.com, a company which ipadio’s directors also founded.   In January 2011, ipadio secured a £1m investment from the London Business Angels one of Europe\u0026#8217;s leading investment networks, the second half of which was accessed in 2013.\u003C/p\u003E\n\n\u003Cp\u003EAwards:\nWinner: Most Innovative Technology of 2009 by eConsultancy \nWinner: Best Mobile Investment of 2011 by the British Business Angels Association \nWinner: Innovation in Rich Media and Video 2012 by eConsultancy\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       55],
      "assets/images/resized/0005/1719/51719v1-max-150x150.png"],
     [[183,
       68],
      "assets/images/resized/0005/1719/51719v1-max-250x250.png"],
     [[183,
       68],
      "assets/images/resized/0005/1719/51719v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Chairman",
    "person":
     {"first_name": "Philip",
      "last_name": "Kimberly",
      "permalink": "philip-kimberly",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder and CEO",
    "person":
     {"first_name": "Mark",
      "last_name": "Smith",
      "permalink": "mark-smith-2",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder and Chief Operating Officer",
    "person":
     {"first_name": "Andy",
      "last_name": "Ayers",
      "permalink": "andy-ayers",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder and Business Development Director",
    "person":
     {"first_name": "Giles",
      "last_name": "Bryan",
      "permalink": "giles-bryan",
      "image": null}},
   {"is_past": false,
    "title": "Finance Director",
    "person":
     {"first_name": "Anthony",
      "last_name": "Francis",
      "permalink": "anthony-francis-2",
      "image": null}},
   {"is_past": true,
    "title": "",
    "person":
     {"first_name": "John",
      "last_name": "Duffy",
      "permalink": "john-duffy",
      "image": null}},
   {"is_past": true,
    "title": "Non-exec Director",
    "person":
     {"first_name": "Mike",
      "last_name": "Brace",
      "permalink": "mike-brace",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "AudioBoo",
      "permalink": "audioboo",
      "image":
       {"available_sizes":
         [[[123,
            33],
           "assets/images/resized/0008/9856/89856v1-max-150x150.jpg"],
          [[123,
            33],
           "assets/images/resized/0008/9856/89856v1-max-250x250.jpg"],
          [[123,
            33],
           "assets/images/resized/0008/9856/89856v1-max-450x450.jpg"]],
        "attribution": null}}},
   {"competitor":
     {"name": "Tweetmic",
      "permalink": "tweetmic",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$1.6M",
 "funding_rounds":
  [{"round_code": "unattributed",
    "source_url": "http://techcrunch.com/2011/02/07/ipadio-secures-1-6m-to-take-phone-to-web-audio-into-businesses/",
    "source_description": "ipadio Secures $1.6m To Take Phone-To-Web Audio Into Businesses",
    "raised_amount": 1600000.0,
    "raised_currency_code": "USD",
    "funded_year": 2011,
    "funded_month": 2,
    "funded_day": 7,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "96 Farringdon Road",
    "address2": "",
    "zip_code": "EC1R 3EA",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.8205815,
    "longitude": 0.0118608}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        148],
       "assets/images/resized/0004/8831/48831v2-max-150x150.jpg"],
      [[250,
        246],
       "assets/images/resized/0004/8831/48831v2-max-250x250.jpg"],
      [[450,
        444],
       "assets/images/resized/0004/8831/48831v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://joedale.typepad.com/integrating_ict_into_the_/2009/05/phlogging-the-french-trip-with-ipadio.html",
    "title": "Classroom use"},
   {"external_url": "http://blogs.journalism.co.uk/editors/tag/ipadio/",
    "title": "Journalists use"},
   {"external_url": "http://homepage.mac.com/guyclapperton/Personalpage/Socialnetworkingblog/files/5cc7eb7fde2695e263d97f866b289fdc-22.html",
    "title": "Blogging tool"},
   {"external_url": "http://www.stuartbruce.biz/2009/06/sony-ericsson-announces-new-greenheart-strategy-in-live-kyte-webcast-today-1.html",
    "title": "For publicity (PR)"},
   {"external_url": "http://current.com/items/90039324_paralympic-hero-joins-web-social-media-outfit.htm",
    "title": "Current TV introduces director"},
   {"external_url": "http://clubs.rfu.com/CLUBS/portals/RFUIT3PeaksChallengePage/",
    "title": "Sport and fundraising"},
   {"external_url": "http://www.timetogetequal.org.uk/news.asp?itemid=637\u0026itemTitle=Great+British+Bus+Tour\u0026section=25\u0026sectionTitle=News",
    "title": "Campaigning"}]}