{"name": "IQMax",
 "permalink": "iqmax",
 "crunchbase_url": "http://www.crunchbase.com/company/iqmax",
 "homepage_url": "http://iqmax.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "IQMaxMobility",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": 1999,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "sales@IQMax.com",
 "phone_number": "704-377-2202",
 "description": "",
 "created_at": "Wed May 29 05:12:11 UTC 2013",
 "updated_at": "Wed May 29 05:31:16 UTC 2013",
 "overview": "\u003Cp\u003EFounded in 1999, IQMax is a privately held corporation based in Charlotte, NC. The company is an early pioneer in the field of mobile healthcare solutions and continues its dedication to providing trusted solutions for the healthcare industry. For more than 12 years, IQMax has been focused on the development of connected care solutions that connect, extend, and optimize data and applications, positively impacting healthcare providers and facilities alike.\u003C/p\u003E\n\n\u003Cp\u003EIQMax has developed a data virtualization platform and mobile application suite with tools that enables healthcare facilities to federate and extend their vast amounts of data from disparate sources and evolve their existing infrastructure and applications. Clinical applications are optimized and facilities realize the maximum benefit from their current investment.\u003C/p\u003E\n\n\u003Cp\u003EFrom its’ inception, IQMax has recognized the value to healthcare providers and facilities of such a rich and intelligent solution that supports the rigorous requirements of scalability and security coupled with the ability to easily and seamlessly exchange data amongst various disparate systems. The Data Virtualization Solution, used as SaaS or hosted solution, is flexible and scales to large hospital systems, small clinics, and private practices. Installations are quick and cost effective enabling smooth workflow transitions with limited internal support and involvement. The solution also introduces a toolset for customers to easily develop new/customized applications on the platform; empowering virtually limitless opportunities for innovation and data exchange that leverages the existing infrastructure.\u003C/p\u003E\n\n\u003Cp\u003EMobile devices continue to evolve into a powerful and valuable tool for care providers in their daily workflow of rendering patient care. As these care providers are increasingly using mobile devices to support their daily workflows, connecting them to critical data at the point of care or wherever they need to access information is vital. The IQMax Mobile Application Suite enables all consumer devices to be used for sophisticated tasks which promote quality delivery of patient care.\u003C/p\u003E\n\n\u003Cp\u003EToday IQMax’s solution supports leading healthcare institutions across the United States allowing caregivers to access and exchange data and information. IQMax’s solutions have connected with over 50 different systems in healthcare and have supported millions of patient encounters from caregivers in a wide variety of healthcare specialties and sub-specialties, practicing at every type of entity from large hospital systems to small independent clinics.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       52],
      "assets/images/resized/0026/8411/268411v1-max-150x150.png"],
     [[233,
       81],
      "assets/images/resized/0026/8411/268411v1-max-250x250.png"],
     [[233,
       81],
      "assets/images/resized/0026/8411/268411v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$360k",
 "funding_rounds":
  [{"round_code": "partial",
    "source_url": "http://www.sec.gov/Archives/edgar/data/1175339/000117533913000001/xslFormDX01/primary_doc.xml",
    "source_description": "SEC",
    "raised_amount": 360000.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 4,
    "funded_day": 26,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "11325 N Community House Rd,",
    "address2": "Suite 175",
    "zip_code": "28277",
    "city": "Charlotte",
    "state_code": "NC",
    "country_code": "USA",
    "latitude": 35.05697,
    "longitude": -80.837802}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        112],
       "assets/images/resized/0026/8410/268410v1-max-150x150.png"],
      [[250,
        187],
       "assets/images/resized/0026/8410/268410v1-max-250x250.png"],
      [[450,
        337],
       "assets/images/resized/0026/8410/268410v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}