{"name": "iScroll",
 "permalink": "iscroll",
 "crunchbase_url": "http://www.crunchbase.com/company/iscroll",
 "homepage_url": "http://www.iScroll.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "iScroll",
 "category_code": "software",
 "number_of_employees": 30,
 "founded_year": 2008,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "books, audiobooks, app, iphone, education, elearning, ebooks, ipad, study",
 "alias_list": null,
 "email_address": "support@iScroll.com",
 "phone_number": "800-277-1331",
 "description": "Human narrated eBooks ",
 "created_at": "Thu May 05 21:48:10 UTC 2011",
 "updated_at": "Wed Aug 01 08:37:30 UTC 2012",
 "overview": "\u003Cp\u003EiScrolls: a unique, new way to enjoy books!\u003C/p\u003E\n\n\u003Cp\u003EThe publishing industry is undergoing a profound transformation as digital content formats including E-books and audio books take over in our daily reading. iScroll\u0026#8217;s industry leading product, Scrolls, takes advantage of this transformation by effectively marrying the most popular digital content mediums offering publishers a whole new product. This winning combination makes iScroll a game-changing company and ensures its rapid growth.\u003C/p\u003E\n\n\u003Cp\u003EUltimate Consumer Experience\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EIncreased retention and comprehension Studies have shown that using both sight and sound simultaneously increases reader retention by 38% and comprehension by 76%. This is invaluable for both student and adult reading and learning. Comprehension is further augmented by reference links to external multimedia content such as pictures, maps, videos, and other materials.\u003C/li\u003E\n\u003Cli\u003EEnhanced Control/Searchability- Using Scrolls increases user control over both text and audio. With simple touch gestures, the user will be able to search audio in multiple directions as well as accelerate the pace of both reading and listening. This control is especially beneficial to professionals in the legal, education, and medical field.\u003C/li\u003E\n\u003Cli\u003EGreater Convenience - Having a multi-format title increases reader convenience. At times readers may employ simultaneous read and play to increase comprehension and retention. At other times listening to a title is more appropriate, while commuting or lying in bed. The added convenience of Scrolls will enable readers to maintain continuity and finish the title in whatever manner the user chooses. Scrolls also provide convenient cross-platform synchronized    bookmarks\u003C/li\u003E\n\u003Cli\u003ESuperior Indexability- As Scrolls content is significantly more search engine optimized (SEO), it will increase the online content discovery and indexing of the vast amount of audio content on the\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EAbout us\u003C/p\u003E\n\n\u003Cp\u003EiScroll Inc. is a privately held technology company based in the US, that since its inception in 2008, has broken new ground with its original text synchronized audio reader application available on the three major screens: mobile, web, and TV. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       81],
      "assets/images/resized/0013/7523/137523v2-max-150x150.png"],
     [[236,
       129],
      "assets/images/resized/0013/7523/137523v2-max-250x250.png"],
     [[236,
       129],
      "assets/images/resized/0013/7523/137523v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "6101 Plano Parkway",
    "address2": "",
    "zip_code": "75093",
    "city": "Plano ",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/iScroll",
    "title": "Facebook"},
   {"external_url": "http://www.facebook.com/iScroll",
    "title": "Twitter"}]}