{"name": "ISInc",
 "permalink": "isinc",
 "crunchbase_url": "http://www.crunchbase.com/company/isinc",
 "homepage_url": "http://www.isinc.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 25,
 "founded_year": 1982,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "training, microsoft, vmware, novell, software-training, sharepoint, sharepoint-consulting, remote-training",
 "alias_list": null,
 "email_address": "kris@isinc.com",
 "phone_number": "9169201700",
 "description": "Technology Training and Consulting",
 "created_at": "Tue Sep 18 19:03:27 UTC 2012",
 "updated_at": "Mon Sep 24 19:57:00 UTC 2012",
 "overview": "\u003Cp\u003ETechnical and Desktop Training\u003C/p\u003E\n\n\u003Cp\u003EServing the business community since 1982, ISInc provides in depth, hands-on training on a wide variety of topics. Our instructors are seasoned professionals who provide high-quality education and training to help you build and support real-world business solutions and take full advantage of technology.\u003C/p\u003E\n\n\u003Cp\u003EWe put your needs first by listening to you and adapting our services to meet your changing requirements as you adopt new technologies and meet new business challenges. Let us work with you to ensure that you get the training you need, when and where you want it.\u003C/p\u003E\n\n\u003Cp\u003ETake a look at our Course Catalog for an updated listing of available classes. If you need specialized classes, contact us and we can accommodate your organizations needs. ISInc also provides an online Learning Management Solution to enroll and track your student’s training history. Please contact us for more information.\u003C/p\u003E\n\n\u003Cp\u003ENetworking and Software Consulting\u003C/p\u003E\n\n\u003Cp\u003EDid you know ISInc has provided top tier Professional Services for over 30 years? Our team of experts can help your organization get the most from your software or hardware investments. ISInc. is also a leader in helping organizations migrate from older software releases to the latest and greatest technologies.\u003C/p\u003E\n\n\u003Cp\u003EWhether you are evaluating open source technologies, or moving from Exchange 2003 to Exchange 2010, ISInc can provide the right technical solution to meet your company’s time line and budget.\u003C/p\u003E\n\n\u003Cp\u003EFind out more about ISInc’s Professional Services.\u003C/p\u003E\n\n\u003Cp\u003EPartnerships\u003C/p\u003E\n\n\u003Cp\u003EISInc maintains the highest level of certification with our key partners. We are a Microsoft Gold Partner, Novell Platinum Training Center and VMware Professional Solution Partner.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       62],
      "assets/images/resized/0021/1900/211900v2-max-150x150.png"],
     [[250,
       103],
      "assets/images/resized/0021/1900/211900v2-max-250x250.png"],
     [[450,
       186],
      "assets/images/resized/0021/1900/211900v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}