{"name": "IT Entrepreneur",
 "permalink": "it-entrepreneur",
 "crunchbase_url": "http://www.crunchbase.com/company/it-entrepreneur",
 "homepage_url": "http://www.itentrepreneur.com.au/",
 "blog_url": "http://beanitentrepreneur.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "public_relations",
 "number_of_employees": 1,
 "founded_year": 2008,
 "founded_month": 4,
 "founded_day": 30,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it, it-news, it-industry, it-companies, it-entrepreneur, news, latest-news, internet, breaking-news, business-news, economy, business, finance-news, internet-news, economy-news, finance, innovation, entrepreneur, entrepreneurs, sharemarket",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "IT News Aggregator",
 "created_at": "Fri Feb 20 07:14:45 UTC 2009",
 "updated_at": "Fri Dec 07 13:51:53 UTC 2012",
 "overview": "\u003Cp\u003EIT Entrepreneur is a News Aggregator targeted to anyone who has considered becoming an entrepreneur in the IT industry. It delivers the latest and most relevant IT and business news for IT entrepreneurs. The author of this website - IT Entrepreneur - is Tony Chen. He has a Bachelor of Engineering in Software Engineering from UNSW with class 1 honours and a Master of Commerce in Professional Accounting from UNSW with distinction average. \u003C/p\u003E\n\n\u003Cp\u003EReading the most relevant news will foster new business and technology ideas and keep the readers up to date to the latest in tech and business. Even if you are not working in the IT industry or you do not want to start your own business in the IT field - this website will still be relevant to you. It will keep you updated on the general economy and sharemarkets and other useful business news. You don\u0026#8217;t need to consider starting your own company to get benefits from IT Entrepreneur. Eg. the new business/technology ideas that come to you after reading relevant news can be discussed with your manager, as a result - help you get a promotion! \u003C/p\u003E\n\n\u003Cp\u003EI have found that it takes a lot of time going to lots of different news sources to find the relevant business and IT news that is relevant to IT entrepreneurs. That\u0026#8217;s why I have started this website, to make it easier for everyone who is interested in IT and business news to get the most important and relevant IT and business news that is prioritized and all included in only one website - IT Entrepreneur. I hope you like it and I hope it makes your life easier. \u003C/p\u003E\n\n\u003Cp\u003EYou can read my blog to find out about my thoughts on the economy, share (or stock) markets and the IT industry in general in this location: http://beanitentrepreneur.blogspot.com/ It is hosted on Google\u0026#8217;s Blogger.\u003C/p\u003E\n\n\u003Cp\u003EIf you want to follow my Tweets, go to http://twitter.com/itentrepreneur/. It will tell you what news I find interesting and also whenever I update my blog.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[146,
       133],
      "assets/images/resized/0003/6602/36602v4-max-150x150.jpg"],
     [[146,
       133],
      "assets/images/resized/0003/6602/36602v4-max-250x250.jpg"],
     [[146,
       133],
      "assets/images/resized/0003/6602/36602v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Tony",
      "last_name": "Chen",
      "permalink": "tony-chen-2",
      "image": null}},
   {"is_past": false,
    "title": "Independent Internet Professional",
    "person":
     {"first_name": "Byron",
      "last_name": "Wycoff",
      "permalink": "byron-wycoff",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        108],
       "assets/images/resized/0003/6666/36666v2-max-150x150.jpg"],
      [[250,
        181],
       "assets/images/resized/0003/6666/36666v2-max-250x250.jpg"],
      [[450,
        326],
       "assets/images/resized/0003/6666/36666v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}