{"name": "iTechnology Planet",
 "permalink": "itechnology-planet",
 "crunchbase_url": "http://www.crunchbase.com/company/itechnology-planet",
 "homepage_url": "http://www.itechnologyplanet.com",
 "blog_url": "http://www.itechnologyplanet.com/blog.html",
 "blog_feed_url": "",
 "twitter_username": "itplanetindia",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2009,
 "founded_month": 7,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "param@itechnologyplanet.com",
 "phone_number": "011-41408402      ",
 "description": "Online Marketing Solution",
 "created_at": "Wed Oct 19 12:49:45 UTC 2011",
 "updated_at": "Mon Oct 31 00:11:02 UTC 2011",
 "overview": "\u003Cp\u003EiTechnology Planet promises to be the driving force behind the success of your online business. Offering competent services in the field of internet marketing, we work proficiently to give your business an exponential growth. At iTechnology Planet, it is our customers who hold the key to our success and we excel when it comes to providing maximum satisfaction for our esteemed customers. \u003C/p\u003E\n\n\u003Cp\u003EWeb design and development endeavors almost steal the show single handedly when it comes to glorifying your business on a global platter. At iTechnology Planet we have high end expertise to let this coveted dream of yours come true at the earnest through our concerted services in this secluded domain of internet marketing.\nUnparalleled Web Design Company India\u003C/p\u003E\n\n\u003Cp\u003EOur web development and web design company India possesses above par excellence in delivering picture perfect websites. In all our web design services, we ensure eye-popping look and feel for your website, yet giving due importance to its user friendly feature with sound, simple, and soothing functionality throughout.\nLeveraging the latest technology\u003C/p\u003E\n\n\u003Cp\u003EWe keep ourselves in the hunt for the latest and the most sophisticated technology to implement in all our web development and web design projects. Our web design company india boasts of its experienced and creative professionals who take their web design assignments more as an unending passion, than merely a profession and it indeed shows in their out of the box thinking and unrivaled web designs.\nOur foremost Internet marketing Firms\u003C/p\u003E\n\n\u003Cp\u003EAlongside holding prominence in the field of web design and development, our web design company India is home to a roster of legions of other cutting edge internet marketing services as well. These include but not limited to:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003ESearch Engine Optimization (SEO)\nWeb hosting\nBusiness Email Hosting\nCorporate Logo Design\nEcommerce website solutions\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EHighly Affordable\u003C/p\u003E\n\n\u003Cp\u003EOur web design company India offers incredibly affordable services without compromising on quality and standards which in turn contributes heavily towards our enriched clientele. Our attractive web design company packages are tailor-made to befit the requirements and budget constraints of all the big and small entrepreneurs.\nVisit us today!\u003C/p\u003E\n\n\u003Cp\u003EIt is indeed due to our quintessential efforts in the world of internet marketing, specifically in web design and development domain that our clients find it much easier to attain the so far unconquered peaks in their respective businesses than ever. And now you too can follow into their footsteps, just feel free to avail of the effectual services of our web design company India and be witness to exponential gains in your business. We are always available at your service, 24 by 7.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       79],
      "assets/images/resized/0015/8716/158716v2-max-150x150.png"],
     [[250,
       132],
      "assets/images/resized/0015/8716/158716v2-max-250x250.png"],
     [[289,
       153],
      "assets/images/resized/0015/8716/158716v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}