{"name": "Itera International Energy",
 "permalink": "itera-international-energy",
 "crunchbase_url": "http://www.crunchbase.com/company/itera-international-energy",
 "homepage_url": "http://www.itera.ru/isp/eng/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "IteraEnergy",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "energy, international, itera",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Thu Apr 12 13:16:16 UTC 2012",
 "updated_at": "Sat Apr 14 20:01:59 UTC 2012",
 "overview": "\u003Cp\u003EThe ITERA International Energy Company is currently headquartered in Moscow, having had its roots in Jacksonville, Florida. Established in 1992, the company quickly formed a reputation in the natural gas market. At ITERA, we are known for our contributions to the energy market of Russia. \u003C/p\u003E\n\n\u003Cp\u003EOur business spans the globe. We have come to prominence in gas field development, and have invested billions in our eight fields in the Far North of Russia. We have also become leaders in several other industries, such as construction, industrial engineering, and electric power development.\u003C/p\u003E\n\n\u003Cp\u003EThe company has remained profitable and competitive thanks in part to the management expertise of our CEO. Igor Viktorovich Makarov has kept the company on its course to success, while maintaining a focus on the community. \nMakarov’s passion for business started in the 1980s. It culminated with his formation of the company. Its successful transition from a small production and trading company to a large international corporation occurred thanks to him.\u003C/p\u003E\n\n\u003Cp\u003EThe company’s many projects, needless to say, create jobs wherever we go. This is not the only way in which we give back to the community. Many of our projects, such as the steam-gas power cogeneration plant we’re building in the Nizhny Novgorod region of Russia, provide vital services.\u003Cbr/\u003E\nITERA International Energy Company Gives Back\nHere at ITERA, charitable activities and sponsorship are one of our highest priorities. Our Council on Charity and Sponsor Activities keeps us in touch with the needs of the community. Established in 2003, the Council seeks out socially meaningful projects and sponsorships, ensuring our continued support.\u003C/p\u003E\n\n\u003Cp\u003EOur background in charity is extensive. Starting in 2003, we’ve been involved in dozens of large-scale projects that benefited thousands. Here are some of the most notable examples:\n• Tchaikovsky Medal Award: In 2003, The Tchaikovsky Fund for National Music Development presented us with a medal for contribution toward the development of Russian music. We sponsored a music festival in Moscow, where the work of famous composers was performed by competing choirs.\u003C/p\u003E\n\n\u003Cp\u003E• Vision-Impaired Children: We have a long tradition in providing books to children with eye disorders or partial blindness. In 2005, we made our first donation of 300 books to Kindergarten classrooms. We did the same in 2010 and again in 2012.\u003C/p\u003E\n\n\u003Cp\u003E• Flight of Hope Project: In February of 2012, we supported a project to preserve and increase the white crane population of Uzbekistan. \u003C/p\u003E\n\n\u003Cp\u003EThese, and many others, serve as the foundation for our charitable traditions. Our business has remained successful because of the community, and we are determined to show our appreciation. ITERA International Energy Company is a driving force in the world—of both charity and international commerce. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0018/3929/183929v2-max-150x150.jpg"],
     [[160,
       160],
      "assets/images/resized/0018/3929/183929v2-max-250x250.jpg"],
     [[160,
       160],
      "assets/images/resized/0018/3929/183929v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}