{"name": "iThinQware",
 "permalink": "ithinqware",
 "crunchbase_url": "http://www.crunchbase.com/company/ithinqware",
 "homepage_url": "http://www.ithinqware.net",
 "blog_url": "http://www.inteloquent.com",
 "blog_feed_url": "http://www.inteloquent.com/feed/",
 "twitter_username": "ithinqware",
 "category_code": "mobile",
 "number_of_employees": 3,
 "founded_year": 2007,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "police-mobile-app, crime-tip-app, crime-app-iphone, crime-app-android, mobile-police-app, crimetips, crimetip-app, crimestoppers, crime-stoppers, mobile-crimestoppers, mobile-crimetip, crime, crime-map, crime-mapping, mapping, crime-report, crimereports-c",
 "alias_list": null,
 "email_address": "mediarelations@ithinqware.net",
 "phone_number": "469.759.0998",
 "description": "Inventors of iWatch",
 "created_at": "Sun Feb 12 18:22:42 UTC 2012",
 "updated_at": "Tue Feb 14 00:13:28 UTC 2012",
 "overview": "\u003Cp\u003ECommunity policing 2.0. ~ Mobile apps for Law Enforcement\u003C/p\u003E\n\n\u003Chr/\u003E\n\n\u003Cp\u003EThis application (app for short) works on your iphone, blackberry or desktop and allows you to send a text, voice mail or video (or combination) to report a crime to the police right on the spot as you see it happening. It’s called the iWatch, and it’s nothing short of a revolution in the making. It extends the power of the law right to citizens’ hands.\nJoe Gaudett, Chief of Police of Bridgeport, CT, a community of about 150,000, tells it like this: “if you see something, (you can) send something. Your call can be anonymous or we can even have a two-way conversation. The app launched to our community on October 25, 2011. Able to be downloaded from the Apple Store, it has engaged the community and  created what is essentially an ongoing, 24-7, never off-duty, real-time, virtual block-watch.”\u003C/p\u003E\n\n\u003Cp\u003EThis reporter caught up with Dan Elliott, Founder of Addison, Texas-based iThinQware, which developed iWatch, and asked him a few questions, such as why it’s so unique?\u003C/p\u003E\n\n\u003Cp\u003E“At it’s root, it isn’t an off the shelf, one size fits all application,” he said. “Instead, it is a framework of integrated tools that may be uniquely configured and branded for law enforcement.” \u003C/p\u003E\n\n\u003Cp\u003EMr. Elliott indicated that it was built to permit the geo-location and referral of crime tips from citizens to either a single Dispatch, Fusion Center or Intelligence Unit or in a Sheriff\u0026#8217;s Office environment with multiple cities in a larger geographic area such as a Metropolitan Survey Area (MSA).\nHow did iWatch come about, we asked?\nFifteen years ago, Mr. Elliott stopped to make a quick phone call at a convenience store. What ensued, however, changed his life forever. With a gun suddenly shoved underneath his ribs, he was ordered by the man standing behind him to hand over his cash and car keys. He was robbed but his life spared. Since that moment, he has been keenly aware that not everyone in his situation would have been fortunate enough to escape unharmed. That point was brought even closer to home when his brother’s fiancée was found murdered in her apartment a few years later.\u003C/p\u003E\n\n\u003Cp\u003EHe was left with a deep sense of responsibility toward the safety of the people around him—a responsibility that has driven him to this project, and to the development of an app that is now launching in city after city with the hope of giving everyone a tool to communicate with police about their personal safety.\u003C/p\u003E\n\n\u003Cp\u003EChief Gaudett pointed out that in the Bridgeport community he serves, he simply wanted to appeal to young people and reach them where they are. This app does exactly that. The use of texting and the use of smart phone apps is widespread in today’s connected world.  “(We put) the app on the Appstore’s digital billboard in town, showing officers, including me, using their cell phones. These signs are along highway I-95 running right through Bridgeport.”\n“Our Community Services Division has gone out into the community to town hall meetings at high schools. This is big in the schools.”\u003C/p\u003E\n\n\u003Cp\u003EWhat the Chief likes is that an officer can set up an email “push” so that the citizens calling in can select what category the crime falls under, such as narco or traffic. “This is forwarded to the Commander of that Division who gets an email,” Gaudett explained. “The info is pushed to the Commanders’ Blachberries in voice mail as a wav.file. Dispatch is not involved. The Division Commanders can huddle informally as necessary.”\u003C/p\u003E\n\n\u003Cp\u003EIn only a few months since launch, the response of the Bridgeport community has been remarkably strong for the app. Digital information can be used for both good and bad,” Dan Elliott said. “The goal is to teach students how to guard themselves digitally, how to use technology and information for positive and safe purposes.” \u003C/p\u003E\n\n\u003Cp\u003E”Students may see things that don’t fit or make sense,” Mr. Elliott elaborated. “They may realize other students are selling drugs, engaging in inappropriate behavior with adults or holding private parties where there are drugs or alcohol—iWatch is a means for them to communicate those things anonymously to law enforcement.”\u003C/p\u003E\n\n\u003Cp\u003EThe app reaches students in a new way, Elliott said. It allows faculty, staff, parents, students and law enforcement to come together as a collective to help reduce crime through digital communication.\u003C/p\u003E\n\n\u003Cp\u003EBridgeport isn’t the first community to see the effects of the app. The product was initially created in 2006, as an outgrowth of the Open Records program of the Dallas Police Department. The goal of that project was to take the open records of offenses and map them on a google map for citizen awareness. The app first launched in December of 2007 and over 1.8 million pages were displayed.\u003C/p\u003E\n\n\u003Cp\u003EBrian Harvey, Deputy Chief, Dallas Police, reported that more than 1,600 tips, with 1,000 actionable tips, 250 calls for service and more than 70 felony arrests have been generated by tipsters via the app.\u003C/p\u003E\n\n\u003Cp\u003ENationwide, 68 police and sheriff\u0026#8217;s departments use the app. Popularity is growing fast. Elliott commented that more than 500 cities across the U.S. have either started to build an iWatch system with his company, or are in negotiations to build one.\u003C/p\u003E\n\n\u003Cp\u003EAnother community benefitting from the app is also in Texas, and covering the Houston area is Harris County. Crime tips received through iWatchHarrisCounty are received by deputies in their Criminal Investigations Bureau. “We stress to the public that the app is for sending us crime tips and non-emergency information,” said Christina Garza Manager, Media Relations Executive Bureau for Harris County Sheriff’s Office (HCSO). Through this app, citizens can report suspicious behaviors or activities by turning in tips as text messages, photos, emails, video attachments, and phone calls directly to the HCSO from almost any mobile phone or PC. Citizens can remain anonymous or may choose to disclose their identity.\u003C/p\u003E\n\n\u003Cp\u003E“The HCSO was the first sheriff’s office in the country to use this mobile app,” Ms. Garza said. “It’s a great idea. Think about it, who doesn’t have a mobile phone these days? Why not use that technology to stay in communication with your local law enforcement agency and actually be involved. It’s immediate, it’s mobile, it’s convenient, and it’s free!\u003C/p\u003E\n\n\u003Cp\u003E“Besides Texas, we’ve sold the app to Sheriff’s offices, Police Departments in California, Minnesota, and have Private Security customers across the U.S.,” Mr. Elliott said. Also they have sold to transportation for trucking security, and universities are iterested in the app for safety on campuses. “In fact,” Elliott added, “we are partners with the founders of the Clery Act for Campus Safety.”\u003C/p\u003E\n\n\u003Cp\u003EA secure, closed communications dashboard available only to law enforcement provides all available information about the crime, including the suspect and the victim from forensic data to witness statements. Elliot indicated that certain defined groups—such as investigating officers, patrol officers in a defined area, and supervisors—can receive alerts when new information is added to the case file and investigators can set up discussion groups or email lists to pool information, theories and thoughts on the crime. An open communications module managed by law enforcement displays selected information to the general public.\u003C/p\u003E\n\n\u003Cp\u003EThis reporter asked if there were other ways the app could be used. Elliott said that interested members of the general public who had signed up to receive alerts about a specific kind of crime, offenses in a particular zip code, or crimes against a particular type of victim (crimes against the elderly, crimes against children, hate crimes, etc.) could be notified of the offense in near real-time via the alerting method (SMS text message, email, or RSS feed) they selected. Citizens could then respond to the alert by sending relevant tips, photos, videos and other information directly to the police.\n“This combination of public and private communications,” Elliott said, “with automatic sorting via segregation and delivery of information by audience and information type is extremely powerful and has not been available to law enforcement in the past except with costly customized systems that took months to build and deploy.”\u003C/p\u003E\n\n\u003Cp\u003E“iThinQware’s solution is cost-effective enough to fall within the discretionary spending limits in most agencies (meaning that no RFP or bid process is required) and powerful enough to meet and exceed expectations and needs in multiple departments within the agency,” he said.\u003C/p\u003E\n\n\u003Cp\u003E“By delivering tested, standards-compliant, state-of-market products within the discretionary budget parameters,’ Elliot explained, “we are able to offer affordable, grant approved solutions to the real public communications problems faced by our target market. Each product is uniquely suited to its target market, including full compliance with industry standards such as those established by the Law Enforcement Information Technology Standards Council (LEITSC).”\u003C/p\u003E\n\n\u003Cp\u003EFor more information, there are details on LEITSC standards for law enforcement records management systems, including public information systems, available in a 67-page Acrobat file that can be downloaded at: http://www.leitsc.org/Files/LawEnforcementRMS.pdf. Elliot pointed out that his firm’s alpha product, currently in testing in the FUSION Group at the Dallas Police Department, has been determined by the department to comply with these standards.\u003C/p\u003E\n\n\u003Cp\u003EThe app started from a personal quest: law and order and citizen safety. “Launched for Nokia and Motorola flip phones,” Elliot remembered, “with many of the same features as currently offered, not one agency could see the benefit. Now, after the launch of iWatchDallas and the success it has, requests have exploded. We have two branches of the military who are looking to deploy the app on military bases. But today, three years later, the \u0026#8220;I get it\u0026#8221; of the app is it\u0026#8217;s power.”\u003C/p\u003E\n\n\u003Cp\u003E“We don\u0026#8217;t have to explain it beyond a few simple statements,” he summed-up, “and everyone has the ‘Aha!’ moment. That means they can see how they can use it, and, in that use and understanding have come quite a few new innovations.”\nLive anonymous chat to the tipster, for example. “This came from a tip received from a child describing a fight with their parents and a drug dealer outside their apartment,” he said. “Push Alerts is another. We can push alerts, warnings, updates and time critical safety awareness updates to the mobile based on user selected categories, or location based criteria. This changes the game for police with regards to Silver Alerts, Amber Alerts, Most Wanted, weather emergencies, even school closings.”\u003C/p\u003E\n\n\u003Cp\u003EHe concluded with this powerful thought: “the real surprise is the shear depth of the tips. We\u0026#8217;re not talking about ‘my neighbor is playing his stereo too loud’, we\u0026#8217;re seeing photos of felons in hiding, getting their aliases, fake drivers\u0026#8217; license numbers. How and when they are dealing drugs. It\u0026#8217;s simply amazing.”\nChief Gaudett said that the app engages the community. “Citizens can share info with little bureaucracy. There’s an opportunity to be anonymous. And that anonymous texting can be a very good thing. We have an on-going investigation right now based on the use of the app.”\u003C/p\u003E\n\n\u003Cp\u003E‘Community policing 2.0’ might only be a catch-phrase but it highlights how this technology has put the power back with the people for greater safety and closer relations with public safety officers. The smart phone app has made an impact. The criminals can’t hide anymore.\u003C/p\u003E\n\n\u003Cp\u003E# # #\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[133,
       150],
      "assets/images/resized/0017/3997/173997v2-max-150x150.png"],
     [[140,
       157],
      "assets/images/resized/0017/3997/173997v2-max-250x250.png"],
     [[140,
       157],
      "assets/images/resized/0017/3997/173997v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "President",
    "person":
     {"first_name": "Daniel",
      "last_name": "Elliott",
      "permalink": "daniel-elliott",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "General Offices",
    "address1": "4345 Lindbergh Dr.",
    "address2": "",
    "zip_code": "75001",
    "city": "Addison",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.ithinqware.org/grouptherapy/smedley1.html",
    "title": "Radio and Print Interviews"},
   {"external_url": "http://www.ithinqware.org/grouptherapy/smedley2.html",
    "title": "Radio and Print Interviews"},
   {"external_url": "http://www.wtnh.com/dpp/news/crime/bridgeport-police-create-their-own-app",
    "title": "Bridgeport police create their own app"},
   {"external_url": "http://www.dallassouthnews.org/2010/10/05/iwatch-dallas-new-tip-program-for-dallas-police-virtual-crime-watch/",
    "title": "“iWatch Dallas” new tip program for Dallas Police, virtual crime watch"}]}