{"name": "ITSCAPE",
 "permalink": "itscape",
 "crunchbase_url": "http://www.crunchbase.com/company/itscape",
 "homepage_url": "http://www.itscape.com",
 "blog_url": "http://www.itscape.com",
 "blog_feed_url": "http://www.itscape.com",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 15,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cloud-based-it-systems-management, application-dependency-mapping, cloud-based-application-discovery, auto-discovery, addm, it-visibility, cloud-based-it-management, datacenter-management, datacenter-transformation, datacenter-virtualization, datacenter-c",
 "alias_list": null,
 "email_address": "info@itscape.com",
 "phone_number": "",
 "description": "Cloud-based IT Systems Management",
 "created_at": "Fri Aug 17 18:53:22 UTC 2012",
 "updated_at": "Fri Aug 17 20:14:54 UTC 2012",
 "overview": "\u003Cp\u003EITSCAPE provides a new generation of low-cost, high-quality, easy-to-use cloud-based system management products.\u003C/p\u003E\n\n\u003Cp\u003ECompanies are losing $26.5B every year due to outages and unplanned downtime. A major contributor to these outages is the difficulty managing the rapidly increasing complexity of IT environments created by virtualization and cloud technologies. Business applications and processes are more complex to manage as they are no longer contained to a few servers in a datacenter, but spread out across many physical and virtual servers inside and outside a company. This creates a lack of visibility of where applications reside and what servers or components they are dependent on. IT managers often have no idea of which servers, databases, connection, and more support their companies business-critical services. Simple changes to a single server can cause major outages. \u003C/p\u003E\n\n\u003Cp\u003EITSCAPE provides a new, cloud-based, affordable, and easy way to perform application discovery, application dependency mapping map, and change tracking in an IT environment –including elements that are physical, virtual, or in the cloud.  With ITSCAPE, IT managers get an accurate and comprehensive understanding of all of the servers, applications, databases, and communications in their datacenter, see the relationships between these IT components, and get clear visibility into the IT systems that support their company’s business critical services.  This information can then be used to pinpoint or prevent issues that cause performance problems, outages and downtime.  ITSCAPE helps IT managers more quickly resolve service issues, keep an accurate view of \u0026#8220;who changed what when.\u0026#8221; ITSCAPE can also be used to prepare to optimize IT systems or for datacenter transformation initiatives such as  virtualization, consolidation, and/or migration. \u003C/p\u003E\n\n\u003Cp\u003ETraditional auto-discovery and dependency mapping solutions are expensive to purchase, install, and maintain. ITSCAPE is changing this.  ITSCAPE requires no hardware, expensive training classes, or consulting services and is priced to be affordable for small to medium sized businesses.  Next, ITSCAPE can be set up and functioning in minutes, is self-maintaining, requires no upgrades, and has little to no impact on existing IT systems. Finally, it can provide initial discovery and dependency mapping results in an hour or less and is easy-to-use and understand by both technical and non-technical staff. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0020/6634/206634v2-max-150x150.jpg"],
     [[250,
       61],
      "assets/images/resized/0020/6634/206634v2-max-250x250.jpg"],
     [[450,
       110],
      "assets/images/resized/0020/6634/206634v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Advisor/Investor",
    "person":
     {"first_name": "Roberto",
      "last_name": "Moctezuma",
      "permalink": "roberto-moctezuma",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0024/3817/243817v6-max-150x150.jpg"],
          [[200,
            200],
           "assets/images/resized/0024/3817/243817v6-max-250x250.jpg"],
          [[200,
            200],
           "assets/images/resized/0024/3817/243817v6-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}