{"name": "Ivoire Consultancy",
 "permalink": "ivoire-consultancy",
 "crunchbase_url": "http://www.crunchbase.com/company/ivoire-consultancy",
 "homepage_url": "http://www.ivoireconsultancy.org",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "freelance, outsourcing, executives, consultant, small-business, elance, guru",
 "alias_list": null,
 "email_address": "marketing@ivoireconsultancy.org",
 "phone_number": "(44) 0844 357 1048",
 "description": null,
 "created_at": "Mon Dec 15 15:35:14 UTC 2008",
 "updated_at": "Sat Dec 20 14:39:25 UTC 2008",
 "overview": "\u003Cp\u003EIvoire Consultancy (IC) has innovated itself into being the online site for outsourcing work. Using its existing client base and wide array of consultants, it has taken measures to facilitate the exchange of expertise. With the launch of its newly improved site, more user friendly website and client discount programmes, IC continues to be a professional meeting place for both clients and quality consultants.\u003C/p\u003E\n\n\u003Cp\u003EIvoireConsultancy.org is also setting itself as an online freelance site that offers discounts to businesses outsourcing their projects on its site. This is a first in the online outsourcing industry.\u003C/p\u003E\n\n\u003Cp\u003EMany companies are now, more than ever before, realizing the benefits of outsourcing work to experts and consultants. They have the service of experienced professionals and academics to perform the tasks with professionalism and at a much reduced cost. This is applicable to clerical work as well as to management consultation, business planning, strategy formulation, etc. In addition to the cost of labour being reduced, the quality of work is enhanced and performance measured by use of project milestones, status reports, etc. The client even has the services of industry-specific experts at their disposal.\u003C/p\u003E\n\n\u003Cp\u003EIn light of the global economy and current trends, more and more industry executives are engaged in outsourcing and reaping its benefits.\u003C/p\u003E\n\n\u003Cp\u003EAt IvoireConsultancy.org, a business owner posts its project, invite the most recommended consultants for proposals and choose the best one.  Also a buyer could take advantage of the company discount policy, once he achieves VIP status (5%, 20% and more off your project cost). The VIP is assigned to a personal account manager who looks after his every needs. Your account manager will help you find the most recommended consultant, refine your proposals and even hold a one-to-one telephone conversation if needed at no additional costs.\u003C/p\u003E\n\n\u003Cp\u003EOverall, Ivoire Consultancy is the guarantee of quality for all work undertaken and its vision is the long term benefits for both its client base and its consultants. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       20],
      "assets/images/resized/0003/1796/31796v1-max-150x150.jpg"],
     [[250,
       33],
      "assets/images/resized/0003/1796/31796v1-max-250x250.jpg"],
     [[319,
       43],
      "assets/images/resized/0003/1796/31796v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Online Outsourcing Freelance Market Place",
    "permalink": "online-outsourcing-freelance-market-place",
    "image": null}],
 "relationships":
  [{"is_past": true,
    "title": "",
    "person":
     {"first_name": "Sekhou",
      "last_name": "Camara",
      "permalink": "sekhou-camara",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "England Office",
    "address1": "Suite 7",
    "address2": "58 North Street",
    "zip_code": "BS3 1HJ",
    "city": "Bristol",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.4348382,
    "longitude": -2.5949734}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}