{"name": "Jaaydaad",
 "permalink": "jaaydaad",
 "crunchbase_url": "http://www.crunchbase.com/company/jaaydaad",
 "homepage_url": "http://www.jaaydaad.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "jaaydaad_1",
 "category_code": "other",
 "number_of_employees": 300,
 "founded_year": 2006,
 "founded_month": 3,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "real-estate-india, real-estate-dealers, property-consultants, real-estate-developers, office-space, real-estate-dealer, retail-space-for-lease, property-dealer",
 "alias_list": null,
 "email_address": "seo.jaaydaad@gmail.com",
 "phone_number": "1204331347",
 "description": "#1 portal in real estate industry.",
 "created_at": "Thu Dec 16 12:17:13 UTC 2010",
 "updated_at": "Fri May 03 07:31:19 UTC 2013",
 "overview": "\u003Cp\u003EJaaydaad.com set to redefine real estate marketing scenario\u003C/p\u003E\n\n\u003Cp\u003EGlobal Infocom Ltd., a New Delhi based company, is a 10 year-old company in the domain of software development and internet. Established in the thick of the dotcom era, the company made a rapid growth as it expanded into many new areas of business and industry. Its unbeatable track record has provided the right impetus to many of its sister concerns to amplify their successful operations in real estate, events and expos.\nThis fast growing company has a wide range of real estate products and services both for B2B sector and B2C customer, which include the largest real estate portal www.jaaydaad.com , and B2B English monthly magazine Jaaydaad.com. These products and services aim at linking the vital stakeholders of the Indian real estate. Global Infocom Ltd. is chalked out concrete plans to expand its horizon across the globe.\nJaaydaad.com is the largest real estate network, deals in sales and marketing of all real estate related products \u0026amp; services through its different wings like Portal, Franchise Network, Magazine, Channel Partners, Core Investor Group, World Tour of Jaaydaad.com Expo-cum-Sale. Under the umbrella brand Jaaydaad.com, the company plans to provide a gamut of consultancy services like Legal Consultancy, Valuation \u0026amp; Validation Services, FDI, Joint Ventures \u0026amp; MoU consultancy to NRIs, Manpower Management in real estate, Credit Rating and Project Report Services.\nThere are several other innovative projects in the pipeline, which include The largest real estate directory - Jaaydaadnama - The Bible of Real Estate Industry, Jaaydaad University - The Real Estate Academy, Customer Loyalty Card, Weekly TV Show, E-Shop on real estate and allied products, Talking Yellow Pages, SMS-ing \u0026amp; MMS-ing, Jaaydaad Investa- Core Investor Group, Jaaydaad Jobs - Real Estate Job Portal, Online Property Auction, Tender World - The Tender Information Bureau, NRI Club, Hot Deals and Pre-Launches and Real Estate Mutual Fund. Jaaydaad.com is the largest real estate portal with nationwide database on residential, commercial, retail, commercial, industrial, SEZs etc.\nBeing registered with jaaydaad.com, one can access this database and deal with the way one like. This unique portal offers a global platform to deal with all kind of real estate and allied product and services. Jaaydaad.com is set to further eliminate the distances, boundaries and frontiers in the real estate sector and make available the entire real estate sector on the desktop.\nJaaydaad.com has the strength of powerful network of over 30,000 registered property dealers and consultants, more than 20,000 registered NRIs and Investors and a team of 285 dynamic professionals. Within a very short period, Jaaydaad.com has created a niche in the virtual world and today it gets over 10,00,000+ hits everyday.\nCMD of Global Infocom Ltd. and the founder of Jaaydaad.com S.K.Jain affarmatively says, \u0026#8220;There is no competition to Jaaydaad.com because of the range of innovative products. While other mushrooming portals are just property shops, Jaaydaad.com is the big Mall where stakeholders of real estate find one stop real estate marketing solution.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[95,
       150],
      "assets/images/resized/0011/4321/114321v2-max-150x150.png"],
     [[158,
       250],
      "assets/images/resized/0011/4321/114321v2-max-250x250.png"],
     [[200,
       315],
      "assets/images/resized/0011/4321/114321v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "#1 portal in real estate ",
    "address1": "44-A, Pushpa Appartment",
    "address2": "Sector-5",
    "zip_code": "201005",
    "city": "Sahibabad",
    "state_code": null,
    "country_code": "IND",
    "latitude": 28.6715819,
    "longitude": 77.3704849}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}