{"name": "jackshoot",
 "permalink": "jackshoot",
 "crunchbase_url": "http://www.crunchbase.com/company/jackshoot",
 "homepage_url": "http://www.jackshoot.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "internet, webcasting, internet-broadcast, mobile-video, video, audio, streaming, progressive-download, content-repurposing, encoding",
 "alias_list": null,
 "email_address": "studio@jackshoot.com",
 "phone_number": "+44(0)8456 521 631",
 "description": "IP Centric Video Production",
 "created_at": "Thu Jun 04 13:29:06 UTC 2009",
 "updated_at": "Mon Jun 08 17:14:31 UTC 2009",
 "overview": "\u003Cp\u003EJackshoot aims to bring events to a wider audience, using professional capture techniques to broadcast content either live, or within hours, to any digital medium. In addition they have specialist experience delivering both live and on demand audio and video content to the internet and mobile telephones. \u003C/p\u003E\n\n\u003Cp\u003EJackshoot offers reliable and cost effective solutions to originate, capture and distribute your digital assets. \u003C/p\u003E\n\n\u003Cp\u003EUtilising the skills and experience of its Principles, Jackshoot provides innovative communications solutions, to maximize broadcast reliability and impact for their customers. \u003C/p\u003E\n\n\u003Cp\u003ESimon Haywood started his career as a qualified audio engineer on live shows but quickly evolved into a leading technical production manager using his thirst for technology as the catalyst for innovation. These innovations have led to hugely successful broadcasts based on convergence of satellite and IP (internet) broadcasting. \u003C/p\u003E\n\n\u003Cp\u003EKen Coppel took his corporate operations experience into the production industry and became a leading figure in Internet Broadcasting. Ken is well placed to produce and manage high pressure broadcasts, and fully understands how to manage the balance between brand values and project risk. \u003C/p\u003E\n\n\u003Cp\u003EProviding services \u0026amp; solutions, Jackshoot has successfully delivered for high profile entertainment clients such as Michael Jackson, Robbie Williams, Madonna, Kylie and numerous corporate names like BAE Systems,  The O2, Microsoft, HP,  AOL,  ASDA and MYSPACE. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       45],
      "assets/images/resized/0004/6690/46690v2-max-150x150.png"],
     [[200,
       60],
      "assets/images/resized/0004/6690/46690v2-max-250x250.png"],
     [[200,
       60],
      "assets/images/resized/0004/6690/46690v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}