{"name": "Jacob Remote",
 "permalink": "jacob-remote",
 "crunchbase_url": "http://www.crunchbase.com/company/jacob-remote",
 "homepage_url": "http://www.indiamart.com/jacobremotetechno/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jacobremotetechno@tradepassport.org",
 "phone_number": "+(91)-(22)-25170956",
 "description": "manufacturing, trading supplying",
 "created_at": "Fri Apr 05 09:39:57 UTC 2013",
 "updated_at": "Fri Apr 05 09:39:59 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1993,we “Jacob Remote Techno Pvt. Ltd.” is an eminent organization involved in the business of manufacturing, trading, supplying and wholesaling an impeccable assortment of LED Pearlite, Battery Backup Unit and Industrial Crane Remote Controller. Under this product range, we offer Hundred Eight Point Remote Control, Four Point Remote Control, Six Point Remote Control \u0026amp; Fan Remote Control. Apart from this, we also comprises Water Level Controller, Remote Control for Fan \u0026amp; Light, Electric Door Lock, Remote Bell, Switched-Mode Power Supply (SMPS) and many more. These quality-approved products are manufactured by our professionals using high quality raw material and other allied components required for manufacturing process. The skilled \u0026amp; semi-skilled labors working with us use latest equipment and machinery to develop these products in order to avoid any kind of defect. All the products offered by us are widely appreciated by the customers for feature like reliable performance, better efficiency, sturdy construction and long service life. \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\nQuality is one of the key factors of our renowned organization that provides best quality Pressure Gauge Tester, Ball Valve and Flame Arrester to our valuable customers. We have well-experienced quality experts in our team, who keep an evil vigil on all the business operations right from the procurement of raw material till the final dispatch.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nIn order to offer a quality approved range of products, we have maintained an advanced infrastructure unit. This unit is available with the essential amenities that are necessary for regular business operations. We have segregated this unit into various departments such as manufacturing, warehousing \u0026amp; packaging, quality control and sales \u0026amp; marketing units.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Manufacturing unit\n    Warehousing \u0026amp; packaging\n    Quality control\n    Sales \u0026amp; marketing units\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe prime objective of our organization is to provide the maximum satisfaction to our esteemed customers. We work consistently to achieve their satisfaction by providing them desired range of Pressure Gauge Tester, Ball Valve and Flame Arrester in various models as per the customers requirements and demands.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8492/248492v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8492/248492v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8492/248492v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}