{"name": "Jadhav Engineerings",
 "permalink": "jadhav-engineerings",
 "crunchbase_url": "http://www.crunchbase.com/company/jadhav-engineerings",
 "homepage_url": "http://www.indiamart.com/jadhavengineeringservices/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jadhavengineeringservices@tradepassport.org",
 "phone_number": "9892038378",
 "description": "Manufacturer of Various Types Of Lab ,",
 "created_at": "Sat Apr 06 06:09:16 UTC 2013",
 "updated_at": "Mon Apr 08 00:15:44 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1991, we, “Jadhav Engineering Services ”, have emerged to be one of the reputed and reliable manufacturers of a wide assortment of Various Types Of Lab Equipment. In this range that we offer we have equipment such as Mechanical Lab Equipment, Engine Lab Equipment, Automobile Lab Equipment and Control Lab Equipment. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur proficient team has always proved to be the backbone of the organization. We have hired for ourselves highly qualified professionals. These professionals work in an organized to attain the defined organizational goals.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality being our prominent forte, we have been indulged in providing our clients with what is qualitative and doesn\u0026#8217;t lacks on the industrial standards parameters. To ensure this meticulous process in the most assured ways, our proficient teams of the quality control department carry out quality checks on each of the productions. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nSupported by a well-furnished infrastructure facility located at Mumbai, in the state of Maharashtra, we have divided our infrastructure into segregated units of manufacturing, quality control and warehousing \u0026amp; packaging units. In a further description, the manufacturing unit is well equipped with latest machines that helps in fabricating flawless product range.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}