{"name": "Jag Creative",
 "permalink": "jag-creative",
 "crunchbase_url": "http://www.crunchbase.com/company/jag-creative",
 "homepage_url": "http://jagcreative.co.nz/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "company-brand-development, creative-marketing-agency, branding-services, graphic-design-company",
 "alias_list": null,
 "email_address": "gary@jagcreative.co.nz",
 "phone_number": "",
 "description": "",
 "created_at": "Wed Feb 20 03:02:12 UTC 2013",
 "updated_at": "Fri Feb 22 23:08:04 UTC 2013",
 "overview": "\u003Cp\u003EAt Jag Creative, it is all about creative business design and innovative marketing solutions that are specifically tailored to every unique business’s needs and goals. This \u003Ca href=\"http://jagcreative.co.nz\" title=\"creative marketing agency\" rel=\"nofollow\"\u003Ecreative marketing agency\u003C/a\u003E is composed of the top creative professionals who are skilled in creative design, website development, \u003Ca href=\"http://jagcreative.co.nz/brand-development\" title=\"company brand development\" rel=\"nofollow\"\u003Ecompany brand development\u003C/a\u003E and management, print services, marketing and more. Jag Creative has the industry knowledge and creative experience to offer clients a range of tailored services that would be serve their individual needs, budget and goals.\u003C/p\u003E\n\n\u003Cp\u003EA company’s brand is much more than a logo or colour scheme. It is the personality that supports your company and Jag creative has the skills to capture the essence of your company and express it through visual design. Jag Creative is based in Auckland and provides a collective base of promotional, marketing and \u003Ca href=\"http://jagcreative.co.nz/branding\" title=\"branding services\" rel=\"nofollow\"\u003Ebranding services\u003C/a\u003E to New Zealand businesses. The professionals at Jag develop a close relationship with every client and take time to truly listen to their business objective and dissect the business personality and maximise company awareness through strong development and communication.\u003C/p\u003E\n\n\u003Cp\u003EWith a history of successful case studies and happy clients, you can be sure the professionals at Jag Creative will provide you with the digital and tangible business services to optimise your enterprise. With portfolio of successful case studies and satisfied clients Jag Creative has proven itself to be a top business service agency and the leading professionals within the field. Each new Jag client gives way to new creative possibilities and the opportunity for businesses to be revealed to their target audience.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0023/7078/237078v2-max-150x150.png"],
     [[246,
       43],
      "assets/images/resized/0023/7078/237078v2-max-250x250.png"],
     [[246,
       43],
      "assets/images/resized/0023/7078/237078v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}