{"name": "Jagdamba Engineering Works",
 "permalink": "jagdamba-engineering-works",
 "crunchbase_url": "http://www.crunchbase.com/company/jagdamba-engineering-works",
 "homepage_url": "http://www.indiamart.com/jagdambaengineeringworks/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": 2002,
 "founded_month": 1,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gear-box, worm-reduction-gear-box, reduction-gear-box",
 "alias_list": null,
 "email_address": "jagdambaengineeringworks@tradepassport.org",
 "phone_number": "+(91)-(79)-25850088",
 "description": "",
 "created_at": "Fri Apr 05 05:02:47 UTC 2013",
 "updated_at": "Fri Apr 05 05:02:52 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nEstablished in the year 2002, we, “Jagdamba Engineering Works”, are one of the reputed organizations engaged in manufacturing and supplying a wide range of Gear Box and Precision Machinery Parts. Our offered range comprises Speed Change Gear Box, Worm Reduction Gear Box, Reduction Gear Box\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have succeed in becoming a successfully organization engaged in offering a qualitative range of Gear Box and Precision Machinery Parts to our valued clients, with the untiring efforts of our hardworking team. Our team is appointed by us on the basis of their skill and industrial knowledge, who are highly dedicated to accomplish all their duties within the promised time-frame with completed perfection to achieve the trusts of more satisfied clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWith the aim to serve our clients with a qualitative and unparalleled range of products, we have adopted a strict quality policy. Our quality policy is as par the international quality standards and norms set by our experienced and qualified team of professionals. Our professionals makes use of only selected raw-material sourced from the famed vendors of the market procured from the certified vendors of the market.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a state-of-the-art infrastructure in the organization, which helps us in proper execution of our business proceedings. This facility is well-equipped with advanced tools and cutting edge technology, considered essential for the manufacturing our offered product-line.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing an client-centric organization, we are aimed at providing our clients a unparalleled range of products which exactly meets the variegated requirements of our valued clients. With this aim, we are offering this range in varied custom-build models design as par the requirements of our clients. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8230/248230v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8230/248230v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8230/248230v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}