{"name": "Jaiswal Opticals",
 "permalink": "jaiswal-opticals",
 "crunchbase_url": "http://www.crunchbase.com/company/jaiswal-opticals",
 "homepage_url": "http://www.indiamart.com/jaiswalopticals/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jaiswalopticals@tradepassport.org",
 "phone_number": "9986772911",
 "description": "manufacturing, exporting, trading ",
 "created_at": "Thu Apr 04 07:44:26 UTC 2013",
 "updated_at": "Thu Apr 04 07:44:30 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in 2009, we, Jaiswal Opticals are reckoned as one of the leading manufacturer, supplier, trader and exporter of a broad spectrum of Metallic Eyeglass Frames, Eyewear Frames, Eyeglass Metal Frames, Eye Spectacles Frames, Eye Sunglasses, Eyeglass Frames and Polarized Glasses. Karnataka based firm, we specialize in offering Optical Outlet Designing services.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have build up state-of-the-art infrastructure, equipped with latest technology and ultramodern equipment. To streamline the whole business operations, we have properly segregated our infrastructure various departments such as production, quality control, warehousing and packaging and many more. The categorization of our infrastructure has been done to meet prescribed organizational targets with utmost perfection. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nIn order to offer our esteemed clients with quality products, we have built alliances with a vast and authentic vendor base. Our vendors are known to use quality ingredients and processing techniques while developing the range. We choose our vendors on the basis of their market position and credibility. Some other reasons that we keep in mind while selecting our vendors include their domain expertise, timely delivery, financial stability and packaging standards. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nBeing a quality-oriented organisation, our foremost goal is to ensure quality products to the clients. To ascertain optimum quality standards of our products range, we have recruited a highly qualified and experienced team of quality controllers.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a highly experienced team of professionals, who dedicatedly work to serve to the diverse needs of clients in an efficient manner. Regular training programs are organized to enhance the knowledge and efficiency of our employees.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/7643/247643v2-max-150x150.jpg"],
     [[250,
       113],
      "assets/images/resized/0024/7643/247643v2-max-250x250.jpg"],
     [[250,
       113],
      "assets/images/resized/0024/7643/247643v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}