{"name": "Jayashree Tapes",
 "permalink": "jayashree-tapes",
 "crunchbase_url": "http://www.crunchbase.com/company/jayashree-tapes",
 "homepage_url": "http://www.indiamart.com/jayashreetapes/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "plain-knitted-elastics, rubber-lycra-elastics, wide-elastics, rubber-elastics, non-woven-self-adhesive-elastics",
 "alias_list": null,
 "email_address": "jayashreetapes@tradepassport.org",
 "phone_number": "9944404499",
 "description": "Manufacturers, exporters and suppliers ,",
 "created_at": "Thu Apr 04 11:01:29 UTC 2013",
 "updated_at": "Thu Apr 04 11:01:37 UTC 2013",
 "overview": "\u003Cp\u003EJaya Shree Tapes came into being in the year 2004 and carved a niche as the leading manufacturer, exporter and supplier of the wide range of Rayon Tapes, Elastic Tapes, Polypro Tapes and Elastics. Our product range comprises Button Hole Elastics, Elastics, Plain Knitted Elastics, Rubber Lycra Elastics, Wide Elastics, Rubber Elastics, Non Woven Self Adhesive Elastics, Black Foldover Elastics, Plain Elastics, Lycra Elastic Tapes, Polyester Elastic Tapes, Elastic Tapes, Non Woven Elastic Tapes and more. Our products stands high in terms of varied features such as good finishing, availability in varied colors, high compression, stretch ability and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nAdvanced and modern infrastructural facility is developed by us, where we have installed advanced and modern machines, in order to carry our business operations in smooth and efficient manner. Our infrastructure is divided into various specialized units, such as sampling unit, designing unit, packaging unit and testing unit. With the help of our infrastructure, we ensure that bulk orders of customers are processed and delivered to them in a timely manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIn order to get our tasks accomplished in a timely manner and in order to meet the pre-determined organizational goals, we have employed a team of highly skilled and trained professionals. We have recruited our team after checking their skills and knowledge on varied parameters. Training sessions are conducted on regular basis, so that we can keep our team abreast with the changing market trends and demands. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe give utmost importance to the quality of our range and ensure that customers are served with nothing less than the best. International standards of quality are maintained in our products and we ensure that our products do not carry flaws. Separate unit of quality testing is developed by us, where products are tested stringently on varied parameters. Our skilled quality controllers make sure that final range does not carry even 0% of flaws. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nRayon Tapes, Elastic Tapes, Polypro Tapes and Elastics. Our product range comprises Button Hole Elastics, Elastics, Plain Knitted Elastics, Rubber Lycra Elastics, Wide Elastics, Rubber Elastics, Non Woven Self Adhesive Elastics, Black Foldover Elastics, Plain Elastics, Lycra Elastic Tapes, Polyester Elastic Tapes, Elastic Tapes, Non Woven Elastic Tapes and more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7833/247833v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7833/247833v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7833/247833v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}