{"name": "JayShree Shaktima",
 "permalink": "jayshree-shaktima",
 "crunchbase_url": "http://www.crunchbase.com/company/jayshree-shaktima",
 "homepage_url": "http://www.roadsweeperbrush.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "textile-industry-brushes, stripe-brush, textile-brushes-and-others--in-addition-to-this, we-also-offer-broomer-brush",
 "alias_list": null,
 "email_address": "webmaster@roadsweeperbrush.com",
 "phone_number": "9898329352",
 "description": "Manufacturing, supplying, exporting ,",
 "created_at": "Fri Apr 05 05:08:36 UTC 2013",
 "updated_at": "Fri Apr 05 05:08:39 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1991, we “Jay Shree Shaktima Textile”, are a profound name of this market engaged in manufacturing, supplying, exporting and wholesaling a huge assortment of Textile Industry Brushes, Cylindrical Brush Rollers and Fill Configuration to the reputed clients. Our products comprises Abrasive Wheel Brushes, Brush Bottom, Custom Made Brushes, Textile Industry Brushes, Stripe Brush, Textile Brushes and others. In addition to this, we also present Broomer Brush, MS Wire Sweeping Brush, Nylon Sweeping Brush, Medical Brushes, Road Sweeping Brush, Airport Runway Cleaning Brush and others. \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\nWith a vision to attain quality in all our offered range, we have channelized quality oriented approach in all tasks accomplished. Our team of adroit professionals exercise stringent quality norms and standards to bring forth an impeccable assortment of Textile Industry Brushes, Cylindrical Brush Rollers and Fill Configuration.\u003C/p\u003E\n\n\u003Cp\u003EProduct Range:\nTo meet the patrons needs and preferences in the most promising manner, we bring forth an impeccable assortment of Textile Industry Brushes, Cylindrical Brush Rollers and Fill Configuration to the customers. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are a profound name specialized in offering Textile Industry Brushes, Cylindrical Brush Rollers and Fill Configuration to the patrons. To fabricate this range, we have recruited under us a team that is manned by skilled and adroit professionals, who put unmatched efforts to meet the patrons needs and demands in the most promising manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nTextile Industry Brushes, Stripe Brush, Textile Brushes and others. In addition to this, we also present Broomer Brush, MS Wire Sweeping Brush, Nylon Sweeping Brush, Medical Brushes, Road Sweeping Brush, Airport Runway Cleaning Brush and others.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8236/248236v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8236/248236v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8236/248236v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}