{"name": "JBF Exports Garments",
 "permalink": "jbf-exports-garments",
 "crunchbase_url": "http://www.crunchbase.com/company/jbf-exports-garments",
 "homepage_url": "http://www.indiamart.com/jbfexportsgarments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jbfexportsgarments@tradepassport.org",
 "phone_number": "9873432282",
 "description": "manufacturing and supplying",
 "created_at": "Thu Apr 04 09:59:05 UTC 2013",
 "updated_at": "Fri May 31 12:31:26 UTC 2013",
 "overview": "\u003Cp\u003EEstablished at Gurgaon ( India), in the year 2008, we, “JBF Exports Garments” are one of the distinguished manufacturer, trader and supplier of Mens Garments, Ladies Garments, Kids Garments and Casual Shoes. Our exclusive range includes Casual Shirts, Cotton Shirts, Formal Trousers, Formal Paints, Formal Suits, Ladies Formal Suits, Leggings, Embroidered Ladies Tops, Ladies Leather Shoes, etc. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe pay immense attention in manufacturing our entire assortment in order to provide clients with supreme quality products. In order to ensure the flawless delivery of our products, we follow strict quality measurements, which are performed by our skilled quality controllers. The entire production process is carried out with an accurate proficiency and expertise by our veteran professionals. These products are manufactured using the finest quality basic material and sophisticated technology. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOwing to our meticulous efforts, we have established strong position in the market. Backed by skilled and experienced craftsmen, we are able to design our wide range of garments in accordance with client specifications. We have highly experienced quality auditors, who check the entire range on well-defined parameters to ensure flawless products. With our fair business practices, we have achieved the trust of our valuable clients. Moreover, our customized solutions, timely delivery of consignment and flexible payment modes has helped us in garnering a wide clientele spread across the globe. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nThe key features of our organization that have kept us ahead of our competitors in the industry are superior-quality products, reasonable prices, client-oriented approach and timely delivery. Due to our ethical business policies and loyal \u0026amp; transparent dealings, we have become the preferred choice of clients.\u003C/p\u003E\n\n\u003Cp\u003EResearch and Development:\nWe have a separate research and development wing, which is well equipped with the modern facilities that ensures overall development of the product and as per the emerging market trends. This unit also assist us to add new features to the existing products for enhancing the functionality of our range at client\u0026#8217;s end.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Set-Up:\nWe are backed with the state-of-the-art-infrastructure that sprawls over a wide area of land. Our infrastructure is further divided into various departments like manufacturing, quality testing, R\u0026amp;D, sales and marketing, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       23],
      "assets/images/resized/0024/7783/247783v3-max-150x150.png"],
     [[250,
       38],
      "assets/images/resized/0024/7783/247783v3-max-250x250.png"],
     [[450,
       69],
      "assets/images/resized/0024/7783/247783v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Sector- 10 A Market, Near Nawab Honda",
    "address2": "",
    "zip_code": "122001",
    "city": "Gurgaon ",
    "state_code": null,
    "country_code": "IND",
    "latitude": 28.4786064,
    "longitude": 77.053568}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}