{"name": "JC Inc",
 "permalink": "jc-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/jc-inc",
 "homepage_url": "http://www.indiamart.com/jcinc/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jcinc@tradepassport.org",
 "phone_number": "(91)-(22)-33344455",
 "description": "trader, supplier and exporter",
 "created_at": "Thu Apr 04 15:06:19 UTC 2013",
 "updated_at": "Thu Apr 04 15:06:35 UTC 2013",
 "overview": "\u003Cp\u003EOur sole proprietorship concern, J.C. Inc. was established in 1995 at M.I. Road, Jaipur, Rajasthan, India. The prime concern of the firm has remained maintaining the quality standards of the products offered to the customers. Due to its quality policy the firm is reckoned as the most prominent \u0026amp; leading trader, supplier \u0026amp; exporter of Loose Diamonds, Precious Stones, Semi Precious Gemstones, Gold Bullion Bars, Silver Bars, Gold Jewellery \u0026amp; Silver Jewellery. We make our range available in wide varieties.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are able to efficiently take care of diverse demands and requirements of our valued clients owing to our never failing good relations with our vendors. Our worthy vendors have provided us immaculate quality products at industry leading prices that even our esteemed customers feel proud of their business dealings with us. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality is considered to be the prime forte of the firm and the management has taken all measures since the first day it came into existence to maintain the quality as per statutory standards. To carry out the systematic testing operations, the firm has developed a sophisticated Quality Check \u0026amp; Assurance Laboratory at its premises.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision:\n    Offer Quality products\n     Execution of every product order within the scheduled time frame\n    Offering nothing less than the most effective products\n    Catering as per exact requirement of esteemed customers\n    Welcoming feed backs and suggestions for improvisation on products consistently \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have been consistently aspiring to achieve creditability in industry by our ability in catering the upcoming requirements of customers in better and improved ways. We remain undeterred in our commitment towards quality solutions to bring our firm’s name and fame on topmost position.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       100],
      "assets/images/resized/0024/8009/248009v2-max-150x150.jpg"],
     [[125,
       100],
      "assets/images/resized/0024/8009/248009v2-max-250x250.jpg"],
     [[125,
       100],
      "assets/images/resized/0024/8009/248009v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}