{"name": "Jerry Traders",
 "permalink": "jerry-traders",
 "crunchbase_url": "http://www.crunchbase.com/company/jerry-traders",
 "homepage_url": "http://www.indiamart.com/jerrytraders/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jerrytraders@tradepassport.org",
 "phone_number": "9840958487",
 "description": " trading of the wide range of Mixed Seas",
 "created_at": "Fri Apr 05 06:57:09 UTC 2013",
 "updated_at": "Fri Apr 05 06:57:19 UTC 2013",
 "overview": "\u003Cp\u003EJerry Traders incorporated in the year 2012 as a Sole Proprietorship (Individual) firm engaged in trading, wholesaling, distributing and supplying of the wide range of Chicken Masala, Chinese Spices, Indian Spices, Mixed Seasonings, Pizza Seasonings and Packing Boxes. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOur vendors have enabled us to serve the customers in an efficient manner. These vendors are selected after conducting strict market surveys and after carefully analyzing the past work records of the same. They ensure timely deliveries of the products, which enable us to maintain the same with the clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team has played a prominent role in helping us to carve special place in industry. Their knowledge experience and hard-work has helped us to withstand the dynamic business environment and customer’s demands. Support of skilled procurement agents, quality controllers, research and development professionals, sales and marketing executives together has enabled us to serve the customers and market demand in successful manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nOur vast industrial experience and quality products has enabled us to garner huge clientele. Products offered by us are adulteration free and made available at reasonable prices. Customized packaging facility is offered by us and products are delivered in timely manner. All these factors has enabled us to garner he clientele. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nReason behind our carving a strong positing in industry is the sincere efforts mad by our professionals and products delivered in timely manner. Our range is quality-oriented and available at reasonable prices.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/8356/248356v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/8356/248356v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/8356/248356v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}