{"name": "JK Technologies",
 "permalink": "jk-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/jk-technologies",
 "homepage_url": "http://www.indiamart.com/jktechnologies/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jktechnologies@tradepassport.org",
 "phone_number": "9215606891",
 "description": "Manufacturer and Supplier",
 "created_at": "Fri Apr 05 07:57:33 UTC 2013",
 "updated_at": "Fri Apr 05 07:57:36 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2000, at Delhi, India, we, “J K Technologies Private Limited”, are recognized as the prominent Importer, Supplier, Manufacturer, Exporter \u0026amp; Trader of a broad assortment of Aluminum Lined Container, Office Container, Cabin, Ply Lined Container, Blast Retardant Container, Workshop Container, Tool Room Container, Bunk House, Multi Store Container, Store Container New, Process Enclosure Container, School Room, Generator Equipment Container Enclosures, Open Side Container, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a quality-centric firm, we emphasize on offering the best quality products to our precious clients. We have recruited an experienced team of quality experts that conducts crucial tests using hi-tech testing devices and tools. These quality tests are based on the parameters like dimensional accuracy, resistance to corrosion, compression absorption, durability, sturdiness,etc. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur sophisticated infrastructural facility makes us capable of handling bulk orders of the market and clients. We have established a robust infrastructure that are installed with various modern facilities which assist us to carry out our manufacturing activities in a well organized manner.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nAs one of renowned companies in this domain, we have been able to provide highest level of satisfaction by providing our esteemed clients with supreme quality products within the stipulated time frame. We firmly believe in ethical business policies and ensure fair dealings with our clients. As per clients’ requirement, we also facilitate them with customized solutions.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nThroughout our industrial exposure, we have been dealing only with industry\u0026#8217;s most trustworthy and reliable vendors. These vendors practice fair \u0026amp; transparent business practices and use only high grade raw material to manufacture their products. Before forging ties, we hold extensive market research to gauge a vendors\u0026#8217; credibility in the market, his production quality, variety in products and on-time delivery capability.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\nOur firm has earned a valuable position in the industry for providing high quality range of products at reasonable costs to our clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8409/248409v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/8409/248409v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/8409/248409v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}