{"name": "JKBiochem Healthcare",
 "permalink": "jkbiochem-healthcare",
 "crunchbase_url": "http://www.crunchbase.com/company/jkbiochem-healthcare",
 "homepage_url": "http://www.indiamart.com/jkbiochemhealthcare/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "beta-lactam-syrup, calmin-syrup, uterine-tonic, liver-tonics, protein-powder, bezoral-capsule",
 "alias_list": null,
 "email_address": "jkbiochemhealthcare@tradepassport.org",
 "phone_number": "9810106723",
 "description": "We are a leading Supplier and Trader ,",
 "created_at": "Thu Apr 04 07:54:16 UTC 2013",
 "updated_at": "Thu Apr 04 07:54:18 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in the year 2006 at Ghaziabad, India, “JK Biochem Healthcare Pvt. Ltd.” is the renowned supplier and trader of an extensive range of the best quality pharmaceutical medicines like Beta Lactum Section Tablets, Beta Lactam Syrup, CALMIN Syrup, Uterine Tonic, Liver Tonics, Protein Powder, Bezoral Capsule, Anti-Ulcer Capsule. The offered range is processed using high quality raw material procured from the reliable vendors of the industry as per the defined international quality standards. These are broadly acclaimed for their superior quality, accurate composition and zero side effects. Moreover, we also offer these at competitive market prices.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing quality centric firm, our goal is to provide top-notch pharmaceutical medicines to our clients. These medicines are formulated at well-equipped laboratories using highest quality chemical compound and basic ingredients at par with global quality criteria. Further, these medicines are rigorously tested on various parameters at our quality control lab by our quality testing personnel to deliver impeccable quality of product to clients.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe have established long term relations with our trusted vendors and with their assistance, we are able to provide our clients a range of pharmaceutical medicine like tablet, syrup, capsules and injections, Which are assured of optimal effectiveness and precise composition. Our vendors are chosen after comprehensive investigation about their market status and past record of accomplishment. This strategy makes certain that our products are in conformity with international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur highly dedicated team of professionals and medical experts work in the most coordinated manner to provide our clients a range of pharmaceutical Medicines like tablet, syrup, capsules and injections which are formulated by our vendors using highest quality chemical compound and basic ingredients. Moreover, our experts conduct various tests on the procured products to ensure reliability.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nProtein Powder\nCapsule Pill\nPharmaceutical Injections\nBurnaid Tube\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7649/247649v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7649/247649v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7649/247649v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}