{"name": "Jobbaloon.com",
 "permalink": "jobbaloon-com",
 "crunchbase_url": "http://www.crunchbase.com/company/jobbaloon-com",
 "homepage_url": "http://jobbaloon.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "search, jobs, wyszukiwarka-ofert-pracy",
 "alias_list": null,
 "email_address": "jobbaloon@gmail.com",
 "phone_number": "",
 "description": "Job Searchengine",
 "created_at": "Sat Apr 13 14:25:03 UTC 2013",
 "updated_at": "Mon May 06 04:16:38 UTC 2013",
 "overview": "\u003Cp\u003EOd kwietnia podbija Polskę pośród portali, wyszukiwarka  posad pl.JobBaloon.com, która jest jedną z czołowych w swojej branży. Witryna pracy została zorganizowana na potrzeby każdego. Będzie wiarygodnym źródłem poszukiwań, nie tylko dla osób w przedziale wiekowym 25-35 lat, takich które skończyły politechnikę, szkołę zawodową czy posiadają wykształcenie maturalne. Jest to strona www zrobionych dla ludzi w wieku 40 lat, ale i osób po 50 roku życia czy niesprawnych, które bez większych problemów powinny odkryć oferty wolnych stanowisk dla siebie i kumpli. \u003C/p\u003E\n\n\u003Cp\u003EMultiwyszukiwarka dostępnych wakatów, przyczyni się  do zwiększenia liczby pracujących osób na polskim rynku. Dzięki, stronie www w szybki sposób, znajdziemy wymarzone zajęcie na całe życie. Zamiast marnować czas w staniu w kolejce, czekając na oferty pracy z urzędu. Będziemy  w przeciągu paru sekund znaleźć szansę na dobrą w przyszłość w jednym miejscu.\u003C/p\u003E\n\n\u003Cp\u003EJuż nie będziesz musiał zasypywać swojego biurka, ofertami z miesięczników, ani pojawiać się w urzędzie. Zamiast inwestować w bilety zdm, zamiast wychodzić z domu, w bezpośrednim wyszukiwaniu miejsca pracy, spocznij na fotelu i skorzystaj z naszej banalnej wyszukiwarki. Oparta na  2 polach , dopasowuje i oferuje tylko ważne Ciebie oferty wolnych stanowisk. Wystarczy wypełnić pola, wpisując stanowisko, rejon. Jednym kliknięciem myszy, możemy odszukać dużo interesujących nas ofert. \u003C/p\u003E\n\n\u003Cp\u003ETu z pewnością odszukasz coś dla znajomych, bez obawy, że są to wakaty z niesprawdzonego źródła. Wyszukiwarka Jobbaloon agreguje aktualne ofert z całego internetu, tylko z zaufanych portali.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0025/1270/251270v2-max-150x150.jpg"],
     [[250,
       41],
      "assets/images/resized/0025/1270/251270v2-max-250x250.jpg"],
     [[450,
       74],
      "assets/images/resized/0025/1270/251270v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://pl.jobbaloon.com",
    "title": "pl.JobBaloon.com"}]}