{"name": "Jobsarium",
 "permalink": "jobsarium",
 "crunchbase_url": "http://www.crunchbase.com/company/jobsarium",
 "homepage_url": "http://www.jobsarium.com",
 "blog_url": "http://www.jobsarium.com/blog",
 "blog_feed_url": "http://www.jobsarium.com/blog/feed/",
 "twitter_username": "jobsarium",
 "category_code": "ecommerce",
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": 4,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "jobs, job-search, crm",
 "alias_list": null,
 "email_address": "team@jobsarium.com",
 "phone_number": "330-280-1828",
 "description": "Job Search Organization",
 "created_at": "Sat Dec 29 01:08:03 UTC 2012",
 "updated_at": "Sun Dec 30 04:55:10 UTC 2012",
 "overview": "\u003Cp\u003EJobarium is an Employer Relationship Managment system. Jobsarium allows you to create a Job and maintain important information about that job. Jobsarium also allows you to create milestones related to that job, such as submitting a resume, scheduling a phone interview etc\u0026#8230; As you create a milestone, Jobsarium creates tasks that you should completed. Jobsarium also allows you to create Notes associated with the job that you can refer back to later.\u003C/p\u003E\n\n\u003Cp\u003EOk this site was built by a fellow job seeker after he spent months looking for a new job. He realized after applying to almost 100 jobs he started getting disorganized quick. Which resume did he send to that job? Did he follow up after applying to this job. What was the contact\u0026#8217;s name at that other job? Notes would be kept on scraps of paper. Resumes would be kept in a file folder. But when it came time for an interview, he could not remember which resume I had sent\u0026#8230; What to do?\u003C/p\u003E\n\n\u003Cp\u003EIn his years in IT, he had implemented Customer Relationship Management software many times. After getting frustrated at my unorganized state, he realized that something like a Customer Relationship Management system would manage all of this information around me. So he built Jobsarium. \u003C/p\u003E\n\n\u003Cp\u003EIf you are looking for a job and are submitting for a lot of jobs (which is very common these days), then Jobsarium can help you organize and organize your job search.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}