{"name": "Johari Digital",
 "permalink": "johari-digital",
 "crunchbase_url": "http://www.crunchbase.com/company/johari-digital",
 "homepage_url": "http://www.indiamart.com/joharidigital/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "joharidigital@tradepassport.org",
 "phone_number": "8003416760",
 "description": "manufacturing ISO 13485 \u0026 9001/US FDA/CE",
 "created_at": "Fri Apr 05 08:21:12 UTC 2013",
 "updated_at": "Fri Apr 05 08:21:19 UTC 2013",
 "overview": "\u003Cp\u003EJohari Digital Healthcare Ltd is a Corporation, established in 1979, is an international business enterprise with powerful combination of experience and expertise focused to create most advanced medical device solutions. The company has been supplying medical devices to Therapeutic and Medical aesthetic, Life science \u0026amp; Diagnostics markets with its successful venture of Therapeutic \u0026amp; Medical aesthetic product line where thousands of patients were being treated with great results.\u003C/p\u003E\n\n\u003Cp\u003EMedical Device Design and Development:\nWe have a well-establish design and development unit, in our designing unit our professionals devote their time in offering unique product design that facilitate to use it in a better way. Our professional’s uses latest technology such as graphics software by which they design machines models and select perfect one, after passing that design, it goes to manufacturing unit for fabrication process.\u003C/p\u003E\n\n\u003Cp\u003EMedical Contract Manufacturing:\nBacked by advanced manufacturing unit, spreads over 50,000 SQFT and manned with 150+ workforces that make us capable to meet bulk orders of clients in stipulated time frame. Being an ISO 9001 \u0026amp; ISO 13485 certified organization, we ensure to deliver our clients international quality compliant products.\u003C/p\u003E\n\n\u003Cp\u003EWhy Johari:\nWe are instrumental in providing our customers outstanding range of Physiotherapy Equipment, Electrical Stimulator, Portable Electrotherapy Device, etc. These are manufactured keeping in mind the requirements of our clients and we also make sure that these products are delivered within the given frame of time.\u003C/p\u003E\n\n\u003Cp\u003EWhat is Private Labeling:\nStarting up your own line of products for your business, especially with medical devices, can be very laborious and can be full of trials and errors. There are some who succeed and there are others who do not. This can lead to a lot of wasted time and money. With Johari Digital’s full line of complete Private Label Medical Devices we can have your new line of medical devices branded with your company’s information and shipped to you in as little as 2 weeks.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client centric organization, we strive hard to provide our customers maximum level of satisfaction. Our experts work in close-harmonization with clients to provide, what exactly they require. Because of our ethical business policies, transparent dealings, client centric approach and flexible payment modes, we have been able to earn the trust of clients and retain them with their repetitive orders.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8425/248425v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8425/248425v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8425/248425v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}