{"name": "Johnrose Exports",
 "permalink": "johnrose-exports",
 "crunchbase_url": "http://www.crunchbase.com/company/johnrose-exports",
 "homepage_url": "http://www.indiamart.com/johnrose-exports/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dry-fruits, agro-products, fruit-pulps, fresh-coconuts, coir-products, textile-fabrics, handloom-sarees, patiala-suits, spirulina-products",
 "alias_list": null,
 "email_address": "johnrose-exports@tradepassport.org",
 "phone_number": "9025919144",
 "description": " the leading manufacturer, ",
 "created_at": "Fri Apr 05 07:58:49 UTC 2013",
 "updated_at": "Fri Apr 05 07:58:52 UTC 2013",
 "overview": "\u003Cp\u003EJohnrose Exports is a sole proprietorship company, it came into inception in the year 2012. We are based in Chennai, Tamil Nadu India and carry our entire business activities from there itself. Our organization is a premier exporter, supplier and buyer of wide variety of Fresh Fruits, Fresh Vegetables, Indian Spices, Dry Fruits, Agro Products, Fruit Pulps, Fresh Coconuts, Coir Products, Textile Fabrics, Handloom Sarees, Patiala Suits, Spirulina Products, Paper Products, Areca Leaf Products and Decorative Handicrafts. In addition to this, we also engaged in manufacturing, supplying and exporting of Wax Candles. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe enjoy a strong business relationship with our vendors. We source our products and raw material from the known and reliable vendors of the industry. We have maintained friendly relation with the vendors and in return they have ensured that the products and raw material procured by us are highly qualitative.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur dedicated and talented team is extremely rich in experience in the domain with commendable knowledge about the proper outsourcing of all products from various destinations of vendors. Hygienically processing, treating and preserving for longer shelf life without losing on its nutritional values and freshness are the creditable efficiencies possessed by our professionals. Our workforce is able to keep our clients satisfied with their efficiency of work and caliber of presentation in neat and orderly packaging.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur main focus always remains on maintaining the quality of all our products to the best possible standards. We take every measure to ensure that all the quality parameters are checked thoroughly at every step of production to ensure that they match with the international standards and that our customers remain fully satisfied.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed a sophisticated infrastructure facility, which is well-organized and spacious. Various departments such as of production, administrative, sales and marketing, quality control, packaging and others have been kept under strict vigilance of expertise team to carry out the whole process smoothly. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nFresh Fruits, Fresh Vegetables, Indian Spices, Dry Fruits, Agro Products, Fruit Pulps, Fresh Coconuts, Coir Products, Textile Fabrics, Handloom Sarees, Patiala Suits, Spirulina Products, Paper Products, Areca Leaf Products and Decorative Handicrafts. In addition to this, we also engaged in manufacturing, supplying and exporting of Wax Candles. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8411/248411v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8411/248411v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8411/248411v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}