{"name": "Josh Engineers",
 "permalink": "josh-engineers",
 "crunchbase_url": "http://www.crunchbase.com/company/josh-engineers",
 "homepage_url": "http://www.indiamart.com/joshengineers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "joshengineers@tradepassport.org",
 "phone_number": "9371021885",
 "description": "Trader and Supplier of Device Programmer",
 "created_at": "Thu Apr 04 16:11:43 UTC 2013",
 "updated_at": "Thu Apr 04 16:11:45 UTC 2013",
 "overview": "\u003Cp\u003EFounded in the year 2003, at Pune, (Maharashtra, India), we “Josh Engineers” are known as the foremost Manufacturer, Trader and Supplier of an exclusive range of Device Programmers and Adapters. Furthermore, our offered range includes ZM R5860C BGA Rework Station, ZM R5860 BGA Rework Station, RE 8500 BGA, RE 7500 BGA, Bee Prog 2 Programmer, Bee Prog Plus Programmer, BeeHive 204 Programmer, BeeHive 208 Programmer, SmartProg2 Device Programmer, UNIPRO 111U Programmer, iSolder-40 Solder Station, SuperPro 5000E Universal IC, SuperPro 5000 Universal ICSuperPro 501S Universal IC, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nDriven by a passion to offer product range that has no match in the market, our quality supervising team ensures best performance, adaptability durability, complex circuit design and correct output are delivered from our end. Our policy is based on offering clients best range that not only adds to their productivity but also gives no scope for complaints. Further, our quality assessment professional also utilizes their skills in testing quality on different parameters at different stages of production. Further, for assuring optimum accuracy, all testing is done with fine-tuned precision-grade testing equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have with us sophisticated Infrastructural facility that is a testimony to our potential and concern to serve customers with products as needed by them. We have invested extensively in our manufacturing unit, which has paid great dividend in yielding expected returns with optimum turnover so as to meet heavy market demands. The manufacturing unit featuring maximum set up capacity runs smoothly because of the efficient management of our technical team. Further, we also have with us modern Quality and R \u0026amp; D units that allow us to flawlessly design, develop and reassess quality of our high end range of transformers and battery chargers.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur business operations are well handled by our team of experts who guide the operations through all its critical phases. Their process expertise also helps us to deliver quality products to our customers in exact specifications as demanded by them. Further, our professionals are highly experienced and knowledgeable in meeting the variegated demands of the clients. We have hired these professionals on the basis of their experience and exceptional academic records. Our professionals are always dedicated towards the growth of the company. In order to keep them updated with the latest industry requirements, we regularly conduct various seminars and workshops.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric organization, we believe to deliver superiority assured products to our precious clients. Our skilled workforce makes genuine effort to convince clients in the best possible way. In addition to this, to ensure safe shipment at clients’ end, we deliver products in the best quality packaging material. Also, we have established a huge client base across the country because of our fair business policies: good transparent dealings, cost effective prices, well-timed delivery are appreciated by clients. Our association with top vendors of the market has enabled us to supply superlative range at client’s end.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0024/8069/248069v2-max-150x150.jpg"],
     [[250,
       98],
      "assets/images/resized/0024/8069/248069v2-max-250x250.jpg"],
     [[255,
       100],
      "assets/images/resized/0024/8069/248069v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}