{"name": "JTG Systems",
 "permalink": "jtg-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/jtg-systems",
 "homepage_url": "http://www.jtgsystems.com",
 "blog_url": "http://jtgsystems.com/computerrepair/",
 "blog_feed_url": "",
 "twitter_username": "jtgsystems",
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": 2005,
 "founded_month": 8,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "data-recovery, computers, computer-repair, mac-repair, hard-drive, mac",
 "alias_list": null,
 "email_address": "jtgsystems@gmail.com",
 "phone_number": "905 892 4555",
 "description": "PC / Mac repair and Data Recovery.",
 "created_at": "Tue Sep 04 15:40:10 UTC 2012",
 "updated_at": "Sun Sep 09 18:54:25 UTC 2012",
 "overview": "\u003Cp\u003Ethis is about JTG and the Owner: \nJohn Gallie was born in May, 1985 and raised in St. Catharines Ontario until the age of 13 years old. With his family he moved to the wonderful town of Pelham; Fonthill to be exact. Attending AK Wigg, Glenn A. Green, EL Crossley and Niagara College.  John has been working with computers since the age of 10; when Windows 95 came out. He discovered his passion for computers and helping people at an early age.  Long nights reading about computers, fixing and experimenting with his own gear lead to great discoveries and methods on how to repair PC’s and Macs faster than most technicians can comprehend. With a genuine joy for computers and repairing them, for John it has become second nature. It would be like asking you to tie up your shoe or do up your jacket. It’s a skill that he has developed for the last 17 almost 18 years of his life.\u003C/p\u003E\n\n\u003Cp\u003EJohn says; “with computer repair it’s a natural but learned skill. You can tell the difference between a computer tech with a flashy certification; that has no hands on experience or a real technician who can take apart - diagnose, fix and put back together almost any computer known to man! Stepping outside a comfort zone on a regular basis on the most expensive computers and challenging yourself in every aspect of computer repair separates the men from the boys or a hobbyist from an expert.”\u003C/p\u003E\n\n\u003Cp\u003ETraining in mixed martial arts under Tom Burtnik since the age of 7 years old, until 2002, John has received many awards and achievements including obtaining his Black belt in Mixed Martial Arts successfully; showing loyalty and confidence in not only in himself but also the work he does.\u003C/p\u003E\n\n\u003Cp\u003EJohn Joined the Department of National Defense / Lincoln and Welland Regiment in 2002, until his Voluntary release in 2005; he learnt all that the forces had to offer him at his regiment. In that time he nurtured his personal development, stretching his mind to the limits in conditions worse than seen on TV. “Winter exercise’s so cold you thought you might not wakeup in the morning.” In the army, John was trained in various weapons and tactical strategies, such as urban warfare and operations in the field, capable of leading a team of soldiers in even the harshest of Climates. John was a certified small arms coach completing his DP2A course / certification. Where he scored marksman on his personal weapons test level 3. Learning to take apart weapons in the dark for cleaning can compare to the complexity of some computers, learning how to take apart guns that are super complicated has trained John on how to put them back together in an orderly fashion, if its token apart left to right then rebuild right to left it should go back together flawlessly.  Critical thinking skills are always used in the military giving John the advantage when the situation arises. Problem solving would be considered one of John’s greatest strengths in any facet. In 2005, JTG Computer Repair was started but soon later changed the name to JTG Systems later that year as JTG fixes more than computers, they can repair almost all electronics.\u003C/p\u003E\n\n\u003Cp\u003EIn late August of 2005, John Thomas Gallie (Sole owner) started the company known as \u0026#8220;JTG Systems\u0026#8221;. The owners name is literally in the business. With each repair he puts his name on the line for quality and personal reputation as being Niagara’s top computer place.\u003C/p\u003E\n\n\u003Cp\u003EWe have a positive image in our community and are well referred by many locals we are known by businesses and home owners across Canada for our great work and timely service. Our office is located in Niagara; we provide mail in services for other areas or onsite technicians for hardware issues. We have experienced technicians to meet all your computer technology needs from PC\u0026#8217;s, Laptops, Cell phones and Gamming consoles like Xbox 360, Play station 3 - We repair almost all electronics.  If we can\u0026#8217;t do it, no one can!\u003C/p\u003E\n\n\u003Cp\u003EWe have serviced many well know businesses in Niagara such as Rock Way Glenn, IPN Consultants LTD., Welland Avenue Chiropractic, Accelerated Health Center, The Printing House, Green bean cafe, Salvation Army Booth Centre, The Smart Shopper, Lochness links, TELUS, Rogers, Cineplex Digital Solutions, Napa Auto Parts and the list would take an hour to read aloud.\u003C/p\u003E\n\n\u003Cp\u003EWe are past members of the St. Catharines and Thorold Chamber of Commerce (2006).\u003C/p\u003E\n\n\u003Cp\u003EWe are past members of BNI (We Were Top refers in our group!), Know it all Niagara (The Owner (John) was awarded King Linker in 2006)\nWe are current members of The Certificate Club, TBE and other Barter organizations.\u003C/p\u003E\n\n\u003Cp\u003EWe have multiple awards, Donation to Charity Certificates / letters of appreciation and Customer testimonials in our office with hanging with pride knowing that we are a community minded business, Trying to help You and the area we share. We have serviced computers of Local Law enforcement officers and helped fix computers used in Forensics for NRPS. We ensure everyone enjoys our service with trust and confidence in knowing you are being taken care of properly and professionally. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Owner",
    "person":
     {"first_name": "John",
      "last_name": "Gallie",
      "permalink": "john-gallie",
      "image": null}},
   {"is_past": true,
    "title": "Mac Repair Canada",
    "person":
     {"first_name": "Mac",
      "last_name": "Repair",
      "permalink": "mac-repair",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}