{"name": "Ju-mo",
 "permalink": "ju-mo",
 "crunchbase_url": "http://www.crunchbase.com/company/ju-mo",
 "homepage_url": "http://ju-mo.org",
 "blog_url": "",
 "blog_feed_url": "http://ju-mo.org/feed/",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "jumo, jumo-in, jumo-jumo",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Jumo network - new approach to the idea",
 "created_at": "Sat Jul 21 15:35:06 UTC 2012",
 "updated_at": "Wed Jul 25 06:07:55 UTC 2012",
 "overview": "\u003Cp\u003EThe main idea of Jumo social network is to connect people interested in discussing and solving global problems.\nUsing it charity organizations, funds and societies have a huge amount of possibilities to find and attract at their social projects people who really want to help the others.\nToday the Jumo network is aimed to improve usability and functionality of the resource.\nMost of modern social networks are created as entertaining websites providing people with funny contacts and many kinds of distraction. Jumo network is different. People, organizations and funds joint by the community are aimed not only at discussing some issues, but doing something real to change the situation. Each Jumo network user can get all the data on issues he or she cares about freely. All kinds of participation are welcome – discussion, project offers, organization running and etc.\nIt doesn’t mean that Jumo network has no capabilities for friendly contacts, dealings and talks. It has. But if you are a permanent social networks’ user you can see that in last few years charity becomes one of the important parts of its running. The main difficulties of using entertaining networks for charity aims are the lack of interested audience and the enormous volume of user generated content.\nJoining interested people at new thematic website concerns not only community building but also providing users with perfect chance to present their project freely and without any limitation. With Jumo social network organizations and people can collect money to support suffering children or animals, attract social interest at serious ecological issues or global human problems like human trafficking or cancer and etc.\nModern Internet technologies give Jumo network the opportunity to move quickly and provide its users with easy searching and navigating all kinds of content. You could run your personal and group project, publish news on finished, current and future events, share your ideas and discuss it openly.\nThe efficiency of creating and running such social network resources is widely discussed by Internet community. There is also a group of people contesting Jumo networks are ineffective and bad way to attract people’s attention at global problems. Our website proves that people can use the idea of Jumo in some new advanced ways. You should remember that people run projects not the website. Join the community now and do the world a little better.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}