{"name": "JVC",
 "permalink": "jvc",
 "crunchbase_url": "http://www.crunchbase.com/company/jvc",
 "homepage_url": "http://www.jvc.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "AV Products",
 "created_at": "Fri Oct 23 17:36:29 UTC 2009",
 "updated_at": "Fri Oct 23 17:36:29 UTC 2009",
 "overview": "\u003Cp\u003EJVC U.S.A. is a division of JVC Americas Corp., a wholly owned subsidiary of Victor Company of Japan, Limited. JVC is a leading developer and manufacturer of sophisticated audio and video products that use superior technologies to deliver high quality sound and images.\u003C/p\u003E\n\n\u003Cp\u003EIn consumer products, JVC offers high definition displays and home theater projectors, digital video camcorders, home theater systems, audio components and systems, portable audio products, DVD players and recorders, digital storage devices, audio and video accessories, car audio/video products and recording media.\u003C/p\u003E\n\n\u003Cp\u003EAn innovator throughout the analog age, exemplified by the JVC-developed VHS videocassette recorder, JVC has demonstrated the same innovative flair in the digital age. From our top-performing flat panel LCD televisions to our ground-breaking hard drive Everio digital camcorders, JVC continues to offer a succession of distinctive products that deliver sound and images with the power to move people.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to consumer products, JVC offers professional electronics products and distributes a complete line of broadcast, professional and presentation equipment. These include cameras, professional camcorders, DVD recorders, VTRs, high definition monitors, editing equipment, video/data projectors, video data recorders, storage systems and video security products.\u003C/p\u003E\n\n\u003Cp\u003EFor 80 years the JVC brand name has been associated with the very best in audio and video entertainment, and has also been a strong supporter of the creative side of the entertainment world.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[140,
       76],
      "assets/images/resized/0006/3488/63488v1-max-150x150.png"],
     [[140,
       76],
      "assets/images/resized/0006/3488/63488v1-max-250x250.png"],
     [[140,
       76],
      "assets/images/resized/0006/3488/63488v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}