{"name": "Jyoti Irrigation",
 "permalink": "jyoti-irrigation",
 "crunchbase_url": "http://www.crunchbase.com/company/jyoti-irrigation",
 "homepage_url": "http://www.indiamart.com/jyotiirrigation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jyotiirrigation@tradepassport.org",
 "phone_number": "8826613676",
 "description": "Manufacturer and Supplier",
 "created_at": "Thu Apr 04 10:02:13 UTC 2013",
 "updated_at": "Thu Apr 04 10:02:15 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, at Gurgaon (Haryana, India), we, “Jyoti Irrigation” are the renowned manufacturer and supplier of an qualitative assortment of HDPE Pipes, HDPE Coil Pipes, HDPE Pipes, Plastic Sprinkler Pipes, HDPE PP Pipes, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are equipped with a modern and straggling infrastructure that is sprawling over a large area of land and help us in the manufacturing of best quality products. In addition to this, we have segregated our large infrastructural base into various sub-departments such as manufacturing, quality control, sales \u0026amp; marketing, etc. in order to work smoothly.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe offer our esteemed clients high quality array of products that is fabricated using high grade factor inputs and advanced technology in our well-developed fabrication unit. At our organization, the entire production process is strictly monitored by our quality analysts, who have an in-depth knowledge in this domain.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a team of highly trained professionals and members, who works with full dedication to fulfill the varied requirements of clients in conjunction with organizational goals. Our team includes engineers, well trained technicians, quality controllers and sales \u0026amp; marketing personnel. \u003C/p\u003E\n\n\u003Cp\u003EManufacturing Unit:\nWe are equipped with sophisticated manufacturing unit having technically advanced machinery. The machinery is used for engineering plastic based products on German Technology that assure for perfect quality and finishing. Besides, the machinery helps to make the materials absolutely free from moisture content. \u003C/p\u003E\n\n\u003Cp\u003ECustomization:\nWe have innate customization capabilities that has established us as a prominent name in the industry. Our team of adept designers assist in developing custom made designs in accordance with client specifications.   \u003C/p\u003E\n\n\u003Cp\u003EWarehousing \u0026amp; Packaging:\nWe possess a spacious area, which is well furnished with the essential facilities to store our comprehensive range of products. The unit is designed with separate sections so as to store the different products. All the sections of the warehouse are properly labeled which assists us in easy and fast storage and retrieval of the products. Apart from this, the unit also has material handling equipment which help us in the accommodating the comprehensive range.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7787/247787v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7787/247787v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7787/247787v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}