{"name": "Kaback Talent Academy",
 "permalink": "kaback-talent-academy",
 "crunchbase_url": "http://www.crunchbase.com/company/kaback-talent-academy",
 "homepage_url": "http://kabacktalentacademy.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "alycia-kaback, kmm-talent, kaback-talent-academy, the-it-factor-productions",
 "alias_list": null,
 "email_address": "aly@viptalentconnect.com",
 "phone_number": "267-318-7807",
 "description": "Online modeling acting music workshops",
 "created_at": "Sun Jul 22 11:55:26 UTC 2012",
 "updated_at": "Wed Jul 25 06:14:16 UTC 2012",
 "overview": "\u003Cp\u003EAbout Us and What The Kaback Talent Academy Does\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;From the dawn of mankind the one idea we have all shared no matter race, religion or background that gives us our humanity is simply storytelling.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003ESo what is the Kaback Talent Academy?\u003C/p\u003E\n\n\u003Cp\u003EAt some moment, all of us at one moment, weather as kids or even as adults, we have wished or dreamt we were a famous singer, actor or even a model for a fleeting moment.\u003C/p\u003E\n\n\u003Cp\u003EDesigned equally for beginning talent as well as those with experience, the Kaback Talent Academy provides all potential talent with modern techniques, advice and most importantly the fundamentals to go from beginner to professional in the entertainment industry, by providing a foundation of training rooted in time-honored theatrical traditions of those who have been successful and now want to give back by offering the next generation advice and a roadmap of what works and does not work.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;The Academy” is a FREE service offering instructional video clips on subjects such as, what experienced and new models, actors, musicians need to know to succeed. Examples are: “How to be signed by a agent or manager” to up to the minute access of real-time castings and auditions to downloadable e-books and PDF guides on insider technique’s. You will learn how to land the “Dream Job” from advice that is written by real, successful NY and LA agents, managers, actors, directors, models, musicians and a who’s who of A list individuals activity involved in the entertainment industry.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EImagine a world without Arts and Entertainment.\u003C/p\u003E\n\n\u003Cp\u003EAny endeavor in life takes experience and knowledge. For the past five years we have interviewed thousands of individuals who are truly amazing and gifted individuals but the one key factor many of them they lacked is either the education or perhaps the circle of friends and family to support their passion to have success as a model, actor or musician. We used to say to those individuals and families “Why swim with ducks, when you can soar with eagles”.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Our concept is easy to master. Work hard, learn and perfect your ability and build relationships.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EAt the same time we were saddened to see so many of these people spend hundreds and sometimes thousands of dollars on products and service’s that promised success with all good intentions such as photo’s or classes that were a service but did not guarantee a shot at a legitimate job or even better a real opportunity to create a career. Thus you got just what you paid for pictures and basic classes. So we said what were these people lacking? What do the people and kids, perhaps anyone of any age, race or experience with talent; looks and determination really need to succeed or at the very least have that one shot to make their dream real and not some false promise with a price tag to boot?\u003C/p\u003E\n\n\u003Cp\u003EModels, actors, musicians and vocalists that take advantage of Kaback Talent Academy are transformed with a social community that extends beyond the walls of the traditional classroom. Attendees are seen and heard by industry experts while learning. Kaback Talent Academy (KTA) offers the tools to connect and teach the keys of success from directors, modeling insiders and music superstars who know what is needed to succeed. Today, guidence to those with a dream or talent is non-existent. KTA has changed that with a simple fun format that is accessible to all.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       35],
      "assets/images/resized/0020/2216/202216v2-max-150x150.png"],
     [[250,
       59],
      "assets/images/resized/0020/2216/202216v2-max-250x250.png"],
     [[370,
       88],
      "assets/images/resized/0020/2216/202216v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Alycia",
      "last_name": "Kaback",
      "permalink": "alycia-kaback",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0012/3453/123453v2-max-150x150.jpg"],
          [[240,
            240],
           "assets/images/resized/0012/3453/123453v2-max-250x250.jpg"],
          [[240,
            240],
           "assets/images/resized/0012/3453/123453v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "East Coast Office",
    "address1": "125 South St",
    "address2": "",
    "zip_code": "19147",
    "city": "Philadelphia",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}