{"name": "Kalindi Overseas",
 "permalink": "kalindi-overseas",
 "crunchbase_url": "http://www.crunchbase.com/company/kalindi-overseas",
 "homepage_url": "http://www.indiamart.com/kalindioverseas/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "motor-body-casting-and-zinc-die-casting--in-addition-to-this, to-cater-the-variegated-demands",
 "alias_list": null,
 "email_address": "kalindioverseas@tradepassport.org",
 "phone_number": "9537526592",
 "description": "Manufacturing and supplying  ",
 "created_at": "Thu Apr 04 15:34:17 UTC 2013",
 "updated_at": "Thu Apr 04 15:34:20 UTC 2013",
 "overview": "\u003Cp\u003ESince our incorporation is in year 2011, we, “Kalindi Overseas” are a trustworthy organization engaged in manufacturing and supplying a comprehensive range of Die Casting, Aluminum Sand Casting, Aluminum Casting, Cast Iron Casting, SGI Casting, Fastener and Brass Fastener. Under this affordable range, we offer Fabrication Dyeing, Die Casting Mold, Die Casting, Motor Body Casting and Zinc Die Casting. In addition to this, to cater the variegated demands, we also offer Aluminum Clamp Casting, Aluminum Sand Casting, Sand Casting Part and Aluminum Casting are few to name. \u003C/p\u003E\n\n\u003Cp\u003ECompany Policy:\n    It is our policy to produce casting to meet your individual requirements\n    Good surface finish, accurate shape and Dimensional control\n    To upgrade company’s resources to meet customers ever changing expectations\n    Right material delivery at the right time\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have hired for our process a team of qualified and capable professionals who have so far acted as the power house of the company. All trade activities have been carried out in a smooth manner due to their efficiency and consistent support. We have stayed firm over the issue of quality and taken our reputation more higher. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nDue to our firm commitments to quality we have been able to offer to our customers a qualitative range of metal castings. This range has been widely appreciated for its compliance to the standards of the industry. Made from quality raw material of metal alloys sourced from the most reliable vendors our range has been quality approved by industrial quality controllers. For complete quality assurance and a qualitative delivery to the customers, the range is delivered in a stringent packaging. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric organization, we are engaged in offering Die Casting, Aluminum Sand Casting, Aluminum Casting, Cast Iron Casting, SGI Casting, Fastener and Brass Fastener to our esteemed clients. In order to attain maximum satisfaction of our clients, we develop our range of casting utilizing quality-approved raw material like aluminum, irons, brass and other basic components that are obtained from reliable vendors of the industry. In addition, we have appointed a diligent team of quality analyzers, who inspect these castings on different parameters to give our clients defect-free range.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nFabrication Dyeing, Die Casting Mold, Die Casting, Motor Body Casting and Zinc Die Casting. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8035/248035v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8035/248035v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8035/248035v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}