{"name": "Kamaniya",
 "permalink": "kamaniya",
 "crunchbase_url": "http://www.crunchbase.com/company/kamaniya",
 "homepage_url": "http://www.indiamart.com/kamaniya/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "kamaniya@tradepassport.org",
 "phone_number": "9830628141",
 "description": "manufacturer, supplier, trader and expor",
 "created_at": "Thu Apr 04 13:35:25 UTC 2013",
 "updated_at": "Thu Apr 04 13:35:27 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in the year 2011, Kamaniya has proved its competency by manufacturing, supplying, trading and exporting a varied array of Silk Saree, Unstitched Fabric, Silk Dupatta and Silk Scarf. Various other products offered by us under these categories are Handpainted Gachi Tussar Saree, Block Printed Matka Silk Saree, Gachi Tussar Block Printed Saree, Matka Ghicha Saree, Block Printed Gachi Tussar Saree.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe procure best quality of cocoons. We have a sound infrastructure to store the cocoons and to extract fine Tussar yarn from them. Our weaving unit has hand looms which our weavers with at least 15-20 years of experience operate and produce finely woven fabrics. Our highly creative designers do designing of the sarees, dupattas and various other products in our studio.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nIn order to manufacture commendable range, we make use of best quality  threads and refined fabrics. Whether it is the procurement process of cocoons, weaving or printing our quality analysts, keeps close vigil on each and every stage. Reliable vendors are approached, in order to procure products from them. Our experts test even the fabrics before being used in production.\u003C/p\u003E\n\n\u003Cp\u003EOur Strengths:\nVarious factors together have contributed for our success, whether it is the quality of our range, exclusive designs, our pricing policy or customer-oriented approach followed by us. All these factors together have enabled us to win the trust of vast clientele.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nIn order to offer our esteemed clients with quality products, we have built alliances with a vast and authentic vendor base. Our vendors are known to use quality ingredients and processing techniques while developing the range.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are known for manufacturing only flawless range, which is made in conformation with the prescribed quality norms set by Ministry of Textile Govt of India and as a result, we received Hand loom Mark from them. Our aim to deliver best quality products has enabled us to form strict quality control majors with the help of our quality controllers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7930/247930v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7930/247930v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7930/247930v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}