{"name": "Kantrovitz \u0026 Associates, P.C.",
 "permalink": "kantrovitz-associates-p-c",
 "crunchbase_url": "http://www.crunchbase.com/company/kantrovitz-associates-p-c",
 "homepage_url": "http://www.kantrovitzlaw.com",
 "blog_url": "http://www.kantrovitzlaw.com/blog",
 "blog_feed_url": "",
 "twitter_username": "kantrovitzlaw",
 "category_code": "legal",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "personal-injury, workers-compensation, social-security-disability, automobile-accidents-and-injuries, wrongful-death, motor-vehicle-accidents, workplace-injuries",
 "alias_list": null,
 "email_address": "kantrovitzlawfirm@gmail.com",
 "phone_number": "6173670880",
 "description": "Workers’ Compensation Attorneys",
 "created_at": "Sun Mar 17 13:41:28 UTC 2013",
 "updated_at": "Sun Mar 17 13:41:34 UTC 2013",
 "overview": "\u003Cp\u003EKantrovitz \u0026amp; Associates, P.C. is an experienced workers’ compensation law firm located in Boston, Massachusetts. Our attorneys are dedicated to upholding the rights of injured workers. If you have been injured while on the job, the workplace accident lawyers at our firm have more than 20 years of legal experience with workers’ compensation cases. Our goal is to make sure you and your family are fairly compensated for your workplace injuries.\u003C/p\u003E\n\n\u003Cp\u003EBecause we focus on workers’ compensation cases, it has allowed us to develop a thorough expertise in this area of the law. Our workplace injury attorneys understand the complex medical issues that go hand-in-hand with workers’ compensation cases. We will make sure you are compensated for lost wages and money spent on medical bills. In cases involving an accidental death, we will strive to ensure surviving family members have a secure future.\u003C/p\u003E\n\n\u003Cp\u003EKantrovitz \u0026amp; Associates represents injured and ill workers throughout Massachusetts, including but not limited to Boston, Essex, Middlesex, Norfolk, Suffolk, Plymouth and Merrimack River. We also represent Rhode Island and New Hampshire residents whose injuries occurred in Massachusetts or who were hired in Massachusetts but who were injured out of state.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}