{"name": "KAnwar Solutions",
 "permalink": "kanwar-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/kanwar-solutions",
 "homepage_url": "http://www.indiamart.com/kanwarsolutions/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "kanwarsolutions@tradepassport.org",
 "phone_number": "9990491454",
 "description": "Manufacturing and Supplying",
 "created_at": "Fri Apr 05 07:37:38 UTC 2013",
 "updated_at": "Fri Apr 05 07:37:43 UTC 2013",
 "overview": "\u003Cp\u003EFounded in the year 2000, at New Delhi,(India), we, “K. Anwar Solutions”, are engaged in manufacturing and supplying a wide range of optimum quality Aluminum Works, Steel Works, Interior Works, M.S. Works or Iron Works, etc.\u003C/p\u003E\n\n\u003Cp\u003EQuality Policy / Processes:\nBeing a quality-centric organization, we assure our clients that the products offered by us are fault free and require less maintenance. In order to design these products, we use excellent quality components sourced from the most trusted vendors of the industry. Also, we have advanced manufacturing unit, where we manufacture these products using sophisticated technology as per the variegated requirements of our clients. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\nWe are the leading organization in the market, engaged in offering composite panel, structure glazing, doors and windows and all type of aluminum fabrication work \u0026amp; steel works. The goodwill we have generated is due to the timely delivery of best quality products. Our entire range is made as per the set industry standards by our skilled professionals. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur clients are the base of our business and their satisfaction is the basic mantra for our success in the industry. Our presence in the industry for these many years has made it possible for us to understand the requirements of clients. To help our clients, we offer turnkey solutions as well as after sales service facilities to them.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are supported with the most appropriate and advanced infrastructure, equipped with all latest machinery and cutting edge tools, which assists us in building a reputable image in the market. Our team of experts ensures that each product is manufactured from optimum quality raw material to meet international quality standards. Furthermore, our unit is further divided into various specialized departments such as manufacturing, quality testing, sales \u0026amp; marketing that help us in timely delivery of products.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nOwing to the hard work of our personnel, we have established ourselves strongly in the national market. We are backed by skilled and experienced professionals, we are able to offer our wide range of products in compliance with client specifications.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8395/248395v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8395/248395v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8395/248395v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}