{"name": "Kapil Garments",
 "permalink": "kapil-garments",
 "crunchbase_url": "http://www.crunchbase.com/company/kapil-garments",
 "homepage_url": "http://www.indiamart.com/kapilgarments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "track-suits, jackets, mens-lower-and-t-shirts--some-of-our-products-encompass-mens-polo-t-shirts, polo-t-shirt",
 "alias_list": null,
 "email_address": "kapilgarments@tradepassport.org",
 "phone_number": "9779882020",
 "description": "We have placed ourselves as a leading,",
 "created_at": "Fri Apr 05 13:38:10 UTC 2013",
 "updated_at": "Fri Apr 05 13:38:16 UTC 2013",
 "overview": "\u003Cp\u003EWe, Kapil Garments have came into existence in the year 1999 and have successfully marked an enviable position by manufacturing and supplying a comprehensive range of Men’s Bermuda, Men’s Capri Shorts, Ladies Capri, Blazers, Track Suits, Jackets, Men’s Lower and T-Shirts. Some of our products encompass Men’s Polo T-Shirts, Polo T-Shirt, Winter Jackets, Ladies Jackets, Men’s Jacket, Men’s Tracksuit, Men’s Shorts, Ladies Bermuda and many others. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nQuality is always considered as the guiding force for our company and it is our unrelenting efforts towards it that we have established an outstanding place for ourselves in the industry. Strict quality guidelines and policies are followed at every level, covering the whole activities from material selection till their final dispatch of finished goods. Thus, we ensure that our entire range is in compliance to set guidelines of industry. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur company has developed modern infrastructural facility for having smooth and systematic executing of entire production procedure. In our advanced production unit, our products are stitched with the use of state-of-the-art machinery, which helps us in meeting the appropriate and bulk orders of clients efficiently. We have partitioned our whole infrastructural set-up into various departments to carry out trouble free operations. \u003C/p\u003E\n\n\u003Cp\u003EOur Valued Clientele:\nSince the day one of our establishment, we have focused all our tasks and endeavors towards achieving optimum contentment of our estimable clients. Therefore, we have been able to garner huge support of clients based across the country. We provide them simple and convenient payment options, in order to make the transaction of money on-time. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nMen’s Bermuda, Men’s Capri Shorts, Ladies Capri, Blazers, Track Suits, Jackets, Men’s Lower and T-Shirts. Some of our products encompass Men’s Polo T-Shirts, Polo T-Shirt, Winter Jackets, Ladies Jackets, Men’s Jacket, Men’s Tracksuit, Men’s Shorts, Ladies Bermuda and many others. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8705/248705v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8705/248705v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8705/248705v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}