{"name": "Kasheeda Fashion",
 "permalink": "kasheeda-fashion",
 "crunchbase_url": "http://www.crunchbase.com/company/kasheeda-fashion",
 "homepage_url": "http://www.indiamart.com/kasheedafab/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "kasheedafab@tradepassport.org",
 "phone_number": "+(91)-(141)-2657993",
 "description": "manufacturing, supplying and exporting",
 "created_at": "Thu Apr 04 08:20:14 UTC 2013",
 "updated_at": "Thu Apr 04 08:20:23 UTC 2013",
 "overview": "\u003Cp\u003EKasheeda Fashion Store (Exports) has captured an extensive market share by manufacturing, supplying and exporting a beautifully designed range of Trendy Lehengas, Ladies Suits, Designer Sarees, Ladies Kurtis. We came into existence in the year 2010 and are engaged in offering products such as Bridal Lehengas, Designer Lehengas, Fancy Lehenga Sarees, Designer Net Sarees, Party Wear Sarees, Heavy Border Sarees and many more. Our range is manufactured using optimum quality fabrics and other raw material that we procure from the world’s best and certified industrial vendors. Our products are acknowledged for their excellent finishing, colorfastness, comfortable fit, flawless stitching and others. Our experts frequently conduct market surveys to understand the specific demands and preferences of clients and to accomplish them accordingly. Furthermore, we strictly follow quality norms and guidelines suggested by the industry to ascertain the delivery of fault free products in the market.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\u003C/p\u003E\n\n\u003Cp\u003Emanufacturing, supplying and exporting a beautifully designed range of Trendy Lehengas, Ladies Suits, Designer Sarees, Ladies Kurtis. We came into existence in the year 2010 and are engaged in offering products such as Bridal Lehengas, Designer Lehengas, Fancy Lehenga Sarees, Designer Net Sarees, Party Wear Sarees, Heavy Border Sarees and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\u003C/p\u003E\n\n\u003Cp\u003EOur state-of-the-art infrastructural building has helped us set new benchmarks in the market for quality and exceptional performance in our area of functionality. The high production capacity of our manufacturing unit enables us to meet the rising demands of our clients and maintain a smooth supply chain in the market.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\u003C/p\u003E\n\n\u003Cp\u003EOur company has hired a team of knowledgeable and skilled professionals that helps us in taking our business towards greater heights.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\u003C/p\u003E\n\n\u003Cp\u003EOur company is acquainted with the fact that devoid of excellence no organization can succeed. Therefore, we have concentrated our every endeavor towards maintaining quality in the products we offer. For this, we have developed sophisticated quality control laboratory, where each product passes through stern quality checks by our specialized professionals.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\u003C/p\u003E\n\n\u003Cp\u003EBeing a prominent manufacturer, exporter and supplier of ladies garments, we are ably catering to the rising demands of our esteemed clients. Our timely delivery of bulk consignment, fair business practices and transparent dealings have assisted us in becoming the first choice of vast clientele.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/7676/247676v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7676/247676v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7676/247676v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}