{"name": "Kellys Vegies",
 "permalink": "kellys-vegies",
 "crunchbase_url": "http://www.crunchbase.com/company/kellys-vegies",
 "homepage_url": "http://www.kellysvegies.co.uk/",
 "blog_url": "http://kellysvegiesblog.co.uk",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 15,
 "founded_year": 2006,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "food, fresh-fruit-and-vegetables, uk",
 "alias_list": null,
 "email_address": "kellysvegies3@gmail.com",
 "phone_number": "",
 "description": "Farm Fresh Produce ",
 "created_at": "Sun Aug 26 10:44:08 UTC 2012",
 "updated_at": "Thu Aug 30 11:17:44 UTC 2012",
 "overview": "\u003Cp\u003EThe first boxes of fruit and vegetables delivered from Kellys Vegies were dispatched in September 2006 from the Kelly’s family garden. Since that first delivery the growth of the company has led to a move from the garden to the 30,000 sq.ft. warehouse in Maidenhead, out of which the company operates today. When it started out six years ago Kellys Vegies was a one-man operation delivering ten boxes of fruit and vegetables a week. Today the company has fourteen employees and delivers some 750 boxes weekly, adding up to an impressive total of 40,000 boxes of fresh produce delivered annually. As well as growing in size, Kellys Vegies has also diversified its offering, and in addition to the traditional fruit and vegetables that it offered at the outset, the company now offers home-made soups and pies, dairy products, bread, fruit juices, cakes, and free range eggs and meat, the latter delivered in special chilled packaging to ensure that it keeps chilled and fresh. Kellys Vegies is committed to providing its customers with a broad range of fresh, quality produce at good value for their money and with a reasonable shelf life.\nKellys Vegies services a catchment area that extends from London to Maidenhead, and includes several points in between. Deliveries are made overnight, with a guarantee of the boxes arriving by 4 a.m., meaning that people who are out at work all day can bring the fresh produce in before leaving in the morning or setting off on car pools to school, and come home to a kitchen well-stocked with fresh produce, all without having to actually go to the shops. The downside of this overnight delivery is that people is blocks of flats with security doors may not be able to enjoy the service if the company cannot access the building during the night.\nThe fruit and vegetables offered by Kellys Vegies are locally grown, fresh produce, but not organic, although general local farmers do tend to keep their use of chemicals down to a minimum. This preference for local fresh over organic stems from a number of basic reasons – the desire to create sustainable, local agriculture; organic produce is often not available locally and is brought in from further away, meaning may “food miles” are traveled and the produce is less fresh; costs are reduced as the middleman is eliminated when Kellys Vegies buys directly from the local farmers, and this cost reduction is passed on to the customers. \nBecoming a Kellys Vegies customer is quick and simple, and is done online on the company’s attractive, user-friendly site. The first step is entering your postcode to see what can be delivered to your area, and unchecking produce that you do not want to receive. On this page the customer can also add eggs for weekly or fortnightly delivery, as well as potatoes for monthly delivery. The next steps allow the customer to select from the range of additional products offered by Kellys Vegies. After selection of all products, the customer is required to enter the delivery address and pay the £1 delivery charge using the company’s secure server.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Kelly",
      "last_name": "Wheeler",
      "permalink": "kelly-wheeler",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Kelly's Vegies Limited",
    "address1": "Unit 3 Central Estate Denmark Street",
    "address2": "",
    "zip_code": "SL6 7BN",
    "city": "Maidenhead",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}