{"name": "Keoya Business Entertainment Group",
 "permalink": "keoya-business-enterprise-group",
 "crunchbase_url": "http://www.crunchbase.com/company/keoya-business-enterprise-group",
 "homepage_url": "http://www.facebook.com/pages/Keoya-Business-Enterprise-Group/118690488202109",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Listen2thaNoise",
 "category_code": "games_video",
 "number_of_employees": 1,
 "founded_year": 2009,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "television-development, film-fiance, motion-picture-funding, film-development, film-investing, programming, creative-rights, social-media-tv, commercials",
 "alias_list": null,
 "email_address": "StudyScene@excite.com",
 "phone_number": "818 836-4329",
 "description": "In House Film \u0026 Television Fiance Team",
 "created_at": "Sun Nov 04 01:53:45 UTC 2012",
 "updated_at": "Fri Apr 12 07:51:36 UTC 2013",
 "overview": "\u003Cp\u003EA Film \u0026amp; Television Development \u0026amp; Fiance Team\nProcurement of Government Media Contracts\u003C/p\u003E\n\n\u003Cp\u003EDun \u0026amp; Bradstreet # 965029387\u003C/p\u003E\n\n\u003Cp\u003EThe companies business model differs from many other companies in the independent television production sector as it retains control and ownership of all of the rights in its programming beyond the first-run rights granted to the broadcaster. Traditionally, most independent television production companies have been forced to give up these rights to the broadcaster in order to secure distribution. The company will only enter into deals that allow significant control and ownership of all the rights to each project developed, produced, or distributed to the companies library. These rights are valuable, as in addition to the revenues generated from the primary rights licensed to the broadcaster, the company is able to generate substantial additional revenue streams through the use of its own funding source known as Xtreme Revenue Fund, while allowing the Broadcaster to keep their creative integrity and entrepreneurial spirit. We strive to promote an awareness of this newly created prospect within our industry, develop friendly inspired creativeness, and at the same time bring to fruition an economically sustainable businesses, while increasing the Investors value.\u003C/p\u003E\n\n\u003Cp\u003EWelcome to Xtreme Revenue Funding where we take you into the next level of pushing your project into funding. As in most cases various projects never get the green light because of low budget restraints - we here at Keoya Business Ventures succeed in eliminating this recurring problem from your project. We take a hands on approach in assisting you with - how to prepare your project to be funded now. Once you have received the funds, we present to you, where can you begin to see the fruits of your labor. What is the next journey in obtaining more funding and placing your project before the viewers. These are not difficult choices as we look forward to being your guide to the new world of - FINISH PROJECT !!\nThis interest you please contact us at StudyScene@excite.com for a free consultation of your needs.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       100],
      "assets/images/resized/0021/8664/218664v2-max-150x150.jpg"],
     [[250,
       166],
      "assets/images/resized/0021/8664/218664v2-max-250x250.jpg"],
     [[450,
       300],
      "assets/images/resized/0021/8664/218664v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}