{"name": "KG International",
 "permalink": "kg-international",
 "crunchbase_url": "http://www.crunchbase.com/company/kg-international",
 "homepage_url": "http://www.indiamart.com/shrikginternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shrikginternational@tradepassport.org",
 "phone_number": "9462670970",
 "description": "Manufacturer, supplier.",
 "created_at": "Sat Apr 06 03:47:42 UTC 2013",
 "updated_at": "Mon Apr 08 00:08:02 UTC 2013",
 "overview": "\u003Cp\u003EYear of Establishment   2008, Shri K.G. International is a sole proprietorship business organization, which is based at Jaipur in Rajasthan. We are enlisted as a manufacturer, supplier, distributor, trader and wholesaler of the market engaged in offering an extensive range of Ring Binders, Clip Files, Information Organizers.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nSubject Notebooks, Information Organizers, Clip Files, Document Bags, Business Card Holders, Loose Paper Holders, CD Holders, Expanding Files, Laptop Bags, Executive Notebooks, Clear Bags, Blank Notebooks, Lockable Notebooks, Printed Notebooks, Writing Pads,  Scrap Books, Conference Pads, Envelopes, Project Books and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur firm adherence to quality standards enables us to design and develop an immaculate range of products for the clients. We use finest quality materials in our manufacturing process, which are procured from the reliable and trustworthy market vendors. \u003C/p\u003E\n\n\u003Cp\u003EOur Facilities:\nOur state-of-the-art infrastructural building has helped us set new benchmarks in the market for quality and exceptional performance in our area of functionality. The high production capacity of our manufacturing unit enables us to meet the rising demands of our clients and maintain a smooth supply chain in the market.\u003C/p\u003E\n\n\u003Cp\u003EOur Strengths:\nOur hi-tech manufacturing plant and competent workforce enables us to sustain a reputable position among the clients. In order to meet the precise needs and demands of our clients, we offer customized products to them. We ensure that all the undertaken orders are promptly processed and delivered to the clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nAlthough there are several reasons to choose us, but the two most important are our quality-conscious approach and rich industrial experience.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8999/248999v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8999/248999v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8999/248999v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}