{"name": "KickStart Network",
 "permalink": "kickstart-network",
 "crunchbase_url": "http://www.crunchbase.com/company/kickstart-network",
 "homepage_url": "http://www.kickstartnetwork.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Kickstartnet",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "college-entrepreneurship, entrepreneurship, startups, funding, collaboration, college, incubator",
 "alias_list": null,
 "email_address": "info@kickstartnetwork.com",
 "phone_number": "",
 "description": "Incubator for college entrepreneurs",
 "created_at": "Tue Dec 06 02:00:59 UTC 2011",
 "updated_at": "Mon Dec 12 21:42:10 UTC 2011",
 "overview": "\u003Cp\u003EKickStart is an online incubator providing college entrepreneurs with free collaboration, development, and networking tools to develop startups and connect with investors.\u003C/p\u003E\n\n\u003Cp\u003EProfessional Networking:\nOur services revolve around our users and their ability to communicate with each other and potential investors. Members will be able to connect and network with students from a wide variety of business organizations ranging from investment and entrepreneur clubs to national business fraternities. KickStart users will also be able to upload their business documents such as resumes and business plans to have them readily accessible in one spot from any internet connected computer. This feature coupled with the ability to customize profiles will make your KickStart profile your professional calling card on the web for others interested in your business ideas or interested investors.\u003C/p\u003E\n\n\u003Cp\u003EVenture Funding:\nMost importantly, KickStart offers you a venue in which you can develop your startup and pitch your ideas to potential investors. Although angel investor groups and capital venture firms are numerous in America, they are often not readily accessible for young college students. KickStart Network will alleviate this issue by offering our members comprehensive and easy to use tools to filter and search through possible funding sources, present their proposal or venture in a professional manner, and make the necessary contacts and introductions to begin the funding process. KickStart Network will serve as a professional gateway between capital sources and the innovative ideas being fostered on American campuses. Sign up for KickStart and present your entrepreneurial projects to accredited investors waiting for the next revolutionary idea.\u003C/p\u003E\n\n\u003Cp\u003EOnline Collaboration:\nNeed an online platform on which to collaborate with other students from campus or even across the nation? KickStart can help. If you are in search for talented students to join your startup team then just use our screening tools that will allow you to find other students that possess the skills you require. Get advice and help from other student\u0026#8217;s specializing in different business fields and help get your startup venture off the ground. Also take advantage of KickStart\u0026#8217;s chat feature with video capabilities in order to stay up to date with one another and use our web conferencing tool to hold online meetings.\u003C/p\u003E\n\n\u003Cp\u003EMarketplace:\nOur members will also be able to offer freelance services to each other which may range from logo and website design to copy writing and image editing. This marketplace function will allow users to practice their talents and skills while building a portfolio that can help in the user\u0026#8217;s job search. Startups will benefit from an experienced pool of talent ready to work on whatever they need!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       54],
      "assets/images/resized/0016/5312/165312v2-max-150x150.png"],
     [[250,
       91],
      "assets/images/resized/0016/5312/165312v2-max-250x250.png"],
     [[386,
       141],
      "assets/images/resized/0016/5312/165312v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO/Co-Founder",
    "person":
     {"first_name": "Gino",
      "last_name": "Ferrand",
      "permalink": "gino-ferrand",
      "image": null}},
   {"is_past": false,
    "title": "CEO/Co-Founder",
    "person":
     {"first_name": "Yannick",
      "last_name": "Schindler",
      "permalink": "yannick-schindler",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Offices",
    "address1": "",
    "address2": "",
    "zip_code": "92109",
    "city": "San Diego",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe src=\"http://player.vimeo.com/video/26357274?title=0\u0026amp;byline=0\u0026amp;portrait=0\" width=\"400\" height=\"225\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen\u003E\u003C/iframe\u003E\u003Cp\u003E\u003Ca href=\"http://vimeo.com/26357274\"\u003EKickStart for Students\u003C/a\u003E from \u003Ca href=\"http://vimeo.com/user7617384\"\u003EKickStart Network\u003C/a\u003E on \u003Ca href=\"http://vimeo.com\"\u003EVimeo\u003C/a\u003E.\u003C/p\u003E",
    "description": "\u003Cp\u003EKickStart for Students!\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.twitter.com/kickstartnet",
    "title": "KickStar on Twitter"},
   {"external_url": "https://www.facebook.com/pages/KickStart-Network/132125460214714",
    "title": "KickStart on Facebook"},
   {"external_url": "http://www.marketwatch.com/story/newly-developed-college-entrepreneurship-network-to-be-released-for-beta-test-2011-10-12",
    "title": "KickStart on MarketWatch"}]}