{"name": "King University Online",
 "permalink": "king-university-online",
 "crunchbase_url": "http://www.crunchbase.com/company/king-university-online",
 "homepage_url": "http://online.king.edu",
 "blog_url": "http://online.king.edu/news/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-education",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "King University Online Degree Programs",
 "created_at": "Fri Mar 15 18:37:24 UTC 2013",
 "updated_at": "Fri Mar 15 18:37:30 UTC 2013",
 "overview": "\u003Cp\u003EKing University\u003C/p\u003E\n\n\u003Cp\u003ELocated just 2 minutes away from the bustling Bristol, Tennessee – the twin city of Bristol, Virginia – King University spreads over 135 wooded acres and enchants the visitor with its Georgian-style building architecture.\u003C/p\u003E\n\n\u003Cp\u003EKing University is a Presbyterian master’s-level comprehensive university offers more than 80 majors, minors, pre-professional degrees and concentrations in fields such as business, digital media, nursing, forensic science, education, and humanities. Graduate programs are offered in business administration, nursing, and education. A number of off-campus learning opportunities and travel destinations are also available. Now, learning is available online as well, for the undergraduate programs in business and information technology, and the graduate program in business administration.\u003C/p\u003E\n\n\u003Cp\u003EMission\nKing University’s mission is to educate students in an academically rigorous and collegiate setting that integrates Christian faith, scholarship, service and career, leading to meaningful lives of achievement and cultural transformation in Christ.\u003C/p\u003E\n\n\u003Cp\u003EAccreditation\nKing University is accredited by the Commission on Colleges of the Southern Association of Colleges and Schools to award baccalaureate and masters degrees. Contact the Commission on Colleges at 1866 Southern Lane, Decatur, Georgia 30033-4097 or call 404-679-4500 for questions about the accreditation of King University.\u003C/p\u003E\n\n\u003Cp\u003EReputation\nFor the 23rd consecutive year, U.S. News \u0026amp; World Report has recognized King among the best colleges in the nation.\u003C/p\u003E\n\n\u003Cp\u003EThe Princeton Review named King one of the Best Colleges in the Southeast for a ninth consecutive year based on campus life, academics, admissions, and financial aid. King has also been selected by G.I. Jobs for a fourth year as a Military Friendly School.\u003C/p\u003E\n\n\u003Cp\u003EThe U.S. Department of Education and the Corporation for National and Community Services (CNCS) named King to the 2012 President’s Higher Education Community Service Honor Roll, for commitment to bettering our community through community service and service learning.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       59],
      "assets/images/resized/0024/2698/242698v2-max-150x150.jpg"],
     [[250,
       98],
      "assets/images/resized/0024/2698/242698v2-max-250x250.jpg"],
     [[450,
       177],
      "assets/images/resized/0024/2698/242698v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}