{"name": "Kinney Recruiting",
 "permalink": "kinney-recruiting",
 "crunchbase_url": "http://www.crunchbase.com/company/kinney-recruiting",
 "homepage_url": "http://www.kinneyrecruiting.com",
 "blog_url": "http://www.kinneyrecruiting.com/kinney-blog",
 "blog_feed_url": "http://www.kinneyrecruiting.com/kinney-blog?format=feed\u0026type=rss",
 "twitter_username": "kinneyrec",
 "category_code": "legal",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "law, attorney, lawyer, job, employment, asia, texas, austin, dallas, houston, new-york, hong-kong, shanghai, singapore, beijing, recruiter, recruitment",
 "alias_list": null,
 "email_address": "admin@kinneyrecruiting.com",
 "phone_number": "888-848-5757",
 "description": "Legal Recruiting Agency",
 "created_at": "Mon Jun 28 23:08:16 UTC 2010",
 "updated_at": "Tue Jan 17 00:26:17 UTC 2012",
 "overview": "\u003Cp\u003EKINNEY RECRUITING is home to some of the most respected \u003Ca href=\"http://www.kinneyrecruiting.com\" title=\"legal recruiters\" rel=\"nofollow\"\u003Elegal recruiters\u003C/a\u003E in the world, proudly serving markets around the globe. Kinney\u0026#8217;s Asia practice includes Hong Kong, Beijing, Shanghai, Tokyo and Singapore, among others. Our U.S. services focus on New York, Houston, Dallas, Austin, Ft. Worth, Phoenix, Washington, Boston, and Denver. Additionally, Kinney Recruiting is active in Dubai, London, Moscow and the rest of Europe.\u003C/p\u003E\n\n\u003Cp\u003EFounded by one of the most successful Texas legal recruiters of all time, Kinney Recruiting began with a simple philosophy: If we work as hard and smart, and if we are as responsive to client needs as the best of our clients and candidates, we will become the premier legal recruiting firm in every market we serve. We have succeeded by gathering over fifty years of attorney recruitment and top law firm experience within our organization and leveraging technology to help us help our clients. We also have structured our organization to promote teamwork. As a result, we believe that we know of more \u0026#8220;real\u0026#8221; jobs, we have more clients who know and respect our work, and we provide more help to more people than any legal recruitment agency in any market we serve.\u003C/p\u003E\n\n\u003Cp\u003EIf you are interested in legal recruiting services for your organization, or if you are a potential candidate for our services, please browse our site until you are comfortable with our philosophy and practices. Kinney Recruiting is committed to serving our clients\u0026#8217; interests in an ethical and effective manner, ultimately matching the right candidate with the perfect job.  Contact us today to start your search!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0009/1950/91950v2-max-150x150.png"],
     [[232,
       91],
      "assets/images/resized/0009/1950/91950v2-max-250x250.png"],
     [[232,
       91],
      "assets/images/resized/0009/1950/91950v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}