{"name": "Kinomap",
 "permalink": "kinomap",
 "crunchbase_url": "http://www.crunchbase.com/company/kinomap",
 "homepage_url": "http://www.kinomap.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "kinomap",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fitness, geolocation, gps, video, outdoor",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "sharing portal for geolocated videos",
 "created_at": "Thu Jan 03 13:40:41 UTC 2013",
 "updated_at": "Sat Jan 05 06:33:22 UTC 2013",
 "overview": "\u003Cp\u003EKinomap is the first platform in the world for geolocated videos sharing. it attracts more and more contributors, currently from more than 35 different countries in the world, video recording their tracks with GPS data. \u003C/p\u003E\n\n\u003Cp\u003EThese geolocated videos are shared on www.kinomap.com, with visitors from more than 85 countries so far. As of today, more than 10 000 videos are available on-line, giving you access to more than 30 000 km of tracks and rides across the world.\u003C/p\u003E\n\n\u003Cp\u003E« With Kinomap, our company objectives are to offer geolocated video contents for the best immersive experience and give great visibility and audience for partners. ».\u003C/p\u003E\n\n\u003Cp\u003EKINOMAP MAKER\nTo contribute, the easiest is to use a GPS video recorder or a Smartphone. The Kinomap Maker App can be downloaded for free on iPhone, Android, Bada or Windows Phone. If you want to use any kind of video recorder available on the market, feel free to get your position easily recorded by using a simple GPS data logger. All videos, shared on www.Kinomap.com, allow you to enjoy a ride very quickly: a simple click on the track or on the altitude/speed graph or on the video time scroll, and immediately you position yourself exactly in the requested zone. \u003C/p\u003E\n\n\u003Cp\u003EKINOMAP TRAINER\nKinomap Trainer is an iPhone/iPad application that allows anyone to exercise at home on a stationary bike, home trainer, treadmills or rowing machine based on the geolocated videos sharing platform www.kinomap.com. Turn your sport or fitness machine (using into a powerful and fun fitness device.  Just choose among the geolocated videos of Kinomap and ride! Watch your boat moving on the map: your goal is to follow the rhythm of the original video. Run the London’s marathon and be ready for next year. \nWith an ANT+ key (Wahoo  or similar), your iPhone/iPad receives the distance/power data from the equipment (speed, power, cadence..)\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "",
    "address2": "",
    "zip_code": "59500",
    "city": "Douai",
    "state_code": null,
    "country_code": "FRA",
    "latitude": 50.367874,
    "longitude": 3.080602}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://howtospendit.ft.com/technology/12651-its-training-but-not-as-we-know-it",
    "title": "Listen to the Financial Times about Kinomap Trainer"}]}