{"name": "Kirk Petrophysics",
 "permalink": "kirk-petrophysics",
 "crunchbase_url": "http://www.crunchbase.com/company/kirk-petrophysics",
 "homepage_url": "http://www.kirkpetrophysics.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": null,
 "founded_year": 1992,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "ops@kirkpetrophysics.com",
 "phone_number": "00441483235183",
 "description": "Oil \u0026 Gas service company",
 "created_at": "Mon Feb 15 05:58:53 UTC 2010",
 "updated_at": "Wed Feb 17 20:43:52 UTC 2010",
 "overview": "\u003Cp\u003EKirk Petrophysics provide leading technologies and personnel specializing in high quality Core Handling, Core Handling, Core storage procedures.\u003C/p\u003E\n\n\u003Cp\u003EKirk Petrophysics objectives is to safeguard the core from any unnecessary damage. Our constantly evolving technology guarantees leading preservation and core tracking performance throughout the cores  transit from reaching the surface at the wellsite to its arrival at the laboratory.  All methods and recommendations are based on our extensive experience in the field of international core handling, analysis and research, with particular involvement in friable and soft sediments.\nKirk Petrophysics offers a selection of core analyses. Both mineral and hydrocarbon components can be analysed. Kirk Petrophysics laboratories offer analyses such as porosity, permeability, grain density, thin section preparation, petrography, sedimentology, bitumen content, metal content, water content, cations and anions, clay content and carbonate content, amongst others. \nKirk Petrophysics has extensive storage facilities in London and Aberdeen to safely and securely store your core samples. Bespoke data management software allows detailed identification and tracking of all sample material and is supported by a robust QA program. Kirk Petrophysics also provides maintenance by way of condition assessment and remediation, data access (iAsset), legislative compliance (DECC), Sampling and sample transfer, core viewings and workshops amongst others.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       65],
      "assets/images/resized/0007/7045/77045v2-max-150x150.jpg"],
     [[250,
       108],
      "assets/images/resized/0007/7045/77045v2-max-250x250.jpg"],
     [[450,
       195],
      "assets/images/resized/0007/7045/77045v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}