{"name": "KiteLaser Technology",
 "permalink": "kitelaser-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/kitelaser-technology",
 "homepage_url": "http://www.indiamart.com/kite-laser-technology/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "kite-laser-technology@tradepassport.org",
 "phone_number": "13728270107",
 "description": "manufacturer, supplier and exporter ",
 "created_at": "Fri Apr 05 15:03:31 UTC 2013",
 "updated_at": "Fri Apr 05 15:03:34 UTC 2013",
 "overview": "\u003Cp\u003EKite Laser Technology Co Ltd came into inception in the year 2002 at Guangdong, China. From the time it came into formation, we have devoted all our energies in  manufacturing, supplying and exporting of Laser Marking Machines, Laser Cutting Machines, Laser Welding Machines, Laser Coding Machines \u0026amp; Laser Wire Stripping Machines.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nA decade long presence in the market with amazing range of products has been possible owing to our state of-the-art infrastructure. Our infrastructure is evenly sectioned into separate departments to ensure all our business operations get conducted in an organized professional manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe have been successful in gaining a good foothold of the market, owing to our quality in our complete range. We strictly follow total management control in all our processes. Our complete products range is highly technical, so are our procedures to manufacture them.\u003C/p\u003E\n\n\u003Cp\u003EOur Major Markets:\nOur flawless quality and customer friendly products have helped to create a great demand of our manufactured products. Our products are equally liked in domestic and international market for their unmatchable features with assured quality. We have clients from all over the world and we are proud to be a renowned exporter of world class products in the market.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are amongst the most appreciated companies in the market for our quality products. We do every possible thing from our end to ensure satisfaction of clients. All our products are pre tested for reliability, excellent operational performance, low maintenance and great operational life. We are competent to handle bulk orders of clients in the most efficient manner.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8806/248806v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8806/248806v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8806/248806v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}