{"name": "KJWW Engineering Consultants",
 "permalink": "kjww-engineering-consultants",
 "crunchbase_url": "http://www.crunchbase.com/company/kjww-engineering-consultants",
 "homepage_url": "http://www.kjww.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "kjww",
 "category_code": "consulting",
 "number_of_employees": 450,
 "founded_year": 1961,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "engineering",
 "alias_list": null,
 "email_address": "",
 "phone_number": "309.788.0673",
 "description": "Engineering Consulting",
 "created_at": "Fri Apr 12 17:06:24 UTC 2013",
 "updated_at": "Fri Apr 12 17:06:29 UTC 2013",
 "overview": "\u003Cp\u003EIntegration is at our forefront\u003C/p\u003E\n\n\u003Cp\u003EKJWW Engineering is a national leader in consulting engineering services for building and infrastructure systems and a leader in the healthcare market.  Named 2011 Midwest Designer of the Year, KJWW provides clients with a distinctive approach to integrated engineering services.  \u003C/p\u003E\n\n\u003Cp\u003EOur unique combination of mechanical, electrical, structural, technology, acoustics, architectural lighting, commissioning, and medical equipment planning services provides the highest level of integration among these interdependent systems.  The breadth of these services is unmatched in the industry.\nComplementing our core practice, we offer facility assessments, infrastructure master plans, feasibility and life cycle studies, construction administration and systems commissioning.  \u003C/p\u003E\n\n\u003Cp\u003EKJWW Engineering is also recognized as one of the foremost experts in geothermal technology and has designed the two largest lake-coupled geothermal systems in the U.S. for greenfield hospitals.  Our company commitment to, and integration of, sustainability and energy efficiency has earned KJWW international and national awards from ASHRAE and other industry associations.\u003C/p\u003E\n\n\u003Cp\u003ESince our founding in 1961, KJWW has grown to over 450 employees in 11 offices in the U.S. and abroad. U.S. locations include Cedar Rapids, Chicago, Des Moines, Indianapolis, Kansas City, Madison, Naperville, St. Louis, and the Quad Cities. International offices include: Ahmedabad, India, and Dubai, United Arab Emirates.\u003C/p\u003E\n\n\u003Cp\u003EAs an employee-owned firm, we understand that the greatest benefits for our clients are the technical skills and continuity of our staff.  We make an enormous investment each year in their education and training.  We believe our high employee retention rate, along with their technical skills, knowledge and passion, provide our clients with the continuity and foresight they desire.\u003C/p\u003E\n\n\u003Cp\u003EOur aim is to be the long-term Firm of Choice.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}