{"name": "KK International",
 "permalink": "kk-international",
 "crunchbase_url": "http://www.crunchbase.com/company/kk-international",
 "homepage_url": "http://www.indiamart.com/kkinternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "smokey-gemstone, fluorite-stone, coraline-stone, lapis-stone, onyx-stone, chrysocolla-stone",
 "alias_list": null,
 "email_address": "kkinternational@tradepassport.org",
 "phone_number": "9351532302",
 "description": "supplier and exporter of White Rainbow S",
 "created_at": "Thu Apr 04 14:24:57 UTC 2013",
 "updated_at": "Thu Apr 04 14:25:00 UTC 2013",
 "overview": "\u003Cp\u003EKK International has been successful in garnering enough reputation in past few years which speaks volumes about our performance and quality. We are a Sole Proprietorship firm located in Jaipur, Rajasthan, which came into existence in the year 1998. Since its inception we are processing, supplying and exporting White Rainbow Stone, Labradorite Stone, Amethyst Stone, Rose Quartz Stone, Crystal Stone, Smokey Gemstone, Fluorite Stone, Coraline Stone, Lapis Stone, Onyx Stone, Chrysocolla Stone, Black Rutile Stone, Agate Stone, Nephrite Jade stone, Tiger Eye Stone, Jasper Gemstone and Turquoise Stone.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a massive support of excellent infrastructural facilities which assist us in our complete business activities. The support of modern technology has immensely helped our artisans and technicians to give perfect shape and finish to the complete range. To facilitate our routine functioning in smooth manner we have segregated our entire facility into various divisions. In house testing facility of products helps us to deliver products with assured quality and in cost effective range.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOurs is a quality based business and we leave no stone unturned while pursuing the same. We procure all our products in raw form from various reputed vendors who are in business for last many years. Our trained quality members are always vigilant in ensuring quality relentlessly. It is their active support that we have never faced even a single major issue till date. We pursue quality with great dedication and it has also helped us in earning a great reputation and substantial profits in business.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a highly skilled team which takes care of the demands of customers in the most admirable manner. The knowledge they have developed over the years in understanding customer’s preference is remarkable. Their ability and attitude to educate customer about the product, helps massively as confidence building measure.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nSince its inception we are processing, supplying and exporting White Rainbow Stone, Labradorite Stone, Amethyst Stone, Rose Quartz Stone, Crystal Stone, Smokey Gemstone, Fluorite Stone, Coraline Stone, Lapis Stone, Onyx Stone, Chrysocolla Stone, Black Rutile Stone, Agate Stone, Nephrite Jade stone, Tiger Eye Stone, Jasper Gemstone and Turquoise Stone.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       78],
      "assets/images/resized/0024/7966/247966v2-max-150x150.jpg"],
     [[250,
       131],
      "assets/images/resized/0024/7966/247966v2-max-250x250.jpg"],
     [[450,
       236],
      "assets/images/resized/0024/7966/247966v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}