{"name": "KnoFolio",
 "permalink": "knofolio",
 "crunchbase_url": "http://www.crunchbase.com/company/knofolio",
 "homepage_url": "http://knofolio.net/",
 "blog_url": "http://www.andrewcoyle.com/blog/category/education/",
 "blog_feed_url": "",
 "twitter_username": "CoyleAndrew",
 "category_code": "education",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 20,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "art, design, college, aicad, art--design, college-recruiting, admissions, portfolio, education, online-courses, critique, lead-generation, art-school, art-college",
 "alias_list": null,
 "email_address": "info@knofolio.net",
 "phone_number": "763.913.0574",
 "description": "Art \u0026 Design Pre-College",
 "created_at": "Fri Jan 25 02:57:19 UTC 2013",
 "updated_at": "Sat Feb 09 20:44:35 UTC 2013",
 "overview": "\u003Cp\u003EKnoFolio is an art \u0026amp; design portfolio-building platform that offers online courses, critique, and connection to the top art colleges.\u003C/p\u003E\n\n\u003Cp\u003EDescription:\nKnoFolio empowers aspiring artists to create a digital portfolio and share it with prestigious art \u0026amp; design colleges across the United States. KnoFolio offers portfolio development courses, constructive critique, and connection to the top art colleges in North America.\u003C/p\u003E\n\n\u003Cp\u003ERationale:\nThere are no meaningful online art college preparatory platforms despite a stated need from admission counselors and students. There are many websites that help students fulfill admissions criteria for traditional colleges and universities. The platforms usually take the form of ACT/SAT E-learning. The ACT/SAT is the key differentiator in a student’s application for traditional colleges and universities, whereas the portfolio is the key differentiator in a student’s application for an art college.\u003C/p\u003E\n\n\u003Cp\u003EKnoFolio will fill the demand for online portfolio development. It will be in a digital environment to free the student from the constraints of time and space. Students will have the ability to create a portfolio that meets the standards of art colleges without being hindered by economic or geographic constraints.\u003C/p\u003E\n\n\u003Cp\u003EComponents:\nKnoFolio is broken into 4 components. These components reflect the essentials of a pre-college art program, and will provide the criteria to develop a meaningful body of work.\u003C/p\u003E\n\n\u003Cp\u003E•Portfolio\nUsers will have the ability to upload their work, categorize it, and get it in front of The KnoFolio Community.\u003C/p\u003E\n\n\u003Cp\u003E•Critique\nThe KnoFolio Community will provide meaningful critique on submitted work.\u003C/p\u003E\n\n\u003Cp\u003E•Development Courses\nUsers will be offered many portfolio development courses that will help students create meaningful work that reflects what art colleges desire.\u003C/p\u003E\n\n\u003Cp\u003E•Art College Match\nUsers will be able to browse accredited art \u0026amp; design colleges to find the best match for their artistic pursuits.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       28],
      "assets/images/resized/0023/1525/231525v2-max-150x150.png"],
     [[250,
       46],
      "assets/images/resized/0023/1525/231525v2-max-250x250.png"],
     [[300,
       56],
      "assets/images/resized/0023/1525/231525v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        106],
       "assets/images/resized/0023/1524/231524v2-max-150x150.jpg"],
      [[250,
        177],
       "assets/images/resized/0023/1524/231524v2-max-250x250.jpg"],
      [[450,
        320],
       "assets/images/resized/0023/1524/231524v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}