{"name": "Korecki Real Estate Services Inc.",
 "permalink": "korecki-real-estate-services-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/korecki-real-estate-services-inc",
 "homepage_url": "http://www.korecki.ca",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "property-management, vancouver-property-management, richmond-property-management, property-management-vancouver, property-management-richmond, richmond-strata-management, vancouver-strata-management",
 "alias_list": null,
 "email_address": "alex@korecki.ca",
 "phone_number": "604 233-7772",
 "description": "Property Management Services",
 "created_at": "Wed Nov 07 11:33:48 UTC 2012",
 "updated_at": "Thu Nov 08 21:57:28 UTC 2012",
 "overview": "\u003Cp\u003EWelcome to Korecki Real Estate Services. We provide professional, experienced Strata Management and Property Management services to clients throughout the Lower Mainland, including Greater Vancouver, Richmond and Burnaby.\u003C/p\u003E\n\n\u003Cp\u003EThanks to our years of experience, we are proud to offer a full range of Strata Management services, including meeting attendance, arranging building inspections and maintenance, owner and tenant registry, accounting services and much more. We also offer a wide range of Residential Property Management services, including furnished and unfurnished property management and lease-up, as well as rental building leasing, maintenance and accounting.\u003C/p\u003E\n\n\u003Cp\u003EAs part of our first-class service commitment, we do not charge any management fees until your property starts generating revenue. Our competitive rates, multi-unit discounts and no hidden fees promise give you access to affordable property management without compromising on quality.\u003C/p\u003E\n\n\u003Cp\u003EKorecki Real Estate Services is committed to meeting all of your Vancouver Property Management and Strata Management needs. Our dedication to unparalleled, no-hassle customer service and smooth, efficient building operations will help you to generate maximum profit from your valuable real estate investment.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/9203/219203v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0021/9203/219203v2-max-250x250.jpg"],
     [[280,
       280],
      "assets/images/resized/0021/9203/219203v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}