{"name": "KPMG India",
 "permalink": "kpmg-india",
 "crunchbase_url": "http://www.crunchbase.com/company/kpmg-india",
 "homepage_url": "http://www.kpmg.com/IN/en/WhatWeDo/Advisory/Performance-Technology/ITAS/Pages/SPI_ITIL.aspx",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "itil-training",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "ITIL Training",
 "created_at": "Tue Oct 09 10:33:41 UTC 2012",
 "updated_at": "Thu Oct 18 00:08:05 UTC 2012",
 "overview": "\u003Cp\u003EKPMG in India offers customized advisory and certification assistance services to organizations that are willing to pursue an ITIL based process improvement journey.\nAs part of the advisory services KPMG in India offers a variety of ITIL® based approaches that include:\nFacilitating organizations to adopt ITIL within their current working environment and for the purpose of obtaining key process improvement benefits. This service involves identification and implementation of an integrated process approach using combinations of ITIL and ISO 9001, ITIL and CMMI®, ITIL and Six Sigma and others that would support the organization achieve holistic benefits while rendering a more effective and efficient service management process\nFacilitation of ITIL implementation leading to ISO 20000 certification – KPMG in India follows a defined facilitation methodology, that is customized to meet organizational needs and to understand current organizational process strengths and weaknesses. Based on this process understanding, a Service Improvement Program (SIP) is constituted within the organization and supported by KPMG in India to enable fulfillment of the objectives. KPMG in India further coordinates with Registered Certification Bodies (RCB) to accomplish the certification process\nProcess improvement in areas deemed critical by the organization based on ITIL methodology. These critical areas are aligned with the business objectives of the organization.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}