{"name": "KR EngineeringWorks",
 "permalink": "kr-engineeringworks",
 "crunchbase_url": "http://www.crunchbase.com/company/kr-engineeringworks",
 "homepage_url": "http://www.indiamart.com/krengineeringworks-mumbai/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "krengineeringworks-mumbai@tradepassport.org",
 "phone_number": "9930722959",
 "description": "manufacturing, supplying and exporting",
 "created_at": "Fri Apr 05 14:19:17 UTC 2013",
 "updated_at": "Fri Apr 05 14:19:22 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1988, we, K. R. Engineering Works, have consolidated a descent space for ourselves in the market are widely recognized as one of the reputed manufacturers, suppliers and exporters of a wide range of Food Processing Machines and Snacks Making Machines. In this range we have a wide variety to offer that can be availed from us in the most comprehensive range. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWorking in close coordination in order to offer complete satisfaction to the clients, our offered range of these food processing and snacks making machines has been developed stringently by our workforces. In our teams, we have segregated units that manage various departments for a structurally coordinated and well managed cooperation.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nFor developing such a huge consignment, we needed to have a segregated and sophisticated infrastructure that has helped us cater to the variegated needs of our customers. Therefore, we have developed a huge and sprawling infrastructure in the suburbs of Mumbai. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nIn order to cater to the variegated needs of our customers, we are offering to them these high quality and latest kinds of food processing and snacks making machines. Our fabricators have ensured that all the products being dispatched from our side are of the highest quality and thus are in their best state while they reach the customer. For the assurance of complete quality .\u003C/p\u003E\n\n\u003Cp\u003EOur Strengths:\nHigh Quality Products: When it comes to serving our customers, we never compromise on quality. Our manufacturing processes are well streamlined, scrutinized and our products pass through rigorous quality control tests. Stringent quality standards are employed at every stage of manufacturing.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nBeing a client centric organization, we are offering a wide range of Food Processing Machines to our clients at industry leading prices. Our range is designed under the guidance of our experts and meet international standards. We also offer our range in different specifications and widely used in food processing industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0024/8759/248759v2-max-150x150.jpg"],
     [[250,
       65],
      "assets/images/resized/0024/8759/248759v2-max-250x250.jpg"],
     [[450,
       118],
      "assets/images/resized/0024/8759/248759v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}