{"name": "Krishna Enterprise",
 "permalink": "krishna-enterprise",
 "crunchbase_url": "http://www.crunchbase.com/company/krishna-enterprise",
 "homepage_url": "http://www.indiamart.com/krishnaenterprise-rajkot/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "kitchen-sink, brass-builder-hardware-and-designer-mortise-handle--in-this-range, we-offer-wall-tiles-150-x-150-mm",
 "alias_list": null,
 "email_address": "krishnaenterprise-rajkot@tradepassport.org",
 "phone_number": "9909733733",
 "description": "Exporter and supplier an array ,",
 "created_at": "Fri Apr 05 12:13:03 UTC 2013",
 "updated_at": "Fri May 31 13:36:47 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1998, we, “Krishna Enterprise”, are a trustworthy organization completely involved in the business of importing, exporting and supplying a quality-approved range of Ceramic Wall Glazed Tile, Floor Tile, Ceramic Sanitary Ware, Laminated Sheet, Mortise Handle, Mortise Lock, Door Closer, Kitchen Sink, Brass Builder Hardware and Designer Mortise Handle. In this range, we offer Wall Tiles 150 X 150 mm, Wall Tiles 200 X 300 mm, Wall Tiles 300 X 450 mm, Wall Tiles 300 X 600 mm, Floor Tiles 300 X 300 mm, Floor Tiles 400 X 400 mm and Floor Tiles 605 X 605 mm. Apart from this, we also offer Water Closet, Wash Basin, Urinal, Suite, Hinge, Aldrop and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have appointed and supported by a team of expert, hardworking and qualified professionals, who have years of experience and in-depth knowledge in their respective domains. Their expertise and rich experience enable us to bring quality assortment of these products within the specified period of time. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOur company procure the range of Ceramic Wall Glazed Tile, Floor Tile, Ceramic Sanitary Ware, Laminated Sheet, Mortise Handle and other from a reliable network of vendors from all across the country. These vendors are selected by our management after checking their track record in the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWith the aim to provide the best-in-class Ceramic Wall Glazed Tile, Floor Tile, Ceramic Sanitary Ware, Laminated Sheet, Mortise Handle and other to our customers, quality has been the most important part of our customer driven approach, thus we strongly emphasize on maintaining the standards of our range of products. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur company is supported by an advanced infrastructural set-up, spread over an extensive geographical area. The whole infrastructure is well-segregated into different other units, so as to carry out our all operations in an appropriate manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nCeramic Wall Glazed Tile, Floor Tile, Ceramic Sanitary Ware, Laminated Sheet, Mortise Handle, Mortise Lock, Door Closer, Kitchen Sink, Brass Builder Hardware and Designer Mortise Handle. In this range, we offer Wall Tiles 150 X 150 mm, Wall Tiles 200 X 300 mm, Wall Tiles 300 X 450 mm, Wall Tiles 300 X 600 mm, Floor Tiles 300 X 300 mm, Floor Tiles 400 X 400 mm and Floor Tiles 605 X 605 mm. Apart from this, we also offer Water Closet, Wash Basin, Urinal, Suite, Hinge, Aldrop and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0024/8631/248631v3-max-150x150.png"],
     [[250,
       66],
      "assets/images/resized/0024/8631/248631v3-max-250x250.png"],
     [[288,
       77],
      "assets/images/resized/0024/8631/248631v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "108, Golden Space, Sardar Nagar Main Road",
    "address2": "",
    "zip_code": "360002",
    "city": "Rajkot ",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        68],
       "assets/images/resized/0026/9733/269733v1-max-150x150.png"],
      [[250,
        114],
       "assets/images/resized/0026/9733/269733v1-max-250x250.png"],
      [[450,
        206],
       "assets/images/resized/0026/9733/269733v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}