{"name": "Krishna Collection",
 "permalink": "krishna-collection",
 "crunchbase_url": "http://www.crunchbase.com/company/krishna-collection",
 "homepage_url": "http://www.indiamart.com/krishnacollection-jaipur/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ladies-anarkali-kurtis, jaipuri-ladies-kurtis, ladies-embroidery-kurtis-and-many-more-",
 "alias_list": null,
 "email_address": "krishnacollection-jaipur@tradepassport.org",
 "phone_number": "9983055531",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Fri Apr 05 12:44:39 UTC 2013",
 "updated_at": "Fri Apr 05 12:44:42 UTC 2013",
 "overview": "\u003Cp\u003EAfter gaining an experience of 20 to 25 years in the field of Ladies Apparel. We began our operations as a proprietorship unit in the year 2011. Since then, Krishna Collection has have grown in stature and accomplished many a milestones. Today we are counted amongst the leading manufacturer and supplier of Ladies Anarkali Kurtis, Jaipuri Ladies Kurtis, Ladies Embroidery Kurtis and many more. The product range has been of highest quality and reaped lot of appreciation and accolades for us. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have well planned and sound infrastructure at our disposal, this helps us to work with maximum motivation. Thereby producing products meeting prescribed standards and generating delight for the customers. Machines with latest technological bent are installed in our premises and all the more they are handles by competent professionals, this helps us to come with high quality products.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur professionals work with a very dedicated approach to achieve production excellence. The market experience and industrial knowledge of these professionals has enabled us to target the consumers in right manner and to earn maximum profit. They keep close vigil on even the minor changes taking place in industry and ensure that their plans are further planned accordingly.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe have always excelled in quality parameters and have set a benchmark in the industry as per our quality standards. To further educate our people we constantly engage them on certain platforms where in they interact with industry stalwarts and sharpen their base. This not only helps them to work with finesse, at the same time create a healthy image in the mind of clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n Ladies Anarkali Kurtis, Jaipuri Ladies Kurtis, Ladies Embroidery Kurtis and many more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8665/248665v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8665/248665v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8665/248665v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}