{"name": "Krish Engineering",
 "permalink": "krish-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/krish-engineering",
 "homepage_url": "http://www.indiamart.com/krishengineeringandenterprise/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fabrication-and-reconditioning-service--we-render-structure-fabrication-service, induction-furnace-reconditioning-service, m-s---s-s--fabrication-service-and-induction-coil-reconditioning-service-",
 "alias_list": null,
 "email_address": "krishengineeringandenterprise@tradepassport.org",
 "phone_number": "9426580877",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Fri Apr 05 12:26:34 UTC 2013",
 "updated_at": "Fri Apr 05 12:26:37 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Krish Engineering and Enterprise” are widely recognized an one of the reputed manufacturers and suppliers of premium quality array of Reactor, Pressure Vessel, Storage Tank, Belt Conveyor, Hydraulic Power Press Machine and other. Under the offered range, we provide S.S. Reactor, M.S. Reactor, S.S. Pressure Vessel, M.S. Pressure Vessel and Belt Conveyor. In addition to this, we offer S.S. Storage Tank, M.S. Storage Tank, Hydraulic Power Press Machine and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nBacked by a team of experienced and dedicated professionals, we are able to attain all our business aims within pre-set time frame. Our professionals are well-abreast of the universally laid quality standards which they keep in mind while manufacturing Reactor, Pressure Vessel, Storage Tank, Belt Conveyor, Hydraulic Power Press Machine and many more.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nIn order to carry out all our business activities without any hassle, we have developed a sound infrastructure at Ahmedabad, Gujarat (India). This infrastructure is spanning over a broad land mass and is fitted with all the amenities that required for the production process of Reactor, Pressure Vessel, Storage Tank, Belt Conveyor, Hydraulic Power Press Machine and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe put all our efforts in the direction of maintaining the peerless standards of offered Reactor, Pressure Vessel, Storage Tank, Belt Conveyor, Hydraulic Power Press Machine and many more. Manufacturing process of all these products is monitored by our quality controllers who ensure their synchronization with the universally laid quality standards. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBy our customer focused approaches, we have been able to attain the title of an accredited organization in the domain of manufacturing and supplying Reactor, Pressure Vessel, Storage Tank, Belt Conveyor, Hydraulic Power Press Machine and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8650/248650v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8650/248650v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8650/248650v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}