{"name": "Krishna Engineering",
 "permalink": "krishna-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/krishna-engineering",
 "homepage_url": "http://www.indiamart.com/krishnaengineering-gzb/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "krishnaengineering-gzb@tradepassport.org",
 "phone_number": "9717300072",
 "description": "manufacturer and supplier of Sugar Mill ",
 "created_at": "Fri Apr 05 15:50:02 UTC 2013",
 "updated_at": "Fri Apr 05 15:50:08 UTC 2013",
 "overview": "\u003Cp\u003EIncepted in the year 1980, at Ghaziabad (Uttar Pradesh, India), we, “Krishna Engineering \u0026amp; Co.”, are occupied in manufacturing and supplying a comprehensive assortment of Sugar Mill Machinery \u0026amp; Mill Spare Parts. The products are as: CI Parts, C.I \u0026amp; M.S Scraper Plate, C.S Pinions, Tail Bar, Sprocket, Gun Metal Liner, Industrial Gear, Industrial Helical Gear, C.S \u0026amp; C.I Coupling, Magma Pumps.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing quality centric firm, we keep the utmost attention in offering our valued clients a premium quality product assortment. As per our commitment, we make sure that these products are manufactured using superior grade raw material and latest techniques in accordance with the set industry standards. Moreover, we give utmost importance to the quality of the product right from the time of manufacturing till the final dispatch. The offered products are stringently tested on various parameters of quality in order to ensure their flawlessness. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWith a purpose to meet our common targets planned by the organization, we have capitalized our robust infrastructural facility. We have installed sophisticated machinery and the most up-to-date technology in order to meet the varied requirements of our esteemed customers.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have recruited a knowledgeable team of professionals that is a vital asset of our company. Our experienced and qualified professionals and adroit workforce enables us to earn the remarkable position in the respective domain. All the members of our proficient squad work in close coordination to accomplish the specified requirements of the industry.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur organization has gained recognition as the leading manufacturer and supplier of a wide gamut of Sugar Mill Machinery \u0026amp; Mill Spare Parts etc. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8857/248857v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8857/248857v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8857/248857v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}