{"name": "KW Media Group",
 "permalink": "kw-media-group",
 "crunchbase_url": "http://www.crunchbase.com/company/kw-media-group",
 "homepage_url": "http://www.macdesignonline.com/",
 "blog_url": "http://www.macdesignonline.com/",
 "blog_feed_url": "http://www.macdesignonline.com",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": 2000,
 "founded_month": 11,
 "founded_day": 24,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mac, adobe, tips, olympic-games-mac, games-mac-apps",
 "alias_list": null,
 "email_address": "webmaster@photoshopuser.com",
 "phone_number": "+1 813 433 5000",
 "description": "Mac Design Online",
 "created_at": "Tue Jul 24 06:35:04 UTC 2012",
 "updated_at": "Wed Jul 25 11:31:10 UTC 2012",
 "overview": "\u003Cp\u003EDesign And Advertising\n• Corporate identity\nA strong corporate identity is created through the proper use of visual elements, which define and represent what your organisation stands for. Words and images work together to transform a corporate paradigm into a\nmemorable visual, capable of creating a emotional connection with your target market.\nIntegrated into every aspect of your marketing communications, an identity starts with a logo and a positioning statement and grows into a array of other guidelines and standards that define the usage of any element connected with the name.\nStrong corporate identity, combined with a host of other corporate communication media attract more clients and customers, win their trust and increase brand awareness.\n• Content development\nCopywriting has a major impact on what people think of you and your company. Good content development is always a priority. Quality copywriting is rarely about volume and mostly about clarity. People need to understand your message and be moved by it to take action. It should compel and sell your product and / or service quickly and consistently. We make sure your content makes an emotional connection, opens the mind, bridges the gap and builds your brand.\u003C/p\u003E\n\n\u003Cp\u003E• Print advertising\nSuccessful print advertising creates an immediate emotional, call-to-action response as it builds equity in your brand. With the proper frequency and research, the prospective client or customer walks away with your core message and is likely to aggregate value to your brand. We create ads that are not only creatively brilliant but also effective in driving leads and sales for products and services.\n• Collateral material\nFrom office stationery, publications, marketing material, packaging, point-of-sale, promotional items to hospitality items. Collateral materials promote, educate sell and inspire.\nAll the printed material we create and produce, strategically brand your organization to prospective customers, clients and associates.\n• Media planning\nIdentifying the right media for communication is crucial. Understanding target audiences and their segmentation is key to building brand awareness, conversions, transactions and lead generation.\nOur results-driven approach to media planning helps you collect and understand your company’s demographical position and rapidly increase the awareness of your campaigns.\nWe consult with national media buyers to ensure your negotiated rates are the lowest in your industry.\n• Radio advertising\nWith the right focus, SMME’s may find that radio advertising can deliver more clients and customers quicker than they thought possible. Planning is essential when approaching radio advertising. The key is to have a clear understanding of the right market, so the message will be delivered to the right audience.\nMany business owners believe that radio advertising is beyond their advertising budget. What few know is that advertising on local stations can be surprisingly affordable. We will help you find the most cost-effective way to reach your audience and increase brand awareness.\n• Digital presentations\nWe create custom presentations utilizing a wide variety of techniques. By using the latest in 3D software, in \nconjunction with live action video, we can animate client logs and create characters for their brands.\nWe also create TV advertisements, demonstrations, training and informational videos for output to DVD, video-tape or internet. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}