{"name": "LA BREA CHRYSLER JEEP",
 "permalink": "la-brea-chrysler-jeep",
 "crunchbase_url": "http://www.crunchbase.com/company/la-brea-chrysler-jeep",
 "homepage_url": "http://WWW.LABREACHRYSLERJEEP.COM",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 65,
 "founded_year": 1992,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "la-brea-chrysler-jeep",
 "alias_list": null,
 "email_address": "INFO@LABREACHRYSLERJEEP.COM",
 "phone_number": "323-933-5500",
 "description": "AUTOMOTIVE DEALERSHIP",
 "created_at": "Thu Oct 07 21:42:33 UTC 2010",
 "updated_at": "Thu Oct 07 22:02:24 UTC 2010",
 "overview": "\u003Cp\u003EThe new and pre-owned inventories at La Brea Chrysler Jeep are fully stocked and awaiting your test drive. If our current inventory doesn\u0026#8217;t have the vehicle for which you\u0026#8217;re searching, you can fill out our CarFinder form so we can locate and attain your perfect match.\u003C/p\u003E\n\n\u003Cp\u003EAt La Brea Chrysler Jeep in Los Angeles, CA, we strive to put each and every of our customers in the seat of their perfect vehicle, and at an excellent price. This is done with the help of our committed sales staff, financing department and everyone else at our friendly dealership.\u003C/p\u003E\n\n\u003Cp\u003EDon\u0026#8217;t forget to explore the various available specials, parts and more that La Brea Chrysler Jeep is offering. If you want to know more, simply call us at (877) 269 - 5109 and someone will be sure to have an answer for you!\u003C/p\u003E\n\n\u003Cp\u003ELa Brea Chrysler Jeep has the Chrysler or Jeep you have been searching for at a price you can afford. With a friendly and helpful sales staff, highly skilled mechanics and multiple automotive certifications, La Brea Chrysler Jeep is your greater Los Angeles Chrysler and Jeep dealer serving Alhambra, Glendale and Santa Monica. Our mission is to make every customer a customer for life by consistently providing world class services. Superb customer care, competitive prices and a knowledgeable staff are a few of the things you will find at our new and used Chrysler and Jeep dealership. Visit us today and take a test drive in your dream Chrysler or Jeep or give us a call at (877) 269 - 5109. \u003C/p\u003E\n\n\u003Cp\u003EAt La Brea Chrysler Jeep we strive to maintain a complete inventory of new Chrysler and Jeep vehicles. Select from all of the latest Chrysler and Jeep models including the Chrysler Aspen and more. We are the Los Angeles area Chrysler and Jeep car dealership that will make the car buying experience as simple as possible. Take a test drive with one of our Chrysler and Jeep experts and see what makes these some of the best selling vehicles in America. We are a short drive from Alhambra, Glendale and Santa Monica. \u003C/p\u003E\n\n\u003Cp\u003ELa Brea Chrysler Jeep\u0026#8217;s used vehicles are carefully inspected by our technicians to guarantee quality for our Los Angeles customers. We are continually receiving vehicles for our used car inventory, so check back often. Visit our inventory page to browse through the Los Angeles used cars we currently have in stock. If you see something you like, give us a call at (877) 269 - 5109 or stop in and see us at 401 South La Brea Ave, Los Angeles, CA, 90036. \u003C/p\u003E\n\n\u003Cp\u003EFor a low interest rate car loan in Los Angeles, visit the experts at La Brea Chrysler Jeep. We\u0026#8217;ve helped people get the car loans that fit their budget so that they could drive away with a new or used car quickly. Regardless of your credit status we can help. No credit or bad credit? No problem. Come down to 401 South La Brea Ave, Los Angeles, CA, 90036 and speak to a financial professional. An affordable car loan or lease is within reach at La Brea Chrysler Jeep. \u003C/p\u003E\n\n\u003Cp\u003EYou can get original Chrysler and Jeep car parts, car accessories in Los Angeles and professional car repairs from the experts at La Brea Chrysler Jeep. If you\u0026#8217;re looking for vehicle maintenance, repairs or parts in the Los Angeles region, visit our dealership for the professional service you deserve. We\u0026#8217;re located at 401 South La Brea Ave, Los Angeles, CA, 90036, or you can call us at (877) 269 - 5109 if you have any questions. \u003C/p\u003E\n\n\u003Cp\u003ESee one of our new or used cars in person by visiting our Los Angeles dealership at 401 South La Brea Ave, Los Angeles, CA, 90036. Give us a call at (877) 269 - 5109 with any questions, and check out our about us page. We are looking forward to serving your automotive needs in the Alhambra, Glendale and Santa Monica region. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "401 S. LA BREA ",
    "address2": "",
    "zip_code": "90036",
    "city": "LOS ANGELES",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}