{"name": "Laguna Pearl",
 "permalink": "laguna-pearl",
 "crunchbase_url": "http://www.crunchbase.com/company/laguna-pearl",
 "homepage_url": "http://www.lagunapearl.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "lagunapearlcom",
 "category_code": "enterprise",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "pearls, pearl-necklaces, pearl-jewelry, pearl-earrings, pearl-rings, pearl-pendants",
 "alias_list": null,
 "email_address": "sales@lagunapearl.com",
 "phone_number": "888-897-3275",
 "description": "Laguna Pearl was created as a result of ",
 "created_at": "Wed Jan 02 11:45:26 UTC 2013",
 "updated_at": "Thu Jan 03 05:22:42 UTC 2013",
 "overview": "\u003Cp\u003ELaguna Pearl was created as a result of the public demand for high quality pearl jewelry at competitive pricing. With our roots as a wholesale pearl jewelry operation, our organization has strived to cut out the middle man and sell directly to the retail jewelry consumer. As oppose to selling pearl jewelry products to retail jewelers who mark the prices up 2 to 3 times their cost, we have built our online business by passing on the savings directly to the consumer. Our ability to customize any product on our website as well as be the leading source for custom orders of pearl jewelry on the internet is a testament to our vast platform and history of expertise. From our inception, Laguna Pearl has continually thrived on providing high quality pearl jewelry products with the best customer service on the internet. With locations in both Beverly Hills and the Los Angeles jewelry district, we have dealt heavily with surpassing the expectations of our clientele. Customer satisfaction is of utmost importance and we hope that every customer returns to Laguna Pearl for all their pearl needs.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}