{"name": "LAN Logics",
 "permalink": "lan-logics",
 "crunchbase_url": "http://www.crunchbase.com/company/lan-logics",
 "homepage_url": "http://www.lanlogics.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 1998,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "services, tailored, technology-service, provider",
 "alias_list": null,
 "email_address": "info@LanLogics.com",
 "phone_number": "(561) 908-0496",
 "description": "technology service provider",
 "created_at": "Tue Sep 04 09:00:05 UTC 2012",
 "updated_at": "Sat Sep 08 02:33:04 UTC 2012",
 "overview": "\u003Cp\u003EThis nationwide technology service provider has been established and servicing its clients since the beginning of 1998.  Based in Lake Worth in Florida, LAN Logics is a leading provider of multi-vendor IT services, and they have the ability to provide their clients with a fixed response time 24 hours a day, 7 days a week.  \u003C/p\u003E\n\n\u003Cp\u003ELAN Logics services focus on their agreements that are tailored to each client\u0026#8217;s needs for warranty and non-warranty equipment such as maintenance and repair of hardware, software troubleshooting, desktop support, and upgrade of printers, PC\u0026#8217;s, laptops and servers.  \u003C/p\u003E\n\n\u003Cp\u003ETheir range of clients comprise of large business enterprises some of which are even  included in the Fortune 500 leading companies in various fields such as shipping, retail, transportation and financial services.  LAN Logics also offers their services to small businesses and individuals and services rendered by LAN Logics are currently being offered across the USA and in Mexico City and in several cities in Canada.   \u003C/p\u003E\n\n\u003Cp\u003EClients are also invited to have an online account whereby they will have the opportunity to log-in online to LAN Logics website and work orders can be opened and closed, retainer amounts can be increased and reports can be stored.  The search service history can easily be utilized by assigning a serial number and client ticket number to each client.  \u003C/p\u003E\n\n\u003Cp\u003ELAN Logics offer their clients a time efficient and cost proficient outsourcing service at a third of the cost of what a company would pay by employing someone with a high salary just to stand around and wait for something to happen.\u003C/p\u003E\n\n\u003Cp\u003ELAN Logics offers an option of a retainer program called LAN Time.  This program offers clients a system whereby they are either charged a single rate for an advanced technical service or a single rate for basic labor. There are no hidden charges made to the client at the time of billing such as for the duration of the travel involved or any other obscured expenses.   \u003C/p\u003E\n\n\u003Cp\u003EWhen a new client invests in new technology they are extremely challenged by installing it correctly and getting it set up in good working order which can take a lot of time and patience for the average person. LAN Logics offer an on-site installation service whereby they can carry out the installation and configuration of the equipment you have just purchased, quickly and efficiently.\u003Cbr/\u003E\nLAN Logics specialized team of technicians gives a guaranteed and speedy response to the primary and emergency technicalities of each client.  By managing vast technical resources via their highly developed web-based system, LAN Logics enable an outstanding delivery of services.  They take each client\u0026#8217;s individual request as first priority from the minute the call is made until the problem is solved which in turn frees up the client\u0026#8217;s time so that the core business of the client can be attended to.\u003Cbr/\u003E\nLAN Logics are a company that their employees enjoy working for whereby their technicians can dream, innovate and work alongside other intelligent and motivated people.  LAN Logics also give their new recruits the guarantee that the work/life balance can indeed be achieved.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[88,
       87],
      "assets/images/resized/0020/9561/209561v2-max-150x150.jpg"],
     [[88,
       87],
      "assets/images/resized/0020/9561/209561v2-max-250x250.jpg"],
     [[88,
       87],
      "assets/images/resized/0020/9561/209561v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "8401 Lake Worth Road",
    "address2": "",
    "zip_code": "33467",
    "city": "Lake Worth",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.lanlogics.org/",
    "title": "LAN Logics - Wiki Page"},
   {"external_url": "http://www.visualcv.com/lanlogics",
    "title": "LAN Logics - VisualCV Profile"}]}