{"name": "Landmark Property Services",
 "permalink": "landmark-property-services",
 "crunchbase_url": "http://www.crunchbase.com/company/landmark-property-services",
 "homepage_url": "http://landmark-property.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 190,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "real-estate, property-management, property-manager, residential, multifamily, multi-family, single-family, apartments, rent, lease, management, marketing, rentals, software, accounting",
 "alias_list": null,
 "email_address": "lcurley@landmark-property.com",
 "phone_number": "804-673-0900",
 "description": "Property Management Company",
 "created_at": "Mon Nov 29 20:34:30 UTC 2010",
 "updated_at": "Tue Nov 30 22:43:19 UTC 2010",
 "overview": "\u003Cp\u003EWelcome to Landmark Property Services, Incorporated. Landmark is a company devoted exclusively to property management. Our clear focus, knowledge and commitment make us a superior choice for your property management needs. We believe in personal contact between owners and principals. We employ innovative marketing techniques, reliable accounting practices and quality customer service to make your property successful. \u003C/p\u003E\n\n\u003Cp\u003ETogether, the principals at the helm of Landmark have more then 45 years of experience in all aspects of property management - from accounting and technology to laws and regulations, to the hands-on mangement of residential multifamily, single family as well as commerical, retail and industrial properties. Landmark manages more than 6,000 apartments and 375 single family homes across Virginia and North Carolina. Properties include conventional, tax-credit, 501c(3) bond financing and Section 8 (voucher and project based). We utilize cutting edge technology including Jenark Property Management Software, Property Solutions, remote check scanning and online leasing. Landmark prepares monthly financial packages that include P\u0026amp;L statements, delinquency reports, rent rolls, copies of invoices, balance sheets and payables. Landmark has full insurance coverage including liability and errors and omissions coverage. \u003C/p\u003E\n\n\u003Cp\u003ELandmark has licensed real estate brokers in the states of Virginia and North Carolina and has managed properties and/or property accounting in Florida and Arizona. \u003C/p\u003E\n\n\u003Cp\u003EIf you are looking for a property management company that will focus exclusively on managing your property, please contact us at 804.673.0900. For more information, please also visit our brand new company website at www.landmark-property.com. \nEHO \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[108,
       81],
      "assets/images/resized/0011/2182/112182v2-max-150x150.jpg"],
     [[108,
       81],
      "assets/images/resized/0011/2182/112182v2-max-250x250.jpg"],
     [[108,
       81],
      "assets/images/resized/0011/2182/112182v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Office",
    "address1": "4901Dickens Rd. #119",
    "address2": "",
    "zip_code": "23220",
    "city": "Richmond",
    "state_code": "VA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}