{"name": "Law Offices of Sylvia S. Costantino, Esq., LLC",
 "permalink": "law-offices-of-sylvia-s-costantino-esq-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/law-offices-of-sylvia-s-costantino-esq-llc",
 "homepage_url": "http://njfamilylawdivorce.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "divorce-lawyer-new-jersey, nj-divorce-lawyer, nj-family-law, divorce-attorney-nj, new-jersey-family-law-attorney",
 "alias_list": null,
 "email_address": "ssc@njfamilylawdivorce.com",
 "phone_number": "732-615-9100",
 "description": "Sylvia S. Costantino, Esq. is a New Jers",
 "created_at": "Tue Oct 30 05:22:28 UTC 2012",
 "updated_at": "Thu Nov 01 21:11:12 UTC 2012",
 "overview": "\u003Cp\u003ESylvia S. Costantino, Esq. is a New Jersey Attorney who offers personalized and assertive legal representation in all areas of family law from divorce, child custody, alimony, child support, property distribution, domestic violence restraining orders and grandparent visitation rights.  Ms. Costantino will thoroughly answer your questions and explain the legal process to you so that you are a well-informed client. The apprehension and fear that most people experience when going through a divorce is completely normal and Sylvia Costantino, Esq. will help demystify the process for you.  It takes an experienced and strong family lawyer who is well versed in the nuances that are unique to family law to aid you in making the right decisions.  Sylvia Costantino, Esq. knows that a divorce is a heart-wrenching experience especially when children are involved.  Every decision you make now can affect the rest of your life, sometimes permanently.  That is why it is crucial that you have an attorney who is really on your side and motivated to fight for you. Sylvia S. Costantino, Esq. takes every client seriously and respects their needs and the right to be an involved client.  If you are ready to take the next step and move forward, call the Law Offices of Sylvia S. Costantino, Esq., LLC for a free initial consultation.  Serving clients in Monmouth, Ocean, Middlesex counties, and surrounding areas in New Jersey.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       35],
      "assets/images/resized/0021/7849/217849v2-max-150x150.png"],
     [[250,
       59],
      "assets/images/resized/0021/7849/217849v2-max-250x250.png"],
     [[420,
       100],
      "assets/images/resized/0021/7849/217849v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}