{"name": "LawCrossing",
 "permalink": "lawcrossing",
 "crunchbase_url": "http://www.crunchbase.com/company/lawcrossing",
 "homepage_url": "http://www.lawcrossing.com",
 "blog_url": "http://www.jdjournal.com",
 "blog_feed_url": "",
 "twitter_username": "Law_Crossing",
 "category_code": "web",
 "number_of_employees": 100,
 "founded_year": 2003,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "legal-jobs, legal-careers, attorney-jobs, paralegal-jobs, legal-secretary-jobs, law-student-jobs, summer-associate-jobs, summer-internship-jobs, law-student-clerkship-jobs, postgraduate-clerkship-jobs, partner-jobs, harrison-barnes, a-harrison-barnes",
 "alias_list": null,
 "email_address": "seo@lawcrossing.com",
 "phone_number": "626-243-1801",
 "description": "Legal Jobs Careers Employment",
 "created_at": "Mon Dec 22 07:49:08 UTC 2008",
 "updated_at": "Sat Jun 25 14:09:03 UTC 2011",
 "overview": "\u003Cp\u003ELawCrossing, the only legal job-opening research institution in the world whose mission is to track down every legal job through research.\u003C/p\u003E\n\n\u003Cp\u003ELawCrossing, the first of the career websites launched by A. Harrison Barnes is a maverick job board for legal professionals and the best source for legal jobs in the US.  It is a part of EmploymentCrossing which is the leading global online careers and recruitment resource consisting of more than 100+ job boards related to every industry and profession.\u003C/p\u003E\n\n\u003Cp\u003EA. Harrison Barnes, the Founder and CEO of LawCrossing, started his career as an attorney himself.  In his working days as an attorney itself, Harrison sensed an urgent need for comprehensive information about national and international legal job openings in the US.  This led to the advent of LawCrossing which was launched in July 2003.  With more than 140,000 legal jobs online and growing, this site is the world\u0026#8217;s most comprehensive legal job board.\u003C/p\u003E\n\n\u003Cp\u003ELawCrossing closely monitors and analyzes the recruiting and hiring needs of more than 250,000 legal employers.  These employers belong to virtually every law firm, corporation, government office, and public interest organization in the United States and LawCrossing helps them in getting the right job candidates.  A unique feature of the working of LawCrossing is that the company does not charge employers to post their jobs.  Instead, LawCrossing contacts and investigate thousands of employers each and every day to learn of new positions.\u003C/p\u003E\n\n\u003Cp\u003EThousands of law students, associates, attorneys, and legal staff browse for jobs and become aware of the latest happenings through law-related career news and articles on the site.  Many LawCrossing subscribers say that they benefit immensely from the constantly updated new legal jobs and news and articles of the legal market.  LawCrossing even tells their members about jobs which are posted only on employer websites, those which are publicly disseminated or not.\u003C/p\u003E\n\n\u003Cp\u003EA significant percentage of American attorneys and law students subscribe to LawCrossing.  In 2007, Inc. magazine voted LawCrossing as the 72nd fastest growing company in the US, much owing to the clear vision, sharp foresight, and extensive legal experience of Harrison Barnes.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       14],
      "assets/images/resized/0003/2228/32228v2-max-150x150.png"],
     [[250,
       24],
      "assets/images/resized/0003/2228/32228v2-max-250x250.png"],
     [[450,
       43],
      "assets/images/resized/0003/2228/32228v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "Legal Jobs",
    "permalink": "legal-jobs",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Harrison",
      "last_name": "Barnes",
      "permalink": "harrison-barnes",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "175 South Lake Avenue",
    "address2": "Suite 200",
    "zip_code": "91101",
    "city": "Pasadena",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 34.1428388,
    "longitude": -118.1323783}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        148],
       "assets/images/resized/0004/6135/46135v2-max-150x150.png"],
      [[250,
        248],
       "assets/images/resized/0004/6135/46135v2-max-250x250.png"],
      [[450,
        446],
       "assets/images/resized/0004/6135/46135v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        148],
       "assets/images/resized/0004/6136/46136v2-max-150x150.png"],
      [[250,
        248],
       "assets/images/resized/0004/6136/46136v2-max-250x250.png"],
      [[450,
        446],
       "assets/images/resized/0004/6136/46136v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.inc.com/inc5000/2007/company-profile.html?id=200700720",
    "title": "LawCrossing -- Human Resources, inc5000 Article - Inc. Article"},
   {"external_url": "http://www.aharrisonbarnes.com/",
    "title": "Harrison Barnes - Job Market, Goal Setting, Finding a Job, How to Succeed"}]}