{"name": "Layoff Support Network",
 "permalink": "layoff-support-network",
 "crunchbase_url": "http://www.crunchbase.com/company/layoff-support-network",
 "homepage_url": "http://layoffsupportnetwork.com/",
 "blog_url": "http://layoffsupportnetwork.com/lsn/blogs/",
 "blog_feed_url": "http://layoffsupportnetwork.com/lsn/orca/?action=rss_all#4",
 "twitter_username": null,
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 2009,
 "founded_month": 2,
 "founded_day": 24,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "layoff, support, stress, help",
 "alias_list": null,
 "email_address": "layoffsupportnetwork@gmail.com",
 "phone_number": "",
 "description": "Social Network for the Laidoff",
 "created_at": "Tue Mar 17 15:36:36 UTC 2009",
 "updated_at": "Sat Mar 21 14:04:51 UTC 2009",
 "overview": "\u003Cp\u003EThe Layoff Support Network was created as a way to help people who have lost their jobs due to either the down-turn of the economy or the greediness of big business. With record numbers of people being laid off, the skills required to survive unexpected unemployment have changed. The job market is flooded with highly qualified people and the competition for newly opening jobs is greater than ever. Couple this with the fact that many companies are continuously eliminating positions, the prospect of rapidly finding a new job is unlikely.\u003C/p\u003E\n\n\u003Cp\u003EThis website was created as a way to unite displaced workers. By combining the accumulated knowledge of many people that have survived, or are currently surviving without a job, the Layoff Support Network is becoming an invaluable resource.\u003C/p\u003E\n\n\u003Cp\u003EWhere this website differs from any other on the web is that its founders are real experts in surviving unexpected unemployment. The Layoff Support Network team is made up of people that have expertise in several different areas related to living after a layoff. The advice and support given by members of the LSN as well as the LSN team are being done so on a volunteer basis. Guest columnists have not been compensated (though guest columnists are allowed to put in a plug for their own businesses at the end of their articles). All submitted articles are screened for their relevancy in value to this site. You will not see any articles that are really advertisements in disguise.\u003C/p\u003E\n\n\u003Cp\u003EThe goals of The Layoff Support Network are simple. We hope that as you experience issues, problems and emotions caused by unexpected unemployment you will come to this website and seek the advice and comfort of people that are feeling the same way. Remember, you are not in this alone. There are hundreds of thousands of other people experiencing similar things.\u003C/p\u003E\n\n\u003Cp\u003EAnother goal of the LSN is to help you find a new job. Over the upcoming weeks we will be posting articles written by employment professionals to help you with your job search.\u003C/p\u003E\n\n\u003Cp\u003EPlease come back to the Layoff Support Network whenever you need help, advice or are feeling alone.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[73,
       73],
      "assets/images/resized/0003/8376/38376v2-max-150x150.png"],
     [[73,
       73],
      "assets/images/resized/0003/8376/38376v2-max-250x250.png"],
     [[73,
       73],
      "assets/images/resized/0003/8376/38376v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}