{"name": "LeadMaster",
 "permalink": "leadmaster",
 "crunchbase_url": "http://www.crunchbase.com/company/leadmaster",
 "homepage_url": "http://www.clientcurve.com",
 "blog_url": "http://clientcurveinfo.blogspot.in/",
 "blog_feed_url": "http://clientcurveinfo.blogspot.in/",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 40,
 "founded_year": 1988,
 "founded_month": 3,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "lead-tracking, lead-management, online-crm, closed-loop-marketing, virtual-call-center, mortgage-lead-management, sales-crm, sfa, sales-force-automation, pipeline-management, customer-relationship-management",
 "alias_list": null,
 "email_address": "rakesh@clientcurve.com",
 "phone_number": "9140 66 58 6969 \t",
 "description": "Lead Management, Lead Tracking \u0026 CRM",
 "created_at": "Mon Jun 13 23:58:58 UTC 2011",
 "updated_at": "Mon Apr 15 10:52:09 UTC 2013",
 "overview": "\u003Cp\u003ELeadMaster is a low cost, cloud-based lead management, lead tracking and sales CRM solution.  The company\u0026#8217;s hosted online application helps to close the loop between marketing and sales by tracking leads in real time throughout the sales cycle, from demand generation to lead closure. Combining sales force automation, marketing automation and virtual call center capabilities, this powerful web-based CRM application helps companies pinpoint where leads are quickly converting into revenue in order to increase close ratios and maximize return on investment on marketing campaigns.\u003C/p\u003E\n\n\u003Cp\u003ELeadMaster Solution Overview\nLeadMaster provides web-based lead and campaign management as well as powerful tools for data mining, sales forecasting and ROI measurement.\u003C/p\u003E\n\n\u003Cp\u003EUsers can pass sales leads and other key marketing information via the web in real time to all members of the sales and marketing team, including predefined channel partners, sales representatives and field sales management. Working with LeadMaster through our SaaS (Software as a Service) model, you can have your sales and marketing team up and running with a web-based solution tomorrow.\u003C/p\u003E\n\n\u003Cp\u003ELeadMaster Capabilities\nLead Management - Lead Capture - Lead Qualification - Lead Scoring - Lead Distribution - Lead Tracking - Lead Nurturing - Lead Aging \u003C/p\u003E\n\n\u003Cp\u003EDistribute, track and reassign leads in real time via the web \nManage multiple marketing campaigns \nDevelop custom fields and forms \nImport leads from web forms and web inquiries directly into your own LeadMaster database \nTailor access privileges to each individual user or user group \nDownload customized mailing lists \nCommunication\nEstablish a \u0026#8216;Private label\u0026#8217; website for your online marketing database \nUse the Event Tracker to publicize upcoming events \nSet e-mail notification for leads that are reassigned or require action \nShare key campaign updates on the secure online Information Center \nHost online event registration in cooperation with the LeadMaster Service Bureau \nStore comments and additional information within the specific lead record \nGather and analyze feedback on leads from field reps \nImport telemarketing scripts into searchable fields \nData mining\nPerform market research analysis on key customers and prospects \nAnalyze ROI from marketing campaigns \nBuild and maintain a complex data mart \nDownload highly targeted mailing lists \nProduce powerful call back, lead aging and forecast reports \nLeadMaster Benefits\nDesigned specifically with the needs of sales and marketing professionals in mind, LeadMaster delivers powerful benefits to everyone on the company team, from field reps to marketing managers to business partners.\u003C/p\u003E\n\n\u003Cp\u003EWeb-based lead management\nClose the loop between sales and marketing functions \nSimplify lead distribution with automatic reassignment and rules-based lead management \nExpand and nurture the sales pipeline \nEnhanced communication\nImprove communication between sales and marketing teams \nRefine marketing and sales decision support \nStrengthen relationships with key business partners \nIncrease customer satisfaction and loyalty \nData mining\nUncover unseen opportunities \nIncrease accountability throughout the sales process \nGenerate meaningful feedback on the effectiveness of marketing activities \nEmpower managers with advanced data mining and reporting capabilities \nTarget decision-makers for seminars and direct mail \nMeasure and maximize ROI \nLeadMaster Advantages\nPowerful simplicity\nEasy to use, intuitive browser-based interface \nNo IT involvement necessary \nRapid deployment \nData is safe and secure \nAmazing flexibility\nResponsive to your campaign needs, including custom forms and fields \nScalability allows you to add new users quickly and easily \nPersonalized access privileges deliver the right data to the right people \nDesigned for easy import of telemarketing scripts and leads captured online \nWorks in concert with other popular applications \nSaaS affordability\nNo software or hardware investment \nNo long-term contracts \nRequires no costly IT expenditures or consultants \nPer-user fee structure means you pay only for what you need \nEasy to use application requires only one hour of training for most people \u003C/p\u003E\n\n\u003Cp\u003Ewww.clientcurve.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "LeadMaster Headquarters",
    "address1": "885 Woodstock Road",
    "address2": "Suite 430-311",
    "zip_code": "30075",
    "city": "Roswell",
    "state_code": "GA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}