{"name": "Lead Light",
 "permalink": "lead-light",
 "crunchbase_url": "http://www.crunchbase.com/company/lead-light",
 "homepage_url": "http://www.indiamart.com/leadlight/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "leadlight@tradepassport.org",
 "phone_number": "9594240596",
 "description": "manufacturing and supplying",
 "created_at": "Thu Apr 04 15:56:17 UTC 2013",
 "updated_at": "Thu Apr 04 15:56:20 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2011, we, “Lead Light”, are engaged as a manufacturer and supplier of an extensive range of LED Lights that are reckoned in the market for compliance with international quality standards. In our product range, we offer Rigid Bar Waterproof LED Series, Flexiglow Waterproof LED Series, Rigid Bar Non Waterproof LED Series, Wall \u0026amp; Mirror Lights and Led High Bay Lights.\u003C/p\u003E\n\n\u003Cp\u003EBusiness Associates:\nIn the commercial culture of lead light, the most important leading company. We provide a workplace environment in which innovation is encouraged offering our employees the freedom to develop new lighting solutions. The experience of working in a highly creative atmosphere, each day coupled with the intuition, inspiration and enthusiasm of every individual ensures that our lighting ideas are always a step forward.\u003C/p\u003E\n\n\u003Cp\u003EResearch and Development:\nLEAD LIGHT stands for extensive expertise in Research and Development, we start our production level as chip level workshop and packaging - everything is under one roof.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nTo ascertain the optimum quality standards of the lighting solutions manufactured by us, we have developed a sophisticated quality assurance division. This facility is fully equipped with high end machinery for testing the entire range of lights.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur organisation is backed by a diligent team of professionals whose diligence and hard work have made us capable of carving a niche in the industry. These professionals are some of the best in the industry, and strive hard to provide an immaculate range of products to the valuable clients. After a rigorous assessment of skills, knowledge and experience, we have hired these professionals.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nThe highly advanced and state-of-the-art infrastructural set-up of our organisation makes us capable of timely delivering a premium quality range of Led lights to the clients. We are also equipped with a modern manufacturing unit, which is installed with high-end tools and machines, facilitating uninterrupted and large scale production.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8051/248051v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8051/248051v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8051/248051v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}