{"name": "Leader AutoGas",
 "permalink": "leader-autogas",
 "crunchbase_url": "http://www.crunchbase.com/company/leader-autogas",
 "homepage_url": "http://www.indiamart.com/leaderautogasindia/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "leaderautogasindia@tradepassport.org",
 "phone_number": "9323642634",
 "description": "manufacturer and supplier ",
 "created_at": "Thu Apr 04 14:38:45 UTC 2013",
 "updated_at": "Thu Apr 04 14:38:49 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in 1997, Leader Group of Companies has grown to become an end to end alternative and affordable fuel solution manufacturer as well as supplier for all kinds of domestic \u0026amp; Industrial usage. Leader Auto Gas India Private Limited, the Company pioneered in manufacturing of CNG/LPG Auto Conversion Kits in India for 4-wheeler, 3-wheeler and 2-wheeler.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision:\nOur environment is our responsibility. Keeping in line with this thought, Leader Group of Companies will continue to provide and promote environmentally friendly fuel and components which will enable us to reduce our dependence in traditional fossil fuels.\u003C/p\u003E\n\n\u003Cp\u003EOur Mission:\nWith an in-house capability to produce various non polluting devices for a wide range of applications, Leader Group has the mission of “Greener India” whereby we continue providing our clients with alternative / affordable fuel solutions at quality (world class) standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Achievements:\n    LEADER GROUP is very proud of our extensive list of achievements which demonstrate our commitment to achieving our vision of  \u0026#8220;GREENER EARTH”\n    Installation of CNG Kits in Diesel Town Buses in Mozambique, Africa in collaboration with the Transport Department of Mozambique\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nA highly skilled manpower is always considered to the power hose of any particular organization. So is with our organization as we have been supported by some highly professionals and experienced individuals, we have been able to create a reputation for our firm. Our professionals are completely well versed and devoted to their work phases.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nIn order to keep our manufacturing and supplying process go on in a consistent manner we have developed for ourselves a sophisticated infrastructure unit. This unit has been established at the out skirts of the Mumbai, Maharashtra. It has been spread over a wide area and has been segregated in to different units. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7985/247985v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7985/247985v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7985/247985v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}