{"name": "LearnComputer",
 "permalink": "learncomputer",
 "crunchbase_url": "http://www.crunchbase.com/company/learncomputer",
 "homepage_url": "http://www.learncomputer.com",
 "blog_url": "http://www.learncomputer.com/blog/",
 "blog_feed_url": "http://feeds.learncomputer.com/learncomputers",
 "twitter_username": "ittrainers",
 "category_code": "education",
 "number_of_employees": 5,
 "founded_year": 2008,
 "founded_month": 7,
 "founded_day": 20,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ittraining, hadooptraining, androidtraining, apachetraining, phptraining",
 "alias_list": null,
 "email_address": "admin@learncomputer.com",
 "phone_number": "888-396-2096",
 "description": "Instructor-led IT Training Courses",
 "created_at": "Mon Apr 22 06:27:43 UTC 2013",
 "updated_at": "Mon Apr 29 15:31:20 UTC 2013",
 "overview": "\u003Cp\u003ELearnComputer offers instructor-led IT/open source training solutions for individuals, small businesses, and corporations. Choose from beginner to advanced courses in Android, Hadoop, Big Data, Cloud Computing, PHP, MySQL, Databases, SQL, Linux, Java, Web Services, and Networking. We offer our classes both online as well as at our Redwood City training Facility located in San Francisco Bay Area. All our classes are can be customized to your specification and taught at your own site.\u003C/p\u003E\n\n\u003Cp\u003EUnlike many other companies, the staff at LearnComputer have a balanced blend of networking, software engineering, and web development backgrounds. We understand that technologies can change, and sometimes a hot skill one month is old news the next! Our goal is to help IT professionals gain the skills that define today’s Silicon Valley and make them both excellent problem-solvers as well as very competitive in the workplace. We provide an extensive range of computer and information technology training services in the areas of computer programming, web development, database design, and networking – with specific emphasis on mobile frameworks, such as Android, large data management (Hadoop), network technologies, Java programming and other open source frameworks and technologies such as PHP, MySQL, Drupal, HTML5, and Apache.\u003C/p\u003E\n\n\u003Cp\u003EOur classes aren\u0026#8217;t simply more of the same theory that you may have received in other courses. In fact, we\u0026#8217;ve tried hard to make sure that our courses are as practical as they can be! Too often, courses don’t focus on applying the technologies you\u0026#8217;ve learned, but we here at LearnComputer think that’s one of the most valuable skills you can have: as a result, every course relates to everyday problems that are daily encountered in today\u0026#8217;s enterprise. Whether it\u0026#8217;s MySQL sharding or scaling up Hadoop clusters, we\u0026#8217;ve put in a great deal of hard work and research to make sure that our courses will not only teach you the skills you need but show you how to use them to resolve applicable, real-world problems.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Home Office",
    "address1": "607 Wellington Drive",
    "address2": "",
    "zip_code": "94070",
    "city": "San Carlos",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.508154,
    "longitude": -122.282575}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}