{"name": "LeaseDedo.com",
 "permalink": "leasededo-com",
 "crunchbase_url": "http://www.crunchbase.com/company/leasededo-com",
 "homepage_url": "http://www.leasededo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "leasededo",
 "category_code": "advertising",
 "number_of_employees": 1,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 27,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "lease, leasing, property-lease, car-lease, commercial-space-lease, lease-offers, post-free-lease-offers, business-lease, outdoor-advertising, multi-level-marketing, adspace-lease, vehicle-lease",
 "alias_list": null,
 "email_address": "support@leasededo.com",
 "phone_number": "+919985181372",
 "description": "Website Specially for Lease Offers",
 "created_at": "Fri Sep 07 16:11:41 UTC 2012",
 "updated_at": "Sun Sep 09 19:49:45 UTC 2012",
 "overview": "\u003Cp\u003ELeaseDedo.com is a online classifieds platform specially designed for lease offers. LeaseDedo allows its registered users to post various offers like AdSpace Lease Offers, Automobile Lease Offers, Business Lease Offers, Property Lease Offers for Free.\u003C/p\u003E\n\n\u003Cp\u003EThe Name LeaseDedo can be understood as \u0026#8220;Lease\u0026#8221; a word in English which means Lessor offering something that can be leased and \u0026#8220;Dedo\u0026#8221;, a word in Hindi which means \u0026#8220;Give\u0026#8221;. Thus LeaseDedo when completely translated to English means \u0026#8220;Give Lease\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003ELeaseDedo.com Webiste Provides the following Features to their customers who post Advertisement on their website.\u003C/p\u003E\n\n\u003Cp\u003EUsers can Post Ad on LeaseDedo after login in to the website and visiting to Post Lease Page, hover (move thier mouse) on the desired Lease offer users wish to advertise. Now users can either directly click the image to post the corresponding Ad or click on the Post offer Now tab and click on the link provided inside it.\nFor Quick Links users can see in the footer of each and every page to Post or See Lease Offers. \nOnce thier Ad is posted regardless of the geographic location users are located in, our system shows Indian Standard Time(IST)(GMT +5.30) in place of thier posted Ad.\u003C/p\u003E\n\n\u003Cp\u003EFollowing features will be available to users only if users have any valid Lease Offers posted by users on LeaseDedo.\u003C/p\u003E\n\n\u003Cp\u003EUpdate Ad\nUpdating thier Ad on LeaseDedo.com has some regulations. Updating Ad means just thier Ad will be moved to top of all the ads at the time users hit Push to Top button. users can do this by visiting My Account Page and clicking on My Lease Offers link on left side of the page. \nOnce users Update thier ad users can not update another ad (if users have any) with in 24 hours. users also can not able to update thier ad if users have any newly posted ad with in less than 24 hours.\u003C/p\u003E\n\n\u003Cp\u003EAdd New Images to Ad\nUsers can Update thier Ad by adding New Images or if users haven\u0026#8217;t yet added any images users can do it so by clicking on the Add New Images button. All users need to do is navigate to My Account Page and clicking on My Lease Offers link on left side of the page. \nPlease be noted that once users upload new Images to thier existing ad, the old Images if any will be replaced with the new ones uploaded by users. And we do not keep the old images with us and hence will be deleted from our repository.\u003C/p\u003E\n\n\u003Cp\u003EDelete Ad\nUsers can Delete thier ad anytime users wish once users are satisfied with the response obtained as a result of posting thier ad on LeaseDedo.com \nIn order to delete users ad users can navigate to My Account Page and clicking on My Lease Offers link on left side of the page. Click on Delete button in order to delete the corresponding ad.\u003C/p\u003E\n\n\u003Cp\u003EEdit And Update Ad\nLeaseDedo do not provide this facility as of now assuming the lease offer posted by the user is having accurate information and the only facility provided is to allow its users to Update the Ad with new Images and Pushing it to Top of all the Posts.\u003C/p\u003E\n\n\u003Cp\u003EKnow the validity of My Ad\nthier Ad Posted on LeaseDedo will be visible to everyone upto 30 days form the date users post or update thier ad. It will be visible to users in My Account page up to 60 days form the day users update or post thier ad. \nusers can anytime wish to update, add new images or delete thier ad with in 60 days. If users do not update it for 60 days it will be automatically removed from our records. \nIn case users update thier ad on 50th day, thier ads visibility will be extended to 30 days and will be in our records up to 60 days from the point of time users Update users ad.\u003C/p\u003E\n\n\u003Cp\u003ERegister\nJust Visit SignUp Page and enter the details requested. users need to input thier personal e-mail Id at the time of registration. After entering the required details click on \u0026#8220;Create User\u0026#8221; button. users will receive a confirmation mail with activation link to sent thier registered e-mail provided at the time of registration. Just Click on the activation link and users should get \u0026#8220;users have successfully activated thier LeaseDedo.com account\u0026#8221; message.\u003C/p\u003E\n\n\u003Cp\u003ELogin\nIt\u0026#8217;s very simple! Just visit Login Page and enter thier registered username and password. After logging in successfully users can start \u0026#8216;LeaseDedo\u0026#8217;ing.\u003C/p\u003E\n\n\u003Cp\u003ERetrieve Forgot UserName\nUsers can retrieve users Forgot username by visiting Forgot UserName Page and entering thier registered email Id. users can also opt for the generation of new password by checking the \u0026#8220;Reset my password too\u0026#8221; option just below Email Address. And the details will be sent to thier registered email address up on clicking Submit button.\u003C/p\u003E\n\n\u003Cp\u003ERetrieve Forgot Password\nWhen users forget thier password, users will get a new one by visiting Forgot Password page and entering Username and clicking on submit. users will recieve a new password to thier registered email. Every time users forgot thier password, users can get a new password only as thier password is stored in hashed format.\u003C/p\u003E\n\n\u003Cp\u003EChange Current Password\nJust login to LeaseDedo.com and browse to MyAccount Page. Click on the Change Password link on the left side of the page and users will be able to see the Change thier Password Page. Now Input the old password, new password and Confirm it. Once users are done click Change Password button. Then users should see the message saying \u0026#8220;thier Password has been changed Successfully!\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003EUpdate User Details\nJust login to LeaseDedo.com and browse to MyAccount Page. Click on the Update Details link on the left side of the page. Now Input thier details requested on the page and click Update button. Then users should see the message saying \u0026#8220;thier Details are Successfully Updated\u0026#8221;. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       46],
      "assets/images/resized/0021/0321/210321v2-max-150x150.png"],
     [[250,
       77],
      "assets/images/resized/0021/0321/210321v2-max-250x250.png"],
     [[290,
       90],
      "assets/images/resized/0021/0321/210321v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder, CEO",
    "person":
     {"first_name": "Pavan",
      "last_name": "Kumar Rao Navule",
      "permalink": "pavan-kumar-rao-navule-2",
      "image":
       {"available_sizes":
         [[[112,
            150],
           "assets/images/resized/0021/0323/210323v2-max-150x150.jpg"],
          [[187,
            250],
           "assets/images/resized/0021/0323/210323v2-max-250x250.jpg"],
          [[337,
            450],
           "assets/images/resized/0021/0323/210323v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003EPavan Kumar Rao Navule\u003C/p\u003E"}}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Press Release",
    "is_past": false,
    "provider":
     {"name": "prlog.com",
      "permalink": "prlog-com",
      "image": null}},
   {"title": "Press Release",
    "is_past": false,
    "provider":
     {"name": "free-press-release.com",
      "permalink": "free-press-release-com",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}