{"name": "Leathers Club",
 "permalink": "leathers-club",
 "crunchbase_url": "http://www.crunchbase.com/company/leathers-club",
 "homepage_url": "http://www.leathersclub.com/",
 "blog_url": "http://www.leathersclub.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 8,
 "founded_day": 12,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "jacket, leather",
 "alias_list": null,
 "email_address": "info@leathersclub.com",
 "phone_number": "",
 "description": "If you are looking for a leather jacket.",
 "created_at": "Mon Sep 24 14:37:11 UTC 2012",
 "updated_at": "Mon Oct 01 18:13:57 UTC 2012",
 "overview": "\u003Cp\u003EWe know what you need for your leather outfit…\u003C/p\u003E\n\n\u003Cp\u003EThat meets you fashion mood then your hunt for top quality real replica Jackets ends here because we provide a number of elegant and trendiest Vintage leather Jackets for Men and Women. Served by the simplest and veteran craftsmen, we\u0026#8217;ve without an end offer the finest leather attire to the shoppers visiting www.leathersclub.com . \u003C/p\u003E\n\n\u003Cp\u003EWe solely have a glorious assortment of leather jackets for the winter season however additionally we have trendiest range of cool leather fabric for the summer season. Therefore, if you would like to stay fashionable throughout the year, we have a tendency to present the down-to-earth selection for you since our designing team is working to provide best leather fabric to complete your apparel in a classy way.\u003C/p\u003E\n\n\u003Cp\u003EDespite of all the designing challenges within an extremely short span of your time, we\u0026#8217;ve attained an outstanding reputation and currently have increased our customer base reaching an extraordinary response from the fashion globe. Whether it is a replica Jacket for Men or Women, or else maybe you are searching for the other Vintage Leather Jackets, we have the an absolute capability to assure in the direction of delivering the best leather fabric.  \u003C/p\u003E\n\n\u003Cp\u003EReplica Leather Jackets that are designed by us can for sure build heads flip. We all know that high quality leather is very important to achieve the best look. We  never compromise with the quality of leather, however we have a tendency to keep the value affordable, creating attention-grabbing leather substance for you that ample your frame of mind for fashion with style.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       23],
      "assets/images/resized/0021/2756/212756v2-max-150x150.png"],
     [[250,
       39],
      "assets/images/resized/0021/2756/212756v2-max-250x250.png"],
     [[315,
       50],
      "assets/images/resized/0021/2756/212756v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}