{"name": "Leather Associates",
 "permalink": "leather-associates",
 "crunchbase_url": "http://www.crunchbase.com/company/leather-associates",
 "homepage_url": "http://www.indiamart.com/leatherassociates/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "leatherassociates@tradepassport.org",
 "phone_number": "9314884070 ",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 15:47:31 UTC 2013",
 "updated_at": "Fri Apr 05 15:47:36 UTC 2013",
 "overview": "\u003Cp\u003E\u0026#8220;Leather Associates\u0026#8221; was established in 2002 as a sole proprietorship at Jaipur in Rajasthan (India). The company has been working successfully under the guidance of Mr. Neeraj (Proprietor). \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nWe are the leading manufacturer, supplier and exporter of Leather Belts, Leather Card Holders, Leather Cheque Book Covers, Leather Trifold Wallets, Leather Tags, Ladies Wallets, Leather Portfolio Bags \u0026amp; many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have well planned and sound infrastructure at our disposal, this helps us to work with maximum motivation. Machines with latest technological bent are installed in our premises and all the more they are handles by competent professionals, this helps us to come with high quality products, thereby producing products meeting prescribed standards and generating delight for the customers\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur company is endowed with hardworking team comprising of dedicated team members. We have all the members coming with good academic background and having rich industrial experience. Our company takes utmost care to select only professionals and managers who are really talented and skilled in their respective fields. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nTo maintain good and consistent position in the market, our company is relentlessly performing at its best in importing and exporting only quality products. We have become the first choice of our clients due to our best quality assurance and warranty schemes. We follow strict quality check team in order to supply only high quality products to our valuable clients. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us? / Our Strengths:L\nThe reasons behind the progressive growth of our company day by day depends on our efficient team and quality maintenance techniques. Along with timely supply of sufficient quantity of products, our company focuses on all quality parameters while exporting and importing.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8855/248855v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8855/248855v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8855/248855v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}