{"name": "Legal Jobs",
 "permalink": "legal-jobs",
 "crunchbase_url": "http://www.crunchbase.com/company/legal-jobs",
 "homepage_url": "http://www.lawcrossing.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Law_Crossing",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 2,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "legal-jobs, attorney-law-jobs, in-house-counsel-jobs, summer-associate-jobs, alternative-legal-careers, law-firm-jobs, legal-assistant-jobs, government-attorney-jobs",
 "alias_list": null,
 "email_address": "jasonmartino24@gmail.com",
 "phone_number": "626-243-1814",
 "description": "Search legal jobs, ",
 "created_at": "Fri Aug 10 10:55:03 UTC 2012",
 "updated_at": "Sat Aug 11 08:59:29 UTC 2012",
 "overview": "\u003Cp\u003ELawCrossing.com is a job aggregator website for professionals in the \u0026lt;a href=\u0026quot;http://www.lawcrossing.com/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;\u0026lt;b\u0026gt;legal Job\u0026lt;/b\u0026gt;\u0026lt;/a\u0026gt; field. We cover every practice area for attorneys and also have job listings for paralegals, law students and summer associate opportunities. Our extensive database has almost 100,000 job listings.\u003C/p\u003E\n\n\u003Cp\u003EEstablished in 2002, we are one of the oldest Internet \u0026#8220;job boards\u0026#8221; around. The quotation marks are because of the fact, that we are not just any other job board, but a job research company. We specialize in tracking down legal industry jobs from all over the Internet and not just asking employers to pay to post their positions on our site.\u003C/p\u003E\n\n\u003Cp\u003EOur comprehensive database is made possible by our team of researchers, programmers and data analysts who make sure that all our listings are accurate and up-to-date. Using our highly specialized software developed in-house, we are able to keep track of over 50,000 websites that have job openings in the legal sector. This covers law firms, corporate sites for in-house counsel positions, legal industry associations, obscure regional publications and other niche sites.\u003C/p\u003E\n\n\u003Cp\u003EThis is why we are able to add over 7,500 new job openings every week, even in this economy! We have over 25 times more job openings in this industry than any other job board. LawCrossing.com has consistently remained the number 1 job search tool for lawyers for the past decade.\u003C/p\u003E\n\n\u003Cp\u003EWe keep getting return members. Whether its associates who want to change firms or law students who after getting a summer internship through our site now trust us to get them their first job upon graduation!\u003C/p\u003E\n\n\u003Cp\u003EWe operate on a paid-membership model for job seekers. One of the distinct advantages of this model is that our members get to stay ahead of the competition. This is because of the fact that as soon as a position opens up on a company\u0026#8217;s website, we come to know about it through our automated system. And if the position fits the profile of our member, he gets a job alert in his email. \u003C/p\u003E\n\n\u003Cp\u003EAt LawCrossing, we are absolutely confident that there is no other better tool for finding work in the legal industry and that is why we give everybody a 72-hours free trial offer. During this period, our members can look up as many job search results as they want to and if they do not like our services, they can cancel without any penalty. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0020/5447/205447v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0020/5447/205447v2-max-250x250.jpg"],
     [[272,
       272],
      "assets/images/resized/0020/5447/205447v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}