{"name": "Legal Authority",
 "permalink": "legal-authority-2",
 "crunchbase_url": "http://www.crunchbase.com/company/legal-authority-2",
 "homepage_url": "http://www.legalauthority.com",
 "blog_url": "http://www.legalauthorityblog.com/",
 "blog_feed_url": "http://www.legalauthorityblog.com/?feed=rss2",
 "twitter_username": null,
 "category_code": "web",
 "number_of_employees": 100,
 "founded_year": 2003,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "harrison-barnes, legal-targeted-mailing-service, legal-employment-consultants, a-harrison-barnes",
 "alias_list": null,
 "email_address": "seo@legalauthority.com",
 "phone_number": "800-283-3860",
 "description": null,
 "created_at": "Tue Dec 30 05:50:58 UTC 2008",
 "updated_at": "Sat Jan 10 16:41:30 UTC 2009",
 "overview": "\u003Cp\u003ELegal Authority, the world\u0026#8217;s largest legal targeted mailing service, is Harrison Barnes\u0026#8217; second brainchild after the success of BCG Attorney Search. Harrison began his career as a litigation attorney after attending the University of Chicago, where he received his bachelor\u0026#8217;s in political studies, and graduating from the University of Virginia Law School.\u003C/p\u003E\n\n\u003Cp\u003EAfter three years of practice, Barnes founded Juriscape, under which he developed a collection of industry-specific job-search websites that revolutionized the way job seekers access employment postings from around the world. Harrison Barnes and his companies began serving the legal industry with BCG Attorney Search and LawCrossing.com. Following on the success of those endeavors, Harrison started Legal Authority which offers resume development and distribution services for attorneys and paralegals.\u003C/p\u003E\n\n\u003Cp\u003ELegal Authority is the largest and the most comprehensive portal of legal employment opportunities in the world. The methods the company employs to get jobs for legal professionals are inexpensive, quick, and effective. Hundreds of attorneys throughout the United States have landed with jobs, thanks to Legal Authority.\u003C/p\u003E\n\n\u003Cp\u003EThe process is simple, but profound. After interviewing with one of their employment advocates and describing precisely what the job seeker wants to do, they consult with them to provide a target list of legal employers. Using their database, Legal Authority provides the legal job seeker with customized letters, envelopes, and resumes for application to legal jobs, in every area of practice, in every city and every country any legal professional could ever want to work-whether one is interested in one employer or a thousand employers. Legal Authority helps all job seekers whether they want to go in-house, to a law firm, to a public interest organization, to work for the federal or state government, or seek to be prosecutors, court clerks, or even law professors, the company can help anyone find the perfect employer.\u003C/p\u003E\n\n\u003Cp\u003EThe site uses the world\u0026#8217;s most sophisticated database of legal employers and enhances attorneys\u0026#8217; lives by penetrating markets on their behalf to get them the exposure\u0026#8221; to employers that they need. No recruiters, no job-posting boards, and no classified ads can do what they do. The beauty of what Legal Authority does is that they put job seekers in control of their own destinies. The company happens to be Harrison Barnes\u0026#8217; favorite company out of his other 14 companies.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0003/2687/32687v2-max-150x150.jpg"],
     [[250,
       55],
      "assets/images/resized/0003/2687/32687v2-max-250x250.jpg"],
     [[315,
       70],
      "assets/images/resized/0003/2687/32687v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "A",
      "last_name": "Harrison Barnes",
      "permalink": "a-harrison-barnes",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}