{"name": "Lekker Energie",
 "permalink": "lekker-energie",
 "crunchbase_url": "http://www.crunchbase.com/company/lekker-energie",
 "homepage_url": "http://www.lekker-energie.de",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "strom, kostrom, kostromanbieter, stromanbieter, gas, gasanbieter, strom-vergleich, kostrom-vergleich, energie, energie-tarife, strom-preisvergleich",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "strom ökostrom ökostromanbieter",
 "created_at": "Thu Aug 30 15:47:12 UTC 2012",
 "updated_at": "Tue Sep 04 14:57:49 UTC 2012",
 "overview": "\u003Cp\u003Elekker energie ist ein bundesweit tätiger Energieversorger mit Sitz in Berlin. Innerhalb der vergangenen Jahre konnte der Versorger stark wachsen, da seine Tarife für Strom und Erdgas bei den privaten Haushalten äußerst gefragt sind.\u003C/p\u003E\n\n\u003Cp\u003EGleich zwei Eigenschaften machen die Tarife des Berliner Energieversorgers so attraktiv. Da wären zunächst einmal die niedrigen Kosten. Etlichen Haushalten bietet sich mit einem Versorgerwechsel die Chance, in den Genuss deutlich niedrigerer Energiekosten zu gelangen. In Anbetracht der seit Jahren steigenden Gas- und Strompreise überrascht es nicht, dass immer häufiger gewechselt wird. Außerdem gelangen Neukunden in den Genuss einer Strompreisgarantie mit Dauer von zwölf Monaten. Während dieses Zeitraums wird der eigentliche Energiepreis nicht erhöht.\u003C/p\u003E\n\n\u003Cp\u003ENicht nur bei den Kosten setzt sich lekker energie von zahlreichen anderen Versorgern ab. Auch das Thema Ökologie spielt bei den Berlinern eine große Rolle. Beim Strom wird konsequent nur Ökostrom angeboten. Der gesamte Strom wird mit Hilfe regenerativer Energien erzeugt, um somit Ressourcen und Umwelt zu schonen.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}