{"name": "Let's Five",
 "permalink": "lets-five",
 "crunchbase_url": "http://www.crunchbase.com/company/lets-five",
 "homepage_url": "http://www.letsfive.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "letsfive",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 5,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "marketplace-freelance-lancer-gig-euro-startup-entrepreneur",
 "alias_list": null,
 "email_address": "letsfivebcn@gmail.com",
 "phone_number": "0034619056360",
 "description": "marketplace for freelancers",
 "created_at": "Tue Jun 05 21:30:19 UTC 2012",
 "updated_at": "Sat Jun 09 17:24:43 UTC 2012",
 "overview": "\u003Cp\u003ELet’sFive es una startup, un marketplace que brinda a sus usuarios la oportunidad de usar sus conocimientos propios e imaginación para ayudar a otros o para ofrecer tanto servicios como productos por la cantidad de 5 €. En Let’sFive tienen la convicción de que la tradicional fórmula de trabajo de 9 a 5 ya está rebasada o no encaja para todo el mundo, más ahora que cada vez son más personas las que trabajan como freelance, subcontratados en proyectos o simplemente desde el hogar.\u003C/p\u003E\n\n\u003Cp\u003EEmprendedores y freelancers pueden usar Let’sFive para convertir en ingresos sus habilidades, talento o cualquier recurso que tengan de una forma fácil y divertida. Los clientes que necesiten de microservicios o ideas para su negocio o empresa lo pueden buscar entre una multitud de ofertas, ordenadas en diferentes tipos de categorías siempre a un precio fijo. En Let’sFive es posible encontrar todo tipo de servicios; desde diseño web, marketing online, regalos de cumpleaños, tipa de cocina, diseño de audio o video, servicios jurídicos e incluso artesanía. La plataforma proporciona todas las herramientas necesarias para facilitar su uso, incluyendo desde promoción de los trabajos de un usuario, el intercambio de información entre usarios e incluso la gestión de los pagos, vía PayPal.\u003C/p\u003E\n\n\u003Cp\u003EPara utilizar el servicio es necesario comprar Fivoos, cada uno de ellos tiene un valor de cinco euros, algunos vendedores pueden ofrecer mejoras adicionales en sus Fivoo o vender su Fivoos en múltiplos, dependiendo de cada servicio a prestar. Así mismo los usuarios no pueden ofrecer o aceptar pagos utilizando cualquier otro método ajeno al de hacer un pedido a través de cualquiera de los sitios de Let’sFive, quien retiene un euro por cada transacción. Solo los usuarios registrados pueden comprar y vender en Let’sFive, cuya inscripción es totalmente gratuita.\u003C/p\u003E\n\n\u003Cp\u003ECuando un comprador pide un Fivoo, el vendedor será notificado a su cuenta y por correo electrónico. Los vendedores están obligados a cumplir con la duración de la prestación que se especifica a la hora de crear sus Fivoos. De no hacerlo, permitirá al comprador anular la orden y reducir la calificación del vendedor. Del mismo modo un vendedor puede cancelar un pedido en cualquier momento dado. Sin embargo, la cancelación de un pedido tiene un efecto negativo en la calificación del vendedor. Let’sFive es una excelente plataforma para ofrecer productos y/o servicios, sin complicaciones y sobre todo para hacer que cualquier conocimiento genere un ingreso extra.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[98,
       150],
      "assets/images/resized/0019/4083/194083v2-max-150x150.jpg"],
     [[164,
       250],
      "assets/images/resized/0019/4083/194083v2-max-250x250.jpg"],
     [[180,
       274],
      "assets/images/resized/0019/4083/194083v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.todostartups.com/sites/ecommerce/letsfive",
    "title": "Let's Five"},
   {"external_url": "http://www.techvalley.es/espana/letsfive-com-de-todo-por-solo-5-euros-123/",
    "title": "Let's Five de todo por 5 €"}]}