{"name": "Lexicon Senior Healthcare",
 "permalink": "lexicon-senior-healthcare",
 "crunchbase_url": "http://www.crunchbase.com/company/lexicon-senior-healthcare",
 "homepage_url": "http://www.lexiconseniorhealthcare.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "LexiconSH",
 "category_code": "other",
 "number_of_employees": 100,
 "founded_year": 2011,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "lshsocial@lexiconseniorhealthcare.com",
 "phone_number": "800-300-0021",
 "description": "Pre-set Appointments Outside Sales",
 "created_at": "Wed Jan 12 19:05:46 UTC 2011",
 "updated_at": "Tue May 03 21:06:14 UTC 2011",
 "overview": "\u003Cp\u003ELexicon Senior Healthcare (LSH) is a new 2011 marketing arm of a publically-traded Fortune 500 Company with assets under management exceeding $32,000,000,000! \u003C/p\u003E\n\n\u003Cp\u003EAlthough seemingly similar to competitor marketing firms selling our type of products, Lexicon specializes in distributing healthcare supplemental benefit products as first-offer to the senior citizen market. Like similar competitor marketers, LSH salespeople (referred to as Consultants) are provided with daily preset appointments Tuesday through Friday (no cold-calling!), but the quality of the LSH preset appointment is of a much higher quality. \u003C/p\u003E\n\n\u003Cp\u003ELSH initially trains its new consultants only to sell the highest-demand, easiest to sell, most simple senior healthcare product, called Medicare Supplement. After placing this business, LSH further trains its consultants to sell additional products to their existing clients, while still allowing all of their consultants to continue on daily preset appointments at their own discretion. In addition, LSH consultants after having sold only $50,000 of Medicare Supplement (usually a 2 month period for an entry-level consultant to accomplish this level of production) are allowed to make their own decisions as to what days and what locations they wish to have preset appointments and are also given the option to step into a management role immediately. \u003C/p\u003E\n\n\u003Cp\u003EFurther differing itself similar competitors, in as soon as 6 weeks, all LSH consultants\u0026#8217; commissions are markedly increased from their entry-level commission, as strict/regimented management of LSH consultants post $50,000 Medicare Supplement production is eliminated, training meetings are now optional, training travel is no longer necessary, they are selling far more of their appointments (as the learning curve is over!) earning a higher revenue margin to Lexicon per appointment provided, etc\u0026#8230; Bottom-line, a jump in their commission level can now be made because a larger spread of commission dollars are available. Thus, the Lexicon marketing arm, unlike others, shares this higher dollar margin back to the consultant in the form of a generous commission level increase versus retaining it for higher corporate gains. Lexicon wants to not only care for, train, and support each consultant individually, but they understand a key fundamental ingredient to retaining a consultant is to make him/her a fortune quicker in upfront commission income as well as with immediate monthly residual income! \u003C/p\u003E\n\n\u003Cp\u003EThe most exciting part of selling for LSH is that their supplemental products are not affected by the economy whatsoever. To the contrary, individual consultant average sales volume is continuing to rise even in the midst of a down economy. This is simply due to the rapidly increasing number of babyboom generation seniors entering the marketplace. They have Lexicon\u0026#8217;s products on the forefront of their mind as they approach age 65 as they need a product to take over their healthcare costs where Medicare leaves behind\u0026#8230; LSH sales are literally sky-rocketing! \u003C/p\u003E\n\n\u003Cp\u003EThis creates the opportunity for a LSH consultant to build a fortune of clients on the books paying them an increasingly \u0026#8220;stacking\u0026#8221; monthly residual income and the opportunity to expand their horizons into additional senior products (and underage supplement products) with the virtual immediate option of leaping into a management role and earning more income from subordinate new consultants whom they initially train and manage through their learning curve. With Lexicon Senior Healthcare, THERE IS NO LIMIT TO HOW MUCH AN INDIVIDUAL SALESPERSON CAN EARN!!! \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       138],
      "assets/images/resized/0011/8219/118219v2-max-150x150.jpg"],
     [[250,
       230],
      "assets/images/resized/0011/8219/118219v2-max-250x250.jpg"],
     [[450,
       414],
      "assets/images/resized/0011/8219/118219v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}