{"name": "Lexus of Pembroke Pines",
 "permalink": "lexus-of-pembroke-pines",
 "crunchbase_url": "http://www.crunchbase.com/company/lexus-of-pembroke-pines",
 "homepage_url": "http://www.lexusofpembrokepines.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "lexuspembroke",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "lexusofpembrokepines@gmail.com",
 "phone_number": "9544432020",
 "description": "Automotive \u0026 Vehicles",
 "created_at": "Mon Oct 01 22:45:26 UTC 2012",
 "updated_at": "Wed Dec 12 06:57:13 UTC 2012",
 "overview": "\u003Cp\u003EAt Lexus of Pembroke Pines in South Florida, our passion is providing our customers with a world-class Lexus ownership experience. As your leading South Florida Lexus dealer, Lexus of Pembroke Pines is the kind of dealer every innovative, luxury car should come with. Located in Pembroke Pines, Florida, we are happy to be visited by customers from greater Miami, Hollywood, Fort Lauderdale, Weston and the rest South Florida. \u003C/p\u003E\n\n\u003Cp\u003EThe Lexus Covenant: \nLexus will enter the most competitive, prestigious automobile race in the world. Over 50 years of Toyota automotive experience has culminated in the creation of Lexus cars. They will be the finest cars ever built. Lexus will win the race because Lexus will do it right from the start. Lexus will have the finest dealer network in the industry. Lexus will treat each customer as we would a guest in our home. If you think you can’t, you won’t… If you think you can, you will! We can, we will.\u003C/p\u003E\n\n\u003Cp\u003ELexus of Pembroke Pines is committed to our customers and providing them with the exceptional Lexus vehicles they desire, which is why Lexus of Pembroke Pines is an \u0026#8216;Elite of Lexus\u0026#8217; dealer and clients return to us again and again from Ft Lauderdale, Sunrise, Cooper City and Miramar. The number one concern of this Lexus dealer is customer satisfaction.\u003C/p\u003E\n\n\u003Cp\u003EVisit our Pembroke Pines Lexus Dealership from Miami, Plantation, Hileah, or Fort Lauderdale today to test drive a new or used Lexus ES 350, Lexus ES300h, Lexus IS 250 or Lexus IS 350, Lexus LS 460, Lexus GS 350, Lexus RX 350, or Lexus RX 450h. We always have great Lexus lease specials. When you\u0026#8217;re ready to service your Lexus, be sure to take advantage of our Lexus service specials!\u003C/p\u003E\n\n\u003Cp\u003ELexus of Pembroke Pines buy a Lexus for sale - Exceeding the limits of performance, luxury and quality in the South Florida region. Just a short trip from Miami, Hileah, Davie and Ft Lauderdale.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/3767/213767v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0021/3767/213767v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0021/3767/213767v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "16150 Pines Blvd",
    "address2": "",
    "zip_code": "33027",
    "city": "Pembroke Pines",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": 26.0075857,
    "longitude": -80.3639985}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}