{"name": "LGMi Berlin",
 "permalink": "lgmi-berlin",
 "crunchbase_url": "http://www.crunchbase.com/company/lgmi-berlin",
 "homepage_url": "http://www.lgm-interactive.com",
 "blog_url": "http://www.lgm-interactive.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "LGMi",
 "category_code": "public_relations",
 "number_of_employees": 5,
 "founded_year": 2009,
 "founded_month": 12,
 "founded_day": 12,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "digital",
 "alias_list": null,
 "email_address": "eric@lgm-interactive.com",
 "phone_number": "",
 "description": "Digital Storytelling for Sustainability",
 "created_at": "Fri Nov 16 19:55:45 UTC 2012",
 "updated_at": "Tue Nov 20 04:05:00 UTC 2012",
 "overview": "\u003Cp\u003ELGMi is a digital agency headquartered in Berlin, Germany. We specialize in digital storytelling via games, apps and interactive content for companies and organizations with activities in the fields of CSR, social change, and environmental sustainability.\u003C/p\u003E\n\n\u003Cp\u003EWe provide services that help our client navigate the space where digital and sustainability meet. Our services range from consulting to the design and programming of websites to the creation of social media campaigns.\u003C/p\u003E\n\n\u003Cp\u003EBut what defines us the most is creative storytelling and the creation of interactive experiences around sustainability topics.\u003C/p\u003E\n\n\u003Cp\u003EWhen you come to us with an idea for a project, you expect first and foremost competence in the design, programming and delivery of this project. And while we can clearly offer this, we also provide our clients with much more.\u003C/p\u003E\n\n\u003Cp\u003EUnlike most other agencies, we combine this expertise in all things digital with a strong passion for sustainability. We have a thorough knowledge of several aspects of sustainability and we can claim expertise in the following key themes: CSR, Renewable Energy, Climate and Poverty issues. We also work extensively in the field of Human Rights, especially as it pertains to children and education.\u003C/p\u003E\n\n\u003Cp\u003EOur expertise means that we understand what resonates with different audiences. We know what’s been done about these topics, what’s missing, and where a little innovation can give our client\u0026#8217;s projects a real boost.\u003C/p\u003E\n\n\u003Cp\u003EAnd, last but not least, we care. The fact that we truly care is important as it means that we bring passion, dedication and commitment to what we do.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       46],
      "assets/images/resized/0022/0737/220737v2-max-150x150.jpg"],
     [[250,
       77],
      "assets/images/resized/0022/0737/220737v2-max-250x250.jpg"],
     [[320,
       99],
      "assets/images/resized/0022/0737/220737v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}