{"name": "Libertarian National Committee",
 "permalink": "libertarian-national-committee",
 "crunchbase_url": "http://www.crunchbase.com/company/libertarian-national-committee",
 "homepage_url": "http://www.lp.org",
 "blog_url": "http://www.lp.org/blog",
 "blog_feed_url": "",
 "twitter_username": "LPNational",
 "category_code": "other",
 "number_of_employees": 15000,
 "founded_year": 1971,
 "founded_month": 12,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "libertarianism, libertarian-party, politics, non-profit",
 "alias_list": null,
 "email_address": "info@lp.org",
 "phone_number": "888.353.2887",
 "description": "Libertarian Party Governing Body",
 "created_at": "Sun Sep 23 07:50:08 UTC 2012",
 "updated_at": "Wed Sep 26 23:04:25 UTC 2012",
 "overview": "\u003Cp\u003EThe Libertarian Party is your representative in American politics. It is the only political organization which respects you as a unique and competent individual.\u003C/p\u003E\n\n\u003Cp\u003EAmerica\u0026#8217;s Heritage\nLibertarians believe in the American heritage of liberty, enterprise, and personal responsibility. Libertarians recognize the responsibility we all share to preserve this precious heritage for our children and grandchildren.\u003C/p\u003E\n\n\u003Cp\u003EFree and Independent\nLibertarians believe that being free and independent is a great way to live. We want a system which encourages all people to choose what they want from life; that lets them live, love, work, play, and dream their own way.\u003C/p\u003E\n\n\u003Cp\u003ECaring For People\nThe Libertarian way is a caring, people-centered approach to politics. We believe each individual is unique. We want a system which respects the individual and encourages us to discover the best within ourselves and develop our full potential.\u003C/p\u003E\n\n\u003Cp\u003EPrincipled; Consistent\nThe Libertarian way is a logically consistent approach to politics based on the moral principle of self-ownership. Each individual has the right to control his or her own body, action, speech, and property. Government\u0026#8217;s only role is to help individuals defend themselves from force and fraud.\u003C/p\u003E\n\n\u003Cp\u003EAccepting\nThe Libertarian Party is for all who don\u0026#8217;t want to push other people around and don\u0026#8217;t want to be pushed around themselves. Live and let live is the Libertarian way.\u003C/p\u003E\n\n\u003Cp\u003EAMERICA\u0026#8217;S THIRD LARGEST PARTY\nThe Libertarian Party is America\u0026#8217;s third largest and fastest growing political party. Libertarians engage in a variety of projects, working for everyone\u0026#8217;s liberty on every issue.\u003C/p\u003E\n\n\u003Cp\u003EThe Libertarian Party was created in December of 1971 by people who realized that the politicians had strayed from America\u0026#8217;s original libertarian foundation, with disastrous results. Their vision was the same as that of America\u0026#8217;s founders \u0026#8211; a world where individuals are free to follow their own dreams in their own ways, a world of peace, harmony, opportunity, and abundance.\u003C/p\u003E\n\n\u003Cp\u003ELibertarians are practical; we know we can\u0026#8217;t make the world perfect, but, it can be better. Libertarians will keep working to create a better, freer society for everyone.\u003C/p\u003E\n\n\u003Cp\u003EAs William Allen White said: \u0026#8220;Liberty is the only thing you cannot have unless you are willing to give it to others.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EWHY NOT STICK WITH THE ESTABLISHMENT?\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Given the low level of competence among politicians, every American should become a Libertarian.\u0026#8221;\n\u0026#8211; Charley Reese, Alameda Times-Star (California), June 17, 2003\u003C/p\u003E\n\n\u003Cp\u003EThe politicians in Washington and our state capitals have led us away from the principles of individual liberty and personal responsibility which are the only sound foundation for a just, humane, and abundant society.\u003C/p\u003E\n\n\u003Cp\u003EGovernment at all levels is too large, too expensive, woefully inefficient, arrogant, intrusive, and downright dangerous. Democratic and Republican politicians have created the status quo and do not intend to change it.\u003C/p\u003E\n\n\u003Cp\u003ECONSIDER THE LIBERTARIAN OPTION\nSubstantially reduce the size and intrusiveness of government and cut all taxes.\nLet peaceful, honest people offer their goods and services to willing consumers without a hassle from government.\nLet peaceful, honest people decide for themselves what to eat, drink, read, or smoke and how to dress, medicate themselves, or make love, without fear of criminal penalties.\nThe U.S. government should defend Americans and their property in America and let the U.S. taxpayer off the hook for the defense bill of wealthy countries like Germany and Japan.\u003C/p\u003E\n\n\u003Cp\u003EWHAT AMERICANS WANT\u003C/p\u003E\n\n\u003Cp\u003EAmericans want, and deserve, a political system which respects them as unique individuals; as people who can make their own plans, who can take responsibility for themselves, who are compassionate, and who can and will solve their own problems if allowed to do so.\u003C/p\u003E\n\n\u003Cp\u003EMost Americans, after some thought, prefer the Libertarian option in politics. Most people in their private, non-governmental, affairs deal with each other on the libertarian premise of mutual respect. You don\u0026#8217;t threaten your neighbors with fines or jail just because they choose careers or lifestyles different than yours.\u003C/p\u003E\n\n\u003Cp\u003ELet\u0026#8217;s hold government to the same standard. Protect us and our rights, and give us the respect we deserve.\u003C/p\u003E\n\n\u003Cp\u003ETIME FOR ACTION\nWe hope you can see the benefits of living in that America envisioned by the founders and by their political heirs, today\u0026#8217;s Libertarians.\u003C/p\u003E\n\n\u003Cp\u003EWe hope you will want to join the Libertarian Party and become involved in our many activities at the national, state, and local levels.\u003C/p\u003E\n\n\u003Cp\u003EAre you ready for a change in American politics?\u003C/p\u003E\n\n\u003Cp\u003EFor as long as most of us can remember, Republican and Democratic politicians have talked about solving the problems that face Americans; but their \u0026#8220;solutions\u0026#8221; have only worsened the situation \u0026#8211; higher and higher taxes; greater intrusions into our personal lives; more rapes, murders, and muggings; and a crumbling public school system graduating fewer and fewer people who can read.\u003C/p\u003E\n\n\u003Cp\u003EWe believe the American people \u0026#8211; like their counterparts in Eastern Europe \u0026#8211; have seen through the charade of big government. We believe the American people are ready for a fresh approach to the problems that plague us. Libertarian ideas were instrumental in the birth of our country, and they can inspire a return to the individual initiative, responsibility, and prosperity that were once part of the American dream. If you agree, we hope you will join us.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[146,
       150],
      "assets/images/resized/0021/2607/212607v2-max-150x150.png"],
     [[244,
       250],
      "assets/images/resized/0021/2607/212607v2-max-250x250.png"],
     [[439,
       450],
      "assets/images/resized/0021/2607/212607v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Vice Chairman",
    "person":
     {"first_name": "R.Lee",
      "last_name": "Wrights",
      "permalink": "r-lee-wrights",
      "image": null}},
   {"is_past": false,
    "title": "Chairman ",
    "person":
     {"first_name": "Geoffrey",
      "last_name": "Neale",
      "permalink": "geoffrey-neale",
      "image": null}},
   {"is_past": false,
    "title": "Libertarian National Committee Member",
    "person":
     {"first_name": "Brett",
      "last_name": "H. Pojunis",
      "permalink": "brett-h-pojunis",
      "image":
       {"available_sizes":
         [[[144,
            150],
           "assets/images/resized/0003/7732/37732v4-max-150x150.png"],
          [[240,
            250],
           "assets/images/resized/0003/7732/37732v4-max-250x250.png"],
          [[400,
            415],
           "assets/images/resized/0003/7732/37732v4-max-450x450.png"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "Treasurer",
    "person":
     {"first_name": "Tim",
      "last_name": "Hagan",
      "permalink": "tim-hagan",
      "image": null}},
   {"is_past": false,
    "title": "At-Large",
    "person":
     {"first_name": "William",
      "last_name": "Redpath",
      "permalink": "william-redpath",
      "image": null}},
   {"is_past": false,
    "title": "At-Large",
    "person":
     {"first_name": "Arvin",
      "last_name": "Vohra",
      "permalink": "arvin-vohra",
      "image": null}},
   {"is_past": false,
    "title": "Libertarian National Committee Member",
    "person":
     {"first_name": "Norm",
      "last_name": "Olsen",
      "permalink": "norm-olsen",
      "image": null}},
   {"is_past": false,
    "title": "Libertarian National Committee Member",
    "person":
     {"first_name": "Jillian",
      "last_name": "A. Mack",
      "permalink": "jillian-a-mack",
      "image": null}},
   {"is_past": false,
    "title": "Secretary",
    "person":
     {"first_name": "Ruth",
      "last_name": "Bennett",
      "permalink": "ruth-bennett",
      "image": null}},
   {"is_past": false,
    "title": "Libertarian National Committee Member",
    "person":
     {"first_name": "Dr.",
      "last_name": "James Lark",
      "permalink": "dr-james-lark",
      "image": null}},
   {"is_past": false,
    "title": "At-Large",
    "person":
     {"first_name": "Michael",
      "last_name": "Cloud",
      "permalink": "michael-cloud",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Technology and Fundraising",
    "is_past": false,
    "provider":
     {"name": "Big L Solutions",
      "permalink": "big-l-solutions",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "National Headquarters",
    "address1": "2600 Virginia Ave, N.W.",
    "address2": "Suite 200 ",
    "zip_code": "  20037 ",
    "city": "Washington D.C.",
    "state_code": "DC",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}