{"name": "Lifetime Memory Products, Inc",
 "permalink": "lifetime-memory-products-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/lifetime-memory-products-inc",
 "homepage_url": "http://lifetimememory.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Lifetimememory",
 "category_code": "hardware",
 "number_of_employees": 40,
 "founded_year": 1988,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "pc133, pc2100, pc2700, pc3200, pc4200, pc5300, pc6400, ddr, ddr1, ddr2, dimm, sodimm, rambus, sd, secure-digital, mini-sd, micro-sd, usb-flash, 128mb, 256mb, 512mb, 1gb, 4gb, 8gb, 16gb, compact-flash, printer-memory",
 "alias_list": "",
 "email_address": "sales@Lifetime.com",
 "phone_number": "800-233-6233",
 "description": "Memory Manufacturer",
 "created_at": "Wed Mar 25 15:32:17 UTC 2009",
 "updated_at": "Mon Apr 08 20:31:09 UTC 2013",
 "overview": "\u003Cp\u003ELifetime Memory Products has been in business since 1981. As a contract design and manufacturing firm, Lifetime produces a comprehensive retail product line of computer memory upgrades. The company\u0026#8217;s business plan calls for the production of innovative, premium quality products at aggressive price points.\u003C/p\u003E\n\n\u003Cp\u003ETo maintain competitive pricing, Lifetime develops and utilizes the latest manufacturing, testing and distribution systems. Lifetime constantly strives to maintain both the lowest cost-per-order figure in the industry while obtaining the lowest raw materials costs available worldwide. Manufacturing efficiencies begin at the design stage, where initial concepts are developed with economy in mind. Marketing efficiencies are maintained through an emphasis on minimizing consumer advertising and packaging and maximizing our contacts with our customers via direct telesales and dedicated account management by our sales technicians.\u003C/p\u003E\n\n\u003Cp\u003ELifetime\u0026#8217;s production facility, where all research and engineering, production and shipping functions are performed, is located in a state-of-the-art 16,000 square foot building in Irvine, California, strategically located one quarter-mile from Orange County Airport.\u003C/p\u003E\n\n\u003Cp\u003EWhy you should buy your next memory upgrade from Lifetime?\u003C/p\u003E\n\n\u003Cp\u003EPRICING. Count on Lifetime to deliver the prices you need to increase your business and save you money. Dealing directly with a manufacturer such as Lifetime removes the unnecessary costs of marketing and handling by a reseller and adds the flexibility of custom or short notice orders to meet specific industry or company demands. Lifetime welcomes the opportunity to discuss special pricing for large orders.\u003C/p\u003E\n\n\u003Cp\u003EQUALITY. Lifetime uses only the highest quality, performance tested chips such as Micron, NEC, and Samsung. Lifetime tests every single chip on every single board. When you purchase products manufactured by Lifetime, you are dealing with a company that has a world-wide brand name recognized for high quality. Your customers will ask for Lifetime Memory Products by name.\u003C/p\u003E\n\n\u003Cp\u003EAVAILABILITY. You can count on Lifetime Memory Products being first to market with its products. Lifetime manufactures a full line of memory products, which includes the latest technology ultra-high capacity SDRAM DIMMS, Synchronous graphics VRAM modules, 72 Pin EDO, Fast Page Mode (FPM), and Parity SIMMs, as well as older 30 Pin Parity and Non-Parity SIMMs and other legacy product. Lifetime\u0026#8217;s large inventory means orders promptly ship upon receipt of a purchase order.\u003C/p\u003E\n\n\u003Cp\u003ESERVICE. Lifetime guarantees all its products to meet or exceed manufacturer specifications for fit, form and function. Lifetime\u0026#8217;s products come with a lifetime warranty. Should any items need to be returned, just email or fax the details. We will promptly send an RMA (return materials authorization) number along with shipping instructions. We will get you the replacements within two days of receiving the defective modules.\u003C/p\u003E\n\n\u003Cp\u003EAPPLE FOCUS. Lifetime offers a complete line of upgrades for every computer, and specializes in the design and manufacture of devices for the Apple Macintosh line of computers. Our relationship with Apple results in better designed and better engineered consumer oriented products. Unlike some of our competitors who may rely upon cloning or reverse engineering as a way to bring products to market, Lifetime handles its products from the design stage through manufacturing, testing, packaging, and delivery to you. Long before Apple introduces new systems, Lifetime engineers are collaborating with Apple engineers. There is a two-way flow of information; prototypes are exchanged and fully tested in development and production machines. This interactive process ensures that Lifetime products are designed in ways and made of materials of which imitators may not even aware of or concerned with. It ensures that the quality you expect from Apple products is maintained in the upgrades that you purchase from Lifetime.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[100,
       40],
      "assets/images/resized/0003/9271/39271v3-max-150x150.png"],
     [[100,
       40],
      "assets/images/resized/0003/9271/39271v3-max-250x250.png"],
     [[100,
       40],
      "assets/images/resized/0003/9271/39271v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "PC133 DIMM / SODIMM",
    "permalink": "pc133-dimm-sodimm",
    "image": null},
   {"name": "PC2100 DIMM / SODIMM",
    "permalink": "pc2100-dimm-sodimm",
    "image": null},
   {"name": "PC2700 DIMM / SODIMM",
    "permalink": "pc2700-dimm-sodimm",
    "image": null},
   {"name": "PC3200 DIMM / SODIMM",
    "permalink": "pc3200-dimm-sodimm",
    "image": null},
   {"name": "PC4200 DIMM / SODIMM",
    "permalink": "pc4200-dimm-sodimm",
    "image": null},
   {"name": "PC5300 DIMM / SODIMM",
    "permalink": "pc5300-dimm-sodimm",
    "image": null},
   {"name": "PC6400  DIMM / SODIMM",
    "permalink": "pc6400-dimm-sodimm",
    "image": null},
   {"name": "PC8500 DIMM / SODIMM",
    "permalink": "pc8500-dimm-sodimm",
    "image": null},
   {"name": "PC10600 DIMM / SODIMM",
    "permalink": "pc10600-dimm-sodimm",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "Crucial",
      "permalink": "crucial",
      "image": null}},
   {"competitor":
     {"name": "Kingston",
      "permalink": "kingston",
      "image":
       {"available_sizes":
         [[[150,
            44],
           "assets/images/resized/0009/0029/90029v2-max-150x150.png"],
          [[250,
            73],
           "assets/images/resized/0009/0029/90029v2-max-250x250.png"],
          [[450,
            132],
           "assets/images/resized/0009/0029/90029v2-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "2505 Da Vinci",
    "address2": "",
    "zip_code": " 92614-5894",
    "city": "Irvine",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 33.684202,
    "longitude": -117.841742}],
 "milestones":
  [{"description": "murdering asshole still runs lifetime",
    "stoned_year": 2011,
    "stoned_month": 11,
    "stoned_day": 28,
    "source_url": "http://he.com",
    "source_text": null,
    "source_description": "he",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Lifetime Memory Products, Inc",
      "permalink": "lifetime-memory-products-inc"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        100],
       "assets/images/resized/0003/9270/39270v2-max-150x150.jpg"],
      [[250,
        166],
       "assets/images/resized/0003/9270/39270v2-max-250x250.jpg"],
      [[450,
        300],
       "assets/images/resized/0003/9270/39270v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}