{"name": "Life Style",
 "permalink": "life-style",
 "crunchbase_url": "http://www.crunchbase.com/company/life-style",
 "homepage_url": "http://www.indiamart.com/life-style/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "life-style@tradepassport.org",
 "phone_number": "9873358088",
 "description": "Wholesaler and Supplier",
 "created_at": "Fri Apr 05 14:05:27 UTC 2013",
 "updated_at": "Fri Apr 05 14:05:31 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1998, at Delhi (India), “Life Style”, has gained recognition as the noteworthy Distributor, Wholesaler and Supplier of a comprehensive assortment of Towels, Bed Sheets, Blankets, Bed Covers and other Home Accessories. Our offered collection is extremely appreciated by our valuable clients for its diverse features like durability, beautiful designs, alluring color combinations, skin-friendliness and neat stitching. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWith rich vendor base, we are able to fulfill clients\u0026#8217; various requirements in a timely manner, irrespective of the quantity ordered. Our vendors manufacture these products using quality assured material which ensures their conformity with the international principles of the industry. Moreover, our vendors test the entire range on definite parameters so that only quality products are manufactured by them.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe are a quality centric organization and ensure that the offered Towels, Bed Sheets, Blankets, Bed Covers and other Home Accessories are unmatched in quality. Trust, integrity, loyalty, vigilance and integrity being our core values that help us to stand amongst the reputed organizations in the industry.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nCustomer satisfaction is the main motto of our organization. We offer finest of the product range to our customers that are known for their superior quality, long life and high comfort. Their efforts are aimed at rendering finest quality products that safely reaches major markets across the nation.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe direct all our efforts towards acquiring a strong client base across the globe by providing an assorted range of Towels, Bed Sheets, Blankets, Bed Covers and other Home Accessories. The products offered by us can also be availed by clients from us in various designs, prints, colors, etc. as per the variegated needs of clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8742/248742v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8742/248742v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8742/248742v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}