{"name": "Liftshare.com ltd",
 "permalink": "liftshare-com-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/liftshare-com-ltd",
 "homepage_url": "http://Www.liftshare.com",
 "blog_url": "http://Www.liftshare.com/news",
 "blog_feed_url": "",
 "twitter_username": "Aliclabburn",
 "category_code": "web",
 "number_of_employees": 18,
 "founded_year": 1998,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "Ali@liftshare.com",
 "phone_number": "",
 "description": "Innovative carpooling social enterprise",
 "created_at": "Thu Feb 17 20:21:40 UTC 2011",
 "updated_at": "Sat Feb 19 02:14:39 UTC 2011",
 "overview": "\u003Cp\u003Eliftshare is a social enterprise that helps individuals to travel more sustainably by sharing their journey. Our online network matches people with similar journeys so they can travel better together - saving money, cutting their carbon footprint, having fun and making the world a better place.\u003C/p\u003E\n\n\u003Cp\u003Eliftshare funds itself by helping businesses and communities in the UK and around the world to set up their own online journey-matching tools to encourage local car-sharing and more sustainable mobility. Our dedicated team then provides ongoing support services to help them market and monitor their scheme effectively.\nInternationally recognised as leaders in our field, we are at the forefront of technical capability, with 100,000 web users every month. Our friendly and professional team works with hundreds of private, public and voluntary sector organisations: small companies and multi-nationals, business parks, government organisations, local authorities, NHS trusts, event attractions and educational establishments.\u003C/p\u003E\n\n\u003Cp\u003EAs a social enterprise, we have always lobbied decision-makers to raise awareness of the benefits of car-sharing. We also participate in both national and international transport industry functions, trade shows, conferences and workshops. Interacting with the people in the industry keeps us market-driven and customer focused.\nBefore we were founded, organised journey-sharing was almost unheard of in the UK. Now, through our continuous campaigning at both grass root and government levels, the concept of a UK journey-sharing database is a reality and its significant membership levels continue to grow steadily.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.growingbusiness.co.uk/ali-clabburn-liftshare.html",
    "title": ""}]}