{"name": "Likes Fans Exchange",
 "permalink": "likes-fans-exchange",
 "crunchbase_url": "http://www.crunchbase.com/company/likes-fans-exchange",
 "homepage_url": "http://likesfansexchange.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 1992,
 "founded_month": 4,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "free, cheap, increase, get, fb, facebook, likes, fans, twitter, followers, youtube, subscribers, views-fast",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Easily Increase Facebook FB likes free. ",
 "created_at": "Wed Jan 02 14:37:02 UTC 2013",
 "updated_at": "Thu May 16 03:30:25 UTC 2013",
 "overview": "\u003Cp\u003EGet Free Facebook likes and twitter followers easily \u0026amp; fast, new exchange website.\u003C/p\u003E\n\n\u003Cp\u003EIf you create a fan page on Facebook, will fans automatically come? No, the fans won’t magically appear. People must be tempted to like your fan page but it will be time consuming and stressful task. What should you do then?\nWhat if I tell you they can magically appear with a new website? Do you want to get thousands of Facebook fans free and quick? Do you want yourself to become a social spotlight and lift your brand recognition?\nWith LikesFansExchange you can get thousands of Facebook fans fast, safe, simple and free.\u003C/p\u003E\n\n\u003Cp\u003EWhat Is LikesFansExchange?\nLikesFansExchange is social media exchange website which allows users to get free Facebook likes as well as twitter followers, Youtube views, Digg followers, Google Plus ones, LinkedIn shares, Website traffic and StumbleUpon followers. LikesFansExchange is a free tool that helps you to increase your social presence.  \u003C/p\u003E\n\n\u003Cp\u003EHow does it Work?\nThe concept is LikesFansExchange is quite simple. You register for an account, add your Facebook Fan page or twitter account. You earn coins by liking other Facebook pages or doing other “free” things such as liking/viewing/following other members on social networks and pages. You can earn thousands of coins by this way.  Then you can utilize those of coins on your fan page or twitter account to gain 1000’s of Facebook fan page likes or twitter followers.\nIf you do not want to any effort and want Facebook likes then you can buy coins on LikesFansExchange.\nThe social media exchange system that LikesFansExchange have is very easy to use and only takes seconds to register and start getting Facebook likes for free!\u003C/p\u003E\n\n\u003Cp\u003ELikesFansExchange Awesome Features\n·        Earn upto as many coins as you want.\n·        You choose the number of credits per click to reward your members who like/view/follow your pages.\n·        You can choose which people should follow/like/view your Facebook fan page or twitter account\n·        You can even choose gender and country from which you would receive follow/like/views.\n·        Spend a few minutes on LikesFansExchange daily and watch your likes/follows/traffic go skyrocket.\u003C/p\u003E\n\n\u003Cp\u003ELikesFansExchange Uncompromising Policies \n·        100% Safe: LikesFansExchange abides from all social network policies and does not ask for account passwords.\n·        100% Real Traffic: LikesFansExchange send all real people to your fan page and have a strict no bot policy\n·        100% Free: LikesFansExchange do not sell followers/likes/tweets/hits.\n·        100% Secure:  LikesFansExchange will never sell/disclose your information to a third party. \n·        100% Spam Free: LikesFansExchange never send you unsolicited emails.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://m.facebook.com/profile.php?id=325468767555546\u0026refid=5\u0026ref=tn_tnmn",
    "title": ""},
   {"external_url": "http://m.facebook.com/profile.php?id=325468767555546\u0026refid=5\u0026ref=tn_tnmn",
    "title": ""}]}