{"name": "LilyMedia",
 "permalink": "lilymedia",
 "crunchbase_url": "http://www.crunchbase.com/company/lilymedia",
 "homepage_url": "http://lilymedia.cc",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "lilymedia",
 "category_code": "mobile",
 "number_of_employees": 9,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "lilymedia, kids, children, apps, tablet, smartphone, ios, android, ipad, learn, learning, education",
 "alias_list": null,
 "email_address": "info@lilymedia.cc",
 "phone_number": "",
 "description": "Educational apps for kids",
 "created_at": "Thu Dec 13 11:00:47 UTC 2012",
 "updated_at": "Wed Dec 19 07:41:31 UTC 2012",
 "overview": "\u003Cp\u003EHelping Children Discover the World Around Them!\u003C/p\u003E\n\n\u003Cp\u003ELilyMedia creates new revolutionary mobile applications that aim to introduce children to a new engaging world of learning. The first edition of the application ‘Lily and the animals’ has been specifically built to combine learning, interactive technology and engaging games to give children the essential knowledge and skills needed to develop throughout their life. LilyMedia applications are based on the Education 3.0 approach to learning which seeks to teach children outside of traditional learning environments.\u003C/p\u003E\n\n\u003Cp\u003EIn recent years, it has been proven that the use of technology greatly aids in the process of closing the gap between children who excel in academic settings and those who have fallen behind. Technology has allowed children to learn things at an early age now, which in the past could only be achieved during later years. LilyMedia uses this technology to provide a fun and engaging environment for young children to learn from. \nLilyMedia is simple in concept, but powerful in implementation. The player of each game will go on an adventure with the main character on her/his journey to complete educational activities to help her/him along the way; learning and fun has been proven by numerous studies to improve knowledge retention among students.\u003C/p\u003E\n\n\u003Cp\u003EWhile maintaining a highly engaging and fun environment, LilyMedia also helps to provide a crucial learning system. The rich learning environment contained within LilyMedia offers several benefits such as multiple opportunities for learning different languages, 4-in-1 games and innovative learning concepts.\u003C/p\u003E\n\n\u003Cp\u003EAlso, applications will contain an Administration section that will allow parents to obtain analytics about their child to discover their strengths (and identify areas that need improvement). This will allow parents to maximize their child’s learning ability.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       74],
      "assets/images/resized/0022/5195/225195v2-max-150x150.png"],
     [[250,
       124],
      "assets/images/resized/0022/5195/225195v2-max-250x250.png"],
     [[334,
       166],
      "assets/images/resized/0022/5195/225195v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Sergi",
      "last_name": "Planas",
      "permalink": "sergi-planas",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        109],
       "assets/images/resized/0022/5194/225194v2-max-150x150.png"],
      [[250,
        182],
       "assets/images/resized/0022/5194/225194v2-max-250x250.png"],
      [[450,
        328],
       "assets/images/resized/0022/5194/225194v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}