{"name": "Limra Lifts",
 "permalink": "limra-lifts",
 "crunchbase_url": "http://www.crunchbase.com/company/limra-lifts",
 "homepage_url": "http://www.indiamart.com/limralifts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 24,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "panoramic-elevators, freight-elevators, hospital-lifts",
 "alias_list": null,
 "email_address": "limralifts@tradepassport.org",
 "phone_number": "9551624725",
 "description": " supplying a best quality range of Lifts",
 "created_at": "Thu Apr 04 07:20:54 UTC 2013",
 "updated_at": "Thu Apr 04 07:20:56 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nLimra Lifts was established in the year 2008 as a partnership company and has achieved a remarkable position by manufacturing and supplying a quality approved and comprehensive range of Lifts, Elevators. These categories encompass some product such as Panoramic Elevators, Freight Elevators, Hospital Lifts many others.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a customer and quality centric organization, our prior aim is to offer excellent quality range of products and services, which are in strict conformation to the prescribed industrial standards. For this, our experts utilize modernized machines and advanced tools to develop products according to the global quality standards.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nA highly sophisticated infrastructure, which has been developed by us, plays a vital role in determining our company’s growth and development. To assure systematic operations as well as accountability, we have strategically partitioned our entire infrastructure into various departments. Every single unit is interconnected with one another and also installed with modern equipment, which ascertain to meet the comprehensive demands of clients in best possible manner and within the set time.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nOur company revered a leading name of the industry and it is just because of their capability of supplying products and services according to the actual specifications of our esteemed clientele. products offered by us are manufactured according to the stern quality monitoring standards as well as re easily available in the market. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7622/247622v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7622/247622v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7622/247622v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}