{"name": "Limuriya Coir",
 "permalink": "limuriya-coir",
 "crunchbase_url": "http://www.crunchbase.com/company/limuriya-coir",
 "homepage_url": "http://www.indiamart.com/limuriyacoir/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we-are-one-of-the-leading-organizations-manufacturing, exporting-and-supplying-a-premium-quality-range-of-coir-pith-blocks, coir-bricks",
 "alias_list": null,
 "email_address": "limuriyacoir@tradepassport.org",
 "phone_number": "",
 "description": "",
 "created_at": "Wed Apr 03 14:57:17 UTC 2013",
 "updated_at": "Wed Apr 03 19:01:15 UTC 2013",
 "overview": "\u003Cp\u003ELimuriya Coir is a sole proprietorship firm, incorporated in the year 2010. Based at Tamil Nadu, the company is involved in manufacturing, exporting and supplying a comprehensive range of Coconuts, Tender Coconuts, Coir Pith Blocks, Coir Bricks, Coir Fiber, Coir Ropes, Coir Products and Husk Chips. Products offered by us are manufactured according to the specific needs and demands of clients and are highly appreciated for being qualitative, reliable and pure. We are aware of our responsibility of creating, maintaining as well as assuring clean and safe environment, which helps us in developing Eco-friendly products. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nHighly experienced and dexterous team of professionals is working in our organization, whose endless support has assisted us in acquiring desired place in the industry. Our team performs cordially to achieve set aims and objectives of the company. Their hard work, dedication, commitment and loyalty towards firm have enabled us to establish a desired place in the industry.  \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe stake our reputation on products’ excellence, which we offer to the clients. To ascertain the quality of products, we are following strict quality policies as well as measures. Furthermore, we have developed a highly sophisticated quality control lab, where latest testing equipment and machines are installed by us. This unit is skillfully managed by our experienced professionals, who ensure the finished products are in compliance to the prescribed norms of industry. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur company is backed by an advanced infrastructural set up, where our all production and quality testing related operations are efficiently carried out. Well-outfitted with modern machines and latest technology, we are able to meet bulk orders of clients within the stipulated time period. We also possess a spacious warehouse, where we safely and systematically store our bulk consignment. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nCoir Pith Blocks\nCoir Bricks\nCoir Fiber\nCoir Ropes\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/7387/247387v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7387/247387v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7387/247387v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}