{"name": "Linenore",
 "permalink": "linenore",
 "crunchbase_url": "http://www.crunchbase.com/company/linenore",
 "homepage_url": "http://www.linenore.com",
 "blog_url": "http://www.linenore.com/blogs",
 "blog_feed_url": "",
 "twitter_username": "linenorelinen",
 "category_code": "ecommerce",
 "number_of_employees": 15,
 "founded_year": 2011,
 "founded_month": 9,
 "founded_day": 17,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "linen-shirts, buy-linen-shirt, buy-mens-clothing, linen-dress-shirt, men-linen-clothes, mens-linen-clothes",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Linen Online Store",
 "created_at": "Thu Sep 20 13:09:00 UTC 2012",
 "updated_at": "Mon Sep 24 23:38:19 UTC 2012",
 "overview": "\u003Cp\u003EAbout Linenore\u003C/p\u003E\n\n\u003Cp\u003ELinenore was started with a passion of making pure and genuine linen to fulfil the demand of this royal and luxurious cloth and to introduce it into the market and make it easily available to linen lovers. Linenore has a range of exclusive fashion clothing, home fashion and other linen accessories made of pure linen. The Fashion clothing includes affordable designer Linen cloth for men, women and kids.\u003C/p\u003E\n\n\u003Cp\u003ELinenore started as an online store in 2010 focussing India and the middle-east region to make linen clothing as a luxury fashion statement.\u003C/p\u003E\n\n\u003Cp\u003EWhy Linenore?\u003C/p\u003E\n\n\u003Cp\u003ELinenore is built with the passion of exploring the luxurious clothing of Linen. A primary asset is the quality of the fabric that gives one, comfort at its best. Our objective is to make quality linen clothing available to linen lovers.\u003C/p\u003E\n\n\u003Cp\u003EWe have purest form of linen source from European country like Belgium, Ireland and France.\u003C/p\u003E\n\n\u003Cp\u003EWe have a range of selected designer ware for men, women and kids. Our cloths are value for money and quality that one can trust.\u003C/p\u003E\n\n\u003Cp\u003EAbout Linen\u003C/p\u003E\n\n\u003Cp\u003ELinen textiles appear to be some of the oldest in the world and its history goes back many thousands of years 8000 BC.\u003C/p\u003E\n\n\u003Cp\u003E• Linen is considered as a symbol of light and purity\n• Linen is believed to be a gift of God and regarded it as sacred\n• Linen protects skin from harmful UV rays and sun allergies\n• Linen is a health fabric because it is inherently anti-bacterial\n• Linen is truly comfortable and easy to wear in every season\u003C/p\u003E\n\n\u003Cp\u003ELinen is usually an expensive textile, and is produced in relatively small quantities. It is a natural fibre which allows the skin to breathe and the air to circulate in the heat, as well as gently absorbing the body´s perspiration. This also makes linen the ideal for relaxed loungewear clothing option. The paler the colour, the cooler this linen clothing feels, with the ultimate being crisp White\u003C/p\u003E\n\n\u003Cp\u003EFlax, from which Linen fabric is derived, is mainly producers in Ireland, Italy and Belgium, and also in countries including Poland, Austria, Belgium, France, and Germany.\u003C/p\u003E\n\n\u003Cp\u003ELinen is truly comfortable and easy to wear in every season. It is insulating in winter and breathable in summer, due to its thermoregulatory properties.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0021/2224/212224v2-max-150x150.png"],
     [[215,
       62],
      "assets/images/resized/0021/2224/212224v2-max-250x250.png"],
     [[215,
       62],
      "assets/images/resized/0021/2224/212224v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "VP - Operations",
    "person":
     {"first_name": "Mansur",
      "last_name": "shaikh",
      "permalink": "mansur-shaikh",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Linenore Clothing",
    "address1": "Royal Palms",
    "address2": "Aarey Colony",
    "zip_code": "400065",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}