{"name": "Line Pitch",
 "permalink": "line-pitch",
 "crunchbase_url": "http://www.crunchbase.com/company/line-pitch",
 "homepage_url": "http://linepitch.com",
 "blog_url": "",
 "blog_feed_url": "http://linepitch.com/activity/feed/",
 "twitter_username": "linepitch",
 "category_code": "other",
 "number_of_employees": 1,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "news, world, business, local, fashion, entertainment, us, politics, life, health, sports, learning, education",
 "alias_list": null,
 "email_address": "info@linepitch.com",
 "phone_number": "",
 "description": "Current News Affairs",
 "created_at": "Mon Jun 03 19:59:45 UTC 2013",
 "updated_at": "Tue Jun 04 00:29:13 UTC 2013",
 "overview": "\u003Cp\u003ELinepitch.com is a global invitation to help shape what other media outlets do not  cover and a place where people across the world share stories of the events happening near them and personal opinions about issues that miss the headlines. We want to be the every day Line Pitch community that helps to tell the world which reports should become part of the global news coverage on mainstream media.\u003C/p\u003E\n\n\u003Cp\u003EFor this to work, we all need to operate under a few guiding principles:\u003C/p\u003E\n\n\u003Cp\u003EWho’s invited?\u003C/p\u003E\n\n\u003Cp\u003EYou must be at least 13 years old to participate.\u003C/p\u003E\n\n\u003Cp\u003EWhat kind of content is welcome here?\nLinepitch.com is a place to post your news: great stories of events near you, or your own take on issues making headlines. News comes in all shapes and sizes, and the idea here at Line Pitch is that the community will shape what counts as news, but there are a few things every LinePitch should have in common:\u003C/p\u003E\n\n\u003Cp\u003EIt’s yours. Your Line Pitch should be made up of your own words and images, or those that you have the rights to use.\nIt’s true. Line Pitch should be about real events, or real opinions on events. It’s not news if you make it up.\nIt’s new and interesting. The best Linepitch.com teach us something new or start a fresh discussion.\u003C/p\u003E\n\n\u003Cp\u003EWhat isn’t welcome?\u003C/p\u003E\n\n\u003Cp\u003EContent that infringes someone’s copyright.\nContent that you know to be untrue.\nSpam, or repeated uploads that flood the site with duplicate versions of the same or similar content.\nPornography/sexually explicit content.\nObscene/lewd content.\nContent that advocates violent behavior.\nContent that contains violent images of killing or physical abuse that appear to have been captured solely, or principally, for exploitive, prurient or gratuitous purposes.\nContent that advocates dangerous, illegal or predatory acts or poses a reasonable threat to personal or public safety.\nHate Speech/Racially or ethnically offensive content.\u003C/p\u003E\n\n\u003Cp\u003EWhat happens if you post something that violates the Community Guidelines?\nOur Admins will review it and take it down from the site. If you post more than three pieces of material that need to be removed from the site, your account will be disabled.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Publisher",
    "person":
     {"first_name": "Kiema",
      "last_name": "Kimani",
      "permalink": "kiema-kimani",
      "image": null}},
   {"is_past": false,
    "title": "Editor",
    "person":
     {"first_name": "Grab",
      "last_name": "Press",
      "permalink": "grab-press",
      "image": null}},
   {"is_past": false,
    "title": "Podcaster",
    "person":
     {"first_name": "Bernard",
      "last_name": "Cole",
      "permalink": "bernard-cole",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "ireport.com",
      "permalink": "ireport-com",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}