{"name": "Lionesse Beauty Bar",
 "permalink": "lionesse-beauty-bar",
 "crunchbase_url": "http://www.crunchbase.com/company/lionesse-beauty-bar",
 "homepage_url": "http://www.lionessebeautybar.org/index.html",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "LionesseBB",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "lionesse, lionesse-beauty-bar, beauty-products",
 "alias_list": null,
 "email_address": "lionessebeautybar@yahoo.com",
 "phone_number": "",
 "description": "beauty treatments and products",
 "created_at": "Sun Mar 24 09:32:35 UTC 2013",
 "updated_at": "Sun Mar 24 09:32:41 UTC 2013",
 "overview": "\u003Cp\u003EWe have a very simple philosophy. When you visit us at Lionesse Beauty Bar, you will be spoilt and be treated like a princess, because this is what you deserve.\nOur mission is to carry out our business in a professional, caring and relaxed atmosphere whilst maintaining a premier service and knowing that your experience has been a special one.\nBecause you are important to us, we will never compromise on quality; so we use only the highest quality beauty products.\nVibes\nAs soon as you step through the doors of the elegant and swanky Lionesse Beauty Bar you will experience its unique atmosphere. With DJ bar and refreshments you will feel a sense of wellbeing and calmness.\nWe transport you to a world of beauty where your satisfaction and total contentment are essential.\u003C/p\u003E\n\n\u003Cp\u003EProfessional Service\nAt the Lionesse Beauty Bar, our teams of highly trained professional beauty experts, hair stylists, makeup artists and estheticians will listen to what you want and advise and recommend what options are best for you.\nOur hair stylists will let you select the style you want; but will also recommend from a range of hairstyles from all over the world as well as letting you choose the hairstyle of your favorite celebrities.\nYou will receive either a full or part makeover by one of our skilled beauticians, who will use our high quality, yet competitively priced beauty products on your skin.  If you purchase any of our beauty products, your makeover is complimentary. \nLionesse Beauty Bar has a large choice of beauty products for you to try and purchase and our licensed beauty experts will recommend what they believe is suitable for your skin type.\u003Cbr/\u003E\nWe also supply a range of hair tools, including top of the range professional straightening irons.  Our 1.5\u0026#8221; Red Tourmaline and 2\u0026#8221; Red Tourmaline high-tech straightening irons use advanced infrared technology to prevent any harm to your hair as well as protecting colored hair.\u003C/p\u003E\n\n\u003Cp\u003ECustomer Experience\nA visit to the Lionesse Beauty Bar is your chance to experience and enjoy culture and style while you shop and will guarantee that the time you spend in our company will make this day exceptional.\nSchedule an appointment; but if you are passing and fancy a spontaneous makeover we will be thrilled to welcome you with our full “on the go” beauty service which includes hair styling and makeup.\u003C/p\u003E\n\n\u003Cp\u003EMembership\nBecause your visit to the Lionesse Beauty Bar will be special, we know that you will want to return as often as you can, so we have some discounted monthly memberships, which will allow you to visit a few times each month and to buy our outstanding beauty products at reduced prices. \nThe Lionesse Beauty Bar hosts parties, so if you want to come along with a group of your girlfriends, either for a special event or just to chill, we offer a number of reasonably priced packages.\nTo hear all of our latest news and to be first to know about our great offers and discounts, remember to Like our Facebook page.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       131],
      "assets/images/resized/0024/5060/245060v2-max-150x150.jpg"],
     [[160,
       140],
      "assets/images/resized/0024/5060/245060v2-max-250x250.jpg"],
     [[160,
       140],
      "assets/images/resized/0024/5060/245060v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://twitter.com/LionesseBB",
    "title": "Lionesse Beauty Bar on Twitter"},
   {"external_url": "http://www.lionessebeautybar.org/index.html",
    "title": "Welcome to Lionesse Beauty Bar"},
   {"external_url": "http://www.lionesse.net/",
    "title": "What is Lionesse"}]}