{"name": "LiveHelpNow",
 "permalink": "livehelpnow",
 "crunchbase_url": "http://www.crunchbase.com/company/livehelpnow",
 "homepage_url": "http://www.livehelpnow.net",
 "blog_url": "http://www.livehelpnow.net/n/blog/default.aspx",
 "blog_feed_url": "http://www.livehelpnow.net/n/systems/rss.aspx?pg=120\u0026c=en-US",
 "twitter_username": "livehelpnow",
 "category_code": "ecommerce",
 "number_of_employees": 18,
 "founded_year": 2003,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "help-desk-software, ecommerce-solutions, customer-service-software, live-chat-software, website-chat, issue-tracking, knowledge-base-management",
 "alias_list": null,
 "email_address": "communicator@livehelpnow.com",
 "phone_number": "877-548-3001",
 "description": "Help Desk Software",
 "created_at": "Fri Oct 01 14:04:23 UTC 2010",
 "updated_at": "Fri Oct 08 00:20:57 UTC 2010",
 "overview": "\u003Cp\u003EAbout LiveHelpNow\u003C/p\u003E\n\n\u003Cp\u003ELiveHelpNow is focused on providing solutions to online commerce.\u003C/p\u003E\n\n\u003Cp\u003EThese solutions include web based tools that enable a small business to provide the same or better service than their often bigger and better financed competitors.\u003C/p\u003E\n\n\u003Cp\u003EWe know the small business market, have spent years managing sales and customer service operations and have applied that to LiveHelpNow suite of products.\u003C/p\u003E\n\n\u003Cp\u003EWe have designed, priced and delivered to ensure your business grows by using LiveHelpNow. \u003C/p\u003E\n\n\u003Cp\u003ESolutions\nYour Website is the primary face of your business.\nEvery day visitors arrive to your website.\n\u0026#8230;BUT\u0026#8230;\nHow many of them become customers?\nThis in large depends on how quickly and effectively you can assist them with any questions they might have about your service or product.\nLiveHelpNow Help Desk Software has you covered with its powerful line of online and offline products and services.\u003C/p\u003E\n\n\u003Cp\u003ELive Chat System\nExtremely Affordable, award-winning live chat software\u003C/p\u003E\n\n\u003Cp\u003EHelp your website visitors when they are lost or have questions, stand out in the competitive marketplace by providing superior customer service with latest Proactive Live Chat technologies powered by LiveHelpNow\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Increase sales\n* Improve customer loyalty\n* Lower operating costs\n* Improve conversion dramatically\n* Only $9 per month\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ETicket System\nOrganize and streamline all your email communications into one easy to use email management system\u003C/p\u003E\n\n\u003Cp\u003EManage your email communications in style with easy to use interface and fully customizable business rules.\u003C/p\u003E\n\n\u003Cp\u003EUse Ticket System on your web site for everything from bug tracking and customer support to project management and to-do lists.\u003C/p\u003E\n\n\u003Cp\u003EEasily convert resolved tickets to knowledge base articles.\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Organize and manage your company email communications\n* Easily create trouble tickets\n* Manage to-do lists\n* Track bugs\n* Powerful ticket notification system built into the Operator Console\n* Only $9 per month\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ESupport System\nPowerful and versatile knowledge management system\u003C/p\u003E\n\n\u003Cp\u003ELiveHelpNow Support System (Knowledge management suite) helps your company share information with your customers or employees on company public website or intranet with a professional-grade seachable, customizable and brandable knowledge base plarform, substantially reducing the number of customer support inquiries, improving staff productivity and dramatically reducing time your staff or customers spend now searching for information across multiple systems such as poorly organized websites, shared folders and paper documents.\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Streamline and organize your company knowledge and document sharing\n* Keep your company knowledge current and valid\n* Analyze your company knowledge base with superior data mining tools\n* Decrease customer support inquiries and improve customer loyalty\n* We guarantee that even small business will look like enterprise with LiveHelpNow support system implemented on the website\n* Only $9 per month\n\u003C/code\u003E\u003C/pre\u003E",
 "image":
  {"available_sizes":
    [[[150,
       66],
      "assets/images/resized/0010/3845/103845v2-max-150x150.png"],
     [[176,
       78],
      "assets/images/resized/0010/3845/103845v2-max-250x250.png"],
     [[176,
       78],
      "assets/images/resized/0010/3845/103845v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "603 County Line",
    "address2": "",
    "zip_code": "19006",
    "city": "Huntingdon Valley",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}