{"name": "Living Planit Pty",
 "permalink": "living-planit-pty",
 "crunchbase_url": "http://www.crunchbase.com/company/living-planit-pty",
 "homepage_url": "http://www.livingplanit.com.au",
 "blog_url": "http://www.livingplanit.com.au/blog",
 "blog_feed_url": "",
 "twitter_username": "LivingPlanit",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2001,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "project-management-training-australia, diploma, certificate-iv, portfolio-management, program-management, project-management, gantt-chart, tafe, project-management-coaching, on-line-assessment-project-management, sydney, melbourne, brisbane, canberra, per",
 "alias_list": null,
 "email_address": "kayla.chakouch@livingplanit.com.au",
 "phone_number": "0292333233",
 "description": "Project Management Training",
 "created_at": "Thu Sep 16 01:52:38 UTC 2010",
 "updated_at": "Thu Sep 23 03:14:54 UTC 2010",
 "overview": "\u003Cp\u003ELiving Planit is a project management consultancy specialising in training and development. Using a range of leading edge training and assessment products, we provide individuals with the knowledge and skills required to effectively manage their projects. We also help organisations across Australia, New Zealand and worldwide to improve project management maturity and capability. \u003C/p\u003E\n\n\u003Cp\u003EBased in the Sydney CBD, we develop and deliver a range of training programs targeting all levels of project management, from project team members through to project managers, program managers and portfolio directors. We provide diagnostic assessments to measure individual competency and organisational capability in project management. This enables gap analysis and targeted professional development to take place. Our Portfolio Assessment enables experienced project practitioners to get qualified and certified without attending any unnecessary training.\u003C/p\u003E\n\n\u003Cp\u003ELiving Planit is a respected market leader in portfolio, program and project management with a proven track record for delivering high quality, customer focused learning and development services. We regularly update all of our products to integrate the latest research, industry trends and best practice. Our delivery agents are project management veterans who are qualified and experienced in delivering training and assessment programs to commercial and government organisations across the defence, banking, IT, health, community and transport industries.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Lesley",
      "last_name": "Bentley",
      "permalink": "lesley-bentley",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Diploma of Project Management",
    "is_past": false,
    "provider":
     {"name": "TAFE - Hunter",
      "permalink": "tafe-hunter",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "LP Office",
    "address1": "Suite 1802, 109 Pitt Street",
    "address2": "",
    "zip_code": "2000",
    "city": "Sydney",
    "state_code": null,
    "country_code": "AUS",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.livingplanit.com.au",
    "title": "Official Website"}]}