{"name": "LM Investment Management",
 "permalink": "lm-investment-management-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/lm-investment-management-limited",
 "homepage_url": "http://www.lmaustralia.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 1993,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "investments, investment-management, fund-management",
 "alias_list": "",
 "email_address": "mail@LMaustralia.com",
 "phone_number": "+61 7 5584 4500",
 "description": "A privately owned fund manager.",
 "created_at": "Tue Nov 27 06:41:40 UTC 2012",
 "updated_at": "Sun Dec 02 02:35:12 UTC 2012",
 "overview": "\u003Cp\u003EOriginally founded as Law Mortgage Management in 1993, Lm Investment Management Ltd has grown to be a company that offers financial solutions to a variety of consumers. Lm emphasizes their culture of strong ethics and maintains a commitment to compliance within the market.\nNow the company is a major organization, settling transactions across the residential, commercial, aged care, industrial, retail and construction property sectors. In the past fourteen years these transactions have totaled over three billion AUD, a number that is only expected to grow. The company already has connections to a vast number of international markets, and is looking to further that expansion, offering niche Australian investment products to the world market. \nLM offers its services to a global consumer based from its headquarters in Australia, where it is under the ordinance of the Australian Securities and Investments Commission (ACIS) and where it is monitored as a Responsible Entity and functions as an Australian Financial Services Licensee. The company is entirely Australian owned and managed, with offices ranging from Sydney to London and Toronto.\nLM is recognized as a professional lending institution through both the business and the property sectors, with additional recognition in specialist lending. Their in house property asset management team prides itself on its depth and knowledge, as well as its collaborative and proactive approach to asset selection and management. This has led to repeat business not only from Australian property companies but from several multinational entities.\u003Cbr/\u003E\nThe business practices employed by LM speak to the virtues which were put in practice when founded, and remain a value of utmost priority. Their strong code of ethics and their desire to empathize with their customers has driven them forward remains a cornerstone in their success. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0022/2466/222466v2-max-150x150.jpg"],
     [[250,
       153],
      "assets/images/resized/0022/2466/222466v2-max-250x250.jpg"],
     [[315,
       193],
      "assets/images/resized/0022/2466/222466v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Office",
    "address1": "Level 4",
    "address2": "9 Beach Road",
    "zip_code": "4217",
    "city": "Surfers Paradise",
    "state_code": null,
    "country_code": "AUS",
    "latitude": null,
    "longitude": null},
   {"description": "Postal",
    "address1": "PO Box 485",
    "address2": "",
    "zip_code": "4217",
    "city": "Surfer",
    "state_code": null,
    "country_code": "AUS",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}