{"name": "Local-Insights",
 "permalink": "local-insights",
 "crunchbase_url": "http://www.crunchbase.com/company/local-insights",
 "homepage_url": "http://www.Local-Insights.com",
 "blog_url": "http://www.Local-Insights.com/blog",
 "blog_feed_url": "",
 "twitter_username": "Eddie_Godshalk",
 "category_code": "software",
 "number_of_employees": 4,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "location-analytics, real-estate-forecast, real-estate-software",
 "alias_list": null,
 "email_address": "eddie@Local-Insights.com",
 "phone_number": "4082567765",
 "description": "Local intelligence and predictive analyt",
 "created_at": "Fri Feb 15 06:59:49 UTC 2013",
 "updated_at": "Tue Feb 19 21:15:49 UTC 2013",
 "overview": "\u003Cp\u003ELocal-Insights is the only online geography-based analysis software that delivers real time market intelligence for home buyers, real estate brokers and investors.  Our patent-pending technology delivers clear analysis in easy-to-read heat-coded maps and reports giving the subscriber the most accurate and up-to-date information about the factors that affect their local market and ultimately their investment purchases.  Our web platform is scalable with advanced forecasting tools to meet the needs of corporate buyers, city planners, retailers and direct marketers. \u003C/p\u003E\n\n\u003Cp\u003ESolution - Product and Specifications\nLocal-Insights expands the data available to home buyers and  investors, by integrating little-known public and private datasets to provide the user with a detailed analysis about which local markets are growing or declining by aggregating demographic data at the Block, Tract, or Zip Code level such as crime rates, changes in income, migration and the number of area vacancies, so home buyers and investors can fully understand and evaluate their local market risks.\u003C/p\u003E\n\n\u003Cp\u003ELocal-Insights delivers this information in a visual, easy to understand format that has never been available until now.  Our software includes a highly accurate 24-month predictive valuation model that allows larger users such as national real estate brokers, banks, direct marketers and commercial builders to accurately forecast market changes that may influence their investment.  Our predictive model applies proven GIS (Geographic Information System), hedonic regression, and hyper-local analytics to deliver the only 24-month local predictive model with higher than 95% accuracy on the market today.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       48],
      "assets/images/resized/0023/6096/236096v2-max-150x150.jpg"],
     [[250,
       81],
      "assets/images/resized/0023/6096/236096v2-max-250x250.jpg"],
     [[450,
       146],
      "assets/images/resized/0023/6096/236096v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}