{"name": "Local Seo and Internet Marketing",
 "permalink": "local-seo-and-internet-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/local-seo-and-internet-marketing",
 "homepage_url": "http://www.bizwizzz.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 6,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "local-business-marketing-in-los-angeles, local-marketing-in-los-angeles, web-marketing-in-los-angeles, seo-in-los-angeles, google-map-optimization-los-angeles, google-map-seo-los-angeles, map-seo-los-angeles",
 "alias_list": "",
 "email_address": "info@bizwizzz.com",
 "phone_number": "855-269-4999",
 "description": "",
 "created_at": "Thu Feb 03 07:27:36 UTC 2011",
 "updated_at": "Thu Feb 03 07:34:32 UTC 2011",
 "overview": "\u003Cp\u003EBizWizzz is a Company that helps you with development, integration and marketing implementation of web solutions for your business. We promote your business of medium size and large using the latest methods and techniques for advertising, management, development and SEO marketing.\nBizWizzz team consists exclusively of IT professionals in web development, and thus can provide an exceptional level of quality and customer satisfaction.\nFinal integration of the project is done under the supervision of production manager (Project Integration and Quality Assurance) and quality is verified by using dedicated testing department procedures and professional reports.\nWe offer 360 Â° online services that include: group SEM services, website optimization (SEO) campaigns, sponsored links (SEA), interactive web studio, performance-based marketing, maps, digital marketing advice and technical auditing. Guarantee first page on Google in 6 weeks!\nWe are glad to be here over a marketing campaign that will make your business more and more visible on the Internet, hence more easily found by a target audience. Our goal is to propose seo services adapted to your business so that your revenue can increase.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       77],
      "assets/images/resized/0012/0264/120264v2-max-150x150.png"],
     [[250,
       128],
      "assets/images/resized/0012/0264/120264v2-max-250x250.png"],
     [[261,
       134],
      "assets/images/resized/0012/0264/120264v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}