{"name": "Locata Corporation",
 "permalink": "locata-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/locata-corporation",
 "homepage_url": "http://www.locatacorp.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 37,
 "founded_year": 1997,
 "founded_month": 3,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gps, lbs, positioning, automation, indoor-positioning",
 "alias_list": "",
 "email_address": "enquiry@locatacorp.com",
 "phone_number": "+61-2-6126-5700",
 "description": "Terrestrial GPS",
 "created_at": "Sat Mar 26 06:05:34 UTC 2011",
 "updated_at": "Sun Jul 15 10:23:54 UTC 2012",
 "overview": "\u003Cp\u003ELocata Corporation has invented ground-breaking new positioning technology.\u003C/p\u003E\n\n\u003Cp\u003ELocata can fully replicate GPS in any size “local” area - inside a warehouse, around an airport, across a campus, over an entire city, etc - \u003Cem\u003Ewithout\u003C/em\u003E needing satellites or the massively complex infrastructure required by nations to put systems in space.  \u003C/p\u003E\n\n\u003Cp\u003EThis is being hailed as a game-changing breakthrough and Locata is the \u003Cem\u003Eonly\u003C/em\u003E technology on earth that can do it.\u003C/p\u003E\n\n\u003Cp\u003EEmerging from stealth-mode development in late 2011, Locata has now been shown to deliver incredibly accurate, reliable positioning in the myriad environments where GPS is either flaky or completely unavailable for modern apps. Locata calls this \u0026#8220;Your Own GPS\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003EA network of terrestrially-based \u003Cstrong\u003ELocataLite\u003C/strong\u003E beacons transmits proprietary signals which autonomously create a positioning network called a \u003Cstrong\u003ELocataNet\u003C/strong\u003E. This network can operate in tight combination with GPS \u003Cem\u003Eor be totally independent of GPS,\u003C/em\u003E but critically – the position information delivered by the Locata receiver is \u003Cem\u003Eexactly\u003C/em\u003E the same as that provided by a GPS receiver. In other words – Locata’s local network delivers everything the GPS does, except the “G”. This allows a LocataNet to powerfully augment – \u003Cem\u003Eor completely replace\u003C/em\u003E – GPS in any given area. Early adopters of Locata technology include the military, mining, construction and aviation markets. In early 2013 Locata is scheduled to release a breakthrough cm-level indoor positioning system which will revolutionize machine and forklift automation applications inside warehouses.\u003C/p\u003E\n\n\u003Cp\u003ELocata technology was first publicly unveiled in Portland in September 2011 at the Institute of Navigation Conference, after 16 years of stealth development. Initially, Locata\u0026#8217;s inventions were almost universally dismissed by the industry as \u0026#8220;impossible\u0026#8221; – it seemed preposterous that a small private company would dare claim to replicate a system which had needed the development muscle of the entire US military, and which had cost the US taxpayer over $40 billion to put in place.\u003C/p\u003E\n\n\u003Cp\u003EHowever skepticism evaporated dramatically in mid-2012 when the US Air Force - the inventors of GPS - published a seminal article in a respected industry magazine \u003Ca href=\"http://www.insidegnss.com/node/3071\" title=\"CrunchBase\" rel=\"nofollow\"\u003ECrunchBase\u003C/a\u003E. The long article detailed publicly for the first time that Locata had been used by the USAF \u003Cem\u003Eto replace GPS\u003C/em\u003E across a vast area of the famed White Sands Missile Range where GPS is jammed. Apart from showing ground-breaking developments which gave Locata’s new technology irrefutable validation, the USAF article concluded, quote:\u003C/p\u003E\n\n\u003Cp\u003E“\u003Cem\u003E(Locata)\u003C/em\u003E… is \u003Cem\u003Ethe key component\u003C/em\u003E for the realization of the USAF’s next-generation Ultra High Accuracy Reference System performance in a GPS-denied environment. \u003Cem\u003E(This system)\u003C/em\u003E ….will become the new \u003Cstrong\u003E“gold standard truth system”\u003C/strong\u003E for the increasingly demanding test and evaluation of future navigation and navigation warfare systems for the U.S. Department of Defense.”\u003C/p\u003E\n\n\u003Cp\u003EIn another clear indication of the emergence of previously unachievable positioning capabilities, Leica Geosystems - one of the world’s largest and most respected GPS companies - announced they would conduct a global launch in Q3/2012 of new fleet management automation technology which was “Powered by Locata”. In the first print brochure for the new system, Leica called Locata technology “A Game Changer” and stated:\n“They said it couldn’t be done. They were wrong”. \u003Ca href=\"http://mining.leica-geosystems.com/assets/Brochures/Leica-Jps-LocataAUv2.0s.pdf\" title=\"CrunchBase\" rel=\"nofollow\"\u003ECrunchBase\u003C/a\u003E \u003C/p\u003E\n\n\u003Cp\u003ELocata networks have undeniably demonstrated the unique ability to replicate a GPS satellite constellation locally - on the ground. This now allows any entity - mine, port, construction site, warehouses, airports, strategic assets - and eventually entire cities - to determine for themselves the reliability and accuracy of positioning they wish to deploy, under their own local control, with complete autonomy.\u003C/p\u003E\n\n\u003Cp\u003EIn a nutshell: Locata is the inventor, developer and supplier of radically new and proven local wireless positioning signals. This new ability to supply “a local GPS” will forever change what can be done with positioning. The personalized delivery of information across cities to myriad mobile devices - as imagined by Apple, Google, Foursquare, Microsoft, and many others - now has an emerging technology base that will allow it to materialize. Locata can power new generations of positioning apps for future machine, mobile and personal devices as it is ported from today’s industrial-grade devices to cheap consumer-level GPS chips. It will enable previously inconceivable - \u003Cem\u003Ein fact truly science fiction levels\u003C/em\u003E - of positioning performance for mobile devices. Locata has a technology roadmap in place to evolve Locata “all the way to an iPhone”.\u003C/p\u003E\n\n\u003Cp\u003ELocata enables a future of high-accuracy radio positioning \u003Cem\u003Eeverywhere\u003C/em\u003E. There will be no more \u003Cem\u003E“GPS does not work here”\u003C/em\u003E excuses. The totally unanticipated emergence of Locata marks the arrival of critically important new positioning technology which will disrupt the entire $200-billion GPS industry. \u003Cstrong\u003EPositioning will never be the same again.\u003C/strong\u003E\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0012/7892/127892v2-max-150x150.jpg"],
     [[250,
       84],
      "assets/images/resized/0012/7892/127892v2-max-250x250.jpg"],
     [[450,
       151],
      "assets/images/resized/0012/7892/127892v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder, Chairman \u0026 CEO",
    "person":
     {"first_name": "Nunzio",
      "last_name": "Gambale",
      "permalink": "nunzio-gambale",
      "image": null}},
   {"is_past": false,
    "title": "Founder, Inventor, Director of Innovation",
    "person":
     {"first_name": "David",
      "last_name": "Small",
      "permalink": "david-small",
      "image": null}},
   {"is_past": false,
    "title": "General Manager",
    "person":
     {"first_name": "Tony",
      "last_name": "Griffiths",
      "permalink": "tony-griffiths",
      "image": null}},
   {"is_past": false,
    "title": "Manager, Software",
    "person":
     {"first_name": "Ian",
      "last_name": "Sainsbery",
      "permalink": "ian-sainsbery",
      "image": null}},
   {"is_past": false,
    "title": "Director of Navigation",
    "person":
     {"first_name": "Joel",
      "last_name": "Barnes",
      "permalink": "joel-barnes",
      "image": null}},
   {"is_past": false,
    "title": "Manager, Hardware",
    "person":
     {"first_name": "Trevor",
      "last_name": "Hobbs",
      "permalink": "trevor-hobbs",
      "image": null}},
   {"is_past": false,
    "title": "Manager, Product Development",
    "person":
     {"first_name": "Jay",
      "last_name": "Brosius",
      "permalink": "jay-brosius",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$22.5M",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "http://www.epicorp.com.au/index/locatacorporation.html",
    "source_description": "",
    "raised_amount": 500000.0,
    "raised_currency_code": "USD",
    "funded_year": 2005,
    "funded_month": 3,
    "funded_day": 7,
    "investments":
     [{"company":
        {"name": "Epicorp Seed Fund",
         "permalink": "epicorp-seed-fund",
         "image": null},
       "financial_org": null,
       "person": null}]},
   {"round_code": "a",
    "source_url": "http://www.ameinfo.com/174088.html",
    "source_description": "",
    "raised_amount": 22000000.0,
    "raised_currency_code": "USD",
    "funded_year": 2008,
    "funded_month": 11,
    "funded_day": 3,
    "investments":
     [{"company":
        {"name": "Khaleeji Commercial Bank",
         "permalink": "khaleeji-commercial-bank",
         "image": null},
       "financial_org": null,
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Australian Office",
    "address1": "111 Canberra Avenue",
    "address2": "",
    "zip_code": "2603",
    "city": "Griffith, ACT",
    "state_code": null,
    "country_code": "AUS",
    "latitude": null,
    "longitude": null},
   {"description": "US Office",
    "address1": "9 Island View",
    "address2": "",
    "zip_code": "92604",
    "city": "Irvine",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.gpsworld.com/gnss-system/algorithms-methods/innovation-hybrid-positioning-9628",
    "title": "GPS World Magazine Article on Locata Technology - March 2010 Edition"}]}