{"name": "Local Culture",
 "permalink": "local-culture",
 "crunchbase_url": "http://www.crunchbase.com/company/local-culture",
 "homepage_url": "http://localcultures.org",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "localcultures",
 "category_code": null,
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": 10,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "crowdfunding, culture, data, international, local, nonprofit, platform, social, startups, storage",
 "alias_list": null,
 "email_address": "localcultures@gmail.com",
 "phone_number": "",
 "description": "",
 "created_at": "Fri Feb 01 00:09:27 UTC 2013",
 "updated_at": "Sun Feb 03 06:34:14 UTC 2013",
 "overview": "\u003Cp\u003EMission\nLocal Culture seeks to become the primary platform for knowledge and heritage preservation and fundraising for communities around the world.\u003C/p\u003E\n\n\u003Cp\u003ECompany Overview\nLocal Culture is a collaborative non-profit arts and educational outreach project comprised of communities, nonprofit organizations, and other groups that provides the means to collect, store, share, and monetize unique knowledge and products in ways that users control through social and native fundraising platforms.\u003C/p\u003E\n\n\u003Cp\u003EDescription\nCommunities come in all sizes and can be defined in many ways. From rural villages in Belize or India, to homeschoolers in New York or Los Angeles, communities have always revolved around a unique set of locally-based knowledge and understandings. By providing all communities with a virtual space to record, store, and share this unique knowledge and heritage, Local Culture is a repository for the for the innumerable iterations of culture that exist around the globe. Community generated portals allow communities to store their knowledge and culture, and manage access to this information as they see fit. Through the Community Portals, Local Culture offers a place for cultural information to be stored and shared for future generations.\u003C/p\u003E\n\n\u003Cp\u003ECommunity Portals are the backbone and primary focus of Local Culture. Each portal represents a community, and access to and the information in portals are completely controlled by community members themselves. Within portals, communities have access to various functions that allow them to create unique databases of culture and heritage, including documents, photos, audio recordings, and videos. Members can control what databases or parts of databases they want to share publicly and what they want to keep private, so that any given community portal can range from completely private to completely public with any amount of variation in between.\u003C/p\u003E\n\n\u003Cp\u003ELocal Culture further empowers communities through the crowdfunding and MarketPlace features. Once communities have established their Local Culture profile, they can raise funds for community projects by creating crowdfunding campaigns directly linked to their profile. The Local Culture MarketPlace offers an additional platform through which communities can market, sell, trade, or otherwise distribute their unique arts, crafts, and other goods to consumers worldwide.\u003C/p\u003E\n\n\u003Cp\u003EGeneral Information\nFounded in 2012 by Douglas Reeser and Jedi Wright.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       97],
      "assets/images/resized/0023/2863/232863v2-max-150x150.png"],
     [[250,
       162],
      "assets/images/resized/0023/2863/232863v2-max-250x250.png"],
     [[450,
       293],
      "assets/images/resized/0023/2863/232863v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-founder",
    "person":
     {"first_name": "Douglas",
      "last_name": "Reeser",
      "permalink": "douglas-reeser",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Los Angeles Office",
    "address1": "819 N Edinburgh Ave Ste 6",
    "address2": "",
    "zip_code": "90046",
    "city": "Los Angeles",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}