{"name": "Long Beach Petroleum Club",
 "permalink": "long-beach-petroleum-club",
 "crunchbase_url": "http://www.crunchbase.com/company/long-beach-petroleum-club",
 "homepage_url": "http://www.lbpetroleumclub.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "LBPetroleumClub",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "long-beach-petroleum-club, petroleum-club, club-membership, club-facilities, club-packages, long-beach, california",
 "alias_list": null,
 "email_address": "",
 "phone_number": "562 427 7966",
 "description": "perfect place to host special events",
 "created_at": "Sat Mar 16 05:51:25 UTC 2013",
 "updated_at": "Sat Mar 16 06:31:10 UTC 2013",
 "overview": "\u003Cp\u003EHaving a Petroleum Club in Long Beach was the idea of Lee Foust and C.L. “Slim” Fowler which developed in the steam room of the Pacific Coast Club one week during the Summer of 1954. They had discussed the thought many times before, but it was on this particular occasion that they decided to do something about it.\u003C/p\u003E\n\n\u003Cp\u003EAfter sounding out some members of the oil fraternity and receiving favorable reaction for the most part, a committee was formed to secure membership subscriptions. Burning the midnight oil in the Foust Rumpus Room for several nights turned up a list of 150 prospective members. All were contacted with excellent results and thus a nucleus on which to base a club was formed.\u003C/p\u003E\n\n\u003Cp\u003EIn the Fall of 1954 organizational meetings were held at Brower’s Restaurant and the original Constitution and By-Laws were drafted by D.A. Boone and James T. Satchell, as were the Articles of Corporation. The first Board of Directors was selected: Jerry L. Evans, President; Freeman E. Fairfield, 1st Vice President; Wilbur Harrison, 2nd Vice President; C.L. Fowler, 3rd Vice President; Lee Foust, 4th Vice President; D.A. Boone, Secretary; James T. Satchell, Assistant Secretary, and Chester F. Yunker, Treasurer, serving as officers. Directors were Robert L. Jackson, Paul E. Lehr, Donald S. Hare, William S. Albers, Robert M. Pyles, Harry C. Carrothers, and Irving Funk.\u003C/p\u003E\n\n\u003Cp\u003EThe next matter was that of housing, and in November, 1954, the Board of Directors entered into a lease agreement with Arthur V. Morgan for clubrooms adjacent to Ricart’s Restaurant at 4635 Atlantic Avenue. Construction began in March, 1955, and was ready for occupancy on September 22, 1955, but on September 20th, a pre-opening banquet was held for members of the Long Beach press and oil journal representative, at which Freeman E. Fairfield served as Master of Ceremonies.\u003C/p\u003E\n\n\u003Cp\u003EAt the beginning of the organizational period it was realized that a Club manager would be required, and Vernon Castle was “wooed” away from his manager ship of Lakewood Country Club to fill the position. Subsequently, in September, 1955, he acquired a secretary, Dorothy Thompson, bringing the total Petroleum Club employees to two. The kitchen and dining room staff were employed by Ricart’s under the lease agreement, which included assignment of Willie Williams to serve the cardroom. When the cardroom moved, so did Willie, officially making him employee #3.\u003C/p\u003E\n\n\u003Cp\u003EDuring the next two years, many of the Club’s activities originated: Bob Irwin developed the “Pipeline”, which was mimeographed in those days; through the leadership of Betty (Mrs. Irving) Dumm, the women’s activities were initiated and she became the first Petroleum Club Wives Chairman; the first Day at the Races was held in May, 1956; the first reception for the Miss Universe Pageant participants was held in July, 1956; the first golf tournament was played in the Fall of 1956, and in fact, most of the activities regularly enjoyed today were started during that period. It was also near this time that the club became a sponsor of the Oilfield League of the Long Beach Kid’s Baseball Association upon the solicitation of John McCune.\u003C/p\u003E\n\n\u003Cp\u003EDuring the course of operation under the lease agreement, various difficulties arose to the dissatisfaction of both the lessor and lessee, with the result that Mr. Morgan offered a solution in the form of several proposals which, after consideration by the Board, were brought to the attention of the membership. At a Special Membership Meeting on July 16, 1956, it was voted to accept Mr. Morgan’s proposal to purchase the leasehold agreement from the Club and to empower the Board of Directors to obtain new quarters. Thereafter a committee consisting of Wilbur Harrison, C.L. Fowler, and Chet Yunker was appointed to explore possible sites.\u003C/p\u003E\n\n\u003Cp\u003EAs the club’s needs became known, several proposals were presented to the Board and each was given consideration. The most attractive location and proposal came from Contractor Al Reingardt, who owned property both on Atlantic and Linden Avenues in the 3600 block. The original proposal was to have the Club face on Atlantic. However, more land and more parking was available on Linden which was more accessible to in and out traffic. Mr. Reingardt offered very attractive financing and the opportunity to eventually own free and clear all of the facilities, including the land and parking areas. In addition, he brought an excellent reputation as a builder and a working arrangement with Architect J. Richard Shelley and Associates.\u003C/p\u003E\n\n\u003Cp\u003EA basic requirement before proceeding with the new project was to obtain an Alcoholic Beverage Permit. Another was approval by the Long Beach Planning Commission of our final plans and permission to operate Club on the premises. The liquor license posed a problem in that there were three churches in the immediate vicinity who might (and later two did) protest the application. However, the active support of the Minister of the Church of Religious Science, which is south of the premises, in furthering our interest before the Alcoholic Beverage Control resulted in the objections being withdrawn. It was also with this assistance that the zoning restriction was cleared. There were many anxious weeks while these matters were pending. During this time The Board of Directors, Committee Members, the Manager, Boone \u0026amp; Stachel, together with Dorothy Thompson, as she was our right arm, spent many sleepless hours.\u003C/p\u003E\n\n\u003Cp\u003EThe very busy and critical period of planning the new Club carried over into the presidency of Wilbur Harrison in 1957.\u003C/p\u003E\n\n\u003Cp\u003EArchitect Shelley offered the first two sets of preliminary plans in March, 1957, which Mr. Harrison referred to the Building Committee for study. A revised colored sketch of the proposed building and floor plan was presented at a Special Membership Meeting in May.\u003C/p\u003E\n\n\u003Cp\u003EMeanwhile, there was much activity in finalizing the lease sale with Morgan, which took several months of negotiation to complete.\u003C/p\u003E\n\n\u003Cp\u003EJoe Kellogg, Membership Chairman during 1957, continued to bring in more and more members, as had the previous chairman, Lee Foust, all of which brought in more revenue for the building fund. The membership grew to 497 active members.\u003C/p\u003E\n\n\u003Cp\u003EThe purchase agreement with Mr. Reingardt was executed on January 22, 1957, and the start of construction was planned for July 1. However, local labor trouble delayed the groundbreaking to September 25, which precluded any hope of being in the new quarters for the Holidays.\u003C/p\u003E\n\n\u003Cp\u003EThe Building Committee, with Slim Fowler as Chairman, was necessarily faced with myriad duties incidental to its function, all of which were exceedingly time-consuming. To expedite matters somewhat for them, they were empowered by a Board Resolution to accept bids and to contract for furniture, furnishings, and equipment.\u003C/p\u003E\n\n\u003Cp\u003EM.H. “Curley” Stansbury was appointed Chairman of the Swimming Pool Committee, and to secure bids for the pool and its surrounding area. It became his responsibility to obtain financing, as a pool had not been considered in the original plans. Financing was secured largely by response from the membership to his appeal for voluntary contributions to a swimming pool fund.\u003C/p\u003E\n\n\u003Cp\u003EIn January, 1958, C.L. Fowler took over the presidential position and passed on the Building Committee duties to Bob Pollard, which he and his committee capably handled through completion and furnishing.\u003C/p\u003E\n\n\u003Cp\u003EAs detailed plans for the Club developed, its site was expanded (along with its cost!) from some 12,000 sq. ft. to approximately 23,165 sq. ft. to include a large basement area, an expanded entrance area, and the raised terrace areas. As costs mounted, it became apparent that additional financing would be required over and above the original projections. Through the efforts of Irving Dumm, Dan Boone, and others, a loan was arranged at the Farmers \u0026amp; Merchants Bank which was guaranteed by a syndicate of Club members. Recognition is herewith given to those men who “went out on a limb” in the Club’s time of need: Jerry L. Evans, Lee Foust, C.L. Fowler, George Brayton, James T. Satchell, Irving Dumm, M.H. Stansbury, J.K. Kellogg, Wilbur Harrison, D.A. Boone, R.M. Pyles, Francis Tholen, Harold H. Parks, Roland P. Armell, John S McCune, Tom D. Harrison, Walter J. Scott, Earle L. Maddox, Homer R. Dulin, Lyle M. Anderson, William H. Brayton, Paul N. Baker, Frank Vessels, Jr., Walter Everts, Howard Dumm. Robert Dumm, R.J. Guess, R.C. Cacaulay, Macrate Oil Company by Art Macrate, R.E. Ziebarth, Roland Raasch, Clarence E. Ball, Barry Merritt, Phil A. Hattery, C.T. Gates Don Kuster, H. Douglas Lemons, O.M. Slosson, J.M. Jackson, Fred Johnson, Karl Mercer, Richard Clements, Bill Cree, Bill Rogers, Otis Crabtree, H. John Eastman, B.E. Cockriel and George Thagard. Incidentally, all monies borrowed and advanced were repaid with interest during succeeding seven years. Howard Dumm and Carl Gates were selected as Syndicate Managers to coordinate with the Board of Directors in the expenditure of these monies.\u003C/p\u003E\n\n\u003Cp\u003EAdditional land other than that included in the agreement with Mr. Reingardt was secured: The center strip of Linden Avenue for parking to conform with requirements of the Planning Commission, and, with an eye to future expansion, the lot to the north of the Club building was purchased.\u003C/p\u003E\n\n\u003Cp\u003EOutfitting the Club is another matter and much too long a story at this point, but it was completed to a point where the premises could be occupies on May 10, 1958. The Grand Opening Party was held on May 17th.\u003C/p\u003E\n\n\u003Cp\u003EAlthough the Club was opened, there was still much to be accomplished and at every turn there seemed to be increased but necessary costs and expenses in addition to the obligatory payments to be made on existing contracts. The Finance Committee and Board of Directors had their hands full in getting the club financially off the ground during those first months of operation, plus the fact that there was a great slump in the local oil industry during this period. Nevertheless, with such smart operators at the helm and good management, the obligations have been met over the years in a very creditable manner to there the original indebtedness of over $700,000 has been reduced to a minimum.\u003C/p\u003E\n\n\u003Cp\u003EThere was quite a flurry one day when a man arrived in the lobby bearing welding rods and blowtorch and even more when he began to attack the pillars with this torch! However, Mr. Fowler had engaged him to create what we now have come to recognize as a progressive sculpture of a gasoline cracking plant (or did you recognize it as such?). The wielder of the torch was Bernard Zimmerman, an artist from Beverly Hills. The lobby was further enhanced by the painting “Sunlit Surf”, an original by the noted Robert Woods, which was a gift from Mrs. Jack Herley in memory of her husband; a framed grouping of portraits of the original Board of Directors, which was a gift from J.M. Jackson, and a working model of an oil well, loaned to the club by K.L. Kellogg \u0026amp; Sons. The black lighted mural in the ballroom was painted there some years later, a gift of F.E. Fairfield.\u003C/p\u003E\n\n\u003Cp\u003EThis brings you up to the opening of the new Club, and through its first few months to January, 1959, at which time Les Foust was elected president, and will conclude the story of the Club’s creation. Regretfully, space doesn’t permit individual recognition of all the men who gave so generously of their time and talents on behalf of the Club. Up to the time covered here there had been three Boards of Directors, but each so correlated that plans could develop without interruption. Vern Castle also contributed greatly, not only in management, but in liaison with the Directors. He was on the site from the time the first shovel full of dirt was turned, and it can literally be said that he knew where every stick, stone, pipe, and dollar went.\u003C/p\u003E\n\n\u003Cp\u003EEach Board from that time has had its share of responsibility in guiding the Club to the success it enjoys today and our hats are off to all of you!\nOffering\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Wedding reception banquet\n* Grand Room\n* Club Membership\n* Mexican buffet Lunch - Dinner\n* Club packages\n* Corporate membership\n* Hors d’oeuvres\n* Grand Ballroom\n* Red Room\n* Terrace room\n* bar\n* Pool side\n\u003C/code\u003E\u003C/pre\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0024/2812/242812v2-max-150x150.jpg"],
     [[250,
       41],
      "assets/images/resized/0024/2812/242812v2-max-250x250.jpg"],
     [[450,
       73],
      "assets/images/resized/0024/2812/242812v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Petroleum Club",
    "address1": "3636 Linden Avenue",
    "address2": "",
    "zip_code": "90807",
    "city": "Long Beach",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 33.8233756,
    "longitude": -118.1862911}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        76],
       "assets/images/resized/0024/2811/242811v2-max-150x150.jpg"],
      [[250,
        127],
       "assets/images/resized/0024/2811/242811v2-max-250x250.jpg"],
      [[450,
        229],
       "assets/images/resized/0024/2811/242811v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.lbpetroleumclub.com/nonequity-membership.php",
    "title": "Non Equity Memberships"}]}