{"name": "lonSales Corporation",
 "permalink": "lonsales-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/lonsales-corporation",
 "homepage_url": "http://www.indiamart.com/alonsales/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hardware-fitting, cable-manager, door-knob-and-door-kadi--our-highly-durable-range-comprises-cabinet-door-handle",
 "alias_list": null,
 "email_address": "alonsales@tradepassport.org",
 "phone_number": "9879375476",
 "description": "Manufacturer, wholesaler and supplier ,",
 "created_at": "Fri Apr 05 14:51:10 UTC 2013",
 "updated_at": "Fri Apr 05 14:51:18 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2009, we, \u0026#8220;A\u0026#8217;lon Sales Corporation\u0026#8221; are one of the reputed organizations engaged in manufacturing, wholesaling and supplying a wide range of Aluminum Cabinet and Door Handle, Cabinet Handle, Door Handle, Stylish Handle, Hardware Fitting, Cable Manager, Door Knob and Door Kadi. Our highly durable range comprises Cabinet Door Handle, Exclusive Door Handle, Modern Door Handle, Modular Door Handle, Designer Door Handle, Stylish Door Handle, Hardware Khooti, Customized Hardware and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIn order to carry out all our business related activities in soother manner, we have appointed a team of highly experienced and sincere professionals. Our professionals posses great knowledge and experience of this domain, which benefits us in manufacturing a unparalleled range of products. To meet the variegated requirements of our valued customer\u0026#8217;s, our team always come up with unique and concepts and strives to incorporate all the specifications detailed by them. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe have came up with a qualitative and a unparalleled range of Aluminum Cabinet and Door Handle, Cabinet Handle, Door Handle, Stylish Handle, Hardware Fitting, Cable Manager, Door Knob and Door Kadi, with the support of our qualified quality controllers team. Our products are manufactured using qualitative raw-material only under the supervision of our experienced team of professionals.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed our state-of-the-art infrastructure which extends over a vast area. Our facility is well equipped with various latest technologies, which is well segregated into various departments such as manufacturing unit, quality controlling unit, warehousing and packaging unit, R \u0026amp; D unit and administration unit. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nClient centric approaches, fair business polices, we have succeed in gaining a huge clientèle for ourselves. Our organization follows a ethical business practices and strives maintain high level of transparency in all the dealings and delivery all the consignments within the promised time frame. Furthermore, we offer a flawlessness range with customization solution to meet the variegated requirements of our customer\u0026#8217;s.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n Aluminum Cabinet and Door Handle, Cabinet Handle, Door Handle, Stylish Handle, Hardware Fitting, Cable Manager, Door Knob and Door Kadi. Our highly durable range comprises Cabinet Door Handle, Exclusive Door Handle, Modern Door Handle, Modular Door Handle, Designer Door Handle, Stylish Door Handle, Hardware Khooti, Customized Hardware and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8793/248793v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8793/248793v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8793/248793v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}