{"name": "Looky.co",
 "permalink": "looky-co",
 "crunchbase_url": "http://www.crunchbase.com/company/looky-co",
 "homepage_url": "https://looky.co/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-networking, ecommerce",
 "alias_list": null,
 "email_address": "info@looky.co",
 "phone_number": "",
 "description": "Online Friends Based Marketplace",
 "created_at": "Wed May 08 23:44:39 UTC 2013",
 "updated_at": "Thu May 09 04:26:40 UTC 2013",
 "overview": "\u003Cp\u003ELooky.co is a trustworthy marketplace where friends buy and sell their items for only $1 per transaction. Items are listed in order of their price or by proximity of the zip code being searched. Communities across the country are eager to be part of Looky.co’s unique social networking and marketplace experience.\u003C/p\u003E\n\n\u003Cp\u003ELooky.co is a hybrid social networking and e-commerce site, created to provide users with a safe space to buy and sell to people they are connected with.  The first 10,000 users to create a Looky.co profile will be rewarded with a lifetime gift of free marketplace transactions. From then on, each new user will be charged a $1 fee to sell their items.  Its four click interface allows for easy navigation.  Users are able to build both a social profile (visible only to friends) and a marketplace profile (visible to the public), and search for goods by zip code, reflecting the mission of Looky.co to facilitate online transactions within users social network and local community.  Looky.co does not allow advertising on the site, and protects user privacy by not sharing any information and by storing passwords in a virtually unreadable, encrypted format.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}