{"name": "Loopster",
 "permalink": "loopster",
 "crunchbase_url": "http://www.crunchbase.com/company/loopster",
 "homepage_url": "http://www.loopster.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "video-editing, free-video-editor, ez",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "EZ Video Editing Software",
 "created_at": "Sat Jul 28 01:19:01 UTC 2012",
 "updated_at": "Tue Jul 31 05:15:53 UTC 2012",
 "overview": "\u003Cp\u003ELoopster, Inc. is a technology startup based in Grand Junction, CO that is creating the world’s easiest to use, cloud-based video editing software solution.\u003C/p\u003E\n\n\u003Cp\u003EOur website allows users to easily upload, edit, and most importantly share their videos with their existing social networks.\u003Cbr/\u003E\nMost people that currently edit their videos do so using video editing software installed on their computer.  This software is generally very complicated to use and has a steep learning curve.  The result is that most people simply don’t edit their videos at all.\nThe solution is Loopster.com.  We enable people with little or no video editing experience to easily edit and share their videos.  Users do not have to download or install any software to edit their videos.  Most importantly, users can then export their videos directly to YouTube or Facebook with a single click.  Our goal is to make video editing so easy that your grandmother can do it!\u003Cbr/\u003E\nLoopster is currently seeking to raise $1M in seed capital.  Once funding is secured, Loopster will relocate to the Denver / Boulder area or Las Vegas.\u003Cbr/\u003E\nVideo with a Collaborative Social Twist\nLoopster users can opt to share some or all of their finished videos and raw video clips with other Loopster users.  These other Loopster users can then use your video footage in the finished videos they create, and of course, vice versa.  You can choose to give this permission just to custom defined “Loops” of users (ie. friends and family), or you can choose to give this permission to the general public.   \u003C/p\u003E\n\n\u003Cp\u003EThe beta version of the Loopster.com website was launched on June 27, 2012.  We currently have a small number of users and are primarily in bug-fixing mode.\u003Cbr/\u003E\nLoopster has partnered with Paul Jr. Designs from Discovery Channel’s American Chopper television show to generate initial publicity for our website and product.  Paul Jr. Designs has designed and built a custom made, Loopster-themed motorcycle.  The building and unveiling of this motorcycle will be featured on the American Chopper television show on September 10th and September 17th, 2012.  The show’s viewing audience is in the millions.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       112],
      "assets/images/resized/0020/3282/203282v2-max-150x150.jpg"],
     [[250,
       187],
      "assets/images/resized/0020/3282/203282v2-max-250x250.jpg"],
     [[450,
       337],
      "assets/images/resized/0020/3282/203282v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}