{"name": "Loud Mountain",
 "permalink": "loud-mountain",
 "crunchbase_url": "http://www.crunchbase.com/company/loud-mountain",
 "homepage_url": "http://www.loudmountain.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "LoudMountainInc",
 "category_code": "software",
 "number_of_employees": 6,
 "founded_year": 2009,
 "founded_month": 3,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "independent-recruiter, recruiters, recruiting, social-recruiting, social-media, social-web, career-placement, job-matching, recommendation-engine, talent-management, information-technology",
 "alias_list": null,
 "email_address": "sschmitt@loudmountain.com",
 "phone_number": "412 200 7960",
 "description": "Where Referrals Matter",
 "created_at": "Fri Oct 22 14:40:40 UTC 2010",
 "updated_at": "Wed May 16 04:04:25 UTC 2012",
 "overview": "\u003Cp\u003EWho We Are\u003C/p\u003E\n\n\u003Cp\u003EWe are a peer-to-peer recruiting company that has made the job hunting process more efficient and effective by utilizing the power of social networking platforms to intelligently match our members to their next career opportunity.  When you apply you are assigned a Loud Mountain Career Consultant that will assist you in every step of the process. In addition, if you refer a colleague to an open position, and the colleague is hired, you receive a reward for your referral. Also, our services are 100% free of charge easy to use and completely confidential. All you have to do is follow the three simple steps below to get started.\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003ESign in: Connecting with us through LinkedIn only takes a minute. We then analyze your professional profile and make job recommendations based on many aspects of our career. Once again, all of your information is completely confidential and is shared with no one outside of the Loud Mountain community without your permission.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EApply: Once you find a job you like, you can apply with just a few clicks. From here, you will be assigned a Loud Mountain Career Consultant that will assist you throughout the hiring process.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ERefer: In addition, we match your colleagues (1st level connections on LinkedIn) to open positions.  If you feel there is a correct  match, you can refer them to any of these opportunities, and with their permission, we will assist them in finding their next career challenge.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EGet Started Today!\u003C/p\u003E\n\n\u003Cp\u003ELoud Mountain Principle Values\u003C/p\u003E\n\n\u003Cp\u003ETrust- Every piece of information you give us is held in the highest of confidence. None of your information will be given to any potential employer and we will not contact any of your connections without your permission.\u003C/p\u003E\n\n\u003Cp\u003EQuality- Our goal is to place qualified candidates in the best positions available for them. When you work with Loud Mountain, you will receive the highest quality personal service until you are hired.\u003C/p\u003E\n\n\u003Cp\u003ESimplicity- We want our site to be clear and easy to use. Signing up, sharing jobs, and applying for open positions should only take a few clicks.\u003C/p\u003E\n\n\u003Cp\u003EDisclaimer: The information you provide will be held in the strictest confidence. We will not contact your connections without you permission or in any way disclose your information or your network\u0026#8217;s information to anyone outside of the Loud Mountain Community.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0010/7144/107144v4-max-150x150.png"],
     [[250,
       67],
      "assets/images/resized/0010/7144/107144v4-max-250x250.png"],
     [[450,
       122],
      "assets/images/resized/0010/7144/107144v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO and Founder",
    "person":
     {"first_name": "Steven",
      "last_name": "Schmitt",
      "permalink": "steven-schmitt",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$750k",
 "funding_rounds":
  [{"round_code": "angel",
    "source_url": "",
    "source_description": "Angel",
    "raised_amount": 750000.0,
    "raised_currency_code": "USD",
    "funded_year": 2011,
    "funded_month": 1,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "340 Mansfield Avenue",
    "address2": "First Floor",
    "zip_code": "15220",
    "city": "Pittsburgh",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}