{"name": "LyfeLog",
 "permalink": "lyfelog",
 "crunchbase_url": "http://www.crunchbase.com/company/lyfelog",
 "homepage_url": "http://www.lyfelog.me",
 "blog_url": "http://www.lyfelog.tumblr.com",
 "blog_feed_url": "http://www.lyfelog.tumblr.com/rss",
 "twitter_username": "LyfeLog",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-network, social-networking, android, ios, app, mobile, smartphone",
 "alias_list": null,
 "email_address": "connect@lyfelog.me",
 "phone_number": "9860135161",
 "description": "Tech Startup",
 "created_at": "Tue Jun 04 08:04:59 UTC 2013",
 "updated_at": "Tue Jun 04 23:31:34 UTC 2013",
 "overview": "\u003Cp\u003EABOUT:\nLyfeLog (for Android and iOS) enhances your social networking experience in a revolutionary way. All you ever wished for in your networking platform is now in the palm of your hand. Share photos, videos and ideas. Find your friends, categorize your posts, and tell the world about you, all with a tap on your screen.\u003C/p\u003E\n\n\u003Cp\u003EWHY LYFELOG?\nWe realized one day that each social networking site - be it Facebook, Twitter, Instagram etc. - had its own flaws. No networking platform was perfect or actually aiding in the “Social Networking” part. In fact, social networking itself was no more social. Ads popped up everywhere, content was being forced upon the user without consent.\u003C/p\u003E\n\n\u003Cp\u003ETwitter was intended to be a micro-blogging site. Facebook has become nothing more than a glorified ad-space while Instagram is threatening to sell your fabulous clicks without your permission. The user has become a Product, to be sold, instead of a Member of the platform\nAlso, when almost 80% of the “Social Networkers” (and probably 100% of your friends) use these sites from their smart phones, we found it difficult to believe that there existed not one social networking app that was specifically and optimally designed for that particular demographic.\nAnd hence we decided - Why not take the flaws of each networking site. One flaw at a time. And not only correct it, but improve it beyond recognition.\u003C/p\u003E\n\n\u003Cp\u003EHence, LyfeLog was born. It caters to and encourages all kinds of social networking practices that you can imagine. Want to follow your passion (tech news, hilarious jokes, Chinese recipes etc.) ? Want to socialize and interact with your close friends? Want to share every moment from every day of your life? Want to browse endless photo streams? LyfeLog has you covered.\u003C/p\u003E\n\n\u003Cp\u003ELyfeLog, is our effort, to create a platform so powerful and so versatile, it can adapt to your pattern of use and taste, however varying or common it may be. There is something (and much more) for everyone, in LyfeLog\u0026#8230;\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Harscelle",
      "last_name": "Goenka",
      "permalink": "harscelle-goenka",
      "image": null}},
   {"is_past": false,
    "title": "CMO",
    "person":
     {"first_name": "Abhijit",
      "last_name": "Dey",
      "permalink": "abhijit-dey",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "LyfeLog Base",
    "address1": "33, IT Park Road",
    "address2": "Lokseva Nagar",
    "zip_code": "440022",
    "city": "Nagpur",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}