{"name": "Lypsso.com",
 "permalink": "lypsso-com",
 "crunchbase_url": "http://www.crunchbase.com/company/lypsso-com",
 "homepage_url": "http://www.lypsso.com",
 "blog_url": "http://blog.lypsso.com",
 "blog_feed_url": "",
 "twitter_username": "Lypsso",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@lypsso.com",
 "phone_number": "",
 "description": "Beauty network",
 "created_at": "Thu Apr 25 22:34:30 UTC 2013",
 "updated_at": "Mon Apr 29 21:32:49 UTC 2013",
 "overview": "\u003Cp\u003ELypsso is the first non-biased meeting point of information exchange for beauty users, professionals and companies on beauty treatments and salons, natural and organic beauty products and professional beauty equipment.\u003C/p\u003E\n\n\u003Cp\u003ELypsso.com is a marketing channel for small, medium and large companies from the beauty industry through which they can offer their products or services (including organic and natural beauty products, beauty equipment and salons services) nationally and internationally. Companies of all varying sizes will be able to compete through this channel as the differentiation point amongst them is based on consumer reviews. This is a great opportunity for small and medium companies, as they don’t normally have enough resources to position themselves online, which may in turn, hinders their growth potential.\u003C/p\u003E\n\n\u003Cp\u003ELypsso takes a sustainable approach to beauty and incorporates social responsibility elements to product and services reviews. Furthermore, Lypsso’s first steps involved thinking of the beauty industry’s main stakeholders: users, beauty professionals and companies and finding a solution that meets their needs. The reasoning behind Lypsso is based on two key trends in the beauty sector: i) beauty and taking care of yourself has become a hot topic these days driven by our ageing population which has led to growing consciousness and desire to look young  me with pressures to look young, and ii) sustainability is increasingly becoming a must for companies in the eyes of the consumer, even in the beauty industry. For instance, using natural ingredients or using “green packaging” has become increasingly popular. Furthermore, in this day and age, we can find many different and innovative beauty treatments accessible to the average end consumer, which are an alternative to plastic surgery and the risks that this may entail. However, in many instances, consumers are not aware of these types of products or where to find these alternatives. tive treatments.. This is particularly for due to the lack resources of most beauty salons to communicate with consumers about the benefits of their treatments.\u003C/p\u003E\n\n\u003Cp\u003EThere is no other website like Lypsso.com in the beauty industry. There are other websites that offer “high-street” product reviews from their own bloggers or other users. Other websites offer professionals beauty news and trends, etc… Lypsso.com takes beauty a step further. We want to offer our stakeholders true and non-biased information. On our site users will find a wider selection of beauty products (natural, organic and vegan) and other user’s reviews taking into account our “sustainable” approach. They will also be able to search for beauty products that exclude certain ingredients, which may be potentially harmful or which they may be allergic to. \u003C/p\u003E\n\n\u003Cp\u003EThere is no other website that offers beauty professionals such a wide variety of beauty equipment information and reviews from other professionals. Having good beauty equipment is crucial to offer their services and they often lack enough information to take a decision on which equipment to invest on. From previous research, we found that currently beauty equipment information on the internet can mostly only be sourced from the equipment manufacturer’s website and the information in forums is not sufficient and lacks detail. On lypsso.com, professionals will be able to easily compare equipment information, specs and reviews, all on the same page and only a few clicks away.\u003Cbr/\u003E\nOur beauty salon section not only will allow users to search for beauty salons in different countries (mainly from large cities) but also to search for the best beauty treatments based on other user’s opinions of the salon’s cleanliness, customer service, price, service offering etc…. In turn, this section is a great marketing channel for beauty salons to communicate with users by allowing them to: update their salon information, pictures, beauty treatment listings, offer treatment deals, and provide important news updates, etc.  \u003C/p\u003E\n\n\u003Cp\u003ELypsso.com is also the only bilingual beauty site, offering both English and Spanish. These two languages account for two of the top 5 most spoken languages in the world. Furthermore, www.lypsso.com will offer from day hundreds of products for users to search and review. This is thanks to beauty product and equipment companies that trust Lypsso’s business model.  \u003C/p\u003E\n\n\u003Cp\u003EIn summary, Lypsso.com is a beauty site that aims to raise user’s awareness of beauty sustainability (in a fashionable manner) and allows small, medium and large companies to market their products and services to a large base of users and professionals always looking out for the best purchasing decision to meet their individual needs.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Laura",
      "last_name": "Sanchez",
      "permalink": "laura-sanchez-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Techhub",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.5112139,
    "longitude": -0.1198244}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}