{"name": "MacnRoss",
 "permalink": "macnross",
 "crunchbase_url": "http://www.crunchbase.com/company/macnross",
 "homepage_url": "http://macnross.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 25,
 "founded_year": 1980,
 "founded_month": 3,
 "founded_day": 24,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "marketing-consulting-firms, small-business-consulting-firms, auditing-services, chartered-accountants-uae, cpa-firms-dubai",
 "alias_list": null,
 "email_address": "sumtechseo@gmail.com",
 "phone_number": "",
 "description": "Chartered Accountants uae",
 "created_at": "Thu Jun 13 07:03:27 UTC 2013",
 "updated_at": "Thu Jun 13 18:50:56 UTC 2013",
 "overview": "\u003Cp\u003EMac\u0026amp;amp; Ross is the consultancy firms for business,marketing,Chartered Accountants,tax and accounting,bookeeping services,business management firms in dubai,UAE\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EMAC \u0026amp; ROSS is an audit firm established in Dubai. We render services as Auditors and Financial and Accounting experts as well as advisers and consultants for project feasibility studies, financial planning, mergers and acquisitions of business units, staff selection, formation of companies and allied commercial and legal matters.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to provide cost effective but efficient professional services to the business community and support them to attain the optimum result they can achieve under the prevailing economic conditions. To meet our client highest expectations is our goal. Integrating quality with integrity.\u003C/p\u003E\n\n\u003Cp\u003EWe strive to understand your business and help you to achieve your objectives through value added services in corporate accounting and finance thereby enabling your focus on core business. Nevertheless our advisory services are here as solution to advice you on all matters both finance and others.\nAt Mac \u0026amp; Ross, we always strive to understand our client business before a holistic approach is advice. We treat each one of our client as our business partner.\nWe also have a branch office at Saif Zone, Sharjah, UAE.\u003C/p\u003E\n\n\u003Cp\u003EOur Strategy:\u003C/p\u003E\n\n\u003Cp\u003EClient’s satisfaction and consistently high quality professional services are the priorities in our business strategy. We tailor our professional approach to the specific needs and requirements of our clients to ensure that the work is conducted in most efficient and cost effective manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Strength :\u003C/p\u003E\n\n\u003Cp\u003EA team of highly qualified and widely experienced professionals dedicated to practice the profession at its highest standards and committed to provide the best services to the clients, lead Mac \u0026amp; Ross, Chartered Accountants. We are fully equipped to provide services to a wide spectrum of clients, from individuals to corporate entities; from small organisations to very large companies; domestic and multinationals, in to-day’s fast growing business environment.\u003C/p\u003E\n\n\u003Cp\u003EOur Standards :\u003C/p\u003E\n\n\u003Cp\u003EIn our endeavour to provide the best professional services, we follow the international standards and keep abreast with the latest developments in the respective fields of practice. We adhere to the International Financial Reporting Standards (IFRS) for the financial statements audited by us.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\u003C/p\u003E\n\n\u003Cp\u003EOur team members include those possessing more than 30 years of rich experience in rendering services in the fields of auditing and consultancy to all types and categories of clients in varied businesses in public and private sectors internationally.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       56],
      "assets/images/resized/0027/4657/274657v2-max-150x150.png"],
     [[240,
       91],
      "assets/images/resized/0027/4657/274657v2-max-250x250.png"],
     [[240,
       91],
      "assets/images/resized/0027/4657/274657v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}