{"name": "Madison Alexander PR",
 "permalink": "madison-alexander-pr",
 "crunchbase_url": "http://www.crunchbase.com/company/madison-alexander-pr",
 "homepage_url": "http://www.madisonalexanderpr.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "TecFlack",
 "category_code": "security",
 "number_of_employees": 8,
 "founded_year": 2004,
 "founded_month": 3,
 "founded_day": 31,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "technology-public-relations, technology-analyst-relations, social-media-programs, corporate-blogging, blogs, start-up-pr, security-pr, networking-pr, search-technology-pr, high-tech-marketing-communications, high-tech-writing, technology-thought-leadershi",
 "alias_list": null,
 "email_address": "dchm@madisonalexanderpr.com",
 "phone_number": "714-832-8716",
 "description": "Technology PR, AR, marcom, SoMe agency",
 "created_at": "Thu Apr 28 17:19:29 UTC 2011",
 "updated_at": "Wed May 04 07:49:15 UTC 2011",
 "overview": "\u003Cp\u003EMadison Alexander PR is a boutique technology public relations, analyst relations, marketing communications and social media agency specializing in technology innovators in the security, networking, enterprise software, storage and search technology markets.  \u003C/p\u003E\n\n\u003Cp\u003EMadison Alexander PR has won three national PR awards since 2010; InfoSecurity Products Guide 2011 PR agency of the year for Security Companies, a 2011 Network Products Guide IT PR Campaign of the Year award, and a 2010 Golden Bridge Business award for Best Technology PR Campaign.  Dan Chmielewski founded Madison Alexander PR in 2004 after five years as Rainbow Technologies head of worldwide PR.\u003C/p\u003E\n\n\u003Cp\u003EThe agency represents clients all over the world.  Much of the agency\u0026#8217;s new business comes from client referrals \u0026#8211; technology is a small industry at times.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Dan is one of those rare PR people that actually knows what he is talking about and doesn\u0026#8217;t waste my time. He reads your work and is pitching you the right contact for a story. He has worked for a long time in the networking and communications industry and knows the history of his clients, your pub, and can identify trends and fads better than most of the analysts out there.\u0026#8221; \u0026#8211; David Strom, technology editor, Web Informant \u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Dan is the consummate PR professional with well-honed instincts on what the reporter is looking for in a story. When I get a call from Dan with a story pitch, I know I\u0026#8217;d better listen because he\u0026#8217;s never given me a bad pitch. He doesn\u0026#8217;t waste your time. Aside from that, I owe him a huge debt of gratitude. When I made the switch from mainstream news to IT business reporter, Dan graciously carved out an afternoon to brief me on the industry and its intricacies. For someone who knew next to nothing about the industry then, what I got from this meeting was truly immeasurable.\u0026#8221;\u0026#8211; Pedro Pereira, Channel Editor, Ziff-Davis Internet\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;I\u0026#8217;ve worked with Dan on a number of occasions with several different clients in the data security market. He understands the information requirements of industry analysts and his clients are well prepared for detailed questioning.  Dan strives to make each briefing a good exchange of information for both me and his clients.\u0026#8221;\n\u0026#8211; Michael Suby - Program Manager, Communications Service Strategies \u0026amp; Opportunities, Stratecast Partners, a Division of Frost \u0026amp; Sullivan \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Principal",
    "person":
     {"first_name": "Dan",
      "last_name": "Chmielewski",
      "permalink": "dan-chmielewski",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Lega; Services",
    "is_past": false,
    "provider":
     {"name": "Gallinger Law",
      "permalink": "gallinger-law",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Madison Alexander PR",
    "address1": "19 Wedgewood",
    "address2": "",
    "zip_code": "92620",
    "city": "Irvine",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.prandcorporate.com/people/Dan-Chmielewski.html",
    "title": "2011 PR Agency of the Year for Security Companies"}]}