{"name": "Madyzine",
 "permalink": "madyzine",
 "crunchbase_url": "http://www.crunchbase.com/company/madyzine",
 "homepage_url": "http://madyzine.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "madyzine",
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 21,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web, design, solutions, graphic, website, web-design, web-solution, web-building, graphic-design, logo-design, business-card-design, logo, business-card, hosting, wordpress, themes, template-",
 "alias_list": null,
 "email_address": "contact@madyzine.com",
 "phone_number": "972-577757246",
 "description": "Web Solutions",
 "created_at": "Sun Jul 15 10:49:49 UTC 2012",
 "updated_at": "Mon Apr 29 11:02:10 UTC 2013",
 "overview": "\u003Cp\u003EWho Are We?\nMadyzine is a young and energetic Web Design company which provides a wide variety of Internet services including web design, website development, graphic design, domain registration, web hosting and also marketing, branding and SEO services.\nOur vision is to lead the world of web design by taking advantage of latest technology, while emphasizing on our customers satisfaction as a first priority.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EWe believe that new technology, up to date technique and cutting edge design are the source of ground-breaking success of our services to the customer.\u003C/li\u003E\n\u003Cli\u003ETransparency of information with the customer is a very important to us. Client’s understanding of processes done behind the scenes contributes to a feeling of security. Escorting a customer through his first steps ever breaking into the Online World can be difficult, so we put most emphasis on the transfer of information to the customer. Authentic and true recommendation by our side to the customer as part of understanding what the customer wants and what works best for him is what defines the reliability between the two sides.\u003C/li\u003E\n\u003Cli\u003EWe are not just another Web Design company. In the world of Web Design there have been a lot of developments in the past decade, in fact changes are being made daily. Madyzine aims itself to be young and dynamic as part of our objective of understanding the modern Internet user requirements. Our research team studies and investigates new techniques for design, new formats and programming languages – all this in order to be in front of the market’s demand.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EAnswering The Need\nMadyzine’s founders realized that there is a huge need to be connected at the modern market, to be On-Line. In fact, if you’re not On-Line – You do not exist, this is how it is today. Having a website is a long and sometimes tiring process of learning and improving as it is on-line and everyone can connect to it at all times. We feel that there are many companies that offer a wide range of services but still no internet company that brings real progress in front of the modern web surfer. Nowadays, Madyzine is in the process of breaking into the competition as the most innovative company in the design field, where the design emphasis is at the use of Web 2.0 technology.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       42],
      "assets/images/resized/0020/1014/201014v2-max-150x150.jpg"],
     [[247,
       70],
      "assets/images/resized/0020/1014/201014v2-max-250x250.jpg"],
     [[247,
       70],
      "assets/images/resized/0020/1014/201014v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Dennis",
      "last_name": "Gal",
      "permalink": "dennis-gal",
      "image": null}},
   {"is_past": false,
    "title": "CMO",
    "person":
     {"first_name": "Michael",
      "last_name": "Burshtein",
      "permalink": "michael-burshtein",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "Churgin 22",
    "address2": "",
    "zip_code": "52356",
    "city": "Ramat Gan",
    "state_code": null,
    "country_code": "ISR",
    "latitude": 32.0735632,
    "longitude": 34.8210869}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://www.facebook.com/madyzine",
    "title": "Facebook Page - Madyzine"},
   {"external_url": "http://www.linkedin.com/company/madyzine",
    "title": "LinkedIn Page - Madyzine"},
   {"external_url": "https://twitter.com/madyzine",
    "title": "Twitter Page - Madyzine"},
   {"external_url": "https://plus.google.com/101561491161245952048/posts",
    "title": "Google+ Page - Madyzine"}]}