{"name": "Maestro Touch",
 "permalink": "maestro-touch",
 "crunchbase_url": "http://www.crunchbase.com/company/maestro-touch",
 "homepage_url": "http://www.maestrotouch.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ipad-music-app, music-app, ipad, ipad-app, free-music-app, free-ipad-app, free-ipad-music-app",
 "alias_list": null,
 "email_address": "zack@maestrotouch.com",
 "phone_number": "",
 "description": "iPad Music App",
 "created_at": "Tue Oct 09 20:14:29 UTC 2012",
 "updated_at": "Thu Oct 18 23:36:32 UTC 2012",
 "overview": "\u003Cp\u003EMaestro Touch introduces a new free app for the iPad that dramatically reduces the learning curve of writing and composing music. \u003C/p\u003E\n\n\u003Cp\u003EDesigned for any level of music enthusiast, Maestro Touch provides a user-friendly interface that allows for instant creation. By-passing years of memorization and technical complexity, Maestro Touch presents a digital instrument that’s unlike anything on the market today. According to founder, Ben Scheuer, “Maestro Touch was the result of years of frustration learning to compose and write music. I recognized that much of the difficulty revolved around learning to master the technique of an instrument or memorizing scales and chords. This led me to envision a new type of instrument that was technically easy to play and that also exposed much of the theory behind composing music on the surface of the instrument.”\u003C/p\u003E\n\n\u003Cp\u003EMaestro Touch is a brand new instrument with a unique interface. The app displays notes in a circular pattern, highlighting the notes that are in the scale of any selected key. This allows for easy melodic composition and creation of chords and harmony.  Each note is designated with it’s own color and when pressed, produce the sound. Maestro Touch comes with two instruments (piano and an instrument of the user’s choice), and more instruments can be purchased. The app has twelve keys and eight octaves to work with, as well as the option to use major, minor, or blues scales for every key.\u003C/p\u003E\n\n\u003Cp\u003EOver 4500 people have already downloaded the app since its July release. “We’re really excited about the positive response to the app,” Scheuer said. “Due to the great feedback, we’re moving forward with additional features such as record and edit, custom sounds and instrument libraries, exporting and sharing of recorded work, and many more. Our Kickstarter page has more information about upcoming features and rewards for anyone wanting to get involved.”\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/4924/214924v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0021/4924/214924v2-max-250x250.png"],
     [[450,
       450],
      "assets/images/resized/0021/4924/214924v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        136],
       "assets/images/resized/0021/4923/214923v2-max-150x150.png"],
      [[250,
        227],
       "assets/images/resized/0021/4923/214923v2-max-250x250.png"],
      [[450,
        409],
       "assets/images/resized/0021/4923/214923v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://itunes.apple.com/us/app/maestro-touch-free/id560955016?mt=8",
    "title": "Free on iTunes"},
   {"external_url": "http://www.youtube.com/user/MaestroTouchApp",
    "title": "Video"}]}