{"name": "Mahavir Electronics",
 "permalink": "mahavir-electronics",
 "crunchbase_url": "http://www.crunchbase.com/company/mahavir-electronics",
 "homepage_url": "http://www.indiamart.com/mahavirelectronics/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "led-tvs, lcd-tvs, plasma-tvs, oven, home-theatres, dvds, computers, laptops, etc-",
 "alias_list": null,
 "email_address": "mahavirelectronics@tradepassport.org",
 "phone_number": "",
 "description": "We are the leading trader and supplier ,",
 "created_at": "Fri Apr 05 05:42:54 UTC 2013",
 "updated_at": "Fri Apr 05 05:42:57 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1992, at Pune (Maharashtra, India), we, “Mahavir Electronics”, are engaged in trading and supplying a comprehensive assortment of LED TVs, LCD TVs, Plasma TVs, Oven, Home Theatres, DVDs, Computers, Laptops, etc. The offered products are sourced from some of the reliable vendors of the industry. Our products are usually acknowledged for their diverse features like reliable performance, low power consumption, robust construction, attractive design, excellent finish and longer service life. Moreover, the products offered by us are designed and developed by our trustworthy vendors using high grade raw material and sophisticated technology as per the set quality standards. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOwing to our experienced professionals, we are engaged in providing superior quality products that are offered as per the varied requirements of our prestigious customers. With their vow and enthusiasm, we have established ourselves as the reckoned name in the domain of trading and supplying high quality products.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe always strictly adhere to the quality control procedures and therefore, provide flawless products to our valued customers. The offered products are procured from the most reliable vendors of the industry. We have recruited expert quality inspectors, who analyze our products right from the stage of procurement till the final dispatch. After procurement, all the products stringently undergo thorough various tests so as to ensure their flawlessness. These products are known among clients for their dimensional accuracy, temperature resistance and durability.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nDue to a strong network of trustworthy vendors, we have been able to provide an impeccable quality array to the clients. Considering vendors as the backbone of any trading company, our procurement agents conduct intensive market researches to choose the reliable and authorized manufacturers that are spread all across the nation. They analyze financial stability, quality standards, infrastructural facility, delivery schedules, pricing policies, etc. of these vendors and then place the orders.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nLED TVs, LCD TVs, Plasma TVs, Oven, Home Theatres, DVDs, Computers, Laptops, etc. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8277/248277v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8277/248277v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8277/248277v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}