{"name": "Mahala Enterprises",
 "permalink": "mahala-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/mahala-enterprises",
 "homepage_url": "http://www.indiamart.com/mahalaenterprises/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mahalaenterprises@tradepassport.org",
 "phone_number": "9829019425",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 08:07:32 UTC 2013",
 "updated_at": "Fri May 31 13:33:25 UTC 2013",
 "overview": "\u003Cp\u003EMahala Enterprises was in the industry since 1981, engaged in manufacturing and supplying a comprehensive range of Ferro Alloys, Minerals, Fire Bricks and Acidic Ramming Mass. Further, our range consists of Ceramic Boards, Ceramic Blankets, Magnesite Bricks, Fire Bricks Blocks, High Alumina Bricks, Ferro Titanium Alloys, Ferro Chrome Alloys, Ferro Phosphorous, Soap Stone Powders, Bentonite Powders, Coal Dust Powder, Coupla Ramming Mass and many others.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur company has established a hi-tech and ruggedly constructed infrastructural set-up, which is equipped with modern amenities and all requisite tools as well as equipment. The reason behind partition of our infrastructure is to carry out the entire activities in a smooth and well-organized manner. Moreover, the machinery installed by us in our manufacturing department is regularly upgraded, which further improves their performance and helps to remain in pace with the existing market developments. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nAt present, the status our organization has achieved in the industry is an outcome of the dedicated efforts, loyalty and hard work of our diligent team of professionals. They hold expertise of catering to the various needs of clients in an efficient manner. Further, to enhance the knowledge of our workers and to keep them abreast of existing market tendency, we organize regular workshops and training sessions for our them. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe are quality driven organization, therefore assures to make delivery of excellent quality range in the market. Our company possesses a sound and well-equipped quality testing laboratory, where our complete product range undergoes various strict quality checks that has been performed by our experts. They leave no stone unturned in assuring that the products are free from any defect and are in conformation with the set industrial norms and guidelines. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nBy consistently maintaining the supply of qualitative and client suggested range, our company has established an outstanding position in the industry. We ensure clients that the products, which we offer them are in strict conformation with the set industrial standards.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0024/8419/248419v3-max-150x150.png"],
     [[250,
       43],
      "assets/images/resized/0024/8419/248419v3-max-250x250.png"],
     [[342,
       60],
      "assets/images/resized/0024/8419/248419v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Shop No. 60/61, Dadi Bari Market, Sikar Road",
    "address2": "",
    "zip_code": "302 013",
    "city": "Jaipur ",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        69],
       "assets/images/resized/0026/9731/269731v1-max-150x150.png"],
      [[250,
        115],
       "assets/images/resized/0026/9731/269731v1-max-250x250.png"],
      [[450,
        208],
       "assets/images/resized/0026/9731/269731v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}