{"name": "Mahmutlar Acar Emlak",
 "permalink": "mahmutlar-acar-emlak",
 "crunchbase_url": "http://www.crunchbase.com/company/mahmutlar-acar-emlak",
 "homepage_url": "http://www.acarhome.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "memduhjoy",
 "category_code": "other",
 "number_of_employees": 4,
 "founded_year": 2000,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "for-sale-for-rent-apartment-property-mahmutlar-alanya-turkey",
 "alias_list": null,
 "email_address": "memduhjoy@hotmail.com",
 "phone_number": "00905369691600",
 "description": "satılık daire ev mahmutlar",
 "created_at": "Sat Sep 22 13:03:39 UTC 2012",
 "updated_at": "Wed Sep 26 22:24:29 UTC 2012",
 "overview": "\u003Cp\u003EACAR REAL ESTATE AGENT ALANYA/MAHMUTLAR\nSINCE 2001\u003C/p\u003E\n\n\u003Cp\u003ETurkey ACAR Property / Real Estate helps you realize the dream of owning a property in Turkey. Whether it’s a luxury villa, beach side apartment, or if you are looking for an off-plan investment – we have it covered. Search our website for properties, currently available real-estate.\nThe ACAR Property, life-style offering 300 days of sunshine in a year is as well in parallel with sophisticated cultural and sporting activities. Alanya truly has something for everyone. More than ever before more and more Europeans are choosing the regions relaxed pace, its way of life. Alanya’s sophisticated nature, excellent infrastructure \u0026amp; weather makes your property semi-permanent or permanent home base.\u003C/p\u003E\n\n\u003Cp\u003EThe variety and volume of real estate opportunities in Turkey can be daunting to the visitor in search of their dream homes or optimal investment. Antalya Real Estate services provide the customer with an excellent knowledge of the best new developments in the Antalya region as well as quality re-sale properties and can guide you through the entire purchase process.\nAs is the case, your property’s investment potential will greatly depend on its location and quality of construction. Antalya Real Estate wants you to feel secure and confident in your investment and will work with you to find the ideal property according to your specific requirements and other specifications, also advising you of the best locations and developments that befit your target. If you don’t want to wait for an off-plan property we’ve got re-sales in the best locations and at the best prices. Let us help you realize your future in MAHMUTLAR Alanya-Turkey.\u003C/p\u003E\n\n\u003Cp\u003ETurkey ACAR Properties /Real Estate is one of the leading companies in Alanya – our experienced staff and references are your guarantee of a professional service\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0021/2569/212569v2-max-150x150.jpg"],
     [[250,
       67],
      "assets/images/resized/0021/2569/212569v2-max-250x250.jpg"],
     [[300,
       81],
      "assets/images/resized/0021/2569/212569v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}