{"name": "Maimoon Fashion",
 "permalink": "maimoon-fashion",
 "crunchbase_url": "http://www.crunchbase.com/company/maimoon-fashion",
 "homepage_url": "http://www.indiamart.com/maimoonfashion/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fancy-sequins, motifs, viscose-threads, glass-and-pearl-beads-",
 "alias_list": null,
 "email_address": "maimoonfashion@tradepassport.org",
 "phone_number": "9819032846",
 "description": "Mnufacturer, supplier and exporter ,",
 "created_at": "Thu Apr 04 14:31:58 UTC 2013",
 "updated_at": "Thu Apr 04 14:32:04 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2003, we, “Maimoon Fashion Accessories Pvt. Ltd.”, are an ISO 9001:2008 certified organization, which is engaged in manufacturing, supplying and exporting an unparalleled assortment of Fancy Sequins, Motifs, Viscose Threads, Glass and Pearl Beads. The range offered by us includes Sequins, Appliqués-Sequined \u0026amp; Beaded Motifs, Yarn-Viscose Threads and more. These products are designed in compliance with the latest trends of the market using superior quality raw material, which is sourced from the reliable vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have appointed a team of expert professionals, which helps us in carrying out business ventures. Owing to their expertise and experience, we have been able to offer a quality assured range of Fancy Sequins, Motifs, Viscose Thread, Glass and Pearl Beads to our clients. Our hierarchy and division of labor ensures smooth and systematic production process. Apart from this, our team members work in a cohesive manner that help in achieving the goals of our organization.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have developed a sprawling infrastructure in Mumbai, Maharashtra, India. Divided into various departments, this infrastructure help in managing the activities of our firm in an organized manner. Moreover, we have installed various advanced machines and tools at our departments that help in remaining in tandem with international standards and norms. Owing to our well-equipped infrastructure, we have been able to meet the bulk requirements of our clients regarding Fancy Sequins, Motifs, Viscose Threads, Glass and Pearl Beads. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are a quality conscious organization, hence, our main aim is to sustain the market credibility by offering an unparalleled range of Fancy Sequins, Motifs, Viscose Threads, Glass and Pearl Beads. For this, we manufacture our entire range using superior quality raw material, which is procured from the trusted vendors. Apart from this, we have established a well-equipped testing unit, which is managed and controlled by a team of quality controllers.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction\nWe aim at attaining the complete satisfaction of our clients, since our establishment. For this, we ensure to provide a quality assured range of Fancy Sequins, Motifs, Viscose Threads, Glass and Pearl Beads to the clients as per their requirements. Moreover, we offer these products in different sizes, designs, shapes and colors to meet the diverse choices and preferences of the customers. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nFancy Sequins, Motifs, Viscose Threads, Glass and Pearl Beads. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7975/247975v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/7975/247975v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/7975/247975v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}