{"name": "Maimoon Hardware",
 "permalink": "maimoon-hardware",
 "crunchbase_url": "http://www.crunchbase.com/company/maimoon-hardware",
 "homepage_url": "http://www.indiamart.com/maimoonhardware/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "impact-drills, electric-drills, electric-screwdrivers, angle-grinders, demolition-breakers, blowers",
 "alias_list": null,
 "email_address": "maimoonhardware@tradepassport.org",
 "phone_number": "9158465566",
 "description": "We are successfully ranked amongst ,",
 "created_at": "Thu Apr 04 13:20:12 UTC 2013",
 "updated_at": "Thu Apr 04 13:20:20 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 2006, at Pune (Maharashtra, India), we, “Maimoon Hardware \u0026amp; Tools”, are known as the renowned trader and supplier of a qualitative collection of Power Tools, Drill Bits, Drill Machines, etc. Our offered series of products comprises Impact Drills, Electric Drills, Electric Screwdrivers, Angle Grinders, Demolition Breakers, Blowers, Chain Saws, Cutting Tools, etc. These products are sourced by our procuring agents from the only certified and trustworthy vendors like Black \u0026amp; Decker, Dewalt, Bosch, Hi-Power, Hitachi, Electerx, KPT, Boda, Fusion \u0026amp; Power. \u003C/p\u003E\n\n\u003Cp\u003ETeam:\nOur firm is setting high standards of quality in the industry with the support of an expert team of professionals. The commitment levels and rich industry experience of our team members also add on to our high value in the market. While procuring the products from our vendors, they make sure that the products are of unmatched quality and are in total compliance with the set industry norms. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOur in-depth industrial knowledge and immense domain expertise, has enabled us to form and maintain strong vendor base all across the globe for procuring our high quality product assortment. Apart from this, our vendors manufacture these products using optimum quality raw material, which ensures their compliance with the international standards. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nThe prime factor that sets us apart from our competitors is the superior quality range of Power Tools, Drill Bits, Drill Machines, etc. We follow strict quality policies at every level of our business operations. In addition to this, we have set-up a quality control unit, where the entire range of procured product is checked on well-defined parameters at both procurement and the final dispatching stage. Our vendors also ensure that only the quality tested raw material is used in the manufacturing process.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe main aim of our firm is to maximize the satisfaction level of our esteemed clients. We source the products from only the certified and trustworthy vendors of the market and store these in our clean warehousing facility. Assisted by our dedicated professionals, we succeed in delivering the ordered consignments to the clients in a timely manner. Besides this, our timely delivery, wide distribution network, transparent dealings and reasonable pricing structure have made us the most preferable name in the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nOur offered series of products comprises Impact Drills, Electric Drills, Electric Screwdrivers, Angle Grinders, Demolition Breakers, Blowers, Chain Saws, Cutting Tools, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7923/247923v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7923/247923v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7923/247923v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}