{"name": "Majestic Apparels",
 "permalink": "majestic-apparels",
 "crunchbase_url": "http://www.crunchbase.com/company/majestic-apparels",
 "homepage_url": "http://www.indiamart.com/majesticapparels/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "majesticapparels@tradepassport.org",
 "phone_number": "09953361143",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 13:08:36 UTC 2013",
 "updated_at": "Fri Apr 05 13:08:42 UTC 2013",
 "overview": "\u003Cp\u003EMajestic Apparels was established in the year 2012 as a sole proprietorship firm. The company is renowned due to its ability of manufacturing, supplying and exporting a broad spectrum of Men Shirts, Men Sherwani, Men Wear, Women Kurtis, Women Sarees, Women Nighties, Women Wear and Kids Wear.\u003C/p\u003E\n\n\u003Cp\u003EProducts:\n Products fall under these categories are Men  Night Suits, Men Casual Shirts, Men Wedding Sherwani, Churidar Suits, Embroidery Sarees, Designer Kurtis and so on.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure;\nWe are blessed to have with us a highly sophisticated and advanced infrastructural set-up, which enables us to meet the bulk orders of clients within the specific time frame. It is well-equipped with latest tools and machines, which are used to develop products as per the growing demands of clients. We timely upgrade these machines, to remain abreast of the prevailing market developments and preferences.  \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nBacked by a team of highly creative, dexterous and adroit professionals, we are ably fulfilling the growing demands of our valuable clients. To keep our workers aware of prevailing market demands, we organize seminars, workshops and training sessions on regular intervals. Further, our experts are capable of using both traditional and modern approach of designing products, which are largely acceptable by huge clientele. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur organization is always been driven by the commitment of supplying qualitative range, since the day one of its establishment. We leave no stone unturned in ascertaining that the products we supply meet the actual demands of clients and are in compliance to the prescribed standards of industry. Further, our range is examined on various parameters, which are designs, skin friendliness, color fastness as well as finishing. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have become the foremost choice of large customers and acquired distinct market place by offering products as per the growing market tendencies. With the perfection and quality of our range, we have successfully acquired the huge support of clients, which are based almost all across the nation.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[86,
       150],
      "assets/images/resized/0024/8674/248674v2-max-150x150.jpg"],
     [[144,
       250],
      "assets/images/resized/0024/8674/248674v2-max-250x250.jpg"],
     [[144,
       250],
      "assets/images/resized/0024/8674/248674v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}