{"name": "Make-A-Store",
 "permalink": "make-a-store",
 "crunchbase_url": "http://www.crunchbase.com/company/make-a-store",
 "homepage_url": "http://www.make-a-store.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 1994,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ecommerce, convergent-commerce, online-commerce, mobile-commerce",
 "alias_list": null,
 "email_address": "info@make-a-store.com",
 "phone_number": "(866) 962.7462",
 "description": "Online and Mobile Commerce Platform",
 "created_at": "Thu Mar 29 19:52:17 UTC 2012",
 "updated_at": "Fri Mar 30 16:19:26 UTC 2012",
 "overview": "\u003Cp\u003EMake-A-Store provides a suite of enterprise-ready features to start or migrate cross channel, convergent commerce efforts.  We\u0026#8217;ve been successfully building and deploying online solutions for over 18 years.\u003C/p\u003E\n\n\u003Cp\u003EWith an instant, on-demand setup, the Make-A-Store comes packed with features for Operations, Security \u0026amp; Fraud Prevention, Inventory, Order and Customer Management and International Commerce.  This powerful and scalable solution also has, built in, call center features, robust analytics, tools for wholesalers, mobile commerce integration and social.\u003C/p\u003E\n\n\u003Cp\u003EFor established organizations, Make-A-Store has proven it\u0026#8217;s ability to integrate successfully with numerous accounting, POS and ERP solutions.  Our fully customizable platform integrates with numerous sales channels and comparison engines.  These include Amazon, eBay, Buy.com Sears.com, Overstock and many more. \u003C/p\u003E\n\n\u003Cp\u003EMake-A-Store is a unified, complete, end-to-end solution. We are a single source for hosting, programming, and common features other companies rely on third party companies for.  Our tools are developed in-house by our local engineers.\u003C/p\u003E\n\n\u003Cp\u003EMake-A-Store is a cloud-based, fully scalable set of tools that was created and continues to evolve with the needs of both the business leader and consumer in mind.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}