{"name": "Man88naM",
 "permalink": "man88nam",
 "crunchbase_url": "http://www.crunchbase.com/company/man88nam",
 "homepage_url": "http://man88nam.free.bg",
 "blog_url": "http://www.facebook.com/man88nam",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "man88nam",
 "alias_list": null,
 "email_address": "man88nam@gmail.com",
 "phone_number": "+359884829669",
 "description": "LTD",
 "created_at": "Fri Dec 30 23:50:40 UTC 2011",
 "updated_at": "Tue Jan 03 13:05:42 UTC 2012",
 "overview": "\u003Cp\u003EIn 2011 a private company registered \u0026#8220;Man88naM\u0026#8221; Ltd profile and commercial activity in services, trade, travel, innovative tools and methods of communication, media, domestic and international trade, exchange of goods and services and other . In search of partners for partnership programs for the development of business communication in perspective. The company is new and expected credit of mutual interest. Man88naM individual is located in Bulgaria. The priority idea is related to the presence of broadcast media space, resulting in different manifestations of communication as the Internet network, and through graphics and video processing forms that affect human sensory capabilities. Developed new opportunities for exchange of communication data, creating information. Commercial Profile Man88naM, supported by a partner company. We rely on a serious attitude in perspective. May God be with us for a new and better world!\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.crunchbase.com/user/Man88naM\u003C/p\u003E\n\n\u003Cp\u003EI am looking for business angels, credit investors in the long term, serious people for serious communication. Development perspective, which is related to corporate activity and depends on the intentions of investors and creditors. Participation in the funds of the European accession projects, international trade, domestic trade and commodity trading. SEO optimization, online shops and online ads, broadcast and network communication, and the place - personally.\u003C/p\u003E\n\n\u003Cp\u003EПрез 2011 година е регистрирана частната фирма \u0026#8220;Ман88наМ\u0026#8221; ООД с търговски профил и предмет на дейност в сферата на услугите, търговията, екскурзии, иновационни инструменти и методи на комуникация, медия, вътрешна и международна търговия, обмен на стоки и услуги, както и други. В процес на търсене на партньори за партньорски програми, за развитието на бизнес комуникация в перспектива. Фирмата е нова и очаква кредитиране от взаимен интерес. Man88naM е частно лице намиращо се в България. Приоритетната идея е свързана с присъствието на медия в ефирното пространство, което се изразява в различни прояви на комуникация както в мрежата на Интернет, така и чрез графика и видео обработка на форми, които повлияват върху сетивните човешки способности. Разработват се нови възможности за обмен на комуникационни данни, които създават информацията. Търговският профил на Man88naM, се поддържа от съдружник на фирмата. Ние разчитаме на сериозно отношение в перспектива. Нека Бог да бъде с нас за един нов и по-добър свят! \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       136],
      "assets/images/resized/0016/8276/168276v2-max-150x150.png"],
     [[250,
       226],
      "assets/images/resized/0016/8276/168276v2-max-250x250.png"],
     [[301,
       273],
      "assets/images/resized/0016/8276/168276v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://man88nam.free.bg",
    "title": "Man88naM"}]}