{"name": "Manas Hosting",
 "permalink": "manas-hosting",
 "crunchbase_url": "http://www.crunchbase.com/company/manas-hosting",
 "homepage_url": "http://www.manashosting.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 100,
 "founded_year": 2003,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "manashostingindiacom@gmail.com",
 "phone_number": "",
 "description": "Web hosting company",
 "created_at": "Tue Jan 24 09:39:51 UTC 2012",
 "updated_at": "Tue Jan 24 20:34:36 UTC 2012",
 "overview": "\u003Cp\u003EManashosting is a Bangalore-based company that is dedicated in helping small and midsize business companies to reach customers online. We believe that by creating a website, all you have is just web presence; but to get effective traffic on your website, it is equally important to have a well designed one. This is why we provide the best of Web Hosting and Web Designing services. Also, our services are backed with exceptionally good quality and low costs.\u003C/p\u003E\n\n\u003Cp\u003EWe are professionals who have delivered stellar projects to a large number of national and international clients. We service all business sectors at very competitive rates. Our areas of strength are our innovation, out of the box thinking and commitment to quality. With our skillful management team as well as in-house Microsoft Certified web developers, we register a unique name for your organization, and thus open up a new world of web-based clients and services to you.\u003C/p\u003E\n\n\u003Cp\u003EManashosting, we provide our customers with exclusive web hosting services at competitive prices. With our vast experience in web hosting and designing, we try to create an ideal balance between web design and web development of your website. However, many of our existing clients and general customers have asked us the reason behind our economical and low cost services. Essentially, we save costs on server rental, as we have our own servers. By using a large number of servers, we are able to maintain high uptime and are able to provide unlimited web space and bandwidth to our clients, thus resulting in lowered costs. Apart from this, we also save by avoiding unnecessary large number of employees, unnecessary out going phone calls and expensive office space. As a result, our operational expenses are also low.\u003C/p\u003E\n\n\u003Cp\u003EWe understand that like us, every entrepreneur looks at getting the best service at the most cost effective prices. There for, we try to provide exceptional quality web hosting and designing services to all our esteemed clients at unbelievable packages.\u003C/p\u003E\n\n\u003Cp\u003EThe network services provided by us are completely top of the world. Once you have availed our network services, you will always keep coming back. As end users, this means that you will never ever have to work with slow Internet speed. Most of our servers are fast Dual Pentium IV based technology with 2GB or more of RAM. So, even when Internet traffic is at its peak, our servers won\u0026#8217;t overload and will continue giving you optimum speed.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}