{"name": "Mantri Plast",
 "permalink": "mantri-plast",
 "crunchbase_url": "http://www.crunchbase.com/company/mantri-plast",
 "homepage_url": "http://www.mantriplast.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "storage-contessa-containers, storage-super-seal-containers, storage-crystal-containers",
 "alias_list": null,
 "email_address": "webmaster@mantriplast.com",
 "phone_number": "09953353432",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 07:35:36 UTC 2013",
 "updated_at": "Fri Apr 05 07:35:40 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2006, we, “Mantri Plast Private Limited”, are involved in manufacturing and exporting an array of Storage Classic Containers, Storage Contessa Containers.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nStorage Classic Containers, Storage Contessa Containers, Storage Super Seal Containers, Storage Crystal Containers, Frosty Buckets, Regular Buckets, Square Buckets, Storage Super Containers, Storage Super Fresh.\u003C/p\u003E\n\n\u003Cp\u003EApplication Areas:\nWe are offering a wide range of plastic products to our valued clients, at highly reasonable prices. All the products offered by us find wide application in different packaging industries, offices, domestic households and other commercial establishments.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe proudly acknowledge our team of competent and qualified professionals, who work in coordination with the clients to design widely applicable products. We hire these professionals through a rigorous recruitment process, which has a series of tests to check the capability and talent of the candidates. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed a capacious and sophisticated infrastructural set up which is spread across a sprawling area. This infrastructure has a vast manufacturing unit is well equipped with high end machinery and tools.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe are a quality conscious organization and are widely known for offering high quality products to our esteemed clients. The ultimate mission of our organization is to offer excellent quality products at reasonable prices. Our quality control unit actively supervises the entire manufacturing process, which ensures that high grade merchandise is offered to the clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8392/248392v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8392/248392v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8392/248392v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}