{"name": "Market Tech Media",
 "permalink": "market-tech-media",
 "crunchbase_url": "http://www.crunchbase.com/company/market-tech-media",
 "homepage_url": "",
 "blog_url": "https://markettechmedia.jux.com/",
 "blog_feed_url": "",
 "twitter_username": "MarketTechMedia",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2004,
 "founded_month": 8,
 "founded_day": 27,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mediamarkettech@yahoo.com",
 "phone_number": "",
 "description": "",
 "created_at": "Mon Dec 17 21:50:51 UTC 2012",
 "updated_at": "Thu Jan 10 05:37:14 UTC 2013",
 "overview": "\u003Cp\u003EAs an industry leader, Market Tech Media Corporation has introduced and provided the highest quality products along with the most desirable distribution methods for these products for businesses, services, and professionals available in today\u0026#8217;s marketplace. Our longstanding relationships with thousands of supermarkets ensures uninterrupted presence of these products in local neighborhoods, as well as communities throughout the world.\u003C/p\u003E\n\n\u003Cp\u003EThe foundation for our success is very basic\u0026#8230;only the most qualified people may represent our company. This standard carries through to every department to include management, sales, creative services, production, and fulfillment. Add to that equation constant education and communication relative to product knowledge and sales\u0026#8230;PLUS\u0026#8230;constant upgrading of computer hardware and software, production equipment, machinery, and printing presses, it becomes evident that although often imitated we are the industry\u0026#8217;s icon.\u003C/p\u003E\n\n\u003Cp\u003EMarket Tech Media Corporation has grown to become one of the largest and most respected highly targeted in-store advertising company in the world. Our client base ranges from the local shoe repair to international conglomerates. We understand the value of each and every one of our customers as well as the importance of Customer Service, even more so, Customer Satisfaction. We are committed to providing the highest quality products available at a cost quite affordable to any business, service, or professional. We take pride in being an integral part of tens upon tens of thousands of these businesses advertising agendas. Market Tech Media Corporation has offices in Durham, NC, Naples, FL, Dallas, TX, Chicago, IL, and Valencia (a suburb just north of Los Angeles) CA as well as sales representatives in all major cities.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       99],
      "assets/images/resized/0022/8657/228657v2-max-150x150.png"],
     [[250,
       166],
      "assets/images/resized/0022/8657/228657v2-max-250x250.png"],
     [[256,
       170],
      "assets/images/resized/0022/8657/228657v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}