{"name": "MarketFriends",
 "permalink": "marketfriends",
 "crunchbase_url": "http://www.crunchbase.com/company/marketfriends",
 "homepage_url": "http://www.marketfriends.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "other",
 "number_of_employees": 1,
 "founded_year": 2009,
 "founded_month": 2,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "daytrading, stocks, forex, commodities, trading, trader-network, social-network, financial-social-network, technical-analysis",
 "alias_list": null,
 "email_address": "psmarketfriends@gmail.com",
 "phone_number": "6463180554",
 "description": "Social network for traders",
 "created_at": "Mon Apr 06 18:17:13 UTC 2009",
 "updated_at": "Tue Apr 07 23:14:36 UTC 2009",
 "overview": "\u003Cp\u003EMarketFriends is a social network and information sharing site for traders.\u003C/p\u003E\n\n\u003Cp\u003EMarketFriends was conceptually built on the premise that information, and communication of that information, are primary drivers of profitable trading in the financial markets. Furthermore, we believe that a superior information and communication network has traditionally provided a distinct competitive advantage for Wall Street traders, as compared to independent traders on \u0026#8216;Main Street.\u0026#8217;\u003C/p\u003E\n\n\u003Cp\u003EMarketFriends seeks to narrow that information and communication gap. As the retail trading community grows larger, it becomes a much greater force in the financial markets. Knowing what the retail trading community is doing is becoming an increasingly important priority for all traders. We are that community! Our network of independent traders across the globe provides the framework for better informed, and thus, more profitable trading.\u003C/p\u003E\n\n\u003Cp\u003EThe vast reach of the MarketFriends community increases the depth and breadth of information available to independent traders. From doctors to carpenters to housewives, we are a diverse network of people from all walks of life. A tidbit of information communicated from a factory worker in an autoplant in South Korea, for example, might provide invaluable insight into the Korean automotive industry that a lawyer in New York City might have never otherwise discovered on his or her own. And the information is free! \u003C/p\u003E\n\n\u003Cp\u003EThe purpose of MarketFriends is to encourage better communication between independent traders of all financial markets, from all over the world. There are thousands of sites on the web that publish stock quotes and research - we are different! Our primary focus is to promote interaction between members. Share your thoughts with others, and they will more likely share with you! Share your thoughts on our Message Boards and share your charts in our Technical Analysis Forum! Become part of a research team to delegate specific responsibilities to trusted members for more efficient research! Keep MarketFriends chat open on your screen while you trade for real-time information sharing that could potentially make or save you money!\u003C/p\u003E\n\n\u003Cp\u003EMarketFriends is the premiere social network for independent traders on the internet, and an essential tool for any trader, of any financial market. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       68],
      "assets/images/resized/0004/0410/40410v2-max-150x150.jpg"],
     [[194,
       88],
      "assets/images/resized/0004/0410/40410v2-max-250x250.jpg"],
     [[194,
       88],
      "assets/images/resized/0004/0410/40410v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Peter",
      "last_name": "Shepard",
      "permalink": "peter-shepard",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}