{"name": "Mark World",
 "permalink": "mark-world",
 "crunchbase_url": "http://www.crunchbase.com/company/mark-world",
 "homepage_url": "http://www.markworld.us",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 20,
 "founded_year": 2002,
 "founded_month": 4,
 "founded_day": 21,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-consultants, business-finance-consultants, small-business-consultants, it-business-consultants, corporate, restructuring-through-merger-and-acquisitions, warehouse-for-rent, hydro-power-projects",
 "alias_list": null,
 "email_address": "mwcontact@markworld.us",
 "phone_number": "9999817469",
 "description": "Markworld.us offers service like mortgag",
 "created_at": "Fri May 25 10:05:13 UTC 2012",
 "updated_at": "Wed May 30 07:57:56 UTC 2012",
 "overview": "\u003Cp\u003EMark World Venture assists buyers and sellers of privately held business in the buying and selling process. We estimate the value of the business; advertise it for sale with or without disclosing its identity; handle the initial potential buyer interviews, discussions, and negotiations with prospective buyers; facilitate the progress of the due diligence investigation and assist with the business sale.\u003C/p\u003E\n\n\u003Cp\u003EWe provide a conventional full-service, commission-based brokerage relationship under a signed agreement with a seller or \u0026#8220;buyer representation\u0026#8221; agreement with a buyer.\u003C/p\u003E\n\n\u003Cp\u003EMark World Venture works to facilitate the transaction and deals with both parties on the same level of trust. Company leverages new media and innovative strategies to deliver opportunities to stable and emerging domestic and international markets.\u003C/p\u003E\n\n\u003Cp\u003ETypes of services we offer:\n• Assist client in establishing a MPSP Value- Most Probable Selling Price Valuation\n• Conduct buyer searches\n• Exposure - Marketing the business to prospective buyers\n• Screen buyers for ability to complete a purchase\n• Coordinate negotiations and provide deal structuring advice\n• Provide overall deal management to guide the client through the entire process\n• Help maintain confidentiality of the sale\n• Hourly Consulting for a fee, based on the client\u0026#8217;s needs\u003C/p\u003E\n\n\u003Cp\u003EMark World Venture allows owners to stay focused on running their business during the sale process.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}