{"name": "Marshal Hydraulics",
 "permalink": "marshal-hydraulics",
 "crunchbase_url": "http://www.crunchbase.com/company/marshal-hydraulics",
 "homepage_url": "http://www.goodshandlingequipments.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@goodshandlingequipments.com",
 "phone_number": "9843376931",
 "description": "manufacturing, supplying and exporting ",
 "created_at": "Fri Apr 05 07:00:44 UTC 2013",
 "updated_at": "Fri Apr 05 07:00:52 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2002, we, “Marshal Hydraulics”, are engaged in manufacturing, supplying and exporting an extensive range of Material Handling Equipment to our customers. Our products are appreciated widely by the customers owing to their features like Durability, Reliability, High performance, Functional Efficiency, Perfect finish and Easy installation. \u003C/p\u003E\n\n\u003Cp\u003EProduct Profile:\nWe are counted amongst the renowned manufacturer \u0026amp; exporter of wide range of Material Handling Equipment which includes Hydraulic Beam Hand Pallet Truck, Hydraulic Hand Lift Mobile Floor Jib Crane, Hydraulic Lift Table, Hydraulic Drum Lifter/Tilter, Semi Electric Stacker, Two Cylinder Lift, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Engineers and technicians\n    Quality controllers\n    Researchers\n    Skilled labourers\n    Sales and marketing personnel\u003C/p\u003E\n\n\u003Cp\u003EManufacturing Unit:\nWe have a state-of-the-art infrastructure spread across a wide area. The entire infrastructure is divided properly into a number of units that cater to the various processes going on in the organization. Manufacturing, packaging, quality control are the units to name a few. Moreover, we also have the latest technology and advanced machinery employed for the purpose of manufacturing in order to serve our clients with the world-class products.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a client-centric organization, we are engaged in offering quality-assured products to our customers. These products are manufactured using high-grade quality of raw material. The products offered by us are widely appreciated for their supreme quality, perfect finish, resistance against corrosion, robust construction and easy installation.\u003C/p\u003E\n\n\u003Cp\u003EIndustries We Cater To:\nWe are counted among the leading organizations engaged in offering a wide and excellent range of Machine Handling Equipment to our esteemed patrons. These machines have been furnished in compliance with international quality standards using the best quality raw material procured from some of the renowned vendors of the market.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8359/248359v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8359/248359v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8359/248359v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}