{"name": "Marshall Corporation Limited",
 "permalink": "marshall-corporation-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/marshall-corporation-limited",
 "homepage_url": "http://www.indiamart.com/marshallcorporation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Mon Apr 01 11:43:40 UTC 2013",
 "updated_at": "Mon Apr 01 11:43:43 UTC 2013",
 "overview": "\u003Cp\u003EMarshall Corporation Limited (MCL) are in business since 1971 in various types of projects involving high-rise Buildings, Roads, Embankments, Railway Siding, Material Handling inclusive of transportation and industrial projects in Power and Steel industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Sister Concern:\nICM (India) provides end to end solutions for import \u0026amp; export of various cargo materials. The company has under its control, 4 Riveine Jetties for loading \u0026amp; unloading of cargo. Our Riverine jetties are installed to the highest specifications and are of an international standard.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nWe are a quality centric organization, aiming to deliver superlative range in the market. For this, we have developed a highly advanced and sophisticated quality control laboratory at our premises, where advanced quality testing equipment has been installed by us.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWith the endless support, dedication and hard work of our experts, we are ably meeting our set production targets as well as the objectives of the organization. Our professionals are familiar with the demands prevailing in the market and hold an expertise of accomplishing those specifications accordingly. They cordially perform the whole business activities, in order to cater to our clients in an efficient manner.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have channelized our entire efforts to provide a product range in accordance with actual client requirement. For this, we provide various solutions to our clients, which are according to their actual specified details. We make smooth and ethical business dealings with our clients, which results in getting repeated orders of our products from them. To sustain our market credibility, we ensure delivery of products within the stipulated time.\u003C/p\u003E\n\n\u003Cp\u003EWarehouse Facilities:\nOur company is backed by a highly spacious warehouse, where we efficiently store our comprehensive range in a most appropriate manner and for maximum period of time. This department is skillfully managed by our specialized team of warehousing personnel, who keep appropriate records of all incoming and retrieval of the consignment. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/6925/246925v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/6925/246925v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/6925/246925v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}