{"name": "Marudhar Metal",
 "permalink": "marudhar-metal",
 "crunchbase_url": "http://www.crunchbase.com/company/marudhar-metal",
 "homepage_url": "http://www.indiamart.com/marudharmetalalloys/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we, marudhar-metal--alloys, are-an-eminent-trader--supplier-of-inconel, monel",
 "alias_list": null,
 "email_address": "marudharmetalalloys@tradepassport.org",
 "phone_number": "",
 "description": "",
 "created_at": "Wed Apr 03 14:47:04 UTC 2013",
 "updated_at": "Wed Apr 03 19:00:36 UTC 2013",
 "overview": "\u003Cp\u003EWe, “Marudhar Metal \u0026amp; Alloys”, well recognized trader and supplier of a wide assortment of Inconel, Monel, Hastelloy, SMO and 904 L Scraps. Our gamut includes lnconel 825 Scrap, Inconel 625 Scrap, Inconel 625, Inconel X750, Inconel 625 Wire, Monel Scraps, Monel K - 500, Hastelloy C 276 Scraps and Hastelloy C22. In addition to this, we are also offering SMO Scrap, 904 L Scrap, SS Scraps, A 286 Scraps, Ferro Silicon/Ferro Manganese, Ferro Chrome, Calcium Silicon/Silicon Manganese and Ferro-Silicon-Zirconium. We procure these products from the reliable and established vendors of the market where they are manufactured with ultra grade raw material implementing latest technologies. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIn order to bring qualitative product line into the market, we have appointed a team skilled and experienced professionals. Our highly adroit team consists of various professionals who have vast experience in our domain and are well versed with the conceptual knowledge. They capacious to avail quality assured products to our esteemed clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nSince our establishment, we have been committed towards quality in our products as per the international quality standard. We are backed by diligent quality auditors who are highly experienced in this domain and possess vast industry experience. Firstly, we procure our products only from the reliable and well-established vendors of the vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nTo gain utmost client satisfaction is the prime goal of our business operations. In every possible manner, hundred percent client satisfaction is always been in the core of our business. We strongly believe utmost client satisfaction and for this, we avail them qualitative products which are procured from the reliable and authentic vendors. We have a team of professionals which work in close proximity of client’s specifications. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nFerro Alloys\u003C/p\u003E\n\n\u003Cp\u003EStainless Steel Products\u003C/p\u003E\n\n\u003Cp\u003ENickel \u0026amp; Cobalt Alloy Scraps\u003C/p\u003E\n\n\u003Cp\u003EChromium Metals\u003C/p\u003E\n\n\u003Cp\u003EStainless Steel Scraps\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7383/247383v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7383/247383v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7383/247383v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}