{"name": "Maryada Textiles",
 "permalink": "maryada-textiles",
 "crunchbase_url": "http://www.crunchbase.com/company/maryada-textiles",
 "homepage_url": "http://www.indiamart.com/maryadatextiles/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cotton-silk-fabric, cotton-viscose-fabric, silk-fabric, net-fabric, embroidery-fabric, lycra-fabric, brasso-fabric",
 "alias_list": null,
 "email_address": "maryadatextiles@tradepassport.org",
 "phone_number": "9818039565",
 "description": "Wholesaler \u0026 sampling ,",
 "created_at": "Fri Apr 05 11:05:40 UTC 2013",
 "updated_at": "Fri Apr 05 11:05:43 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in the year 1992, at New Delhi (India), we, “Maryada Textiles”, are engaged in trading, supplying \u0026amp; sampling a comprehensive range of Fabrics like Cotton Fabric, Viscose Fabric, Polyester Fabric, Linen Fabric, Jute Fabric, Cotton Silk Fabric, Cotton Viscose Fabric, Silk Fabric, Net Fabric, Embroidery Fabric, Lycra Fabric, Brasso Fabric, Jacquard Fabric, Pleated Fabric, Silk Chanderi Fabric and Cordrye Fabric. These fabrics are manufactured using the best quality fibers \u0026amp; yarns and advanced techniques by our vendors in order to meet the set industry norms. Further, the offered fabrics are tested on various parameters by skilled quality controller team using latest techniques.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality is always given prime importance in our organization. Our quality controllers make certain that entire product range is examined on defined quality parameters to eradicate all the flaws from products. Further, our quality controllers adopt different quality measures at each business stage like procurement, quality checking, packaging and dispatch. \u003C/p\u003E\n\n\u003Cp\u003EResearch And Development:\nWe have a separate research and development wing, which is well equipped with the modern facilities that ensures overall development of the product and as per the emerging market trends. This unit also assist us to add new features to the existing products for enhancing the functionality of our range at client\u0026#8217;s end.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe only aim of our organization is to give our clients optimum satisfaction by offering them high quality range of Fabrics. In order to achieve this goal, our professionals follow ethical business policies and make transparent dealings with our clients to provide them maximum satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nCotton Fabric, Viscose Fabric, Polyester Fabric, Linen Fabric, Jute Fabric, Cotton Silk Fabric, Cotton Viscose Fabric, Silk Fabric, Net Fabric, Embroidery Fabric, Lycra Fabric, Brasso Fabric, Jacquard Fabric, Pleated Fabric, Silk Chanderi Fabric and Cordrye Fabric. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8553/248553v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8553/248553v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8553/248553v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}