{"name": "MassStorage Systems",
 "permalink": "massstorage-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/massstorage-systems",
 "homepage_url": "http://www.indiamart.com/mass-storage-systems/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mass-storage-systems@tradepassport.org",
 "phone_number": "09953358758",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 12:56:57 UTC 2013",
 "updated_at": "Fri Apr 05 12:57:04 UTC 2013",
 "overview": "\u003Cp\u003EMass Storage Systems came into being in the year 1998 and carved a niche as the known manufacturers and suppliers of the wide range of Storage Racks, Library Racks, File Racks, Mobile Storage Racks, Skeleton Racks, Pigeon Hole Racks, Centering Sheets, Two Tier Racks, Mezzanine Floors, Pallet Clamping Systems, Cable Trays, Cable Tray Accessories and Slotted Angles.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nMachines based upon latest technology are placed at our manufacturing unit, which help us to carry our production in smooth and efficient manner. We have carefully segregated our infrastructure into varied units, so that smooth flow of various organizational activities is ensured. These departments are looked after by the skilled and efficient staff, which maintains synchronization between the tasks performed these departments. Besides, with the help of our vast distribution network we ensure timely deliveries at the clients end.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur skilled staff has helped us to meet the dynamic customer’s demands in timely manner. Qualified and skilled professionals with great knowledge and experience have enabled us to carve a distinct niche in industry. They are aware of their duties and ensure that tasks are accomplished in most desirable manner. Training sessions are conducted by us on regular basis, in order to keep our team updated with changing market trends.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe ensure that products offered by our end stand high in terms of quality and serve clients in an efficient manner. Stainless steel and iron of top grade is used by us in manufacturing of our range. In-depth knowledge and experience of our quality controllers has enabled us to deliver flawless range in the market. TQM policies are followed by us, in order to enhance the quality of products offered by us.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have counted among the known firm, engaged in offering the quality products. By serving our clientele in an efficient manner, we have gained a prominent position in industry. Customers prefer us because of the quality of our range and our competitive pricing policy.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8668/248668v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8668/248668v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8668/248668v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}