{"name": "Masstech Group",
 "permalink": "masstech-group",
 "crunchbase_url": "http://www.crunchbase.com/company/masstech-group",
 "homepage_url": "http://www.masstech.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": 2001,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "",
 "phone_number": "905-886-1833",
 "description": "video workflow solutions",
 "created_at": "Mon Dec 01 15:41:21 UTC 2008",
 "updated_at": "Wed May 26 17:10:35 UTC 2010",
 "overview": "\u003Cp\u003EMasstech Group Inc. develops enterprise-level file-based video workflow solutions for television production, broadcast, and channel origination operations. Its solutions provide a framework for media lifecycle content management, business continuity and disaster recovery applications, and broadcast monitoring solutions for compliance recording. The company offers MassStore WAM Suite, a workflow based asset management platform, which allows for configurable automated processes, including file-based ingest, tape digitization, instream transcoding, production and news integration, business continuity, content delivery/distribution, and portal connectivity; MassChannel, a broadcast playout/automation appliance to deploy new channels, manage multicast programming, or provide business continuity for DR applications; and MassLogger, an appliance for professional broadcast monitoring. Its MassStore WAM Suite comprises M-Ingest that ingests content into the MassStore WAM suite content repository and moves it to shared folders, video servers, catch servers, NLE systems, and live ingest or playout devices; SAvI, which provides direct access from within the Avid environment to the MassStore WAM Suite of products; M-Connect that allows to transfer the content in and out of final cut studio from any format without going to tape; MassBrowse, an offline media preparation tool, which works with low resolution proxies or full bandwidth video files; and N-Connect that allows users to search and preview archived content within the MassStore WAM Suite and bring the content to the desired location directly from the news interface. Masstech Group also provides content repository, data movement, content transformation, and archive management services. \u003C/p\u003E\n\n\u003Cp\u003EThe company was founded in 2001 and is based in Richmond Hill, Canada. Masstech Group Inc. operates as a subsidiary of 1293551 Ontario Inc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       54],
      "assets/images/resized/0008/8618/88618v1-max-150x150.jpg"],
     [[183,
       67],
      "assets/images/resized/0008/8618/88618v1-max-250x250.jpg"],
     [[183,
       67],
      "assets/images/resized/0008/8618/88618v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "2 East Beaver Creek",
    "address2": "Building 3",
    "zip_code": "L4B 2N3",
    "city": "Richmond Hill",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        114],
       "assets/images/resized/0008/8619/88619v1-max-150x150.jpg"],
      [[250,
        191],
       "assets/images/resized/0008/8619/88619v1-max-250x250.jpg"],
      [[450,
        344],
       "assets/images/resized/0008/8619/88619v1-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}