{"name": "Mastiff Tech",
 "permalink": "mastiff-tech",
 "crunchbase_url": "http://www.crunchbase.com/company/mastiff-tech",
 "homepage_url": "http://www.techmastiff.com",
 "blog_url": "http://blog.techmastiff.com",
 "blog_feed_url": "http://blog.techmastiff.com/?feed=rss2",
 "twitter_username": null,
 "category_code": "software",
 "number_of_employees": 100,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ruby-on-rails, product-development, product-engineering, online-travel-platform-implementation, online-media-consulting, it-consulting, online-media, social-networking-sites, media-encoders, p2p, health-care, cms, podcasting-clients, rss, web-2-0, atlas",
 "alias_list": null,
 "email_address": "business@techmastiff.com",
 "phone_number": "+1-209-267-4302",
 "description": null,
 "created_at": "Fri Apr 18 07:15:37 UTC 2008",
 "updated_at": "Sat Jan 12 04:19:10 UTC 2013",
 "overview": "\u003Cp\u003EMastiff Tech is an emerging consulting service provider in consumer internet product domain. Company\u0026#8217;s primary focus is into online media, content sharing and social networking space. Having gained immense experience in different areas and developed a thorough understanding of the digital media market, mastiff team helps clients from concept to market lifecycle for their product. Company unique approach supported by the domain knowledge maintains client\u0026#8217;s ROI with high success rate and less time to market.\u003C/p\u003E\n\n\u003Cp\u003EMastiff Tech has crafted its presence in the competitive online content sharing and social networking domain. Company has core competency in all avenues of its development — from visualization of user interface and designing to implementation of robust frameworks that ensures smooth scaling of applications in web2.0 age. With time, company has utilizes its sound experience in online media domain to craft innovative solutions, which can further reduced the cost and go-to market time for an enterprise.\u003C/p\u003E\n\n\u003Cp\u003EMastiff\u0026#8217;s portfolio is enriched by clients who range from venture backed product companies, movie distribution companies, audience measurement practice for pod casts to social networking providers in different domains like sports, movies etc. In addition to developing large-scale advertising platforms, mastiff has an excellent track record of implementing best online search tools, integrating with Google ad sense, online affiliate platforms and payments gateways etc. In short, mastiff is a complete online media solutions provider in Online Media, Online Travel and Online Retail Domains.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[122,
       60],
      "assets/images/resized/0001/7452/17452v1-max-150x150.jpg"],
     [[122,
       60],
      "assets/images/resized/0001/7452/17452v1-max-250x250.jpg"],
     [[122,
       60],
      "assets/images/resized/0001/7452/17452v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office ",
    "address1": "Unit: 317-217, Building No: 2,Sector: 1, Millennium Business Park Mahape,",
    "address2": "",
    "zip_code": "400 710",
    "city": " Navi Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}