{"name": "Matwali",
 "permalink": "matwali",
 "crunchbase_url": "http://www.crunchbase.com/company/matwali",
 "homepage_url": "http://www.matwali.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sarees, buy-online-saree, indian-saree, wedding-saree, kurtis, salwar-kameez, womes-outfits, one-minute-saree, kurtas, bag, party-wear-sarees, embroidered-sarees, bandhej-sarees, catalog-collection-saree, dress, lehenga-choli, lehenga-sari, patiala-kurta,",
 "alias_list": null,
 "email_address": "kiran.rathod0093@gmail.com",
 "phone_number": "",
 "description": "Online Shopping for women",
 "created_at": "Wed May 01 04:39:52 UTC 2013",
 "updated_at": "Mon May 06 05:20:33 UTC 2013",
 "overview": "\u003Cp\u003ECulture of India raises to the religious beliefs, customs, traditions, languages, ceremonies, arts, values and the way of life in India and its people. India\u0026#8217;s languages, religions, dance, music, architecture, food, and customs differ from place to place within the country. Among all these India is more famous and recognized for its clothing. Indian clothing is known for its elegance and traditional wear all over the world.Though clothing greatly varies across the country the most popular styles of woman dress since years include draped garments very well known assari.As we all know 60% of Indian female prefer wearing sari on daily basis while remaining other definitely wear them occasionally. And when you ask any women about sarees they definitely very excitedly talk about the beautiful Surat sarees.\nIn matwali.com wemake cent percent of our afford to fulfill your choice of traditional to trendy sarees at affordable prize sitting at your home.We are an online shopping portal catering to wide spectrum of women’s clothing including designer sarees, casual sarees, bridal or wedding sarees. Matwali brings you with exclusive variety of traditional, trendy, embroidered, zari work , with andfancy varieties of Surati sarees.\nOur team is makes continuous effort to offer and inform you with wide ranges ,collection of sarees. Team is continuously engaged in satisfying our customer with best quality and ongoing sarees at affordable prizes and exclusive discounts.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}