{"name": "maudau",
 "permalink": "maudau",
 "crunchbase_url": "http://www.crunchbase.com/company/maudau",
 "homepage_url": "http://www.maudau.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "maudau",
 "category_code": "advertising",
 "number_of_employees": 15,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mau, dau, cross-promotion, cross-promotional, online-game, apps, developers, traffic-exchange, roi, network, facebook, vk, android, ios, application, agency, advertising, social-games, social-game",
 "alias_list": null,
 "email_address": "marketing@maudau.com",
 "phone_number": "+972775508159",
 "description": "network web app cross promotion platform",
 "created_at": "Tue Aug 14 13:35:10 UTC 2012",
 "updated_at": "Wed Jan 30 03:06:04 UTC 2013",
 "overview": "\u003Cp\u003Emaudau, the largest cross-promotion network for social and Mobile games, is now bringing you a N-E-W 360° solution that would assist you to grow your user base faster, stronger, and better than you have ever imagined.\u003C/p\u003E\n\n\u003Cp\u003EIt has been so easy to grow and now it\u0026#8217;s even e-a-s-i-e-r!\u003Cbr/\u003E\nSo what does growing 360° mean?\u003C/p\u003E\n\n\u003Cp\u003E 360° Cross Platform Solution – \nmaudau\u0026#8217;s powerful click-exchange model is now available across Facebook, VK, iOS, and Android\nYou can now swap traffic on one platform and boost your game growth and user base on another platform\u003C/p\u003E\n\n\u003Cp\u003E 360°  on Mobile -\nA new click-exchange feature, which is tailored specifically for mobile UX and flow, is now available \nYou can now grow your user base on iOS and Android faster, better, and easier than ever imagined\nYou can now have special \u0026#8216;More Games\u0026#8217; buttons featured to your users at strategic exit points, allowing you to benefit from your users, even as they leave your game, without giving up on game experience on the small screen… !\u003C/p\u003E\n\n\u003Cp\u003E 360° Marketing Consulting Service -\nWith over 500 leading social and mobile games in its network, maudau is closely exposed to the pain points of game developers as they struggle to grow and retain their use base in the most cost-efficient manner\nTo address these pain points, maudau has put together a new Marketing Consulting team which would work closely with selected developers on marketing and growing their game\nFormer Marketing Director of Double Down Casino has came on board to build a in-house consulting team which would advise on all aspects of game marketing, UA, and retention, with a special focus on the economics of game development and CRM.\u003C/p\u003E\n\n\u003Cp\u003E 360°  exclusive product features continuously added to our cross-promotion platform – \nNew White Label Solution – Still concerned about letting your users see your competitors\u0026#8217; games on the cross-promotion bar?  You can now use our powerful system to cross-promote internally your titles only, without featuring any 3rd party games. Pay per cost and take your internal cross-promotion activities to the next level!\nNew Fluid Vertical Bar to be placed right between your canvas and Facebook\u0026#8217;s ads …. ! – \nTired of seeing your users leaving to other games through Facebook\u0026#8217;s right-hand column ads?! You can now place the maudau bar right in the middle and get a piece of the traffic dropping out!\u003C/p\u003E\n\n\u003Cp\u003EA few facts and figures about maudau –\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003Emaudau is the largest cross-promotion network for social and mobile games, with over 20M Dau\n-Over 500 apps featured and cross-promoted across Facebook, VK, iOS and Android \u003C/li\u003E\n\u003Cli\u003EThe 1 (and ONLY) cross-promotion platform that keeps a c-l-o-s-e-d network and allows ZERO traffic to go out\u003C/li\u003E\n\u003Cli\u003ENo traffic auctioning to games that do not share their traffic in return, no external ad campaigns\u003C/li\u003E\n\u003Cli\u003E100% transparency in reporting, 5 min integration, numerous bar skin design options\u003C/li\u003E\n\u003Cli\u003E100% commission-free platform\u003C/li\u003E\n\u003Cli\u003EIt has been so easy to grow and now it’s even easier.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EBecause when it comes down to cross-promotion, it comes down to maudau.\u003C/p\u003E\n\n\u003Cp\u003Ewww.maudau.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO and CO-Founder",
    "person":
     {"first_name": "Tom",
      "last_name": "Ben",
      "permalink": "tom-ben",
      "image": null}},
   {"is_past": false,
    "title": "VP of Business Development ",
    "person":
     {"first_name": "Odelia",
      "last_name": "Lajani",
      "permalink": "odelia-lajani",
      "image": null}},
   {"is_past": false,
    "title": "Mobile Marketing Director",
    "person":
     {"first_name": "Nir",
      "last_name": "Franbuch",
      "permalink": "nir-franbuch",
      "image": null}},
   {"is_past": false,
    "title": "Senior Account Manager",
    "person":
     {"first_name": "Megane",
      "last_name": "Dreyfuss",
      "permalink": "megane-dreyfuss",
      "image": null}},
   {"is_past": false,
    "title": "Director, Agency Services",
    "person":
     {"first_name": "Phillip",
      "last_name": "Runyan",
      "permalink": "phillip-runyan",
      "image": null}},
   {"is_past": false,
    "title": "Senior Account Manager",
    "person":
     {"first_name": "Or",
      "last_name": "Mash",
      "permalink": "or-mash",
      "image": null}},
   {"is_past": true,
    "title": "Executive Advisor",
    "person":
     {"first_name": "Uri",
      "last_name": "Lancry",
      "permalink": "uri-lancry",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "Ben Avigdor 18",
    "address2": "",
    "zip_code": "61576",
    "city": "Tel Aviv",
    "state_code": null,
    "country_code": "ISR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}