{"name": "mayurdicosta",
 "permalink": "mayurdicosta",
 "crunchbase_url": "http://www.crunchbase.com/company/mayurdicosta",
 "homepage_url": "http://hydraulic-piston-pumps.made-from-india.com/",
 "blog_url": "http://hydraulic-piston-pumps.made-from-india.com/",
 "blog_feed_url": "http://hydraulic-piston-pumps.made-from-india.com/",
 "twitter_username": "stavemartin",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hydraulic-piston-pumps",
 "alias_list": null,
 "email_address": "stavemartin@gmail.com",
 "phone_number": "",
 "description": "Hydraulic Piston",
 "created_at": "Mon Apr 22 10:09:40 UTC 2013",
 "updated_at": "Mon Apr 29 15:43:21 UTC 2013",
 "overview": "\u003Cp\u003EHydraulic Piston Pumps the process of removing metal plate by using a tool at a high level of pressure. Today, there are slew of shear machines available in the market today. Two of the conventional punching machines include: small disc and blanking machines that help small metal items such as washers.\u003C/p\u003E\n\n\u003Cp\u003EThere are obvious differences between Hydraulic Piston Pumps and ordinary direct tool machining. In case of ordinary machines a single or multiple point tools are used to remove cuttings from metal sheet or block. In order to acquire the required shape, the tool is applied repeatedly on the metal until the desired result is obtained. The metal plate comes in contact with tool only once. \u003C/p\u003E\n\n\u003Cp\u003EBoth Hydraulic and mechanical machines do Hydraulic Piston Pumps. Hydraulic Piston Pumps are ideal for perfect, quick cutting as well as scoring of metal sheets. These shears are mostly used in factories having massive volumes of metal fabrication. Shops wanting serious intense pressure prefer Hydraulic Piston Pumps. The plus point of these sheers include: low maintenance and continual, quick, quiet usage. In fact hydraulic shear machines need less space than mechanical shear machines, yet generate the same amount of pressure. \u003C/p\u003E\n\n\u003Cp\u003EGiven the high pressure applied, the metal is held tightly by clamps once it’s placed inside the hydraulic machine. This thwarts any shifting from taking place. If you wish to have a smooth or even 90 degree cut then it becomes imperative to apply squaring arm or back gauge. Grinding the edges can help get rid off the small burrs created by the blade edge. \u003C/p\u003E\n\n\u003Cp\u003EToday manufacturers make hydraulic machines in different sizes and models involving an array of plate sizes. You can use different metal cuts and the scrap can be reused. The hydraulic machines available today are very different from the shearing machines of the past. Positioned inside a large stand alone unit, the machine operates very quietly. \u003C/p\u003E\n\n\u003Cp\u003EQuite a few blades inside the machines are used to cut the metal into a particular shapes and sizes. Keeping the blades sharp will not only increase efficiency, but also helps off-cuts. \u003C/p\u003E\n\n\u003Cp\u003EDemand of Hydraulic Piston Pumps in the international markets\u003C/p\u003E\n\n\u003Cp\u003EChina, Egypt, Malaysia, Ethiopia, India, Iran, Philippines, Saudi Arabia, Singapore, South Africa, United States,Vietnam\u003C/p\u003E\n\n\u003Cp\u003EProminent Places to source Hydraulic Piston Pumps from India\u003C/p\u003E\n\n\u003Cp\u003ERajkot, New Delhi, Delhi, Ahmedabad , Ludhiana, Mumbai, Chennai, Faridabad, Kolkata, Bangalore, Ghaziabad, Hyderabad, Pune, Thane, Vadodara, Gurgaon, Howrah, Indore, Jalandhar, Mandi Gobindgarh, Amritsar, Belgaum, Bahadurgarh, Ballabgarh, Coimbatore, Kolhapur, Navi Mumbai, Noida, Raipur, Secunderabad\u003C/p\u003E\n\n\u003Cp\u003EMore information at :- http://hydraulic-piston-pumps.made-from-india.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       81],
      "assets/images/resized/0025/3699/253699v2-max-150x150.jpg"],
     [[250,
       136],
      "assets/images/resized/0025/3699/253699v2-max-250x250.jpg"],
     [[450,
       245],
      "assets/images/resized/0025/3699/253699v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}