{"name": "Mazda Limited",
 "permalink": "mazda-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/mazda-limited",
 "homepage_url": "http://www.indiamart.com/mazdalimited-ahmedabad/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mazdalimited-ahmedabad@tradepassport.org",
 "phone_number": "9879106351",
 "description": "manufacturing \u0026 exporting",
 "created_at": "Thu Apr 04 13:11:50 UTC 2013",
 "updated_at": "Thu Apr 04 13:11:53 UTC 2013",
 "overview": "\u003Cp\u003EMazda Limited\u0026#8221; is a truly unique engineering company, situated in the Western Region of India. While India surges ahead in the field of manufacturing and engineering, Mazda partakes in this journey. What sets Mazda apart from its peers in India, is the fact that Mazda has acquired high powdered technologies from the West. \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy / Processes:\nAn ISO 9001:2000 Certified Company. In order to meet with the high-quality demands by power, petrochemical \u0026amp; fertiliser industries, Mazda has developed a Quality Assurance program in accordance with the requirements of ASME Boiler and Pressure Vessel Code, as well as other national \u0026amp; international standards like ANSI, ISA, TEMA and HEI. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure Facility:\nWe have set up a state-of-the-art infrastructure that is spread over a wide area. This area is divided into various units that include a production unit, quality testing unit, research \u0026amp; development unit and a warehousing unit. Our manufacturing unit is equipped with high grade machines and equipment so as to provide our clients with best-in-class products. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are blessed with a team of dexterous professionals who work in sync with one another to carry our all our business activities with ease. All our appointed professionals are highly qualified and hold immense expertise in their respective fields. We have sourcing agents who ensure that the raw material procured for our products are of high standards. Further, our team of deft quality analyzers test our manufactured products using advanced technologies to ensure their adherence to international quality standards. Furthermore, we provide regular training sessions to our clients and conduct seminars to keep them updated with the changing market conditions and advancements in technologies.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur firm holds a client-centric approach and we try our level best to maximize our clients satisfaction. We ensure that the products manufactured in our production unit is high in standards. Besides this, our researchers maintain a close and cordial relationship with our clients to take their valuable feedback and suggestions and act according to their requirements. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7919/247919v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7919/247919v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7919/247919v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}