{"name": "MBAProjectSearch.com",
 "permalink": "mbaprojectsearch-com",
 "crunchbase_url": "http://www.crunchbase.com/company/mbaprojectsearch-com",
 "homepage_url": "http://mbaprojectsearch.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mullaneydan",
 "category_code": "consulting",
 "number_of_employees": 6,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mba-startup-smallbusiness-freelance-internship-jobs-consulting",
 "alias_list": null,
 "email_address": "mullaneydan@mbaprojectsearch.com",
 "phone_number": "202-480-1252",
 "description": "Freelance MBA Site",
 "created_at": "Fri Nov 30 15:07:08 UTC 2012",
 "updated_at": "Fri Dec 14 04:08:23 UTC 2012",
 "overview": "\u003Cp\u003EWe all know one of the biggest challenges facing startups is money: where to get it, how to spend, and how you’re going to get more. Ultimately, though, the most important thing you can spend money is the talent. When you’re bootstrapping, it can be really hard to get quality labor because, let’s be honest, you just can’t afford to pay what their worth right now.\u003C/p\u003E\n\n\u003Cp\u003EThere is, however, a group of people who are down to work for less than the usual amounts: MBA students. Like any other student group, these folks are ready and willing to jump into the workforce during the two years it takes them to get their degrees.\u003C/p\u003E\n\n\u003Cp\u003EThe difference between MBA students and, say, a college undergrad is that people getting their MBAs are usually professionals who have been in the field for awhile already and are looking to bump up their cred a little bit higher. You won’t have to teach them about business casual or the fact that answering their cellphones in the front of the office isn’t really cool, because they’ve already learned all that stuff.\u003C/p\u003E\n\n\u003Cp\u003EBut how do you find these highly qualified, cheap workers? Head on over to MBA Project Search, a startup that’s looking to connect businesses with MBA students who are looking for internships, freelance work, and full-time jobs.\u003C/p\u003E\n\n\u003Cp\u003EHow does it work?\nThere are two sides to this equation: the people who are looking to hire and the people who are looking for positions. On the hiring businesses side of the equation, customers have a choice between posting for free or paying $10 to feature their post. There’s also an option to pay $5 to hide the post from search engines, in case you want to keep it more on the down low.\u003C/p\u003E\n\n\u003Cp\u003EOn the MBA student side, all the job-seeker has to do is find a job they like and post their resume (or resumes, if it’s a group project). Then they just wait and see if they get hired. Super simple, right?\u003C/p\u003E\n\n\u003Cp\u003EQuality control\nObviously a resume is a great place to start when you’re figuring out if someone will be a good fit for your project, but most people want a little more assurance. I mean, that’s why you’re more likely to get hired if you have a connection to the company that’s hiring, right?\u003C/p\u003E\n\n\u003Cp\u003EMBAProjectSearch makes sure that there’s a feedback section for every job seeker, so you can take a look and see if they’ve done good work in the past. While it’s not exactly the same as a thumbs up from a trusted friend, this component can definitely help you feel a little more confident in your choice.\u003C/p\u003E\n\n\u003Cp\u003EIt also serves the purpose of keeping job seekers honest and on their toes, while simultaneously weeding out the poor workers because enough bad reviews means you’re just not going to get hired again.\u003C/p\u003E\n\n\u003Cp\u003ESo, let’s be clear: this is a site that can hook you up with cheaper, talented labor, a site that provides jobs to a market that hasn’t been targeted up to this point, and it’s all free? Yes, yes, and yes. Sounds like a slam dunk to me.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       52],
      "assets/images/resized/0022/3188/223188v2-max-150x150.jpg"],
     [[150,
       52],
      "assets/images/resized/0022/3188/223188v2-max-250x250.jpg"],
     [[150,
       52],
      "assets/images/resized/0022/3188/223188v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Dan",
      "last_name": "Mullaney",
      "permalink": "dan-mullaney",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}