{"name": "McCartney Kay Auto Cosmetics",
 "permalink": "mccartney-kay-auto-cosmetics",
 "crunchbase_url": "http://www.crunchbase.com/company/mccartney-kay-auto-cosmetics",
 "homepage_url": "http://mccartneykay.com",
 "blog_url": "http://blog.mccartneykay.com/",
 "blog_feed_url": "",
 "twitter_username": "mccartneykay",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "headlight-lashes, car-eyelashes, dash-dash-cameras, truck-dash-cameras, purse-hooks, purse-hangers, handbag-hooks, handbag-hangers, wipers, wiper-blades, pink-wiper-blades, resqme, lifehammer, car-escape-tools",
 "alias_list": null,
 "email_address": "info@mccartneykay.com",
 "phone_number": "404-859-6035",
 "description": "Female Auto Accessories",
 "created_at": "Fri Apr 26 12:05:36 UTC 2013",
 "updated_at": "Mon Apr 29 21:30:37 UTC 2013",
 "overview": "\u003Cp\u003EMcCartney Kay Auto Cosmetics, LLC is a one-stop-shop for the fashionable woman driver looking for ways to add that personal touch of flare, femininity and personality to her vehicle! You’ll find everything from stylish, decorative accessories to useful tools for organization and safety that no woman should be without – because every woman should be able to personalize her vehicle just as much as men do!\u003C/p\u003E\n\n\u003Cp\u003EIf you are looking for a high quality dash cam in car camera with DVR and audio, look no further!\nThe TD Dash Cam is affordable and easy to use.\u003C/p\u003E\n\n\u003Cp\u003EThe affordable TD dashboard camera is easy to install.\nSimply clip the dash cam in-car camera onto your visor and plug the power cord into the cigarette lighter.\nGreat for capturing video of the driver\u0026#8217;s view or the interior of the vehicle. Dash cam videos are recorded on a micro SD card in AVI file format, for later playback on your PC, laptop or TV using the AV cable, or USB 2.0 Cable.\nRecords up to 48 hours of continuous video/audio on a 32 GB micro SD card.\n(TD Dash Cam includes a FREE 8 GB SD Card)\nThe TD Dash Cam with built-in DVR, crystal clear audio \u0026amp; high-resolution 720x480 pixel screen and 30 frames per second recording.\nWith the new TD Dash Cam you can easily record your driver\u0026#8217;s view OR interior view in real time with audio. Taxi, limousine, truck drivers, bus drivers \u0026amp; every day drivers can record everything that happens in the vehicle while driving with our dash cam in-car camera system.\nPolice use it as evidence and to protect themselves from wrongful prosecution, shouldn’t you?  Tire of hearing “Tell it to the judge”? \nNow you can show it to the judge with the time and date stamped on the video.\u003C/p\u003E\n\n\u003Cp\u003EAutoTex Pink Plus windshield wiper blades come in a standard pink color, with a small pink ribbon promoting the cause of breast cancer awareness and research. They are available in metal or frameless.  Fits over 98% of vehicles on the road, Natural molded rubber for longer life, Meets or exceeds SAE specifications and Easy installation in as little as five minutes The AutoTex PINK PLUS wiper blade is the optimal wiper replacement for drivers who are both concerned with ensuring safety through improved visibility on the road and making a bold  statement.\u003C/p\u003E\n\n\u003Cp\u003EDress your car\u0026#8217;s headlights to match your own style, fashion and sparkle with the Eyelashes for your car in Black or Pink Eyelashes. Simply attach the Headlight lashes to your car using the 3M automotive tape supplied, the flexible design of the lashes allows them to bend round almost any car headlight.\u003C/p\u003E\n\n\u003Cp\u003EThe Car•go Handbag Hook is distinctively designed to add convenience and style to your car’s interior.  The simple snap clip easily swings around to offer several placement options for securing a wide variety of items such as grocery bags, laptop bags, totes with longer straps and much more!\nA Car•go hook can also keep your belongings up off of the dirty floor mats and away from muddy shoes during carpool, keep your grocery sack and take-out food upright, prevent your rear seat DVD headphone set from being sat or stepped on, your wet umbrella off the floor and on and on \u0026#8230;  The possibilities are endless!\nAdditional Uses: Grocery Bag Laptop Bag Rear Seat DVD Headphones Kid\u0026#8217;s Book Bags Coat / Sweater Briefcase Diaper Bag Gym \u0026amp; Sporting Duffel Backpacks Sporting Equipment Beach Tote Umbrellas (Especially when wet!)\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       120],
      "assets/images/resized/0025/5279/255279v2-max-150x150.jpg"],
     [[250,
       200],
      "assets/images/resized/0025/5279/255279v2-max-250x250.jpg"],
     [[405,
       324],
      "assets/images/resized/0025/5279/255279v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Owner",
    "person":
     {"first_name": "Lyta",
      "last_name": "Williams",
      "permalink": "lyta-williams",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}