{"name": "McGraw University.",
 "permalink": "mcgraw-university-2",
 "crunchbase_url": "http://www.crunchbase.com/company/mcgraw-university-2",
 "homepage_url": "http://www.mcgrawuniversity.com/",
 "blog_url": "http://mcgrawuniversity.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "McGrawUni",
 "category_code": "education",
 "number_of_employees": 500,
 "founded_year": 2000,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mcgraw-university, mcgraw-university-reviews, about-mcgraw-university, online-mcgraw-university, mcgraw-university-accreditation",
 "alias_list": null,
 "email_address": "info@mcgrawuniversity.com",
 "phone_number": "18664974901",
 "description": "",
 "created_at": "Wed Jul 25 06:32:49 UTC 2012",
 "updated_at": "Sat Jul 28 11:30:45 UTC 2012",
 "overview": "\u003Cp\u003EMcGraw University is a premier online education university providing accredited degree programs to students and professionals from all walks of life. We are known for is known for the brilliance of our faculty and innovative learning methods. Students from diverse backgrounds and in various fields follow their dreams through our online class rooms that are flexible and extremely rewarding. At McGraw University, students learn to do creative and inventive work that makes a constructive diversity in the world.\u003C/p\u003E\n\n\u003Cp\u003EMcGraw University will enable students to learn from real life experiences and gain practical knowledge in their chosen field, may it be any field from nursing or engineering.\nOur goal is to make the education attainment process simple for students and professionals, and we provide simple solutions to meet our goals. With McGraw University’s degree options, applicants will always have a degree program. There are detailed degree programs related to all major fields and courses. Here is a preview of what McGraw offers:\u003C/p\u003E\n\n\u003Cp\u003EDegree Programs:\u003C/p\u003E\n\n\u003Cp\u003E• Associate’s Degree\n• Bachelor’s Degree\n• Master’s Degree\n• PhD Degree\u003C/p\u003E\n\n\u003Cp\u003ECertificates Program:\u003C/p\u003E\n\n\u003Cp\u003E• Course Certificate\n• Graduate Certificate\u003C/p\u003E\n\n\u003Cp\u003EDiploma Programs\u003C/p\u003E\n\n\u003Cp\u003E• Undergraduate Diploma\n• Graduate Diploma\u003C/p\u003E\n\n\u003Cp\u003EThese Degree, Diploma and Certificate Programs are offered mainly through these departments and schools:\u003C/p\u003E\n\n\u003Cp\u003E• Business and Management\n• Health Sciences\n• Computer Sciences\n• Criminal Justice\u003C/p\u003E\n\n\u003Cp\u003EThere are even other schools that signify major here are a total of 16 schools offering distinct programs.\nCan’t make up your mind? Stop stressing yourself, our expert student counselors can be contacted at any time to assist students and professional with what should be the best fit according to their liking or career. But before you talk to our representative, you need to know what is it exactly that you want out of your degree, and which field you want to get into. \u003C/p\u003E\n\n\u003Cp\u003EStudents can enroll into the degree of their choice and continue their education online without having to change their time schedules for their jobs. This is the primary advantage of a degree from McGraw University, that you do not have to compromise on your family or work life to attend college.\u003C/p\u003E\n\n\u003Cp\u003ENew students are enrolling in McGraw University everyday and achieving their dreams on a regular basis. You may also enroll today to start your degree program right away!\nIf you require more information regarding the online education procedure at McGraw University and are wondering how we can benefit you, please feel free to contact us at 1-866-497-4901. To apply at McGraw University, log on to our website www.mcgrawuniversity.com and submit your credentials so that we can start processing your application and enroll you in our next batch.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}