{"name": "McNamee Law",
 "permalink": "mcnamee-law",
 "crunchbase_url": "http://www.crunchbase.com/company/mcnamee-law",
 "homepage_url": "http://mcnameelaw.org/",
 "blog_url": "http://mcnameelaw.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "mcnameelaw",
 "category_code": "legal",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mcnamee-law",
 "alias_list": null,
 "email_address": "",
 "phone_number": "937.427.9650",
 "description": "McNamee Law - CrunchBase",
 "created_at": "Mon Apr 22 22:06:53 UTC 2013",
 "updated_at": "Mon Apr 29 15:49:37 UTC 2013",
 "overview": "\u003Cp\u003EDavid McNamee, a Beavercreek attorney and founder of the McNamee Law Office, serves residents throughout the Miami Valley and surrounding areas of Ohio. McNamee Law prides itself on treating clients with courtesy, professionalism, and promptness, while making sure they fully understand each stage of the process. Mr. McNamee believes that straightforward case management is best for all those involved, which means setting achievable, realistic expectations.\u003C/p\u003E\n\n\u003Cp\u003EFounded in 1997, McNamee Law specializes in all aspects of family law, including divorce, adoption, child support, and paternity issues. In addition, McNamee Law can assist clients with misdemeanor cases, such as traffic offenses and license suspensions, as well as real estate transactions. For companies interested in business law, the firm also offers personalized business organization support, such as incorporation and dissolution.\u003C/p\u003E\n\n\u003Cp\u003EDavid McNamee is a native of Xenia, Ohio, and graduated from Alter High School in 1988. Mr. McNamee went on to obtain his Bachelor’s degree in Mediterranean and Middle East Studies from the University of Notre Dame in 1994, graduating cum laude. David McNamee studied law at the University of Dayton for the next several years, during which time he served as an editor of the Law Review and argued cases before the Moot Court. Earning his Juris Doctor in 1997, he was honored to receive the American Jurisprudence Award and was admitted to the Ohio Bar by the Ohio Supreme Court the same year. As an active Beavercreek attorney, David McNamee is additionally a member of the Dayton Bar Association and the Greene County Bar Association. \u003C/p\u003E\n\n\u003Cp\u003EFor more information about the McNamee Law Office, including its areas of practice, please peruse the website and its detailed resource section at www.mcnameelawoffice.com.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0025/3904/253904v2-max-150x150.png"],
     [[250,
       82],
      "assets/images/resized/0025/3904/253904v2-max-250x250.png"],
     [[450,
       147],
      "assets/images/resized/0025/3904/253904v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "McNamee Law",
    "address1": "42 Woodcroft Trail",
    "address2": "",
    "zip_code": "45430",
    "city": "Beavercreek",
    "state_code": "OH",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://about.me/mcnameelaw",
    "title": "McNamee Law - About.Me"},
   {"external_url": "http://aboutmcnameelaw.com/",
    "title": "McNamee Law's website"}]}