{"name": "MedeClinic",
 "permalink": "medeclinic",
 "crunchbase_url": "http://www.crunchbase.com/company/medeclinic",
 "homepage_url": "http://www.medeclinic.in/",
 "blog_url": "http://medeclinic.blogspot.in/",
 "blog_feed_url": "http://medeclinic.blogspot.in/feed/",
 "twitter_username": "medeclinic",
 "category_code": "software",
 "number_of_employees": 20,
 "founded_year": 2011,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "clinic-software, clinic-management-software, emr-software, pms-software",
 "alias_list": null,
 "email_address": "support@medeclinic.in",
 "phone_number": "02230912345",
 "description": "Care Beyond Clinic",
 "created_at": "Tue Sep 25 10:14:49 UTC 2012",
 "updated_at": "Thu Oct 11 18:34:51 UTC 2012",
 "overview": "\u003Cp\u003EMedeclinic is a bundle of joy for the clinicians. The user friendly navigation makes it very easy for even the not so tech savvy doctors to fill in their complete practice profile, add locations, schedule, or even cancel appointments. The appointment slot for a fixed appointment would never clash with any other appointment as once scheduled it would get freeze. Though you could re-schedule or cancel the appointment at your end.\u003C/p\u003E\n\n\u003Cp\u003ENot only for doctors would the patient benefit a lot. No more they have to keep calling the doctors’ clinic to know whether he is available or not. The “My Holidays” section allows the doctors/ healthcare professionals to inform their patients about their unavailability. Isn’t this really wonderful and useful too? Even the doctors’ staff could maintain this really easy to use clinical data management cloud based software. As said this EMR software is cloud based so it could be updated and maintained from any where and everywhere.\u003C/p\u003E\n\n\u003Cp\u003EComing back again to the patient detail page, it is so richly and extensively designed that you would get every piece of information from the page. Even patients’ previous electronic medical records file could be uploaded. This feature allows the doctors to get complete information about the patients’ medical history and so he could start the procedure accordingly.\u003C/p\u003E\n\n\u003Cp\u003ESo doctors now gear up and embrace the future of healthcare IT i.e. the medeclinic. The USP of medeclinic is that it is very much affordable and offers a whole new working professional lifestyle.\nCut off your expense \nPrescribe electronically\nNo time wasting looking for charts\nMultiply your profits\nAccess from anywhere and everywhere \n These features along with many other make medeclinic the most sought after clinical data management software. So why wait and see others marching ahead of you. Act today and enrol for the really useful EMR software i.e. Medeclinic.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "4 / A-1, Court Chambers",
    "address2": "35, New Marine Lines",
    "zip_code": "400020",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.medeclinic.in/",
    "title": "clinical data management"}]}