{"name": "Mediology Software",
 "permalink": "mediology-software",
 "crunchbase_url": "http://www.crunchbase.com/company/mediology-software",
 "homepage_url": "http://www.mediologysoftware.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mediology",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "emagazine, content-management-solutions, social-networking-solutions, flash-flip-book, magazine-workflow-management, mailing-solution",
 "alias_list": null,
 "email_address": "sales@mediologysoftware.com",
 "phone_number": "+91-9717182182",
 "description": "Digital Publishing software company.",
 "created_at": "Mon Nov 02 12:00:28 UTC 2009",
 "updated_at": "Tue Sep 07 22:38:15 UTC 2010",
 "overview": "\u003Cp\u003EMediology Software provides products and solutions for the media and publishing industry.\u003C/p\u003E\n\n\u003Cp\u003EOfferings can be broadly categorized in the following categories:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EPr- Press Editorial workflow management: This solution is meant specifically for collaboration before a magazine or a journal is ready for print. This includes setting up tasks for content authoring, taking content through an editorial approval process, doing layout design and eventually doing the pagination for final output of the publication.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EDigital Press online publishing: This solution allows a print publication to be offered on the internet in form of a highly interactive and content rich website. The homepage of the website can be customized to have editorial content or select articles on it. Each article has its own page on the website. The entire website is searchable and archives can be separately browsed. This solution is very search engine friendly. We offer interactive elements so users can register on the website, comment on articles, rate them and also chat with each other in real time. In addition, users can also carry out discussions in groups and forums that are directly integrated within the website. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ESocial Sense social networking: Allow your web visitors to sign up, create profiles, interact with each other as well as you via ratings, comments, reviews and more. Our social sense toolbar is a great way to bring better content discoverability and encourage visitor participation on your website. We offer range of social networking solutions starting from simple comments and ratings to micro-blogging and full fledged facebook type social networks.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EE-magazine: An e-magazine solution will take the print version of your journal and create an exact replica of it on the internet. This will be a visually similar to a book and user can flip through each page and zoom in to the page that they want to read. They would also be able to search for text within the pages. Users can also leave comments on the site\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EE-paper:An e-paper solution offers hassle free, real Replica publishing of your print edition online. The e-paper can publish any TV Commercial advertisement, Pop up/under Ad, Banner Ad, Text Ad and Flash/Video Ad for your online edition while all published ad should be at same place as on print with value addition of hyperlinks emails \u0026amp; URLs. The e-paper offers Smart and easy navigation through each corners, navigation buttons, indexing and skip page features and easy print, mail and PDF download facility.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EMobile Application: We have developed an integrated solution for distributing magazines on all mobile devices. The way it works is that we create a custom XML feed from the existing site/CMS. Then using that XML feed and the PDF of your issue it will work on Blackberry, ipad . Iphone and  a WAP based version. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EMonetize: Monetization is basically why you want to be online! We work with you to open new revenue channels for your web properties. These include an ad serving solution, matrimonial solution, white labeled offerings like classifieds or travel booking engines as well as fostering strategic alliances with other ecommerce or content portals. \u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E",
 "image":
  {"available_sizes":
    [[[149,
       51],
      "assets/images/resized/0006/4493/64493v2-max-150x150.png"],
     [[149,
       51],
      "assets/images/resized/0006/4493/64493v2-max-250x250.png"],
     [[149,
       51],
      "assets/images/resized/0006/4493/64493v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "papermart",
      "permalink": "papermart",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Development Office",
    "address1": "728 Udyog Vihar ",
    "address2": "Phase-V",
    "zip_code": "122016",
    "city": "Gurgaon",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}