{"name": "Medilek Instruments",
 "permalink": "medilek-instruments",
 "crunchbase_url": "http://www.crunchbase.com/company/medilek-instruments",
 "homepage_url": "http://www.indiamart.com/medilek-instruments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "medilek-instruments@tradepassport.org",
 "phone_number": "9480100931",
 "description": "manufacturer and supplier",
 "created_at": "Thu Apr 04 13:18:39 UTC 2013",
 "updated_at": "Thu Apr 04 13:18:41 UTC 2013",
 "overview": "\u003Cp\u003EMedilek Instruments is a sole proprietorship based business concern, which was incorporated in the year 1996 at Bengaluru, Karnataka. We are one of the reputed manufacturer, supplier and service provider of Baby Incubators, Radiant Warmers, Double Surface Phototherapy Unit, Transport Incubators and many more. Our products are the first choice of our clients due to their performance centric quality standards. We also customize these products as per the various requirements and specifications of clients. All our products are cost effective and at the same time the quality exhibited by them is top-class. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have built a sprawling infrastructure, which is equipped with hi-tech machinery, handled by our deft professional. To execute all the business activities in streamlined manner, we have segmented our premises in different segments. This categorization has been done, to complete all the tasks with perfection without any delays. These departments are manufacturing, quality auditing, warehousing \u0026amp; packaging and testing. In addition to this, our manufacturing unit has huge production capacity that enables us to meet the bulk requirement.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nQuality being the epitome of manufacturing, we have employed skilled man force who are highly experienced. Our apex aim is to maintain supremacy, which is only possible through stringent quality checks that are regularly done by supervisors who are allotted for the work. These professionals supervise raw material procurement as well as the entire production process.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team consists of professionals who are known for their skills and dedication. With up to the mark quality, we have catered to the various needs of our clients. Professionals associated with us are outstandingly experienced, hence, contributing to the demands of the market. Our main objective is to understand the shortcomings in order to attain production in large scale. With set goals, we have managers who keep constant check so that our aims can be achieved in the given time frame. \u003C/p\u003E\n\n\u003Cp\u003EService / Reconditioning:\u003Cbr/\u003E\nWe also undertake service / reconditioning of any make of Baby Incubator, Radiant Warmer and Photo Therapy Units.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have been catering to the relevant industry for a while now and have attained experience in delivering our clients with products which are long-lasting. The company has developed the capability to cater to huge market demands which makes us the one stop destination to attain quality centric products.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7921/247921v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7921/247921v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7921/247921v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}