{"name": "Medzee",
 "permalink": "medzee",
 "crunchbase_url": "http://www.crunchbase.com/company/medzee",
 "homepage_url": "http://www.medzee.in/dentists/bangalore/indiranagar/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "MedZee is an online portal which brings ",
 "created_at": "Tue Mar 26 07:42:38 UTC 2013",
 "updated_at": "Tue Mar 26 07:42:40 UTC 2013",
 "overview": "\u003Cp\u003EMedZee is an online portal which brings together patients with their doctors. We help patients book a confirmed appointment with their dentist. Gone are the days of tiresome wait in the dentist’s clinic. Gone are the days where you are not sure how good the dentist is. Gone are the days of worrying how much a particular treatment is going to cost you. MedZee solves all these problems and much more. MedZee is partnering with all the dentists in order to ensure that you not only know who the best dentist is, but also the closest one to you.\u003C/p\u003E\n\n\u003Cp\u003EThrough MedZee a patient sees all he needs to know about a particular clinic and/or doctor, before actually being to the clinic. Starting from the location of the clinic, contact details work timings, reviews of the clinic / doctor by other patients, information about the doctor, the services he provides and its prices. The patient can also see when the doctor is free on a particular day, and book a confirmed appointment with the doctor at that particular time.\u003C/p\u003E\n\n\u003Cp\u003EWhen almost everything in this world is going online, MedZee wants to be the one stop portal for all your appointment booking needs. With its user friendly design and awesome features, MedZee solves all the problems of the common man at no charge. Time is of the essence in today’s world, and through MedZee, patients can save their valuable time which otherwise is generally spent waiting in a lobby anxiously.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/5562/245562v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/5562/245562v2-max-250x250.jpg"],
     [[450,
       450],
      "assets/images/resized/0024/5562/245562v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}