{"name": "Mefero",
 "permalink": "mefero",
 "crunchbase_url": "http://www.crunchbase.com/company/mefero",
 "homepage_url": "http://mefero.com",
 "blog_url": "http://blog.mefero.com",
 "blog_feed_url": "",
 "twitter_username": "mefero",
 "category_code": "mobile",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business, mobile, start-up, solution, suite, customer, service, warranty, claim, tracker",
 "alias_list": null,
 "email_address": "we@mefero.com",
 "phone_number": "224-572-9461",
 "description": "Mobile business solution",
 "created_at": "Sat Aug 13 08:36:41 UTC 2011",
 "updated_at": "Wed Mar 27 19:47:05 UTC 2013",
 "overview": "\u003Cp\u003EMefero is a mobile business solution for every businessman and women. \u003C/p\u003E\n\n\u003Cp\u003EMefero, in itself, is a mobile application suite for every businessman. It turns an Android/OS/Windows device into a Blackberry essentially. Things such as travel details, contacts, e-mails, QR codes, business cards, documents, signatures\u0026#8230;essentially, a briefcase, is all intelligently sorted through within the users\u0026#8217; smart phone. Anything uploaded is accessible anytime, anywhere via cloud servers access. Currently, we\u0026#8217;re within BizSpark\u0026#8217;s program, and are looking to approach RIM to promote the app as an alternative to the Android/OS/Windows phenomenon. \u003C/p\u003E\n\n\u003Cp\u003EPrior to launch, Mefero is also releasing its very own product - Claim Tracker (CT). Claim Tracker takes all the pains of customer service and turns it into a breeze. For example, say a customer purchases a new TV with a warranty. Traditionally, one would have to store the paperwork and receipts very carefully and organized. However, with CT, they can upload their receipts, input all their paperwork and warranty details, and be completely up to speed with it. Anytime they have a problem with the TV, they simply log onto the website and their information is there, easily stored and categorically accessible. Furthermore, several months before your warranty is about to expire, CT will shoot the user a reminder e-mail reminding him or her about the warranty, in case any claim needs to be created. Beyond warranties, CT will also be an essential to dealing with customer service. Things like uploading the phone conversation, or making detailed notes/summaries of each phone conversation, as well as the rep\u0026#8217;s name, ID #, etc. can all be inputted and tracked directly on the site. \u003C/p\u003E\n\n\u003Cp\u003ETogether with these two services, we hope to help the business world and make the lives of businessmen and women much easier, while still be innovative.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0014/9340/149340v2-max-150x150.png"],
     [[250,
       83],
      "assets/images/resized/0014/9340/149340v2-max-250x250.png"],
     [[340,
       113],
      "assets/images/resized/0014/9340/149340v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Co-Founder",
    "person":
     {"first_name": "Hardik",
      "last_name": "Pandya",
      "permalink": "hardik-pandya",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        73],
       "assets/images/resized/0014/9339/149339v2-max-150x150.png"],
      [[250,
        121],
       "assets/images/resized/0014/9339/149339v2-max-250x250.png"],
      [[450,
        219],
       "assets/images/resized/0014/9339/149339v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}