{"name": "MeghaSales Enterprises",
 "permalink": "meghasales-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/meghasales-enterprises",
 "homepage_url": "http://www.indiamart.com/meghasalesenterprises/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cap, collar-tee-shirt, chapati-maker, chargeable-torch, coffee-maker, cutlery-set, electric-lunch-box, hot-case, etc-",
 "alias_list": null,
 "email_address": "meghasalesenterprises@tradepassport.org",
 "phone_number": "9560658922",
 "description": "Manufacturing and Exporting ,",
 "created_at": "Fri Apr 05 06:14:56 UTC 2013",
 "updated_at": "Fri Apr 05 06:14:58 UTC 2013",
 "overview": "\u003Cp\u003ELocated at New Delhi (India), we, “Megha Sales Enterprises” are leading Manufacturer, Supplier, Wholesaler and Exporter of qualitative gamut of Apparels Items, Household Electronic Items, Occasions, Household Items, Crystal \u0026amp; Acrylic Items, Marbles and Special Moments such as Cap, Collar Tee Shirt, Chapati Maker, Chargeable Torch, Coffee Maker, Cutlery Set, Electric Lunch Box, Hot Case, etc. These products are designed and manufactured using high-grade raw material and latest technology under the guidance of skilled team of professionals. \u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nAllahabad Bank\nBank Of Baroda\nBank Of India\nOriental Bank Of Commerce\nUnited Bank Of India\nCentral Bank Of India\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a quality-centric organization, we lay immense emphasize on the quality of the offered products. Our offered products are manufactured using top-notch quality raw material and latest technology in compliance with international standards. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a dexterous team of professionals who help in manufacturing and exporting superior quality range of products. The knowledge of our expert personnel and their in-depth knowledge help us in achieving the defined organizational goals like quality production and optimum client satisfaction. Their full dedication and commitment has enabled us to manage an invincible position in the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWith the assistance of our state-of-the-art infrastructure, we have become a prominent manufacturer and exporter of a wide range Apparels Items, Household Electronic Items, Occasions, Household Items, Crystal \u0026amp; Acrylic Items, Marbles and Special Moments. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nApparels Items, Household Electronic Items, Occasions, Household Items, Crystal \u0026amp; Acrylic Items, Marbles and Special Moments such as Cap, Collar Tee Shirt, Chapati Maker, Chargeable Torch, Coffee Maker, Cutlery Set, Electric Lunch Box, Hot Case, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8315/248315v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8315/248315v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8315/248315v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}