{"name": "Melify Inc.",
 "permalink": "melify-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/melify-inc",
 "homepage_url": "http://www.Melify.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 12,
 "founded_year": 2004,
 "founded_month": 2,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "internet, mobile, tablets, smart-phones",
 "alias_list": null,
 "email_address": "Melify@yahoo.com",
 "phone_number": "6463031234",
 "description": "Internet Application Service Provider",
 "created_at": "Sun Oct 21 18:33:12 UTC 2012",
 "updated_at": "Fri Oct 26 18:08:59 UTC 2012",
 "overview": "\u003Cp\u003EWe have built a reputation for excellence by providing a flexible portfolio of consultancy, research and design to the leading producers of interactive systems.\nNow in our ninth year, we are expanding our services and tools for clients in order to help them realise even more value by understanding even more about their end users. We are a wholly independent, privately owned company.\nOrganisations, their projects and their products are radically different. We have no preferred approach other than a firm belief that the more you systematically build an understanding of your users into your designs, the better these designs will aid your business goals. We engage in a different way with each client, and recommend different activities to get the best results.\nWe are often complimented that we understand more about our clients\u0026#8217; domains than they do themselves.\nOur consultancy team is highly focused in the following areas:\nUsability\nUser Centered Design\nHigh-Fidelity Prototyping\nSystem and Usability Testing\u003C/p\u003E\n\n\u003Cp\u003EBenefits in getting us involved\u003C/p\u003E\n\n\u003Cp\u003EHelp you integrate Usability and User Centered Design best practices into your environment\nDesign High-Fidelity prototypes to ease communications and development\nHelp you understand new technologies and how to best use them\nHelp you in the software tools selection process that fits your team\u0026#8217;s expertise\nSetup usability goals, test scenarios and an environment to fit your organization\nHelp lower development and maintenance cost and time up to 75%\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}