{"name": "Memplai",
 "permalink": "memplai",
 "crunchbase_url": "http://www.crunchbase.com/company/memplai",
 "homepage_url": "http://www.memplai.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Memplai",
 "category_code": "web",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 5,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "video-editing, online-video-editing, collaborative-editing, cloud-editing",
 "alias_list": null,
 "email_address": "gus@memplai.com",
 "phone_number": "",
 "description": "Collaborative On-Line Video Editing",
 "created_at": "Wed Apr 25 14:21:12 UTC 2012",
 "updated_at": "Sat May 26 07:06:12 UTC 2012",
 "overview": "\u003Cp\u003EAt Memplai.com, our goal is to provide our customers with an easy and useful environment to collaborate with your friends and family to create fun and exciting video clips. We aim to give you all the tools you need to create lasting memories in a medium that makes it easy to share with your social network.\nIn our site, you are in charge of your own production, we allow you to create your own virtual work space, which we call Video Projects. You can create projects, invite the people that you would like to participate, create as many videos as you want by using our online video editors. Finally we have made it easy for you to share your creations with your social network. \u003C/p\u003E\n\n\u003Cp\u003EFeatures\nCreate Video Projects\nThink of a video project as a virtual work space dedicated to a particular project. You can create as many video projects as you would like and configure them separately as needed. For example, I can create a \u0026#8220;Camping 2011\u0026#8221; project and invite all the friends that went with me on the trip. I can also create a different project called \u0026#8220;Peter\u0026#8217;s Roast\u0026#8221;, to this project I would invite all friends that would have something to say to Peter.\nFrom the files received in an individual work space, the project owner can generate as many videos as he/she wants. \u003C/p\u003E\n\n\u003Cp\u003EInvite People To Participate\nOnce a video project is created, you probably want to invite friends and family to collaborate with you by sending you all files relevant to the project. Notice that people you invite do not need to register with memplai.com to collaborate in your project; we have made it as easy as possible so you get the files you need to create your awesome video clip.\nYou can send invitations via Email or with direct messages on Twitter. Whichever method you prefer, your friends will get a link which will allow them to upload files directly into your video project.\u003C/p\u003E\n\n\u003Cp\u003EUpload Files\nUsers can upload files from their computer, or select from their photo library at Facebook. Either way, we\u0026#8217;ve made it easy and secure to upload pictures into the video project, and make it immediately available to use when creating a video clip.\u003C/p\u003E\n\n\u003Cp\u003EOnline Video Editors\nCreating videos online is a breeze with your video editors. You can currently select from one of our two video editors:\nStandard: Simple story line, with ability to remix videos and images, add effects and texts to images, add transitions and add soundtracks.\nAdvanced: All the benefits of the Standard Editor, plus timeline based editing, add text slides, extended library of effects, overlays and transitions.\nAfter your video is created, it will immediately be available for you to watch and share.\u003C/p\u003E\n\n\u003Cp\u003EQuick Sharing\nNow that you have created an awesome video, share it with your friends! We have included quick links to easily share with the most popular social networks. You\u0026#8217;ve done a great job\u0026#8230; go and brag about it !\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "President and Founder",
    "person":
     {"first_name": "Gus",
      "last_name": "Bobotsis",
      "permalink": "gus-bobotsis",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        83],
       "assets/images/resized/0018/7974/187974v2-max-150x150.png"],
      [[250,
        139],
       "assets/images/resized/0018/7974/187974v2-max-250x250.png"],
      [[450,
        251],
       "assets/images/resized/0018/7974/187974v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        83],
       "assets/images/resized/0018/7976/187976v2-max-150x150.png"],
      [[250,
        139],
       "assets/images/resized/0018/7976/187976v2-max-250x250.png"],
      [[450,
        251],
       "assets/images/resized/0018/7976/187976v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://startuptunes.com/2012/05/25/memplai-create-unique-videos-easily-and-share/",
    "title": ""}]}