{"name": "Mens Custom Dress Shirts -NattyShirts New York, NY NYC, United States",
 "permalink": "mens-custom-dress-shirts-nattyshirts-new-york-ny-nyc-united-states",
 "crunchbase_url": "http://www.crunchbase.com/company/mens-custom-dress-shirts-nattyshirts-new-york-ny-nyc-united-states",
 "homepage_url": "http://www.nattyshirts.us/",
 "blog_url": "http://www.blog.nattyshirts.us/",
 "blog_feed_url": "http://www.nattyshirts.us/feed",
 "twitter_username": "nattyshirtsusa",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2003,
 "founded_month": 2,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "design, internet, shopping, shirt, clothes, dress-shirts, mens-clothing, mens-shirts, custom-shirts",
 "alias_list": null,
 "email_address": "support@nattyshirts.us",
 "phone_number": "(917) 284-9536",
 "description": "Order Online Mens Custom Dress Shirts.",
 "created_at": "Tue Jan 15 18:19:21 UTC 2013",
 "updated_at": "Thu Jan 17 08:32:15 UTC 2013",
 "overview": "\u003Cp\u003E“NattyShirts.us” has been in existence since 2003. We were in existence under the name of “Spades” and were only doing business in The USA with a few known Wall Street investment bankers. Positive fee back from the big wigs on a yearly basis we decided to go public and in 2009 opened our website and started marketing a little more extensively in the US market especially in New York. We started to get good response from our specific market which involves only high end clientele such as (Lawyers, Investment Bankers, and Doctors\u0026amp; Corporate Managers). Due to the work and effort put into our specific made to measure Dress shirt, it requires time effort and meticulous stitching for instance some of the points that keeps us ahead and competitive with the rest of the big giants in the industry such as (Shirts my way, Proper cloth, Georgentie, Tailor Made).\u003C/p\u003E\n\n\u003Cp\u003E1-Single needle stitching: stitching of this sort is sign of elegance and we give you 18 to 20 stitches per square inch there are a hand full of companies in the world at this point that give you such quality.\u003C/p\u003E\n\n\u003Cp\u003E2-Another key point that we provide to all our clientele is the Removable collar bone ,we put these strips of collar stays to keep the crisp and shape of the collar even after extensive dry cleaning and Laundry, all you have to do is take them out and re insert them after cleaning and ironing.\u003C/p\u003E\n\n\u003Cp\u003E3-Our collar are fused at a German engineered Collar fusing plant so there is no puckering or air left in the collar or cuff to give that smooth sleek and clean look.\u003C/p\u003E\n\n\u003Cp\u003E4-We use the highest quality 100% Egyptian cotton which is double refined to give you the smooth and soft texture of our fabric and we are up to par with all the latest colors and fashions in the Dress and casual shirt market.\u003C/p\u003E\n\n\u003Cp\u003E5-Buttons which also give the look of the shirt we provide you with dyed buttons according to the fabric shades. The traditional way is only two colors on buttons Black\u0026amp; White. This particular feature is provided to you with no extra cost.\u003C/p\u003E\n\n\u003Cp\u003E6-Another feature that we provide that no one in the industry provides is ‘Door to Door ‘ service no one in this industry does that .The only reason we do this is keeping our clients valuable time in consideration and them not having enough time for themselves to go shop due to the hustle \u0026amp; bustle  corporate world deals and high demand for doctors, unstable stock market investment bankers on the move at all times, keeping all this in mind we want you to be at ease at least when your shopping for yourself and not stuck in traffic on your way to the mall or clothing store that is where our on line service and local sales rep come in handy we are just a phone call away.\u003C/p\u003E\n\n\u003Cp\u003E7-Monogram Initials on dress shirts is a great way of personalizing your dress shirt, not only does it give a second take when you look at the person’s dress shirt but expresses individuality. At Nattyshirts.us we allow you to place up to six characters on the pocket and the other most common and elegant placement is on the individuals left cuff. You also have the luxury of choosing the color of the thread and the font for the monogram or Initials. There is a small fee we charge for this because it not being every individual’s requirement so we have to get it done from an outside source.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0022/9849/229849v2-max-150x150.png"],
     [[182,
       30],
      "assets/images/resized/0022/9849/229849v2-max-250x250.png"],
     [[182,
       30],
      "assets/images/resized/0022/9849/229849v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "NattyShirts New York",
    "address1": "1274, Hancock Street",
    "address2": "",
    "zip_code": "10036",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": 40.693065,
    "longitude": -73.909995}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        106],
       "assets/images/resized/0022/9848/229848v2-max-150x150.jpg"],
      [[250,
        176],
       "assets/images/resized/0022/9848/229848v2-max-250x250.jpg"],
      [[450,
        318],
       "assets/images/resized/0022/9848/229848v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.nattyshirts.us/custom-dress-shirts.php",
    "title": "Custom Dress Shirts Online -NattyShirts New York, NY NYC, United States"},
   {"external_url": "http://www.nattyshirts.us/custom-tailored-shirts.php",
    "title": "Custom Tailored Shirts -NattyShirts New York, NY NYC, United States"},
   {"external_url": "http://www.nattyshirts.us/custom-made-shirts.php",
    "title": "Custom Made Dress Shirts -NattyShirts New York, NY NYC, United States"},
   {"external_url": "http://www.nattyshirts.us/mens-cutom-dress-shirts-guidelines.php",
    "title": "Mens Custom Dress Shirts Online -NattyShirts New York, NY NYC, United States"}]}