{"name": "MentorHealth",
 "permalink": "mentorhealth",
 "crunchbase_url": "http://www.crunchbase.com/company/mentorhealth",
 "homepage_url": "http://www.mentorhealth.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-healthcare-training, hospital-management, healthcare-compliance, risk-management, hazard-prevention, safty-management, hipaa, osha",
 "alias_list": null,
 "email_address": "mentorhealth84@gmail.com",
 "phone_number": "8003851607",
 "description": "online healthcare training",
 "created_at": "Thu May 09 11:12:33 UTC 2013",
 "updated_at": "Mon May 13 03:52:19 UTC 2013",
 "overview": "\u003Cp\u003EMentorHealth is a comprehensive training source for healthcare professionals. Our trainings are high on value, but not on cost. MentorHealth is the right training solution for healthcare professionals. With MentorHealth, healthcare professionals can make use of the best benefits relating to their professional training. \u003C/p\u003E\n\n\u003Cp\u003E• They can get the benefit of advice from experts in the field. \n• Healthcare professionals will have the flexibility of viewing recorded webinars at their convenience.\n• MentorHealth offers online interactive participation. Using this, healthcare professionals, no matter which part of the world they are based in, will have the opportunity to listen to and interact with some of the most   accomplished experts in the healthcare Industry. \u003C/p\u003E\n\n\u003Cp\u003EMentorHealth is driven by a core objective –that of being a platform for learning and discussion to address some of the important issues and challenges that the healthcare community, consisting of healthcare workers from doctors to nurses to other support staff, is up against in today‘s scenario. Various aspects of healthcare, such as Meaningful Use, Patient Protection and Affordable Care Act of 2010, HIPAA, HITECH Act, Stark and Anti Kickback Act, Valid Consent, Patient Safety and Process Improvement, Patient Safety and Quality Outcomes, Healthcare Information Technology Standards Panel (HITSP), Substance Abuse and Mental Health Records, Nursing Informatics, Healthcare Disclosure, Electronic Transactions Standards such as 5010 and ICD-10, Electronic Health Records, Stimulus Code, Healthcare Information Exchange, Healthcare Information Technology, Medical Necessity, Personal Health Records, Clinical Decision Support, Financial Management and ROI, Electronic Prescribing, Healthcare Information Systems, Clinical Informatics, Insurance Claim Appeals, Auto ID and Bar Coding, Integration and Interoperability, Risk Management in the Retention and Destruction of Medical Records and Medical Records Law, to name just a few, are covered. \u003C/p\u003E\n\n\u003Cp\u003EAnother of our aims is to provide on-demand consulting services and customized training programs. We have wholesome and valuable offerings in these and related areas. We would be glad to have you take a few minutes to check out these. You are welcome to contact us anytime if you have any queries or clarifications or need additional information. \u003C/p\u003E\n\n\u003Cp\u003EMentorHealth is the latest addition to a growing list of specialized continuing education web portals from NetZealous LLC. With over 500 trainings conducted successfully in the last year under the brand GlobalCompliancePanel and having around 15000 satisfied customers, we at NetZealous have now ventured into providing healthcare-centric trainings. The response from our customers and the relationship we have had with our panel of experts on GlobalCompliancePanel has given us the confidence to foray into other niche areas of expertise. A comprehensive list of categories and topics is available.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[100,
       100],
      "assets/images/resized/0026/0438/260438v2-max-150x150.jpg"],
     [[100,
       100],
      "assets/images/resized/0026/0438/260438v2-max-250x250.jpg"],
     [[100,
       100],
      "assets/images/resized/0026/0438/260438v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}