{"name": "Mera Print",
 "permalink": "mera-print",
 "crunchbase_url": "http://www.crunchbase.com/company/mera-print",
 "homepage_url": "http://www.meraprint.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "MeraPrint",
 "category_code": "advertising",
 "number_of_employees": 20,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "offset, digital, printing",
 "alias_list": null,
 "email_address": "media@meraprint.com",
 "phone_number": "91-141-5170277",
 "description": "Offset Printing Company",
 "created_at": "Tue Feb 19 05:56:44 UTC 2013",
 "updated_at": "Mon Feb 25 05:12:01 UTC 2013",
 "overview": "\u003Cp\u003EMeraPrint.com, a leading social site, has served you for a long time and is responsible for online printing company in India; it has established itself as a major player in the industry with its distinct vision and clear approach to helping small businesses grow. It serves thousands of on-demand business printing and graphic printing orders online daily, and this is the reason which has enhanced our growth and so yours. We use high-quality press printing and a robust yet simple and easy-to-use online ordering system, resulting in high-end printing services and reliable color printing at cheap prices. We have come this further with your support and have given you all the benefits, therefore you can trust us in every respect.\u003C/p\u003E\n\n\u003Cp\u003EMeraPrint provide specialization in printing of brochures, books, calendars, flyers, magazines, banners, bookmarks, business cards, catalog, carbonless forms, CD/DVD, CD jackets, Christmas cards, booklets, bottle neckers, clings, display boards, diwali cards, packaging boxes, envelopes, exhibition stands, greeting cards, stationery and much more at cheap prices. Our innovative printing solutions have helped clients to increase productivity and promote their business, this is the fact we are getting into the mind of common people. This retreat of ours is only possible with your support so for any detail you can log on to MeraPrint.com.\u003C/p\u003E\n\n\u003Cp\u003EWith its signature easy-to-use website interface, Offset and digital printing company MeraPrint.com offers convenient marketing support such as print design services, custom online printing quotes and direct mailing to help the small or medium-sized business grow. Whatever you’re promotional needs, from business card printing to full color brochure printing to postcard printing services and beyond, MeraPrint have the solution. \u003C/p\u003E\n\n\u003Cp\u003EAt MeraPrint.com, we strive to be your single source for all your print media through quality, competitive pricing, knowledgeable customer service, and on-time delivery. We appreciate the opportunity to prove to you why our customers rely on MeraPrint.com for all their printing needs and we are sure that we will stand high on your upcoming demand. Sincere thanks from MeraPrint.com.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/7599/237599v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0023/7599/237599v2-max-250x250.jpg"],
     [[276,
       276],
      "assets/images/resized/0023/7599/237599v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Managing Director",
    "person":
     {"first_name": "Akshay",
      "last_name": "Agarwal",
      "permalink": "akshay-agarwal-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Agarwal",
    "is_past": false,
    "provider":
     {"name": "Akshay",
      "permalink": "akshay",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Digital Printing Company",
    "address1": "B 92 Nehru Nagar Near Jain Temple Jaipur",
    "address2": "",
    "zip_code": "302016",
    "city": "Jaipur",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/q61f9YEzRO8?feature=player_detailpage\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EMeraprint is a Online Digital and offset printing company in India. 100% Guaranteed quality color printing from any digital file for brochures, business cards, packaging boxes, flyers, stationary, postcards, digital printing and more. cheap prices, award \u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}