{"name": "Mercury International",
 "permalink": "mercury-international",
 "crunchbase_url": "http://www.crunchbase.com/company/mercury-international",
 "homepage_url": "http://www.indiamart.com/mercuryinternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cargo-lishing, cargo-rope-thimbles",
 "alias_list": null,
 "email_address": "mercuryinternational@tradepassport.org",
 "phone_number": "+(91)-(22)-66333121/66333122",
 "description": "Suppliers of cargo lishing",
 "created_at": "Fri Apr 05 05:51:31 UTC 2013",
 "updated_at": "Fri Apr 05 05:51:33 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nEstablished in the year, 1978, we \u0026#8216;Mercury International\u0026#8217; are noteworthy organization involved in manufacturing, supplying \u0026amp; trading a remarkable range of Rope Slings, Nets and Hardware Tools.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are privileged to have a conscientious team of professionals; owing to its meticulous efforts we are able to confront challenges. Our team employs striven efforts to execute the entire production process, including procurement of the raw material till the final delivery of the products in a streamlined manner so as ensure flawlessness.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure;\nWe possess an ultramodern and considerable infrastructure set up at Mumbai (Maharashtra). Infrastructure which we have developed is accoutred with all the technically advanced machinery and provided with requisite facilities. Supported by such infrastructure we are able to manage an alacritous rate of production in a hassle free manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance;\nWe have been noted for offering quality-assured product-line our esteemed clients. We are ISO 9001 Registered company. Product-line, which we offer is manufactured by making use of supreme quality requisite raw material, procured from the accredited vendors of the industry.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction;\nWe make continuous efforts in direction to attain the complete satisfaction of our clients. Being a noteworthy organization, we explore the entire avenue to surpass expectations of our clients with product-array and business policies. With an aim to cater to the demands of clients, we offer a qualitative product-array, which is developed in accordance with the illustrated quality parameters of the industry.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nOwing to our wide range of products and experienced team of professionals, we have been able to establish ourselves at a reputed market place in this domain. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       83],
      "assets/images/resized/0024/8286/248286v2-max-150x150.jpg"],
     [[125,
       83],
      "assets/images/resized/0024/8286/248286v2-max-250x250.jpg"],
     [[125,
       83],
      "assets/images/resized/0024/8286/248286v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}