{"name": "Mercury Global Partners",
 "permalink": "mercury-global-partners",
 "crunchbase_url": "http://www.crunchbase.com/company/mercury-global-partners",
 "homepage_url": "http://www.mercuryglobalpartners.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mmhull",
 "category_code": "consulting",
 "number_of_employees": 6,
 "founded_year": 2007,
 "founded_month": 8,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@mercuryglobalpartners.com",
 "phone_number": "+1 415 889 9977",
 "description": "multi-discipline marketing/PR firm",
 "created_at": "Tue Aug 10 11:29:22 UTC 2010",
 "updated_at": "Fri Dec 16 09:47:37 UTC 2011",
 "overview": "\u003Cp\u003EEstablished in 2007, Mercury Global Partners is a multi-discipline, international marketing and PR firm with offices in San Francisco, Amsterdam and London. Mercury Global Partners offers strategic guidance combined with tactical execution to companies who seek a blend of traditional and highly creative ways to reach their target audiences. The company is uniquely geared toward providing an unmatched range of marketing and PR services in both the online and offline world.\u003C/p\u003E\n\n\u003Cp\u003EMercury Global Partners is a results-driven independent firm with international experience, expertise and a deep business and media network in the US and Europe. Our highly strategic marketing and PR campaigns not only allow our clients to successfully go to market; they put them on the global map and ensure they stay there.\u003C/p\u003E\n\n\u003Cp\u003EWe specialize in working with B2B and B2C companies within the TMT (technology, media, telecom) sector with a strong focus on mobile, tech (enterprise/cloud), Web 2.0 and venture capital companies. We work with businesses of all sizes from start-ups to publicly traded companies. \u003C/p\u003E\n\n\u003Cp\u003EWe understand that every client is unique, and that not every company has the same needs or goals. We want our clients to succeed, and we manage each client\u0026#8217;s reputation with the same level of scrutiny we do our own to ensure we advise, create and manage campaigns and content that generates maximum impact and return on investment. We work collaboratively as a partner to challenge, inspire, connect and deliver bottom line results.\u003C/p\u003E\n\n\u003Cp\u003EWe take a 360-degree approach to marketing and believe that effective, multiple-touch marketing and PR campaigns are key to supporting and optimizing a company\u0026#8217;s sales and goals. We deploy highly tactical and strategic plans that are customized for each client, and then continuously review and refine to ensure they consistently align with each client\u0026#8217;s needs and business objectives. We use traditional marketing methods combined with creative ideas to ensure our clients\u0026#8217; core messages resonate with and are heard by their target audiences. This includes participating in market research initiatives and leading collaborative meetings to uncover and examine a company\u0026#8217;s primary goals, and to identify thematic paradigms that tell a brand\u0026#8217;s unique story.\u003C/p\u003E\n\n\u003Cp\u003EMarketing is about building brand awareness, creating loyal customers and brand advocates. It is about developing and executing clear, compelling marketing campaigns that increase customers, drive business development opportunities and facilitate revenue growth. Truly effective marketing is about communicating to the world and the marketplace not only how your company and its products are unique, but also why they matter.\u003C/p\u003E\n\n\u003Cp\u003EWe employ the best mix of PR tools including traditional media, trade press, analyst relations, speaking opportunities, blogs and social media to help communicate our clients\u0026#8217; messages to their publics and position them as industry thought leaders. PR is about telling authentic stories and facilitating two-way conversations between companies and their publics through a variety of different channels. This requires a high level of transparency, honesty and an ability to effectively listen and communicate clear, cohesive messages that are closely aligned with a company\u0026#8217;s core marketing messages, positioning and brand. We constantly review, analyze and refine our approach to marketing and PR to stay ahead of the market.\u003C/p\u003E\n\n\u003Cp\u003EMercury Global Partners \u0026gt; the global market awaits.\u003C/p\u003E\n\n\u003Cp\u003EServices/Capabilities include:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EMarketing\u003C/li\u003E\n\u003Cli\u003EBranding/Positioning\u003C/li\u003E\n\u003Cli\u003EAdvertising\u003C/li\u003E\n\u003Cli\u003EWeb/Online\u003C/li\u003E\n\u003Cli\u003EEvents/Conferences/Trade Shows\u003C/li\u003E\n\u003Cli\u003EPR/Communications\u003C/li\u003E\n\u003Cli\u003ESocial Media\u003C/li\u003E\n\u003Cli\u003EInvestor Readiness\u003C/li\u003E\n\u003Cli\u003ECrisis/Issue Management\u003C/li\u003E\n\u003C/ul\u003E",
 "image":
  {"available_sizes":
    [[[150,
       60],
      "assets/images/resized/0009/7191/97191v4-max-150x150.png"],
     [[250,
       100],
      "assets/images/resized/0009/7191/97191v4-max-250x250.png"],
     [[375,
       150],
      "assets/images/resized/0009/7191/97191v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder and Managing Director",
    "person":
     {"first_name": "Mindy",
      "last_name": "Hull",
      "permalink": "mindy-hull",
      "image":
       {"available_sizes":
         [[[124,
            150],
           "assets/images/resized/0009/6860/96860v2-max-150x150.jpg"],
          [[207,
            250],
           "assets/images/resized/0009/6860/96860v2-max-250x250.jpg"],
          [[356,
            429],
           "assets/images/resized/0009/6860/96860v2-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003EMindy M. Hull\u003C/p\u003E"}}},
   {"is_past": false,
    "title": "Managing Director",
    "person":
     {"first_name": "Ginny",
      "last_name": "Cain",
      "permalink": "ginny-cain",
      "image": null}},
   {"is_past": false,
    "title": "Senior PR Consultant",
    "person":
     {"first_name": "Georgia",
      "last_name": "Hanias",
      "permalink": "georgia-hanias",
      "image": null}},
   {"is_past": true,
    "title": "Managing Director",
    "person":
     {"first_name": "Holly",
      "last_name": "Kulak",
      "permalink": "holly-kulak",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}