{"name": "Mexicate",
 "permalink": "mexicate",
 "crunchbase_url": "http://www.crunchbase.com/company/mexicate",
 "homepage_url": "http://www.mexicate.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mexicatetweets",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mexican, food, restaurant",
 "alias_list": null,
 "email_address": "info@mexicate.com",
 "phone_number": "",
 "description": "Mexicate Mexican Food",
 "created_at": "Fri Mar 01 19:36:10 UTC 2013",
 "updated_at": "Thu Mar 07 05:30:33 UTC 2013",
 "overview": "\u003Cp\u003EWhen Mexicate opened up its first store in 2013, the concept was simple: demonstrate those meals offered fast did not need to be a \u0026#8220;fast-food\u0026#8221; experience. We use high-quality raw elements, classic cooking techniques and distinctive interior planning\u0026#8211;features which are more often found in the realm of fine dining. Whenever we opened up, there wasn\u0026#8217;t a business category to explain what we should used to do. We turn to compete inside a group of dining now known as \u0026#8220;fast-casual,\u0026#8221; the quickest growing segment from the restaurant industry, where clients expect food quality that\u0026#8217;s more consistent with full-service restaurants, combined using the speed and ease of junk food.\u003C/p\u003E\n\n\u003Cp\u003EWe attempt to perform a couple of things very well. We elevate fundamental raw elements into food that\u0026#8217;s more potent and much more sophisticated through our quality recipes and putting them to use. Similarly, our restaurant design transforms simple materials in distinctive ways, giving our restaurants a method that\u0026#8217;s more architectural in character and fewer determined by standardized elements of design.\u003C/p\u003E\n\n\u003Cp\u003EOur focus happens to be on using greater-quality elements and putting them to use to create great food available to everybody at inexpensive price points. But our vision has developed. While using the a number of fresh elements continues to be first step toward our menu, we feel that \u0026#8220;fresh isn\u0026#8217;t enough, any longer.\u0026#8221; Now you want to be aware of sources its our elements, to ensure that we can be certain they\u0026#8217;re as tasty as you possibly can when we\u0026#8217;re conscious from the environment and social impact in our business. We refer to this as idea, Food With Integrity, also it guides the way we run our business.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       102],
      "assets/images/resized/0023/9236/239236v2-max-150x150.jpg"],
     [[250,
       171],
      "assets/images/resized/0023/9236/239236v2-max-250x250.jpg"],
     [[450,
       308],
      "assets/images/resized/0023/9236/239236v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}