{"name": "Miami Websites",
 "permalink": "miami-websites",
 "crunchbase_url": "http://www.crunchbase.com/company/miami-websites",
 "homepage_url": "http://www.miawebsites.com",
 "blog_url": "http://www.blog.printerprinting.com",
 "blog_feed_url": "",
 "twitter_username": "socialagency1",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": 12,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "website-design, seo, internet-marketing, web-design, graphic-design, sem, logo-design, websites, miami, web-designer",
 "alias_list": null,
 "email_address": "info@miawebsites.com",
 "phone_number": "888-706-8678",
 "description": "Website Design Services",
 "created_at": "Tue Dec 13 21:32:02 UTC 2011",
 "updated_at": "Mon Dec 19 20:58:07 UTC 2011",
 "overview": "\u003Cp\u003EMiami Websites is owned and operated by Social Agency ®. Miami Websites is based in south Florida, but is proudly serving customers nationwide. With our creative edge, cheap prices and outstanding customer service, Miawebsites.com has grown to become one of the largest web design \u0026amp; web development companies in the United States. We are skilled in all areas of web design \u0026amp; web development including Informational websites, E-commerce websites, Wordpress websites, Joomla websites and much more. Our team is highly trained and professional in all areas of web design, online marketing, graphic design and social networking. We also offer full color printing services for all customers nationwide. Social Agency has been known to be the \u0026#8220;one-stop-shop\u0026#8221; for all business solutions. Everyday our business continues to grow, and we are only getting stronger and more knowledgable along the way.\u003C/p\u003E\n\n\u003Cp\u003EOur Mission \u0026amp; Goals\u003C/p\u003E\n\n\u003Cp\u003EAll of our sales associates and designers are up-to-date on all new business solutions which we will provide to our customers to insure all of our products and services are up-to-date and ready for the competitive economy. Our mission and goals are quite simple, we want to insure our clients and future clients with 100% satisfactory guaranteed products and services! We believe that with all great work comes great results. All of our services are thought out before designed to insure quality \u0026amp; perfection.\u003C/p\u003E\n\n\u003Cp\u003EUnderstanding Online Trust\u003C/p\u003E\n\n\u003Cp\u003EWe being an online business understand the trust that people hold within the online world. We want to advise you that Social Agency ® is a registered business and has been around for a while, so you have nothing to worry about. We can assure you that any product or service you purchase from us will be given to you with 100% satisfactory guarantee! We as an online company want to gain your trust and respect and we hope that you will give us the same. Please feel free to call our corporate office (1-888-706-8678) where you will be able to speak to a live representative who can answer any further questions or concerns. We would be proud and honorable if we could help serve your business today!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0016/6279/166279v2-max-150x150.png"],
     [[250,
       50],
      "assets/images/resized/0016/6279/166279v2-max-250x250.png"],
     [[450,
       91],
      "assets/images/resized/0016/6279/166279v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}