{"name": "MindStep Energy",
 "permalink": "mindstep-energy",
 "crunchbase_url": "http://www.crunchbase.com/company/mindstep-energy",
 "homepage_url": "http://MindStep.ning.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Mindstepenergy",
 "category_code": "cleantech",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 11,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Clean Energy Technologies",
 "created_at": "Sun Aug 05 14:10:57 UTC 2012",
 "updated_at": "Sun Aug 05 21:15:51 UTC 2012",
 "overview": "\u003Cp\u003E\u0026lt;p\u0026gt;MindStep Energy Inc. (A Delaware C-Corporation)\u0026#160;is developing a modular system of sustainable energy technologies on the city scale. MindStep\u0026#8217;s immeadiate objective is to develop a process using technology which converts the output from municipal wastewater treatment facilities into biomass for later processing. This is accomplished by a system centered upon plastic enclosures interwoven with semi-permeable membranes fitted within a proprietary floating frame, designed for offshore use. Essentially this system and process aims to eliminate the need to drill for fossil fuel using traditional methods.\u0026#160;\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;br /\u0026gt;\nMindStep, Inc.’s manufacturing and research facility will be located in South Bronx, NY. The longterm goal is to stimulate economic growth in the region to define the South Bronx as the “Silicon Valley of Clean Technology Manufacturing.” This will be accomplished by a focus on open source community engagement and strategic use of traditional and new media to document the process, which will ultimately raise awareness of the technology and mission of MindStep Energy.\u0026lt;/p\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;MindStep Energy Inc.’s value chain is broken into five steps:\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;ul\u0026gt;\n\u0026lt;li\u0026gt;In-Bound Logistics: Suppliers send raw materials and component parts directly to our contract manufacturers.\u0026lt;br /\u0026gt;\n\u0026lt;br /\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Operations: Raw materials and component parts are converted into finished goods through the manufacturing process.\u0026lt;br /\u0026gt;\n\u0026lt;br /\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Out-Bound Logistics: Product is shipped to our distribution centers. Product is held in inventory until they are shipped directly to our end-consumers for use.\u0026lt;br /\u0026gt;\n\u0026lt;br /\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Marketing \u0026amp;amp; Sales: Product is sold via a dedicated sales force and sales reps directly to our end-consumers via our website (B2C) and to our retail customers (B2B).\u0026lt;br /\u0026gt;\n\u0026lt;br /\u0026gt;\u0026lt;/li\u0026gt;\n\u0026lt;li\u0026gt;Service: We address customer needs and work to exceed their expectations. Our goal is to retain customers for life.\u0026lt;/li\u0026gt;\n\u0026lt;/ul\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;/p\u0026gt;\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}