{"name": "MineWhat",
 "permalink": "minewhat",
 "crunchbase_url": "http://www.crunchbase.com/company/minewhat",
 "homepage_url": "http://www.minewhat.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "janakiram@minewhat.com",
 "phone_number": "",
 "description": "",
 "created_at": "Mon Sep 24 18:23:08 UTC 2012",
 "updated_at": "Thu Oct 11 02:47:23 UTC 2012",
 "overview": "\u003Cp\u003EMinewhat is redefining the way user discover products using their personality and interest. Positioning as facebook for products.\u003C/p\u003E\n\n\u003Cp\u003EWe build user interest graph and map potential products. Today, every user is presented with same set of categories and products at eCommerce sites irrespective of age, gender, and their personality/interests. \u003C/p\u003E\n\n\u003Cp\u003EMinewhat brings a cool collection of products matching user personality \u0026amp; interests (ex: adventurer, creative, gardening) from across eCommerce portals.\u003C/p\u003E\n\n\u003Cp\u003EWe differ from current players by:\nBuilding a recommendation based on structured product facet and personality type. \nLaser beam focus on product mapping (not images). \nIncreasing the relevancy of product by intelligent curation method\nIn essence MineWhat has two important stake holders, end-users are consumer of our service and eCommerce companies are our customers.\u003C/p\u003E\n\n\u003Cp\u003E1) Pavan Kumar has 12+ years of experience and he is primarily into Project Execution, Architecture, Scalability and Data management. \u003C/p\u003E\n\n\u003Cp\u003E2) Janakiram Ganesan is handling the Productization, Business Development, Customer validation and strategy aspects of Minewhat. He has 8+ year of experience.\u003C/p\u003E\n\n\u003Cp\u003EWe complement each other in our skill sets. Our role division is clear, and we have built expertise in different domains to support the startup. We are good at execution. \u003C/p\u003E\n\n\u003Cp\u003EWe have been working together from 2006. Right from the time we met, we used to discuss about our passion for creating products that sowed seeds for our first company Mobiremind Solutions(2008). Made revenue around 1Million INR with Mobiremind Solutions. As part of that we did direct sales, cold calling and team expansion. Later we came in full time to start 3forz Innovations as part of that we are building Minewhat.com. In all we have released 3 products successfully. \u003C/p\u003E\n\n\u003Cp\u003EWe have a strong experience in productization, customer interfacing for mobile \u0026amp; Web by our previous products. We have combined experience of 20+ years in mobile applications and web.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Productization, Business Development, Customer validation and strategy",
    "person":
     {"first_name": "Janakiram",
      "last_name": "Ganesan",
      "permalink": "janakiram-ganesan",
      "image": null}},
   {"is_past": false,
    "title": "Project Execution, Architecture, Scalability and Data management. ",
    "person":
     {"first_name": "Pavan",
      "last_name": "Kumar",
      "permalink": "pavan-kumar-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}