{"name": "MiniVax",
 "permalink": "minivax",
 "crunchbase_url": "http://www.crunchbase.com/company/minivax",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "info@minivaxcorp.com",
 "phone_number": "504.264.2829",
 "description": "",
 "created_at": "Tue May 28 11:41:08 UTC 2013",
 "updated_at": "Tue May 28 11:47:15 UTC 2013",
 "overview": "\u003Cp\u003EMiniVax is focused on the development of novel solutions for the treatment and prevention of opportunistic infections. It is currently developing solutions for the indication Pneumocystis pneumonia (PCP). The fungus Pneumocystis commonly resides in the lungs of healthy individuals, but the infection PCP does not arise until a person’s immune system is depressed at which time the Pneumocystis pathogens can replicate and cause an infection. PCP is the most common opportunistic infection in HIV/AIDS patients. It also affects other immunocompromised patients including those less than two years of age and over seventy years of age and those undergoing cancer treatment, immunosuppression for organ transplant surgery, corticosteroid treatment, or other immunosuppressive therapy.After infection occurs, PCP has a high mortality rate.\u003C/p\u003E\n\n\u003Cp\u003EMiniVax’s lead product candidate is a monoclonal antibody (PCP-Antibody) for the treatment of PCP. For those patients already suffering from PCP that are plagued by an average mortality rate of 20%, PCP-Antibody will provide an immediate defense against PC by delivering the antibodies needed to fight off the infection and thereby reducing the risk of mortality.\u003C/p\u003E\n\n\u003Cp\u003EA follow on product is a novel vaccine (PCP-Vaccine) for the prevention of PCP. PCP-Vaccine promotes the development of long term anti-Pneumocystis antibodies in patients receiving the vaccine. The antibodies help immunocompromised patients prevent Pneumocystis infection and, therefore, prevent PCP development. Similar to childhood vaccinations, one multi-dose regimen of PCP-Vaccine will be needed to confer lifetime protection.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to the therapeutic antibody and vaccine, MiniVax is developing a diagnostic (PCP-Diagnostic) for the detection of a Pneumocystis infection. Currently, clinical diagnosis of PCP is limited to immunohistochemistry and examination of chest X-rays, which have limited sensitivity, specificity, and speed. It takes a highly experienced physician to diagnose PCP. PCP-Diagnostic will provide a quick and accurate means of diagnosing PCP, thus ensuring that the appropriate treatment is prescribed in a timely manner.\u003C/p\u003E\n\n\u003Cp\u003EThe preliminary technology for MiniVax’s PCP products was developed by Dr. Jay Kolls and Dr. Mingquan Zheng at Louisiana State University Health and Science Center (LSUHSC). Drs. Kolls and Zheng initially studied an immunogenic protein in Pneumocystis called Kexin, which provided protection against Pneumocystis in initial animal studies. Approximately five years and $4 million were spent in the lab developing this technology before MiniVax became operational in mid-2011. Currently, MiniVax is further developing the technology through federal and state grants.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       44],
      "assets/images/resized/0026/8010/268010v1-max-150x150.png"],
     [[205,
       61],
      "assets/images/resized/0026/8010/268010v1-max-250x250.png"],
     [[205,
       61],
      "assets/images/resized/0026/8010/268010v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Chief Executive Officer and Chairman-Secretary",
    "person":
     {"first_name": "A.",
      "last_name": "Ray Chaudhuri",
      "permalink": "a-ray-chaudhuri",
      "image": null}},
   {"is_past": false,
    "title": "Chief Operating Officer",
    "person":
     {"first_name": "Martin",
      "last_name": "Preuveneers",
      "permalink": "martin-preuveneers",
      "image": null}},
   {"is_past": false,
    "title": "Executive Vice President",
    "person":
     {"first_name": "Douglas",
      "last_name": "Carnes",
      "permalink": "douglas-carnes-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$110k",
 "funding_rounds":
  [{"round_code": "partial",
    "source_url": "http://www.sec.gov/Archives/edgar/data/1572556/000157255613000001/xslFormDX01/primary_doc.xml",
    "source_description": "SEC",
    "raised_amount": 110000.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 5,
    "funded_day": 2,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "1441 CANAL STREET",
    "address2": "Suite 314",
    "zip_code": "70112",
    "city": "NEW ORLEANS",
    "state_code": "LA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}