{"name": "Mira Web Services",
 "permalink": "mira-web-services",
 "crunchbase_url": "http://www.crunchbase.com/company/mira-web-services",
 "homepage_url": "http://www.mirawebservices.com/",
 "blog_url": "http://www.mirawebservices.com/blog/",
 "blog_feed_url": "http://www.mirawebservices.com/feed/",
 "twitter_username": "MiraWebService",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "full-website-and-seo-packages, monthly-seo-packages, monthly-website-maintenance-packages, website-design, website-redesign, e-commerce, social-networking, local-listings, articlecontent-production, custom-facebook-and-twitter-pages, emailnewsletter-campa",
 "alias_list": null,
 "email_address": "info@mirawebservices.com",
 "phone_number": "4074349323",
 "description": "Web Design \u0026 Internet Marketing Company",
 "created_at": "Sat Feb 18 22:22:41 UTC 2012",
 "updated_at": "Sat Feb 25 09:36:52 UTC 2012",
 "overview": "\u003Cp\u003EMira Web Services is a Central Florida firm specializing in website design, website maintenance, and internet marketing.  With years of experience in professional design and internet marketing, Mira Web Services is the ideal organization to establish a web presence for your business and to oversee the continued growth of your internet exposure.  Their customer-first style differentiates them from other website design and marketing companies as they value the client dynamic and are responsive to your business’ individual needs.\u003C/p\u003E\n\n\u003Cp\u003EWhether it’s the development of a new website or a simple redesign of your website’s look, Mira Web Services has both the technical and design experience to give your business or brand a fresh, modern appearance.  As part of their professional approach, all of their website designs and redesigns are coded to contemporary design standards.  They additionally offer SEO (Search Engine Optimization) packages to better ensure the marketability of your website in the organic search results of Google, Yahoo!, and Bing.  For businesses looking for quality webmasters, Mira Web Services has extensive knowledge in website maintenance for a variety of mediums including CMS platforms (Content Management Systems) as well as in standard code. Mira Web Services can also develop custom social networking skins for your Facebook and Twitter accounts or they can establish your business’ presence on an assortment of social networking sites.\u003C/p\u003E\n\n\u003Cp\u003ETheir internet marketing experts have the knowledge to develop and implement smart strategies to market your business on the web.  Unlike other internet marketing companies, Mira Web Services prides itself on custom-tailoring individual marketing packages that best fits your business. They can create and manage properly tuned pay-per-click campaigns, place your business in a number of local listings including Google Maps, and develop clever email campaigns to further your business’ image.  Their in-house writers can also create original, quality-rich content for your business to be used on your website, blog, and in article publishing to further your business’ brand.\u003C/p\u003E\n\n\u003Cp\u003EExperience Mira Web Services and their client-first approach to your web needs.  They pride ourselves on establishing well thought-out designs and marketing strategies in cooperation with your overall business strategy rather than blindsiding you with technical verbiage and one-sided dialogue.  Their cooperative nature will produce better results with your utmost satisfaction.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       96],
      "assets/images/resized/0017/4866/174866v2-max-150x150.jpg"],
     [[250,
       161],
      "assets/images/resized/0017/4866/174866v2-max-250x250.jpg"],
     [[310,
       200],
      "assets/images/resized/0017/4866/174866v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founding Member",
    "person":
     {"first_name": "Scott",
      "last_name": "Madara",
      "permalink": "scott-madara",
      "image": null}},
   {"is_past": false,
    "title": "Founding Member",
    "person":
     {"first_name": "Emma",
      "last_name": "McCallum",
      "permalink": "emma-mccallum",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}