{"name": "Mithani Chem",
 "permalink": "mithani-chem",
 "crunchbase_url": "http://www.crunchbase.com/company/mithani-chem",
 "homepage_url": "http://www.tuktukind.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmaster@tuktukind.com",
 "phone_number": "",
 "description": "We are one of the leading traders ,",
 "created_at": "Fri Apr 05 11:53:17 UTC 2013",
 "updated_at": "Fri Apr 05 11:53:21 UTC 2013",
 "overview": "\u003Cp\u003ESince inception, Mithani Group is renowned as a leading Manufacturer-Exporter of a diversified range of Zeal Brand Auto Rickshaws and Auto Spare Parts. All these automobiles are available in Petrol, CNG and LPG variants. These automobiles are used for public and private transportation.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nMithani Group is a renowned Manufacturer-Exporter and supplier of a wide range of Zeal Brand Auto Rickshaws and Auto Spare Parts. We are a sustainable and customer friendly export trading company. We have strong presence in many countries such as Africa, Europe, the North \u0026amp; South Africa, USA and Canada, Middle East and many more. To maintain our leadership position in International Market. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are highly respected in the market for our unflinching dedication towards quality. We are strictly adhere to quality control norms and deliver only international standard range of products. Our team of experts test the products at various parameters before dispatching them. Our R\u0026amp;D unit keeps a vigil on the latest market trends and silhouette new ideas. We are totally committed to meet and exceed the expectation of our clients by providing them finest quality products as well as services. \u003C/p\u003E\n\n\u003Cp\u003ETeam of Expert:\nWe have a team of highly qualified and experienced merchandisers \u0026amp; export-import professionals to ensure smooth functioning of all our process. Our quality checking personnel scrutinize every product on the parameters of quality, designs and size and allied factors. We believe in complete teamwork and put our success in the success of our enterprise. We have the required zeal and passion that has resulted into the coming of quality products and services for the industry.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nBeing a client-centric organization, our aim is to provide to maximum satisfaction to our clients. We deliver our range of products as per the specific requirements of our clients. We also understand the budgetary concerns of our clients and offer the products and services at affordable prices. For sustaining our goodwill in the market, we also strive hard to provide the products and services within the stipulated time frame.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[102,
       102],
      "assets/images/resized/0024/8609/248609v2-max-150x150.jpg"],
     [[102,
       102],
      "assets/images/resized/0024/8609/248609v2-max-250x250.jpg"],
     [[102,
       102],
      "assets/images/resized/0024/8609/248609v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}