{"name": "Mitral valve",
 "permalink": "mitral-valve",
 "crunchbase_url": "http://www.crunchbase.com/company/mitral-valve",
 "homepage_url": "http://www.themitralvalve.org",
 "blog_url": "http://mitralvalve1.wordpress.com/2011/10/21/mitral-valve/",
 "blog_feed_url": "http://feeds.feedburner.com/mitralvalve1",
 "twitter_username": "Aaronbert1",
 "category_code": "education",
 "number_of_employees": 200,
 "founded_year": 1990,
 "founded_month": 7,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mitral-valve, mitral-valve-repair, mitral-valve-prolapse, mitral-leakage, mitral-disease",
 "alias_list": null,
 "email_address": "farzan.filsoufi@themitralvalve.org",
 "phone_number": "2126596813",
 "description": "Mitral Valve, Heart Valve Repair",
 "created_at": "Mon Nov 28 06:25:12 UTC 2011",
 "updated_at": "Mon Jan 30 16:17:00 UTC 2012",
 "overview": "\u003Cp\u003EThe Mitral valve is an educational website designed to provide readers with a comprehensive view of valvular heart disease with both historical and contemporary approaches. The first edition primarily focuses on the mitral valve \u003C/p\u003E\n\n\u003Cp\u003EThis unique educational tool of the 21st century contains four independent components: \nHistoric Review, Current Status, Case Study, and News and Events.\u003C/p\u003E\n\n\u003Cp\u003EThe Historic Review is organized into the following four sections:\u003C/p\u003E\n\n\u003Cp\u003EThe first section describes in a Mitralvalve 16th-century chronologic approach the development of knowledge of the structure and function of the heart, circulatory system and subsequently the diseases of the heart with a particular emphasis on the mitral valve. In this section we analyze the work of major contributors from the European Renaissance until the end of the 19th century. Briefly, the Mitralvalve/16th century can be viewed as the century of descriptional anatomy. The development of the science of experimental physiology with the discovery of blood circulation took place in the Mitralvalve/Girolamo-fabrizzi, 17th century. During that era, the science of histology was established and microscopic observation played a critical role in our understanding of the physiology of the circulation. The first pathological reports appeared toward the turn of this century with description of ossification of the cardiac valves. The Mitralvalve/Raymond-Vieussens, 18th century witnessed the birth of anatomo-pathology and a great emphasis was placed on the correlation of clinical symptoms with autopsy findings. Finally, during the first half of the Mitralvalve/Antoine-portal, 19 century, great progress was made in physical diagnosis with the broader application of percussion and the invention of stethoscope.\u003C/p\u003E\n\n\u003Cp\u003EThe second section describes the development of Mitralvalve/Stephen-hales diagnostic tools such as sphygmography, Mitralvalve/Wilhelm-conrad-rontgen X-ray, Mitralvalve/Willem-einthovent electrocardiogram Mitralvalve/Claude-bernardcardiac catheterization and more recently Mitralvalve/Inge-edler echocardiography. For each technology, we have provided the developmental background and then analyzed their applications in the diagnosis of the diseases of the mitral valve. This section covers primarily an era extending from the mid 19th century to the seventh decade of the 20th century. \u003C/p\u003E\n\n\u003Cp\u003EThe third section entitled, Mitralvalve Guillaume-de-baillou disease specific focuses on the development of knowledge pertaining to the specific etiologies of valvular heart disease. We have described in a chronologic manner the progress which was made in our understanding of the most common causes of mitral valve disease namely Mitralvalve/Guillaume-de-baillou rheumatic fever, Mitralvalve/Lazares-riviere infective endocarditis, Mitralvalve/Channing-frothingam degenerative disease and Mitralvalve A-le-piez ischemic cardiomyopathy. \u003C/p\u003E\n\n\u003Cp\u003EThe fourth section is entirely devoted to the birth of Mitralvalve/overview mitral valve surgery in the 20th century. It is important to stress that the selection of the authors and their work(s) has been based on major medical bibliography references. We have read and analyzed their work using the primary sources in almost every instance. They were extracted from a large personal collection on the history of cardiovascular medicine. In addition to this source of information, some of the recent material and images are reproduced from other origins. Every attempt has been made to ensure that such material is only used after the permission of the publisher. Finally for each author, we have presented the entire title of the first edition of their work(s), a portrait (if available), the frontispiece and the title page. Along with the description of their work, appropriate illustrations, of museum quality, and book excerpts from the original text are displayed. We have attempted to provide a translation in English or French for authors whose text was published in Latin. The Mitralvalve/fundamentals Current Status analyzes the state-of-the-art knowledge of predominant etiologies of mitral valve disease. For each etiology, we have described the clinical presentation, pathology, diagnosis with a particular emphasis on echocardiography, and modern treatment with a specific focus on surgical indications and management. The last two components, Mitralvalve/archives Case Study and Mitralvalve/news, News and Events, are self-explanatory. They will be inaugurated in fall 2011. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       60],
      "assets/images/resized/0016/4216/164216v2-max-150x150.jpg"],
     [[250,
       100],
      "assets/images/resized/0016/4216/164216v2-max-250x250.jpg"],
     [[450,
       180],
      "assets/images/resized/0016/4216/164216v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "",
    "is_past": false,
    "provider":
     {"name": "Mitral Valve Repair",
      "permalink": "mitral-valve-repair",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Mitral valve",
    "address1": "The Mount Sinai Medical Center 1190 Fifth Avenue, Box 1028 ",
    "address2": "",
    "zip_code": "10029",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        96],
       "assets/images/resized/0016/5662/165662v2-max-150x150.jpg"],
      [[250,
        161],
       "assets/images/resized/0016/5662/165662v2-max-250x250.jpg"],
      [[450,
        290],
       "assets/images/resized/0016/5662/165662v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        133],
       "assets/images/resized/0016/5663/165663v2-max-150x150.jpg"],
      [[250,
        222],
       "assets/images/resized/0016/5663/165663v2-max-250x250.jpg"],
      [[450,
        399],
       "assets/images/resized/0016/5663/165663v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://themitralvalve.org",
    "title": "Mitral valve"}]}