{"name": "Mix \u0026 Meet",
 "permalink": "mixandmeet",
 "crunchbase_url": "http://www.crunchbase.com/company/mixandmeet",
 "homepage_url": "http://mixandmeet.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": 2006,
 "founded_month": 2,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "bfranco@mixandmeet.com",
 "phone_number": "703-346-2975",
 "description": "Social Network",
 "created_at": "Sun Sep 09 19:42:37 UTC 2007",
 "updated_at": "Thu Dec 27 20:31:00 UTC 2012",
 "overview": "\u003Cp\u003EMix \u0026amp; Meet is a real world social networking service that coordinates same-day live gatherings for the purpose of forming new relationships for business or pleasure. By combining the real-time power of the Internet with a geographic clustering engine, Mix technology facilitates spontaneous, same-day, meetings between unacquainted people sharing a common interest, and does so without any user-to-user interaction.  \u003C/p\u003E\n\n\u003Cp\u003EMix clusters individuals into small groups and then geographically optimizes the mixer venue selection to minimize users\u0026#8217; travel distance. Reservations are received throughout the day, the clustering engine is run at 4 PM, and then users are provided with their mixer assignments telling them where to go and who they will meet at the specified time.  The user simply makes an online reservation and Mix does the rest.  Upon arrival at the mixer users can locate each other with any of three methods: visual identification, physical table markers, and electronic message delivery.  Typical venues would include bars, coffee shops, restaurants, and other commercial/public locations. For maximum convenience, users can make reservations, receive confirmations, and perform mixer check-in via cell phone.   \u003C/p\u003E\n\n\u003Cp\u003EMix is free to join and there are no membership or annual subscription fees. Mix has a pay-as-you-go fee based business model with a per use charge (similar to a cover charge) for its products that deliver value by simplifying users\u0026#8217; social lives and introducing them to new people through \u0026#8220;Instant Mixers.\u0026#8221; However, to balance the site appeal, it also has a large free component, as \u0026#8220;Friends Mixers\u0026#8221; give users a quick and easy way to coordinate real-time get-togethers with their existing friends.   \u003C/p\u003E\n\n\u003Cp\u003EThe Mix venture is comprised of 4 business platforms (Singles, Common Interest, Business Networking, and Political Action) plus a technology licensing strategy. Each of the platforms will employ the same patent pending technology in a different context. Mix will launch with its first of four platforms \u0026#8220;Singles\u0026#8221; as MixBoston.com, followed with a national rollout in other major cities, and then proceed to implement its other platforms.  \u003C/p\u003E\n\n\u003Cp\u003EMix has a two-pronged licensing strategy, the first of which is to license its Business Networking platform in its entirety and give away its Political Action platform to the national political parties as a community service. However, since Mix can add real world interaction and revenue to any website with a virtual community, Mix also plans to provide its technology under shared net revenue agreements to topic or demographic specific websites with virtual communities. For example, Mix has initiated discussions with Eons.com to license its technology in a common interest application for the 50+ crowd. Other ideal license partners would include websites such as iVillage, ClubMom, and Major League Baseball since they have narrowly focused virtual communities that would not cannibalize Mix\u0026#8217;s core platforms.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       38],
      "assets/images/resized/0000/0664/664v1-max-150x150.png"],
     [[250,
       63],
      "assets/images/resized/0000/0664/664v1-max-250x250.png"],
     [[450,
       114],
      "assets/images/resized/0000/0664/664v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": null,
    "title": "Founder \u0026 COO",
    "person":
     {"first_name": "Bruce",
      "last_name": "Franco",
      "permalink": "bruce-franco",
      "image": null}},
   {"is_past": null,
    "title": "Co-Founder \u0026 CEO",
    "person":
     {"first_name": "William",
      "last_name": "Reed",
      "permalink": "william-reed",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$400k",
 "funding_rounds":
  [{"round_code": "angel",
    "source_url": "",
    "source_description": "Founder",
    "raised_amount": 400000.0,
    "raised_currency_code": "USD",
    "funded_year": 2008,
    "funded_month": 3,
    "funded_day": 29,
    "investments":
     [{"company": null,
       "financial_org": null,
       "person":
        {"first_name": "Raymond",
         "last_name": "Sidney",
         "permalink": "raymond-sidney",
         "image": null}}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": null,
    "address1": "64 Putnam Ave",
    "address2": "",
    "zip_code": "02139",
    "city": "Cambridge",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": 42.368143,
    "longitude": -71.113518}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}