{"name": "MobileAppsJobs",
 "permalink": "mobileappsjobs",
 "crunchbase_url": "http://www.crunchbase.com/company/mobileappsjobs",
 "homepage_url": "http://www.mobileappsjobs.com",
 "blog_url": "http://mobileappsjobs.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "mobileappsjobs",
 "category_code": "mobile",
 "number_of_employees": 4,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-apps, jobs, careers, ios, blackberry, android, jobs-in-ios, jobs-in-android, jobs-in-blackberry",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Mobile Apps Job Board",
 "created_at": "Tue Aug 28 13:05:13 UTC 2012",
 "updated_at": "Tue Sep 04 12:50:31 UTC 2012",
 "overview": "\u003Cp\u003EMobileAppsJobs is dedicated to the Mobile Applications Industry. We specialise in Android Jobs, iPhone Jobs, Mobile Banking Jobs\u003C/p\u003E\n\n\u003Cp\u003EWhether you are an Android Developer, iPhone Developer, or the creative mind behind the Designs of these amazing Apps, our clients have jobs for you! We are not just a Mobile Developer Jobs Board but instead have a range of clients also advertising positions in the more Creative side of Apps, such as Creative Designer Jobs, User Interface and User Experience Jobs.\u003C/p\u003E\n\n\u003Cp\u003EHere at Mobile Apps Jobs we have brought together many years of Recruitment experience with an unprecedented level of enthusiasm to provide our clients and candidates with a simple and unique Online Job Portal.\u003C/p\u003E\n\n\u003Cp\u003EAs well as a huge range of Mobile Application Jobs, we can provide a Job Seeker with access to the leading brands who are recruiting right now in the Apps World. Our relationship with recruiters also gives you a wide range of contacts that are in the main, specialists in this rapidly evolving world of Mobile Software.\u003C/p\u003E\n\n\u003Cp\u003EIf you’re a Recruiter or an Employer, let MobileAppsJobs do the hard work for you. Being focused in the Mobile and Tablet Applications industry, our database is consistently updated and monitored. Having experienced the Job Board industry from a Recruiter’s perspective, we understand the challenges you face from both.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}