{"name": "MobiPixie",
 "permalink": "mobipixie",
 "crunchbase_url": "http://www.crunchbase.com/company/mobipixie",
 "homepage_url": "http://www.mobipixie.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": 20,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "photo-sharing, custom-photo-cards, greeting-cards, photo-groups",
 "alias_list": null,
 "email_address": "imobipixie@gmail.com",
 "phone_number": "609-269-4775",
 "description": "MobiPixie Photo Share \u0026 Custom Cards",
 "created_at": "Thu Sep 20 18:09:27 UTC 2012",
 "updated_at": "Tue Sep 25 02:34:47 UTC 2012",
 "overview": "\u003Cp\u003EMobiPixie is a new generation of company focused on mobile and photo sharing and allowing people to create custom cards using those photos.\u003C/p\u003E\n\n\u003Cp\u003EMobiPixie platform is an advanced mobile media sharing and social networking platform for mobile phone users. You can upload, edit, transform, share, distribute, archive, create social groups, edit, enhance, print, play and do many more things with your photos. You can keep your photos private, or make them public. The choice is yours. All you need to start is to create your account here and download MobiPixie mobile apps that are available for iPhone, Android and Blackberry. \u003C/p\u003E\n\n\u003Cp\u003EMobiPixie is all about mobile pictures. MobiPixie is the first and only advanced service platform that lets you send out high-quality, customized, color cards (greetings) from your very own mobile phone to anyone anywhere in the world! Snap a picture, modify it if you like, using Mobipixie\u0026#8217;s built in customization tools, compose an associated message ,and send it to as many postal or electronic recipients as you like. That\u0026#8217;s it! You can even store your Mobipixie cards on your phone or on the Mobipixie website for even further customization, modification and sending at a later date. \u003C/p\u003E\n\n\u003Cp\u003EMobiPixie Product Features Given Below:\u003C/p\u003E\n\n\u003Cp\u003ESHARE \u0026amp; ORGANIZE PHOTOS WITH MOBIPIXIE\u003C/p\u003E\n\n\u003Cp\u003EMobipixie app connects to an easy to use cloud based Photo Sharing \u0026amp; Card Design platform.  It lets you share your photos with full Privacy and Group Membership control. You can make use of MobiPixie\u0026#8217;s advanced features for Online Photo Enhancements, Card Design, Organization and Photo Grouping  at www.mobipixie.com. \u003C/p\u003E\n\n\u003Cp\u003ESOCIAL GROUPS, ARCHIVING \u0026amp; EDITING PHOTOS\u003C/p\u003E\n\n\u003Cp\u003ECreate Private \u0026amp; Public Groups. Invite Friends to Upload Party Photos to the Private Groups. \u003C/p\u003E\n\n\u003Cp\u003EYou can upload, edit, transform, share, distribute, archive, group, edit, enhance, print, play \u0026amp; do many more things with your photos. You can tag them, title them \u0026amp; categorize them in any way you like making easy to search \u0026amp; browse. So, no time wasted in finding what you want! \u003C/p\u003E\n\n\u003Cp\u003ESEND BEAUTIFUL AMAZING PERSONAL CARDS\u003C/p\u003E\n\n\u003Cp\u003EBesides photo sharing, you can use any of your or other public photos in MobiPixie gallery to design, create and send a beautiful personal e-card or printed greeting or invitation cards with your personal message using our online design tool. MobiPixie will print the card for you, stamp it and send to any destination in the world! \u003C/p\u003E\n\n\u003Cp\u003ESET REMINDERS\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EMobiPixie\u0026amp;amp;#8217;s built in calendar and reminder tool will ensure that you never forget the Birthday or Anniversary of any one in the family!\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EHave no need to send the card, that is fine too.  Just browse the beautiful public photos uploaded by others. We are bringing much powerful browse and search in the next release.\u003C/p\u003E\n\n\u003Cp\u003ETRANSFORMING PHOTOS INTO PERSONAL CARDS FOR PEOPLE YOU LOVE\u003C/p\u003E\n\n\u003Cp\u003EMobiPixie.com has an easy to use online Flash based tool to convert your photos in personal cards just in a few simple steps. No more queuing up at the post office to buy stamps. Let the phone do the talking!\u003C/p\u003E\n\n\u003Cp\u003EMobiPixie maintains full online history of the cards along with receiver\u0026#8217;s name, address \u0026amp; card status in the system.  Your all past cards are stored too.\u003C/p\u003E\n\n\u003Cp\u003EWhy send generic cards when you can send personalized custom cards at a much lower cost?\u003C/p\u003E\n\n\u003Cp\u003EBUSINESS OWNERS CAN USE THEM TOO \u003C/p\u003E\n\n\u003Cp\u003EThere is no better way to thank you then sending a personal E-Card or Printed card to your customer. Send it to anyone anywhere in the World. That\u0026#8217;s it! \u003C/p\u003E\n\n\u003Cp\u003EADVANCED MOBIPIXIE FEATURES:\u003C/p\u003E\n\n\u003Cp\u003EWith so many features, MobiPixie makes it fun to manage your photos \u0026amp; use them to share your joy!\u003C/p\u003E\n\n\u003Cp\u003E  Share Your Photos With Friends, Family Groups \u0026amp; Keep them Private in Your Own Photo Gallery (My MobiPixie Gallery)\u003C/p\u003E\n\n\u003Cp\u003E  Share your Photos with the world (MobiPixie Public Gallery)\u003C/p\u003E\n\n\u003Cp\u003E  Full Control on Photo Sharing, You Decide if You Want to Keep a Photo Private or Public\u003C/p\u003E\n\n\u003Cp\u003E  User Defined Unlimited Private \u0026amp; Public Photo Groups Support For  Organizing Your Photos\u003C/p\u003E\n\n\u003Cp\u003E  Add Title, Tags \u0026amp; Categories for Easy Searching\u003C/p\u003E\n\n\u003Cp\u003E  Invite Friends \u0026amp; Share Photo Groups with Them in A Private or Public Mode\u003C/p\u003E\n\n\u003Cp\u003E  Create Custom \u0026amp; Personalized Greeting \u0026amp; Invitation Cards \u0026amp; Send Them Instantly Using MobiPixie. \u003C/p\u003E\n\n\u003Cp\u003E  Full Support for Sending Custom Printed Card (P-cards) \u0026amp; Electronic Cards (E-cards). Save Time \u0026amp; Money.\u003C/p\u003E\n\n\u003Cp\u003E  Advance Online Card Design Tool Accessible From MobiPixie.com with Full Text \u0026amp; Image Editing Including Image \u0026amp; Text Rotation, Font Size \u0026amp; Color selection.\u003C/p\u003E\n\n\u003Cp\u003E  Pre-Created Custom Messages For All Occasions. Easy to Use.\u003C/p\u003E\n\n\u003Cp\u003E  Advanced Photo Editing Tool with Color Enhancements, Photo Cropping, Exposure Fixing etc.\u003C/p\u003E\n\n\u003Cp\u003E Ability To Use Calendar Feature For Reminding Birthdays, Anniversaries \u0026amp; Other Special Occasions. Never forget an important day ever again.\u003C/p\u003E\n\n\u003Cp\u003E  Full History of Card Sent in the System with Full information of Recipient.\u003C/p\u003E\n\n\u003Cp\u003E  Social Media Sharing on Facebook \u0026amp; Twitter of all the Cards \u0026amp; Photos. \u003C/p\u003E\n\n\u003Cp\u003E  More feature coming soon. (patent in works)\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       48],
      "assets/images/resized/0021/2277/212277v2-max-150x150.jpg"],
     [[250,
       80],
      "assets/images/resized/0021/2277/212277v2-max-250x250.jpg"],
     [[269,
       87],
      "assets/images/resized/0021/2277/212277v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$1M",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "Private",
    "raised_amount": 1000000.0,
    "raised_currency_code": "USD",
    "funded_year": 2010,
    "funded_month": 1,
    "funded_day": 1,
    "investments":
     [{"company": null,
       "financial_org": null,
       "person":
        {"first_name": "Confidential",
         "last_name": "information",
         "permalink": "confidential-information",
         "image": null}}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[101,
        150],
       "assets/images/resized/0021/2276/212276v2-max-150x150.jpg"],
      [[168,
        250],
       "assets/images/resized/0021/2276/212276v2-max-250x250.jpg"],
      [[233,
        346],
       "assets/images/resized/0021/2276/212276v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.pr.com/press-release/424995",
    "title": "MobiPixie Press Release"}]}