{"name": "Mobiletech",
 "permalink": "mobiletech",
 "crunchbase_url": "http://www.crunchbase.com/company/mobiletech",
 "homepage_url": "http://www.mobiletech.mobi",
 "blog_url": "http://www.mobiletech.mobi/blog/",
 "blog_feed_url": "",
 "twitter_username": "MrMobiletech",
 "category_code": "mobile",
 "number_of_employees": 30,
 "founded_year": 2005,
 "founded_month": 4,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile, web, mobile-web, html5, framework, online-publishing",
 "alias_list": null,
 "email_address": "pb@mobiletech.mobi",
 "phone_number": "301 250 3815",
 "description": "Mobile Software Solution",
 "created_at": "Wed May 11 17:48:39 UTC 2011",
 "updated_at": "Wed Aug 15 21:30:27 UTC 2012",
 "overview": "\u003Cp\u003EMobiletech is a software company that provides the tools for companies, content owners and publishers to create content and services on the mobile web. \u003C/p\u003E\n\n\u003Cp\u003EMobiletech is a global provider of mobile software and services. Our award winning Platform helps businesses engage with customers through mobile solutions that are quick to develop, simple to deploy and cost effective to maintain. The solutions promise to work seamlessly on every mobile device – today and in the future.\u003C/p\u003E\n\n\u003Cp\u003EEstablished in 2005, our Platform broke new ground by enabling mobile users to navigate the web with the same ease they expected from their PC.\u003C/p\u003E\n\n\u003Cp\u003EToday, the mobile user experience is still at the core of our approach. Making sure that our clients have mobile solutions that give users an unrivalled experience not only increases traffic to their site – it is the key to building customer loyalty and making mobile initiatives profitable.\u003C/p\u003E\n\n\u003Cp\u003EFor Mobiletech’s customers, mobile is straightforward because:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EWe take a holistic view of web, mobile and apps to create the right solution for each one.\u003C/li\u003E\n\u003Cli\u003EOur Platform automatically gives users the best mobile experience regardless of device, browser, the speed of their connection or geographic location.\u003C/li\u003E\n\u003Cli\u003EOur Platform is future compliant – ready to exploit emerging technologies and manage the challenges they create.\nYou can start small and grow with your needs. The Platform scales easily and is built for high volumes and high performance.\u003C/li\u003E\n\u003Cli\u003EMobile becomes part of your existing work-flows. This ensures editorial flexibility and control, while content is published with no extra work and tools people already know.\u003C/li\u003E\n\u003Cli\u003EContent need only be developed once to reach all mobile channels.\u003C/li\u003E\n\u003Cli\u003EWe are experienced at integrating modern mobile solutions with legacy systems.\u003C/li\u003E\n\u003Cli\u003EThe solution is simple and cost effective to maintain.\u003C/li\u003E\n\u003Cli\u003EWe are flexible and our solutions can support any business and deployment model.\u003C/li\u003E\n\u003Cli\u003EToday, more than 300 companies rely on Mobiletech to power their mobile strategy with solutions that span 60 countries and 57 languages. They include local and global brands in media, telecoms, finance, energy and the public sector.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EMobiletech is headquartered in Norway and has offices in Sweden, Denmark and the United States. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       27],
      "assets/images/resized/0020/6102/206102v2-max-150x150.png"],
     [[250,
       45],
      "assets/images/resized/0020/6102/206102v2-max-250x250.png"],
     [[450,
       81],
      "assets/images/resized/0020/6102/206102v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "US Office",
    "address1": "1629 K St. NW, Suite 300",
    "address2": "",
    "zip_code": "20006",
    "city": "Washington DC",
    "state_code": "DC",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}