{"name": "Mobile Spy®",
 "permalink": "mobile-spy-2",
 "crunchbase_url": "http://www.crunchbase.com/company/mobile-spy-2",
 "homepage_url": "http://www.mobile-spy.com",
 "blog_url": "http://www.mobile-spy.com/blog/",
 "blog_feed_url": "http://www.mobile-spy.com/blog/feed/",
 "twitter_username": "yourmobilespy",
 "category_code": "software",
 "number_of_employees": 48,
 "founded_year": 2003,
 "founded_month": 4,
 "founded_day": 28,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-spy, cell-phone-spy, android-spy, iphone-spy, computer-spy",
 "alias_list": null,
 "email_address": "support@retinax.zendesk.com",
 "phone_number": "888-475-5345",
 "description": "Mobile Spy Software",
 "created_at": "Thu Aug 30 03:30:19 UTC 2012",
 "updated_at": "Thu Aug 30 20:34:32 UTC 2012",
 "overview": "\u003Cp\u003EMobile Spy, also known as Retina-X Studios, started as a web consulting and design company in July 1997. After developing a series of spy software programs for external customers, Retina-X Studios began developing its own enhanced spy software applications to be marketed under the Retina-X Studios brand.\u003C/p\u003E\n\n\u003Cp\u003ERetina-X Studios quickly gained a reputation in the spy industry for reliable and thoroughly tested software in this market niche. Positive comments in magazines such as Reader\u0026#8217;s Digest, Computer Shopper, PC Pro, Computer Buyer, T3 and others, coupled with media exposure from outlets like CNN, CBS and BBC, helped in the marketing effort of these applications.\u003C/p\u003E\n\n\u003Cp\u003EStarting in January 2008, the success of Retina-X Studios\u0026#8217; software led to the creation of a boxed retail product, now carried by numerous chains in thousands of stores nationally. This provides access to this application genre to a new audience.\u003C/p\u003E\n\n\u003Cp\u003EPositive reviews, media coverage, and continued success has helped RXS grow at a phenomenal rate, with sales growth of over 1600% in a two year span. Purchased by more than 100,000 customers in over 150 countries, Retina-X Studios software is widely acknowledged as leading the field in this market niche.\u003C/p\u003E\n\n\u003Cp\u003ERXS is dedicated to providing the most complete, professional PC software applications possible. Our spy software is widely used, with excellent reviews and user comments. All RXS software is extensively tested in a variety of environments to ensure complete customer satisfaction. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "World Headquarters",
    "address1": "13453 N. Main St.",
    "address2": "Suite 201",
    "zip_code": "32218",
    "city": "Jacksonville",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}