{"name": "Mobile Recruiting",
 "permalink": "mobile-recruiting",
 "crunchbase_url": "http://www.crunchbase.com/company/mobile-recruiting",
 "homepage_url": "http://www.mobile-recruiting.es",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "MobileRecruitin",
 "category_code": "other",
 "number_of_employees": 6,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile, recruiting, jobs, empleos, video",
 "alias_list": null,
 "email_address": "info@mobile-recruiting.es",
 "phone_number": "+34915004025",
 "description": "mobile, recruiting, jobs, video",
 "created_at": "Wed May 09 13:58:07 UTC 2012",
 "updated_at": "Fri May 11 03:37:22 UTC 2012",
 "overview": "\u003Cp\u003EMobile Recruiting is a new technology startup company that reduces costa of hiring  employees by companies, incorporating video and mobility solutions.\u003C/p\u003E\n\n\u003Cp\u003EToday, companies need to recruit a considerable number of employees (Consumer Good Companies, Call Center, Catering, Franchising, Task Force, Cleaning, Security, Retail, Logistics, Outsourcing HR,…), they lose a not of time and money calling candidates to make their first job interview, when only 10% of candidates pass to a second interview.\u003C/p\u003E\n\n\u003Cp\u003EMoreover, candidates often don’t go or don’t appear in convocations where there are many candidates because they think that is very difficult to be selected.\u003C/p\u003E\n\n\u003Cp\u003EMobile Recruiting allows that companies put their job offers on our mobile app and candidates can subscribe recording a little video on our mobile app:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cp\u003ECompanies: they can increase the number of candidates who sign up for their offers through the mobile app and filter the best candidates for each job after watching the videos of the candidates (from our web).\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ECandidates: they can access all the jobs in your city from mobile phone, sign up in each job and recorded a video with the phone (15 seconds) to submit for each offer.\u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003ECompetitors\u003C/p\u003E\n\n\u003Cp\u003ERecruiting Companies: Manpower, Adecco, Randstad: they are very traditional in recruiting processes, using commercial offices located throughout the world to hire people, some of them are using Internet, some use social networnot but no-one has any mobile development. Strengths: great financial capacity to undertake new technological developments such as ours. Weaknesses: Lack of knowledge of mobility, video and cloud services.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Co-Founder",
    "person":
     {"first_name": "Ignacio",
      "last_name": "Romero",
      "permalink": "ignacio-romero-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Street Alfonso Gómez 29",
    "address2": "",
    "zip_code": "28037",
    "city": "Madrid",
    "state_code": null,
    "country_code": "ESP",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}