{"name": "ModelMentors.com",
 "permalink": "modelmentors-com",
 "crunchbase_url": "http://www.crunchbase.com/company/modelmentors-com",
 "homepage_url": "http://www.ModelMentors.com",
 "blog_url": "http://www.ModelMentors.com/blog",
 "blog_feed_url": "http://www.ModelMentors.com/feed",
 "twitter_username": "ModelMentors",
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "models, modeling, modeling-advice, photography, modeling-industry, professional-models, aspiring-models, modeling-blog, mentors, model-mentors",
 "alias_list": null,
 "email_address": "info@modelmentors.com",
 "phone_number": "7202202390",
 "description": "Modeling Advice, Blog, \u0026 Mentors",
 "created_at": "Sat May 05 17:18:32 UTC 2012",
 "updated_at": "Fri Jan 25 05:06:10 UTC 2013",
 "overview": "\u003Cp\u003EModelMentors.com is an informative resource for models of any experience level- aspiring, semi-experienced, or professional.\u003C/p\u003E\n\n\u003Cp\u003EThe website is divided into 3 targeted sections: Articles, Blogs, and Model Mentors.\nThe \u0026#8220;Articles\u0026#8221; section provides straightforward information regarding the modeling industry. It is unbiased and factual; the articles are concerned with the information offered within and nothing more.\u003C/p\u003E\n\n\u003Cp\u003EThe \u0026#8220;Blog\u0026#8221; section differs greatly in that regard. The blogs written on ModelMentors.com are penned by professional models seeking to educate and inform; using their experience and personality as a direct way to emotionally connect with their audience at the same time. These Blogs appear to aim at supplementing the typical method by which models can find information online (that being rather impersonally; often relying on results from a search engine that feature advice from unidentified, yet self-proclaimed authorities). The Blogs are uncensored, and they revolve around the trials and tribulations of seasoned, successful, and respected models. This can potentially provide a much greater sense of understanding than a typical Google search may offer.\u003C/p\u003E\n\n\u003Cp\u003EThe \u0026#8220;Model Mentors\u0026#8221; section allows its readers/\u0026#8221;Mentees\u0026#8221; the opportunity to personally connect with, and learn from, a team of established, successful, and professional models. The featured \u0026#8220;Model Mentors\u0026#8221; all have lengthy resumes and an abundance of credits and accomplishments to their respective names. The Mentoring sessions offer a 1-on-1, 60-minute, private video conference- exclusively between mentee/mentor. This is the mentee\u0026#8217;s chance to directly ask their mentor for guidance, advice, recommendations, warnings, industry contacts, connections, and more. This is a personalized experience, as-yet-unseen on current \u0026#8220;modeling advice\u0026#8221; internet offerings. Whereas once the Mentees may not have been able to get in contact with the models that inspire them- let alone speak face-to-face regardless of geographic considerations, these barriers no longer exist with the launch of ModelMentors.com. The modeling world is now at everyone\u0026#8217;s fingertips!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       82],
      "assets/images/resized/0023/1454/231454v2-max-150x150.jpg"],
     [[250,
       137],
      "assets/images/resized/0023/1454/231454v2-max-250x250.jpg"],
     [[450,
       248],
      "assets/images/resized/0023/1454/231454v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Sarah",
      "last_name": "McDowd",
      "permalink": "sarah-mcdowd",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.pr.com/press-release/409063",
    "title": "International Cover Model Sarah McDowd Launches ModelMentors.com"}]}