{"name": "Modevity",
 "permalink": "modevity",
 "crunchbase_url": "http://www.crunchbase.com/company/modevity",
 "homepage_url": "http://www.modevity.com",
 "blog_url": "http://blog.araloc.com/",
 "blog_feed_url": "",
 "twitter_username": "modevity",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2004,
 "founded_month": 4,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-content-distribution, white-label-mobile-publishing, secure-content-distribution, educational-content-protection",
 "alias_list": null,
 "email_address": "info@modevity.com",
 "phone_number": "610-251-0700",
 "description": "Secure Mobile Content Distribution",
 "created_at": "Tue Aug 07 13:52:25 UTC 2012",
 "updated_at": "Wed Aug 22 07:48:35 UTC 2012",
 "overview": "\u003Cp\u003EProvides secure distribution of proprietary and confidential content to mobile devices world-wide.\u003C/p\u003E\n\n\u003Cp\u003EModevity’s ARALOC products are end-to-end mobile content management (MCM) and digital rights management (DRM) security solutions. ARALOC provides enterprise clients a flexible platform for the secure distribution, content management, viewer tracking and reporting analytics of any digital media content. The content at rest DRM controls the secure distribution of digital content files by preventing copying, piracy or credential forwarding . \u003C/p\u003E\n\n\u003Cp\u003EARALOC utilizes powerful 256 bit AES Encryption with extensive rights management security controls that enables any content provider to enforce content access, viewing policies, permissions and automated expiration. \u003C/p\u003E\n\n\u003Cp\u003EARALOC supports client organizations in their mobile content protection initiatives across multiple market segments. \u003C/p\u003E\n\n\u003Cp\u003EEducational Publishers\nFortune 500 Boards\nProfessional Sports Teams\nInvestment Banks\nEnterprise Sales Teams\nEnterprise Training Organizations\u003C/p\u003E\n\n\u003Cp\u003EWith ARALOC’s content security protection technology, clients can protect confidential documents and proprietary content on varied devices including iPad, Android, PC and Mac. ARALOC provides the highest level of security controls to corporate documents and MS Office files, PDF, video, audio, HTML5, eBooks, etc. \u003C/p\u003E\n\n\u003Cp\u003EARALOC provides an extensive API that can integrate to any internal or third party system that supports varied organizational business processes. ARALOC is a cloud based MCD and DRM security solution offered on a SaaS business model. Our technology is managed in the Microsoft Azure Cloud.\u003C/p\u003E\n\n\u003Cp\u003EARALOC can be installed on both corporate managed and employee-owned devices.\u003C/p\u003E\n\n\u003Cp\u003EThe ARALOC solution provides a mobile content distribution platform to seamlessly enable content providers to securely distribute content to subscribers, employees, and partners on any mobile device. Additionally, Modevity prides itself on our White Glove Service support to any ARALOC enterprise client with our extensive operational and technical support team.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       27],
      "assets/images/resized/0020/4830/204830v4-max-150x150.png"],
     [[172,
       32],
      "assets/images/resized/0020/4830/204830v4-max-250x250.png"],
     [[172,
       32],
      "assets/images/resized/0020/4830/204830v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}