{"name": "MokshAlumi",
 "permalink": "mokshalumi",
 "crunchbase_url": "http://www.crunchbase.com/company/mokshalumi",
 "homepage_url": "http://www.indiamart.com/mokshalumi/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mokshalumi@tradepassport.org",
 "phone_number": "",
 "description": "Aluminium Doors, Aluminium Cabins,  ",
 "created_at": "Fri Apr 05 16:23:42 UTC 2013",
 "updated_at": "Fri Apr 05 16:23:45 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Moksh@alumi” are widely appreciated for trading and supplying premium quality array of Windows, Doors, Aluminium Cabins, Louvers and Laminate Sheets. Under the offered array, we provide Aluminium Windows, Aluminium Sound Proof Windows, UPVC Windows, Fly Mesh Screenning, Aluminium Sliding Windows and Aluminium Doors. In addition to this, we provide Aluminium Cubicles, Aluminium Partitions, Aluminium Louvers, Laminate Sheets, Wood Plastic Composite Panel, Aluminium Composite Panels and Bakelite Hardner Sheets, to name a few. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur organization is able to carry our different business tasks without any hassle, owing to the support of our team, which comprises qualified and skilled professionals. These professionals have years of experience in their respective domains and keep an eye on the changing market scenario so as to stay updated with the latest trends.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nAt Mumbai, Maharashtra (India), we have established a sound infrastructure, which is sprawled over a wide area. Our manufacturing unit has a large production capacity, supported by which we are able to cater to the bulk orders in a smooth manner. Further, we have installed our infrastructure with modern machinery and latest technology, using which professionals are able to design Windows, Doors, Aluminum Cabins, Louvers and Laminate Sheets as per the detailed specifications. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe have been providing our esteemed patrons with excellent quality Windows, Doors, Aluminum Cabins, Louvers and Laminate Sheets, since our inception. To maintain the peerless standards of these doors, cabins and other products, we make use of only quality-approved raw material in the manufacturing process. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBy manufacturing and supplying a wide array of Windows, Doors, Aluminum Cabins, Louvers and Laminate Sheets in accordance with the specifications given by patrons, we have been able to attain a remarkable position in the market. To ensure that our offered doors, cabins and other products are able to serve patrons for long, we manufacture these by making use of the premium quality raw material that is sourced from the trusted vendors. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8893/248893v2-max-150x150.jpg"],
     [[240,
       240],
      "assets/images/resized/0024/8893/248893v2-max-250x250.jpg"],
     [[240,
       240],
      "assets/images/resized/0024/8893/248893v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}