{"name": "Monsoon Company",
 "permalink": "monsoon-company",
 "crunchbase_url": "http://www.crunchbase.com/company/monsoon-company",
 "homepage_url": "http://www.monsoonco.com",
 "blog_url": "http://monsoonco.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": 12,
 "founded_year": 2001,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile, software, apps, healthcare",
 "alias_list": null,
 "email_address": "info@monsoonco.com",
 "phone_number": "5109917425",
 "description": "Mobile Development Firm",
 "created_at": "Wed Nov 07 00:50:02 UTC 2012",
 "updated_at": "Thu Nov 08 00:24:45 UTC 2012",
 "overview": "\u003Cp\u003EFounded in 2001, Monsoon is a software services firm that has worked with a range of Fortune 100 companies, small businesses, nonprofits, and government institutions.  The firm covers the full lifecycle of software development work, including strategy, design, development, and quality assurance.  Our team has built mobile apps (iOS, Android, and Blackberry), implemented CMS-driven websites \u0026amp; eCommerce platforms, and both enterprise and stand-alone web applications.\u003C/p\u003E\n\n\u003Cp\u003EFormerly in Berkeley, California, Monsoon has forged relationships with clients such as HP, the NBA, the Academy Awards, Cisco, Wells Fargo, and Microsoft. Monsoon works with the world’s leading companies, helping them create meaningful products, services, and experiences. Monsoon’s clients depend on our organization for well-designed, stable, and secure software delivered on time, on spec and according to their needs.\u003C/p\u003E\n\n\u003Cp\u003ERecently, our company has begun a thriving healthcare practice.  We are working at the forefront of electronic health records, mobile patient engagement, and hospital efficiency applications.  As part of this effort, we are working with clients such as Genentech, Novartis, and the United Nations.  \u003C/p\u003E\n\n\u003Cp\u003EMost of Monsoon’s designers and creative directors have between eight and ten years of experience in graphic design and user experience, having worked in print/web/application design and development. The engineering team includes software developers with formal education in technology and several years of hands-on experience. Finally, a small group of strategic experts craft experience and define business priorities for clients in a range of industries. The combination of senior database architects, proficient software engineers and creative designers working under the same roof allows the company to craft intuitive and engaging user experiences for websites and applications across multiple platforms.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       17],
      "assets/images/resized/0021/9115/219115v2-max-150x150.jpg"],
     [[238,
       28],
      "assets/images/resized/0021/9115/219115v2-max-250x250.jpg"],
     [[238,
       28],
      "assets/images/resized/0021/9115/219115v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Sandeep",
      "last_name": "Sood",
      "permalink": "sandeep-sood",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Monsoon Company, Inc.",
    "address1": "350 Frank Ogawa Plaza Suite 100",
    "address2": "",
    "zip_code": "94612",
    "city": "Oakland",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}