{"name": "Moreslides.com",
 "permalink": "moreslides-com",
 "crunchbase_url": "http://www.crunchbase.com/company/moreslides-com",
 "homepage_url": "http://www.moreslides.com",
 "blog_url": "http://www.moreslide.com/blog",
 "blog_feed_url": "",
 "twitter_username": "moreslides",
 "category_code": "enterprise",
 "number_of_employees": 15,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moreslides, powerpoint, presentation, slides, maps, charts, models, shape",
 "alias_list": null,
 "email_address": "contact@moreslides.com",
 "phone_number": "+91-11-26310002",
 "description": "Powerpoint presentation slides designer",
 "created_at": "Thu Dec 13 11:33:56 UTC 2012",
 "updated_at": "Wed Jan 02 02:02:40 UTC 2013",
 "overview": "\u003Cp\u003EAt Moreslides.com we aspire to create a platform to provide a virtual presentation assistant for day to day needs of corporate world, researchers, professors, students and for anybody who is in need of presentation design skills. We offer unique and wide variety of presentation design services.\u003C/p\u003E\n\n\u003Cp\u003EReady to use Templates : We provide ready to use presentation templates for our users. Many are free and some are premium templates. These templates enables you to present your thoughts, ideas, facts and figures in never before seen and easy to interpret formats and help you in engaging and impress upon your audience. Not only are these templates excellent in their design and presentation ability but are also completely and easily editable. With each slide we provide a video to help you easily edit the templates as per your needs. We understand that needs of every user is different and hence we aspire to provide a huge plethora of beautiful, elegant, presentable and easy to inter pretpresentation designs. Each template comes in bundle of 10-15 slides depending upon the type and usage of template. We work for you to fulfill your needs and to act as great personal presentation assistant. We not only offer templates based on designs but also based on topics. Whether you want to present idea to an investor or to present monthly reports to the company management or to just present a topic for your college project, we have topic based template for you. Our topic based templates range from Investor Presentations, Project Appraisal Presentations, Gantt Charts, Equity Research Presentations, Business Proposal Presentation, Monthly Report presentations, Industry Report Presentations, Marketing Plan Presentation, HR presentations etc.\u003C/p\u003E\n\n\u003Cp\u003ECustomized Presentations : We offer ready to use and turnkey based customized presentations for your needs. Whether you have a word document, a pdf, an excel sheet, a brochure, a keynote presentation or a power point presentation we can get it converted into highly customized, elegant and powerful presentation to help you impress upon your idea on the audience.\u003C/p\u003E\n\n\u003Cp\u003EPresentation Animation : Sending your presentation in ppt format is archaic. Be a part of the digitized and contemporary world. We help you create a futuristic, admirable, powerful and elegant animation out of your business slides. Not only does the animation come with great graphics but you can also add a voiceover of different choice of language in your video. So, you can present your idea and present your presentation to your audience without any direct interaction, on emails, on social networks, in dropbox by sharing your animated presentations with voiceovers. And the best part is you do not have to create a presentation yourself. You can either provide us a simple doc, your old presentation or your idea in few words and we create great animation out of your thoughts. Have a look at the samples and get great animations to promote your products, ideas, thoughts and projects.\u003C/p\u003E\n\n\u003Cp\u003EMoreslides.com is the latest .com launch of an evolutionary management consultancy firm M/S JaZaa Financial Advisory Pvt. Ltd. Our web design and e-commerce arm DesignPro is responsible for development and maintenance of this innovative platform.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/5207/225207v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0022/5207/225207v2-max-250x250.png"],
     [[450,
       450],
      "assets/images/resized/0022/5207/225207v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "Editable PowerPoint Slides",
    "permalink": "editable-powerpoint-slides",
    "image": null},
   {"name": "Personalized Presentation Solution",
    "permalink": "personalized-presentation-solution",
    "image": null},
   {"name": "PowerPoint Animation",
    "permalink": "powerpoint-animation",
    "image": null},
   {"name": "Powerpoint Animation with Voiceover",
    "permalink": "powerpoint-animation-with-voiceover",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "www.moreslides.com/blog",
    "is_past": true,
    "provider":
     {"name": "www.moreslides.com",
      "permalink": "www-moreslides-com",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Registered Office",
    "address1": "N36, Ground Floor, Lane No. 2",
    "address2": "Batla House, Okhla",
    "zip_code": "110025",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null},
   {"description": "Corporate Office",
    "address1": "159/2, First Floor,",
    "address2": "Sarai Jullena",
    "zip_code": "110025",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/mvD0dxE99nc\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EMoreslides.com Customization\u003C/p\u003E"},
   {"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/mOrxIHDXUqQ\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EAt www.moreslides.com we aspire to create a platform to provide a virtual presentation assistant for day to day needs of corporate world, researchers, professors, students and for anybody who is in need of presentation design skills. We offer unique and w\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}