{"name": "Moss Networks",
 "permalink": "moss-networks",
 "crunchbase_url": "http://www.crunchbase.com/company/moss-networks",
 "homepage_url": "http://www.MossNetworks.com",
 "blog_url": "http://www.mossnetworks.com/thelatest/",
 "blog_feed_url": "",
 "twitter_username": "MossNetworks",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "public-relations, marketing, consulting, advertising, events, corporate-events, event-marketing, promotions, trade-shows, trade-show-coordination, media-buys, seo, business-to-business-pr, marketing-strategies, technology-pr, online-marketing",
 "alias_list": null,
 "email_address": "info@mossnetworks.com",
 "phone_number": "818-995-8127",
 "description": "Marketing. Public Relations. Events.",
 "created_at": "Mon May 03 22:32:16 UTC 2010",
 "updated_at": "Wed May 05 00:25:08 UTC 2010",
 "overview": "\u003Cp\u003EMoss Networks is a full service Marketing, Public Relations and Event Production powerhouse dedicated to providing aggressive and innovative publicity campaigns, detailed and unparalleled event planning, strategic marketing strategies, and brand positioning to a wide range of businesses.  For nearly a decade, they have applied their inspired vision, original concepts, and attention to detail to develop forward-thinking event marketing and public relations initiatives. The strength of the company lies in their ability to build the value of their clients\u0026#8217; brands and execute their visions with innovative and focused strategies. \u003C/p\u003E\n\n\u003Cp\u003EMoss Networks services include everything from developing, executing and managing comprehensive PR plans aimed at generating and building brand awareness to coordinating strategic media buys , tradeshow coordination and event management. In addition to these services, Moss Networks works to enhance branding and exposure for clients via social media, PR, SEO, Online Reputation management and creative services. This boutique-sized firm offers  a more personal and individualized approach thus creating impactful results for their clients. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       63],
      "assets/images/resized/0008/5830/85830v2-max-150x150.jpg"],
     [[250,
       105],
      "assets/images/resized/0008/5830/85830v2-max-250x250.jpg"],
     [[426,
       179],
      "assets/images/resized/0008/5830/85830v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}