{"name": "MotionElements",
 "permalink": "motionelements",
 "crunchbase_url": "http://www.crunchbase.com/company/motionelements",
 "homepage_url": "http://www.motionelements.com",
 "blog_url": "http://www.motionelements.com/blog",
 "blog_feed_url": "http://www.motionelements.com/blog/feed",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "contact@motionelements.com",
 "phone_number": "+65 6336 5352",
 "description": "Stock Animation Marketplace",
 "created_at": "Fri Jan 04 07:31:32 UTC 2013",
 "updated_at": "Sat Feb 16 15:47:08 UTC 2013",
 "overview": "\u003Cp\u003EMotionElements (ME) is one of the world\u0026#8217;s largest online marketplace for premium Asia inspired royalty-free Stock Animation, Stock Video Footage, 3D Models and After Effects Templates. It is supported by both the Media Development Authority of Singapore and Ministry of Information, Communication and the Arts, as well as Angel Investors and is founders.\u003C/p\u003E\n\n\u003Cp\u003EAs a marketplace, ME provides for the service to Buy and Sell keyed live footages, 2D \u0026amp; 3D Animation, 3D Models and other stock motion elements. Artists can enjoy up to 70% of actual revenues when selling with ME.\u003C/p\u003E\n\n\u003Cp\u003EBeing a community site of Asia\u0026#8217;s motion graphics creators, it establishes an online platform for artists to collaborate and market their works.\u003C/p\u003E\n\n\u003Cp\u003ETo best serve the interests of its ever-growing number of artists, MotionElements has structured a rigorous legal framework to keep them informed and protected at all times.\u003C/p\u003E\n\n\u003Cp\u003EThe site is powered by Web 2.0 technology which allows faster responses, enhanced usability with highly relevant and detailed categorical searchability. This means that users can search for Keyed Top Layer, Background, Lower-Third, Side Panel, Screen Layer, Wipe, Matte, Displays, Front View, Side View, Top View, Perspective View, Camera View, etc.\u003C/p\u003E\n\n\u003Cp\u003EMotionElements practices world-class, global marketing. Hence, works within ME are aggressively marketed to target markets like Europe, US, Canada, Japan, Korea, and Asia. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}