{"name": "Motoring Barrister Direct",
 "permalink": "motoring-barrister-direct",
 "crunchbase_url": "http://www.crunchbase.com/company/motoring-barrister-direct",
 "homepage_url": "http://www.motoringbarristerdirect.co.uk/",
 "blog_url": "http://motoringbarristerdirect.blogspot.in/",
 "blog_feed_url": "",
 "twitter_username": "motoringbarrist",
 "category_code": "legal",
 "number_of_employees": 50,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "drink-driving, driving-offences, driving-without-insurance",
 "alias_list": null,
 "email_address": "motoringbarristerdirect@gmail.com",
 "phone_number": "0800 883 8893",
 "description": "Motoring Barrister Direct",
 "created_at": "Sat Mar 16 08:53:49 UTC 2013",
 "updated_at": "Tue Mar 19 06:53:25 UTC 2013",
 "overview": "\u003Cp\u003Edriving offenceNeed Drink Driving Offences Advice?\nCaught Driving Without Insurance?\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8230;Well, whatever the alleged motoring offence, here at Motoring Barrister Direct we are proud to say that we have a bespoke and dedicated team of professional court room barristers specialising in defending driving offences including driving without insurance. Right now, as your driving offences lawyer team across England and Wales:\u003C/p\u003E\n\n\u003Cp\u003EDriving Offences Tick Each member of our panel is a fully practising barrister proudly regulated by the driving offence bsb\u003C/p\u003E\n\n\u003Cp\u003EDriving Offences Tick We directly represent our clients from start to finish, talk plain English and are on your side - where appropriate, we will even correspond with the CPS to try to get your case dropped so that you can avoid going to court\u003C/p\u003E\n\n\u003Cp\u003EDriving Offences Tick We are dedicated motoring offence lawyers and experts and understand that facing any criminal charge -whether you face a driving ban or are charged with driving without insurance, drink driving or any other charge - can be stressful - we take the burden by seeking to have the charges dropped or otherwise seeking the best possible outcome for you. Whether it is a mere question of speeding fines or you face something more serious, we can help\u003C/p\u003E\n\n\u003Cp\u003EDriving Offences Tick We know that in this economic climate you want certainty about how much your motoring law matter is going to cost. Well relax - we offer reasonable fixed fees so you know where you stand at the very outset.\u003C/p\u003E\n\n\u003Cp\u003E:\nWhich Driving Offences Lawyer should you choose?\u003C/p\u003E\n\n\u003Cp\u003EWe do not assume that you will definitely choose us to deal with your case. Right now though, you are probably looking for advice and guidance so that you can get the best possible solution. However, it is critical that you get that advice from the right driving lawyer from the beginning. Why? Well the reality is that the right advice from the very outset will make an enormous difference to outcome.\u003C/p\u003E\n\n\u003Cp\u003EFor instance, it is very often the case that the police just \u0026#8216;get it wrong\u0026#8217; or at least are too quick in making their decision to charge or at least issue a fixed penalty notice. And the intervention of a lawyer specialising in driving offences with the right approach could bring the whole thing to an early conclusion - often without you having to attend court. As barristers specialising in driving offence cases, we are extremely keen to make sure that you do not have to put up with the stress of your motoring offence case for a moment longer than you need to.\u003C/p\u003E\n\n\u003Cp\u003EWe regularly manage to persuade the Crown Prosecution Service to drop cases before a final hearing. One client (who never actually had to attend court and his case was dropped by the prosecution at an early hearing) recently said to us:\u003C/p\u003E\n\n\u003Cp\u003EDriving Offences Lawyer Tick\u0026#8221;I would like to congratulate you on winning my case and to thank you for your efforts and all the support I was given during the court process. As my driving offences lawyer you have explained my defence options clearly and done the right thing and I won the case. I never thought I could win it, but now I have my clean license and I’m over the moon. Thank you very much.\u0026#8221; AT, London\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       53],
      "assets/images/resized/0024/2832/242832v2-max-150x150.png"],
     [[250,
       88],
      "assets/images/resized/0024/2832/242832v2-max-250x250.png"],
     [[450,
       159],
      "assets/images/resized/0024/2832/242832v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.motoringbarristerdirect.co.uk/",
    "title": ""},
   {"external_url": "http://www.facebook.com/motoringbarristerdirect.co.uk",
    "title": ""},
   {"external_url": "https://twitter.com/motoringbarrist",
    "title": ""},
   {"external_url": "http://uk.linkedin.com/in/motoringbarristerdirect",
    "title": ""},
   {"external_url": "http://about.me/motoringbarristerdirect.co.uk",
    "title": ""}]}