{"name": "Moving Company Tampa",
 "permalink": "moving-company-tampa",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-tampa",
 "homepage_url": "http://movingcompanytampafl.org",
 "blog_url": "http://movingcompanytampa.xanga.com",
 "blog_feed_url": "http://movingcompanytampafl.weebly.com",
 "twitter_username": "MovingTampa_FL",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-services-tampa-fl, tampa-fl-moving-company, local-movers-tampa-fl, long-distance-moves-tampa-fl, professional-movers-tampa-fl, house-movers-tampa-fl, residential-movers-tampa-fl, relocation-services-tampa-fl, licensed-movers-tampa-fl, apartment-mov",
 "alias_list": null,
 "email_address": "SamanthaSwinford897@gmail.com",
 "phone_number": "(813) 649-7220",
 "description": "full moving services ",
 "created_at": "Fri Mar 22 22:25:02 UTC 2013",
 "updated_at": "Fri Mar 22 22:25:08 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Tampa, FL\nMoving Company Tampa holds an excellent position in the moving industry in Florida because this is the only company providing quick, prompt and economical solutions for local and long distance moving. Whether you are a resident or a business owner in Florida, if you are planning to move, contact us and get the best services ever which will be 100% safe, secure, damage free and moreover within your budget.\u003C/p\u003E\n\n\u003Cp\u003ERegardless of what you are moving, our expert movers provide you with fast, reliable and cost-effective services. If you are moving a single room, house or office we can easily accommodate your moving needs without any hassle. Here at Moving Company Tampa, we realize that every move cannot be set for a specific time; it can either be planned or unplanned. We keep our tools, machines and our moving crew prepared to deal with any type of move 24/7.\u003C/p\u003E\n\n\u003Cp\u003EAlways remember five factors while considering a local moving company for your move:\n-A moving company should have a positive rapport in the industry and among its existing clients. \n-Moving quotes provided by your mover should be accurate and it should not be changed at the time of final billing.\n-The movers should be punctual so that they can pick up and deliver your goods on time. \n-The movers should use the best wrapping and packing techniques to ensure damage free moving.\n-The moving crew and drivers should be verified and background checked to ensure no harm to your property.\u003C/p\u003E\n\n\u003Cp\u003EMoving Company Tampa\nmovingcompanytampafl.org\nTampa, FL 33601\n(813) 649-7220\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       147],
      "assets/images/resized/0024/4855/244855v2-max-150x150.png"],
     [[250,
       246],
      "assets/images/resized/0024/4855/244855v2-max-250x250.png"],
     [[450,
       443],
      "assets/images/resized/0024/4855/244855v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}