{"name": "Moving Company_Miami Gardens",
 "permalink": "moving-company-miami-gardens-2",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-miami-gardens-2",
 "homepage_url": "http://movingcompanymiamigardens.com",
 "blog_url": "http://movingcompanymiamigardens.tumblr.com/",
 "blog_feed_url": "http://movingcompanymiamigardens.xanga.com/",
 "twitter_username": "MiamiGardens_FL",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-services-miami-gardens-fl, miami-gardens-moving-company, local-movers-miami-gardens-fl, long-distance-moves-miami-gardens, professional-movers-miami-gardens, house-movers-miami-gardens-fl, residential-movers-miami-gardens-fl, relocation-services-mi",
 "alias_list": null,
 "email_address": "TamekaThomas67@gmail.com",
 "phone_number": "(305) 515-5309",
 "description": "full local/long distance moving ",
 "created_at": "Fri Apr 05 18:55:53 UTC 2013",
 "updated_at": "Fri Apr 05 18:55:58 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Miami Gardens\u003C/p\u003E\n\n\u003Cp\u003EOur company has been in the moving industry for the past 20 years. Once the relocation process is completed we take great pride knowing that we have satisfied our customers to their expectation. Due to our happy customers, we are Florida\u0026#8217;s best local and long distance moving company. Our main goal is to be committed to provide quality and excellence to all our customers. Moving Company Miami Gardens provides storage, relocation, packing and moving services to homeowners, military and businesses of all sizes.  \u003C/p\u003E\n\n\u003Cp\u003EOur company has experienced, dedicated and skilled moving professionals to fit the needs of all our customer\u0026#8217;s requirements. For your safety, each of our team members goes through a background check. Therefore, we are highly proud of our moving crew because they have the skills to relocate any type of local or long distance move. If you are planning on relocating in the near future, it is always best to contact the movers few months or several weeks ahead just to secure your preferred moving date. However, we understand that at times we get caught up in our busy daily routines. No worries, for that reason our company now offers 24/7 services. \u003C/p\u003E\n\n\u003Cp\u003EOur relocation coordinators, packers, drivers and crews are always learning better ways to serve you. If you would like more information regarding our services, our customer service representative will guide you through the process and answer any questions you may have. Call us today and we’ll provide you with a free moving quote. \u003C/p\u003E\n\n\u003Cp\u003EMoving Services:\n• Packing\n• Unpacking\n• Transportation\n• Loading\n• Unloading\n• Warehouse Facilities \n• Insurance\u003C/p\u003E\n\n\u003Cp\u003EWe serve the following:\n• Residential Moves\n• Business Moves\n• Commercial Moves\n• Local Moves\n• Long Distance Moves\u003C/p\u003E\n\n\u003Cp\u003ERequest a Free Quote\nFinding the Right Moving Company is Easy! Submit your moving information to get FREE quotes from moving companies in your area. \nEnter your move information below for your free, no obligation price quotes. \nKNOW the price before you move and SAVE UP to 40% \non your upcoming Move. It takes less than 30 seconds. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}