{"name": "Moving Company Joliet",
 "permalink": "moving-company-joliet",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-joliet",
 "homepage_url": "http://movingcompanyjoliet.com",
 "blog_url": "http://movingcompanyjoliet.weebly.com/",
 "blog_feed_url": "http://movingcompanyjoliet.tumblr.com/",
 "twitter_username": "MovingJoliet",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-services-joliet-il, joliet-moving-company, local-movers-joliet-il, long-distance-moves-joliet, professional-movers-joliet, house-movers-joliet-il, residential-movers-joliet-il, relocation-services-joliet, licensed-movers-joliet, packing-services-jo",
 "alias_list": null,
 "email_address": "Comuxgy7642@gmail.com",
 "phone_number": "(815) 553-0628",
 "description": "Relocation Services in Illinois ",
 "created_at": "Mon May 13 16:47:40 UTC 2013",
 "updated_at": "Wed May 15 12:42:54 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Joliet provides local, long distance and international moving services at competitive prices. Whether you’re moving long distance or locally, we are a group of professional movers that will assist you throughout the entire moving process. We specialize in providing a professional and seamless moving experience because we are committed to being the safest, customer-focused company in the state of Illinois. With over 25 years of experience, Moving Company Joliet is the local relocating company you can count on. \u003C/p\u003E\n\n\u003Cp\u003EWe are a reliable moving company that hires and retain people with a customer focus. We pride ourselves in the quality of how well we handle your goods because we use the best equipment that technology has to offer and maintain top-rated trucks and facilities. We also provide services to move automobiles and motorcycles. Our company offer home to home handling of household items, packing, crating and full line storing and moving services. You can talk to our moving representative and make your moving schedule as per your need. We will help you to arrange all the things that are needed for a pleasant moving experience.  \u003C/p\u003E\n\n\u003Cp\u003EWhy the residents of Illinois choose us:\n•24 Hour Availability\n•Storage Facility Available\n•Computer Controlled Access all the time\n•Drive-Up Access\n•Exterior Facility Lighting\n•Insurance Coverage\n•Outdoor Units\n•24hr Video Recordings\u003C/p\u003E\n\n\u003Cp\u003EMoving Company Joliet provides well-planned and safe moves that are performed by trained professionals. Our movers use specialized equipment to pack your belongings with the best possible techniques to avoid damage. Our truck drivers and moving team members are well verified and background checked before joining our company. \u003C/p\u003E\n\n\u003Cp\u003EMoving Company Joliet\nmovingcompanyjoliet.com\nJoliet, IL 60435\n(815) 553-0628\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       147],
      "assets/images/resized/0026/1802/261802v2-max-150x150.jpg"],
     [[250,
       245],
      "assets/images/resized/0026/1802/261802v2-max-250x250.jpg"],
     [[337,
       331],
      "assets/images/resized/0026/1802/261802v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}