{"name": "Moving Company Hempstead",
 "permalink": "moving-company-hempstead",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-hempstead",
 "homepage_url": "http://movingcompanyhempstead.com",
 "blog_url": "http://movingcompanyhempstead.xanga.com",
 "blog_feed_url": "http://movingcompanyhempstead.tumblr.com/",
 "twitter_username": "MovingHempstead",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hempstead, ny, moving-company-hempstead, movers-hempstead, professional-movers, hempstead-new-york, moving-companies-in-hempstead-new-york, apartment-movers-hempstead, local-movers-hempstead, new-york, moving-company-moving-company-hempstead-new-york-ny, ",
 "alias_list": null,
 "email_address": "RuthWagar675@gmail.com",
 "phone_number": "(516) 302-1069",
 "description": "Local/Long Distance Moving Services",
 "created_at": "Wed Mar 20 18:09:13 UTC 2013",
 "updated_at": "Wed Mar 20 18:09:17 UTC 2013",
 "overview": "\u003Cp\u003EWelcome To Moving Company Hempstead\u003C/p\u003E\n\n\u003Cp\u003EAre you looking for world class, reliable, professional local movers? If your answer is yes, then you are at the right place. Moving Company Hempstead is the leading moving company based in Hempstead, New York. Our local movers as well as long distance movers offer a wide spectrum of moving services to our residential and commercial clients. Our moving company has two decades of experience and we feel proud in providing top-notch moving services with a professionally trained and certified staff. Our licensed movers use the latest cutting-edge equipment and total client satisfaction.     \u003C/p\u003E\n\n\u003Cp\u003EOur moving company is always there to contribute to your new beginnings. We treat our client’s belongings as if they were our own. Whether you are moving locally or you are traveling long distance into a new city, our licensed movers can handle it all. We understand that moving can be dependent on time, so our local movers are available at your convenience to move you twenty four hours a day, seven days a week. If you are planning on moving soon or if you have an emergency move, call our moving company today and one of our licensed movers will be more than happy to assist you.       \u003C/p\u003E\n\n\u003Cp\u003EMoving Company Hempstead strives for quality moving services. That’s why we hire the best long distance movers to work for our company. All of our local movers are completely skilled, trained and certified in their moving duties. Our employees have offered their years of working experience and gained such a wonderful experience working with us. Once they arrive at your place on the pre-scheduled moving day, they will be fully geared up and equipped with all the essential supplies. You will find that our local movers have the energy to perform their moving duties efficiently. We have our own fleet of trucks and vans which provide safe and secure moves every time. We can provide you with additional packing and wrapping material if needed at very nominal prices.    \u003C/p\u003E\n\n\u003Cp\u003EOur top-notch moving services are inclusive but not limited to:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EFree Quotes\u003C/li\u003E\n\u003Cli\u003EAvailable to Move 24 hours/ 7 days a week/ 365 days a year\u003C/li\u003E\n\u003Cli\u003EAny Size Moving\u003C/li\u003E\n\u003Cli\u003EResidential and Commercial Moving\u003C/li\u003E\n\u003Cli\u003EMove you anywhere in U.S.\u003C/li\u003E\n\u003Cli\u003ELatest Tools and Methods used for Moving\u003C/li\u003E\n\u003Cli\u003EExtra Packing Boxes with very low pricing\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EMoving Company Hempstead\nmovingcompanyhempstead.com\nHempstead, NY 11550\n(516) 302-1069\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[149,
       150],
      "assets/images/resized/0024/4026/244026v2-max-150x150.png"],
     [[248,
       250],
      "assets/images/resized/0024/4026/244026v2-max-250x250.png"],
     [[392,
       394],
      "assets/images/resized/0024/4026/244026v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}