{"name": "Moving Company Pembroke Pines",
 "permalink": "moving-company-pembroke-pines",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-pembroke-pines",
 "homepage_url": "http://movingcompanypembrokepines.com",
 "blog_url": "http://movingcompanypembrokepines.tumblr.com/",
 "blog_feed_url": "http://movingcompanypembrokepines.xanga.com",
 "twitter_username": "MCPembrokePines",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "movers-pembroke-pines, apartment-movers-pembroke-pines, local-movers-pembroke-pines, moving-company-pembroke-pines, moving-services-pembroke-pines, office-move-pembroke-pines, professional-movers-pembroke-pines, cheap-movers-pembroke-pines, long-distance-",
 "alias_list": null,
 "email_address": "DianeReed675@gmail.com",
 "phone_number": "(954) 414-7054",
 "description": "Professional Moving Services",
 "created_at": "Tue Mar 12 23:48:30 UTC 2013",
 "updated_at": "Tue Mar 12 23:48:35 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Pembroke Pines\nWhen you move with Moving Company Pembroke Pines you experience the ultimate level of ease, comfort and grace while moving. Movers from our company will make sure to provide a flawless moving service by complying with your every moving need. Our movers go that extra mile to ensure maximum level of comfort and ease for our clients.\u003C/p\u003E\n\n\u003Cp\u003EA major concern when hiring a professional moving company is safety and security of your personal belongings. The safety of your property or business has to be considered while finalizing a local moving company to relocate you. Over the years, we have gained extensive experience and knowledge to best suit your needs. Moving Company Pembroke Pines assures a damage and stress free move. We hire the best local movers who are properly verified and screened before they start moving you.\u003C/p\u003E\n\n\u003Cp\u003EMoving Company Pembroke Pines offers you immediate response after your first call to us. We offer 24/7 moving services, so that you can move whenever you want. Our company can move you in any circumstance, whether you have to move your home or office, our movers can do it all. Our local movers in Pembroke Pines work around your daily routine to move you; we have no restriction on the day or time. If you need our moving assistance, get in touch with us, and you’ll definitely get the assistance you need without any excuses or delay.\u003C/p\u003E\n\n\u003Cp\u003EReasons to choose Moving Company Pembroke Pines:\n• Moves beyond imagination\n• Customer’s safety is on priority\n• Ensures damage free delivery of all moving goods\n• Background confirmed and drug-screened movers\n• Quick and Prompt response\n• 24/7 emergency moving services\n• Emergency services are open throughout the year\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[145,
       150],
      "assets/images/resized/0024/2049/242049v2-max-150x150.png"],
     [[243,
       250],
      "assets/images/resized/0024/2049/242049v2-max-250x250.png"],
     [[285,
       293],
      "assets/images/resized/0024/2049/242049v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}