{"name": "Moving Company Binghamton",
 "permalink": "moving-company-binghamton",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-binghamton",
 "homepage_url": "http://movingcompanybinghamton.com",
 "blog_url": "http://movingcompanybinghamton.xanga.com",
 "blog_feed_url": "http://movingcompanybinghamton.weebly.com",
 "twitter_username": "MovinBinghamton",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "movers-binghamton-company, new-york, moving, move, movers-moving-services, local-movers, binghamton-company, new-york-moving-services, local-move, interstate-move, residential-movers, commercial-movers, military-transfers, binghamton, ny, professional-mov",
 "alias_list": null,
 "email_address": "AndraPhillips675@gmail.com",
 "phone_number": "(607) 235-0946",
 "description": "full moving services ",
 "created_at": "Thu Mar 28 16:52:25 UTC 2013",
 "updated_at": "Thu Mar 28 16:52:30 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Binghamton- Find Movers Binghamton\u003C/p\u003E\n\n\u003Cp\u003EMoving Company Binghamton in New York presents safe, secure, reliable and low cost moving rates in the Binghamton area. We believe that moving is something more than just changing an address. Our company understands that it means a lot to family when one needs to move. They are relocating to a new place to begin a new life full of emotions and memories. We take great care of this thought while moving our clients. \u003C/p\u003E\n\n\u003Cp\u003EMoving Company Binghamton is well known for residential and commercial moving whether you just need local movers or long distance movers. We strongly believe that every move is unique and that is why we have different crew members and strategies for each different kind of move, but each and every one of are licensed movers. Whether you are moving locally within New York City or long distance, Moving Company Binghamton adjusts to each individual move and its needs. Our company will guarantee to execute your move successfully.\nWe value our customers and their smile. We want to make you happy with our world class moving services. That is why Moving Company Binghamton goes beyond time limits for our clients. Our local movers and long distance movers are available twenty four hours a day - seven days a week throughout the year. Our company promises to commit to you every step of the way at any time to fulfill to your moving needs. Moving Company Binghamton will stand by your side throughout each relocation process, no matter if it is a pre-planned or last minute move.\u003C/p\u003E\n\n\u003Cp\u003EWe provide full top of the line moving services for you coupled with the best licensed movers around. Our movers will do the packing, loading, unloading, unpacking and settle your belongings at your new destination. We take great care in wrapping of furniture and fragile items to avoid scratches or damages of any kind. However, you also have the option of packing your own belongings which can save you money on your move. Our company has a wide selection of wrapping materials or packing boxes at very reasonable rates. What are you waiting for, get a free quote now and book your upcoming move with Moving Company Binghamton!\nMoving Company Binghamton offers some exclusive services to its residential and commercial clients. Have a quick look on them:\u003C/p\u003E\n\n\u003Cp\u003E• Round the clock moving\n• Free of Cost Estimates\n• One-Stop full length moving services\n• Residential and Commercial Moving\n• Local and Long Distance Moving\u003C/p\u003E\n\n\u003Cp\u003EMoving Company Binghamton\nmovingcompanybinghamton.com\nBinghamton, NY 13905\n(607) 235-0946\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[148,
       150],
      "assets/images/resized/0024/6287/246287v2-max-150x150.png"],
     [[247,
       250],
      "assets/images/resized/0024/6287/246287v2-max-250x250.png"],
     [[445,
       450],
      "assets/images/resized/0024/6287/246287v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}