{"name": "Moving Company Pompano Beach",
 "permalink": "moving-company-pompano-beach",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-pompano-beach",
 "homepage_url": "http://movingcompanypompanobeach.com",
 "blog_url": "http://movingcompanypompanobeach.xanga.com/",
 "blog_feed_url": "http://movingcompanypompanobeach.tumblr.com/",
 "twitter_username": "FL_PompanoBeach",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-services-pompano-beach-fl, pompano-beach-moving-company, local-movers-pompano-beach-fl, long-distance-moves-pompano-beach, professional-movers-pompano-beach, house-movers-pompano-beach-fl, residential-movers-pompano-beach-fl, relocation-services-po",
 "alias_list": null,
 "email_address": "DeborahRomero564@gmail.com",
 "phone_number": "(954) 414-7027",
 "description": "full service relocating compan",
 "created_at": "Mon Apr 08 23:09:31 UTC 2013",
 "updated_at": "Tue Apr 09 13:33:35 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Pompano Beach is a full service relocating company dedicated to providing easy and affordable moving services to residential and commercial clients. We strive to offer the finest service possible in the moving industry and we have evolved with our clients’ needs and grown into a highly respected moving company for storage and moving services. To make your move simple and hassle-free, our movers have added services such as electronics disassembly and setup, identity protection and cleaning are available through our company. If you require any of these services, please let us know. \u003C/p\u003E\n\n\u003Cp\u003EOur local movers are consistent, efficient and allow us to maintain a high level of quality control. At Moving Company Pompano Beach our movers are all licensed and insured and strive to provide you with the most excellent moving services we have to offer. Our mission is to improve the moving experience by being receptive and inventive in the pursuit of the perfect move for each individual. We will move you with utmost pride and care, and that\u0026#8217;s a promise.\u003C/p\u003E\n\n\u003Cp\u003EWe serve local moves, long distance moves and international moves for:\n• Residential\n• Commercial\n• Corporate\n• Industrial\n• Interstate\u003C/p\u003E\n\n\u003Cp\u003EResidential Moving Commercial Moving Interstate Moving Economical Prices Furniture Assembly Storage Services Local Moves Long Distance Moves Packing Materials Moving can be stressful and challenging, but choosing Moving Company Pompano Beach keeps the relocation process simple and professional. We have the expertise to make your move go as smoothly as possible and we\u0026#8217;ll make sure your property is in safe hands. If you want your move done right without having to worry about your valuables getting damaged or lost, call us today for a free quote. We will be glad to discuss our services and customized services with you.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       148],
      "assets/images/resized/0024/9647/249647v2-max-150x150.png"],
     [[250,
       247],
      "assets/images/resized/0024/9647/249647v2-max-250x250.png"],
     [[450,
       445],
      "assets/images/resized/0024/9647/249647v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}