{"name": "Moving Company Arlington Heights",
 "permalink": "moving-company-arlington-heights",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-arlington-heights",
 "homepage_url": "http://www.movingcompanyarlingtonheights.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1975,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-services-arlington-heights-il, arlington-heights-moving-company, local-movers-arlington-heights-il, long-distance-moves-arlington-heights, professional-movers-arlington-heights, house-movers-arlington-heights-il, residential-movers-arlington-height",
 "alias_list": null,
 "email_address": "brendaoverman88@gmail.com",
 "phone_number": "(877) 701-4894",
 "description": "your preferred moving company",
 "created_at": "Mon Dec 24 14:22:15 UTC 2012",
 "updated_at": "Fri Dec 28 16:24:45 UTC 2012",
 "overview": "\u003Cp\u003EIf you are in need of a specialized local mover to carry out your \nlocal or long distance move, choose our moving company because we \nmake sure that each feature of your move is operated with the maximum \nlevel of care. Moving is a bother and there is no need for you to \ninjure yourself, so let our movers take care of all the hard and heavy \nitems. If your new locality is not prepared to move into we have a \nsolution for you, we tender short term or long term storage spaces \nthat are available upon request. They come in handy for those \ncustomers that need to settle their paper work or have their new \nlocality remodeled. Our movers pay extra attention to detail and \noffer their advice to your individual needs with a range of solutions.\u003C/p\u003E\n\n\u003Cp\u003ESome additional features:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EOur phones are staffed 24 hours a day, 7 days a week. \u003C/li\u003E\n\u003Cli\u003EWe have offices in many major cities.\u003C/li\u003E\n\u003Cli\u003EWe have express trucks that can accommodate all moving needs. \u003C/li\u003E\n\u003Cli\u003EWe are an insured carrier \u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EWhen our client are not satisfied, we are not satisfied and we \nwill never leave our job unfinished. So, if you have questions \nor concerns about our services, please do not hesitate to contact us.\nMoving Company Arlington Heights wants to be your preferred moving \ncompany, just give us a call and we will be more than happy to answer \nany questions you may have. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}