{"name": "Moving Company Miramar",
 "permalink": "moving-company-miramar",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-miramar",
 "homepage_url": "http://movingcompanymiramar.com",
 "blog_url": "http://movingcompanymiramar.xanga.com",
 "blog_feed_url": "http://www.classifiedads.com/moving_storage-ad29020892.htm",
 "twitter_username": "MovingMiramar",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-services-miramar-fl, miramar-moving-company, local-movers-miramar-fl, long-distance-moves-miramar, professional-movers-miramar, house-movers-miramar-fl, residential-movers-miramar-fl, relocation-services-miramar, licensed-movers-miramar-fl, office-",
 "alias_list": null,
 "email_address": "CarolinaSchlegel675@gmail.com",
 "phone_number": "(954) 414-7031",
 "description": "Professional relocation company ",
 "created_at": "Fri Mar 15 21:46:37 UTC 2013",
 "updated_at": "Fri Mar 15 21:46:41 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Miramar\u003C/p\u003E\n\n\u003Cp\u003EAre you looking for a professional and trustworthy moving company in Florida? Moving Company Miramar is a renowned and recommended moving company serving all of Miramar and surrounding areas. We offer amazing service for local and long distance moving, so call us now and get a free quote for your next planned or unplanned move.\u003C/p\u003E\n\n\u003Cp\u003EMoving Company Miramar has moved thousands of families and businesses since 1960 and we offer you a complete and wide array of moving services. We also provide personalized packages that are designed and modified as per your moving need and financial budget.\u003C/p\u003E\n\n\u003Cp\u003EFree estimates: We provide you with a free, no-obligation estimate. Initially, it’s a rough estimate, but as soon as our crew reaches your moving site we give you the final and accurate moving quote in regards to your moving goods, their weight, moving distance and some other important factors.\u003C/p\u003E\n\n\u003Cp\u003E24/7 Availability: Our moving teams are available 24/7 all throughout year. Don’t hesitate to call us if you plan to move soon or in the near future. \u003C/p\u003E\n\n\u003Cp\u003EFlexible pricing options: Every moving family or business has its own financial limitations and here at Moving Company Miramar we understand the fact and give you freedom to pick the best package out for your move.\u003C/p\u003E\n\n\u003Cp\u003EExpert moving crew: Movers who are trained, certified and experienced in moving will be taking care of your move. We make sure our moving crew is drug tested and screened prior to employment.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       143],
      "assets/images/resized/0024/2766/242766v2-max-150x150.png"],
     [[250,
       238],
      "assets/images/resized/0024/2766/242766v2-max-250x250.png"],
     [[383,
       366],
      "assets/images/resized/0024/2766/242766v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}