{"name": "Moving Company Deltona",
 "permalink": "moving-company-deltona",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-deltona",
 "homepage_url": "http://movingcompanydeltona.com/",
 "blog_url": "http://movingcompanydeltona.tumblr.com/",
 "blog_feed_url": "http://movingcompanydeltona.xanga.com/",
 "twitter_username": "MovingDeltona",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-company-deltona, local-movers-deltona-fl, long-distance-moves-deltona, professional-movers-deltona, house-movers-deltona-fl, residential-movers-deltona-fl, relocation-services-deltona, licensed-movers-deltona, packing-services-deltona, office-mover",
 "alias_list": null,
 "email_address": "Davetuv422@gmail.com",
 "phone_number": "(407) 520-5130",
 "description": "Local/Long Distance Relocation Services",
 "created_at": "Wed Apr 24 21:56:10 UTC 2013",
 "updated_at": "Mon Apr 29 21:22:34 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Deltona is a premier moving company based in Florida that is focused on careful, professional and dependable service. We provide professional moves at reasonable and cost-efficient prices. Our company offers local, in-state and long distance moves as well as a range of storage services and packing supplies. Don’t look any further for your short or long-term storage and moving needs; Moving Company Deltona is the right choice for you. Here at Moving Company Deltona we offer immediate pickup and delivery of your belongings. Our company offers local service to all of Deltona and surrounding areas and we have outstanding rates for statewide and out of state deliveries as well. Choosing a quality carrier and working with our moving professionals and selecting the best packing methods for your shipment can go a long way toward preventing loss and damage belongings. \u003C/p\u003E\n\n\u003Cp\u003EWe think that a happy client is the greatest form of advertisement and we invest all of our assets in that. We offer dependable customer service, flexible scheduling, email confirmation, packing supplies, cancellation policies and many other features. With our full length of moving services we offer, we believe that we are the best moving company in Florida. Some of the reasons why you should choose our company over any other is because we offer immediate pickup and delivery of your belongings, customized deliveries are available and a professional and uniformed moving crew will be sent to your home or business. Request your free quote today for more details about these services and many others we provide.   \u003C/p\u003E\n\n\u003Cp\u003EMoving Company Deltona\nmovingcompanydeltona.com\nDeltona, FL 32725\n(407) 520-5130\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[141,
       150],
      "assets/images/resized/0025/4715/254715v2-max-150x150.png"],
     [[235,
       250],
      "assets/images/resized/0025/4715/254715v2-max-250x250.png"],
     [[424,
       450],
      "assets/images/resized/0025/4715/254715v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}