{"name": "Moving Company Spring Hill",
 "permalink": "moving-company-spring-hill",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-spring-hill",
 "homepage_url": "http://movingcompanyspringhill.com",
 "blog_url": "http://movingcompanyspringhill.tumblr.com/",
 "blog_feed_url": "http://movingcompanyspringhill.xanga.com/",
 "twitter_username": "MoveSpringHill",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-services-spring-hill-fl, spring-hill-moving-company, local-movers-spring-hill, long-distance-moves-spring-hill-fl, professional-movers-spring-hill, house-movers-spring-hill-fl, residential-movers-spring-hill, relocation-services-spring-hill-fl, lic",
 "alias_list": null,
 "email_address": "MariaKelly786@gmail.com",
 "phone_number": "(352) 224-3861",
 "description": "professional moving company ",
 "created_at": "Wed Apr 10 17:03:12 UTC 2013",
 "updated_at": "Wed Apr 10 17:03:18 UTC 2013",
 "overview": "\u003Cp\u003EMoving Company Spring Hill is an innovative moving company that is constantly improving its methods. We utilize only but the latest tools and equipment so we can move out our clients fast, quick and easy. Our equipment is exclusively chosen for the safety of your items and for our clients. They are properly maintained and checked before the start and finish of every move. Our equipment is an investment because we believe that if you will be investing in us than you should receive nothing more than the best. You will receive the best customer service, rates, and moving process no questions asked. Our company has had the pleasure to provide our moving services to all around clients including: industrial, commercial, corporate, residential, shops, warehouses and so much more.\u003C/p\u003E\n\n\u003Cp\u003EOur Service Includes:\n• Local Moving\n• Long Distance Moving\n• In-state Moving\n• Out-state Moving\n• International Moving\n• Packaging\n• Documentation\n• Warehousing and Storage Compartment Services\n• Vehicle Transportation\u003C/p\u003E\n\n\u003Cp\u003EOther Special Services We offer:\n• Pre-move survey\n• Documentations\n• Packing\n• Free Boxes and Storage\n• Warehousing\n• Export Packing\n• Insurance Service\n• Shipment Coordinations\n• Easy Payment\n• Customer Clearance\u003C/p\u003E\n\n\u003Cp\u003EDistance is not a challenge to movers at Moving Company Spring Hill. Through years of experienced they have gained the knowledge to properly relocate anyone with a unlimited amount of items to any destination. We own our very own trucks and vans to transport any sized moved to any city, state, or country. Long distance moves have a higher damage risk since the trip is significantly longer and there are more bumps and curves on the road. Our company created thick material boxes and customized blankets to protect all your belongings and furniture from any bump that may come ahead of us. We are a licensed and bonded moving company that fully takes responsibility of your items, and if any item big or small gets damaged on the way we will go ahead and gladly cover the damages, guaranteed! Call us today for a free estimate and our moving expert team will be at your doors within 24 hours after your request.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       124],
      "assets/images/resized/0025/0338/250338v2-max-150x150.png"],
     [[243,
       202],
      "assets/images/resized/0025/0338/250338v2-max-250x250.png"],
     [[243,
       202],
      "assets/images/resized/0025/0338/250338v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}