{"name": "Moving Company Skokie",
 "permalink": "moving-company-skokie",
 "crunchbase_url": "http://www.crunchbase.com/company/moving-company-skokie",
 "homepage_url": "http://www.movingcompanyskokie.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1977,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "moving-company-skokie, moving-services-skokie-il, skokie-moving-company, local-movers-skokie-il, long-distance-moves-skokie, professional-movers-skokie, house-movers-skokie-il, residential-movers-skokie-il, relocation-services-skokie, licensed-movers-skok",
 "alias_list": null,
 "email_address": "ruthmitchell74@gmail.com",
 "phone_number": "(877) 701-4894",
 "description": "the only moving company you can trust ",
 "created_at": "Tue Dec 25 11:30:22 UTC 2012",
 "updated_at": "Fri Dec 28 16:28:44 UTC 2012",
 "overview": "\u003Cp\u003ELong Distance Move:\nAs your preferred moving partner, Moving Company Skokie goes the extra mile \nto offer personalized moving options. You can take advantage of the many \nextra services Moving Company Skokie offers apart from just the basic moving \npackage. Our company has many years of practice in helping families move out \nof state. Our team will make sure that each piece is packed and wrapped \nproperly to make sure a damage-free relocation. Moving with us by your side \nwill make your move simple going and comfortable. Get in touch with Moving \nCompany Skokie long distance movers for a complimentary quote.\u003C/p\u003E\n\n\u003Cp\u003EThese additional services include:\n• Full Service packing\n• Unpacking\n• Crating\n• Shuttle Service\n• Storage\u003C/p\u003E\n\n\u003Cp\u003EAs a local mover, we have satisfied all customers and they have made us \nthe most reputed and reliable moving company in Illinois. Moving is a \nvery difficult task for people that chose to hire the cheapest moving \ncompany that is not bonded or insured. Hiring a non reliable moving \ncompany may put your valuable items at a high risk of getting damaged \nor broken. Moving Company Skokie is a leading relocating company that \nprovides a wide range of local and moving services  to residential and \ncommercial customers in Illinois. Our trained specialized movers have \nthe capabilities to fully satisfy all our customers with their specific \nunique requirements. We are a qualified, insured and skilled moving company \nthat will cover your home commodities and possessions throughout the complete \nmoving course. \u003C/p\u003E\n\n\u003Cp\u003EAs part of our local moving service, we provide packing and office moving \nassistance. We work with only specific moving gear to move all our customers \nin a short amount of time. No matter where you are relocating to, our moving \ncompany will get you there and provide a maximum level of quality. There is \nno moving task is too big or small for us to manage, whether it is local or \nlong distance. Moving in general can be a hassle and our movers have the \nnecessary equipment to get the work done effortlessly and easily.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}