{"name": "Moxtra",
 "permalink": "moxtra",
 "crunchbase_url": "http://www.crunchbase.com/company/moxtra",
 "homepage_url": "http://www.moxtra.com",
 "blog_url": "http://www.moxtra.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "MyMoxtra",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Tue Jan 29 17:06:58 UTC 2013",
 "updated_at": "Tue Jan 29 17:20:17 UTC 2013",
 "overview": "\u003Cp\u003EMoxtra App is a mobile-centric social collection and collaboration application, now available in the App Store. Moxtra enables users to collect any type of digital content, access remote files on desktops, personalize content with voice, and share content publicly on social media or collaborate selectively – all in one app.\u003C/p\u003E\n\n\u003Cp\u003EMoxtra is for anyone with a project or collection of things on which they want to collaborate with others, in a more productive way.\u003C/p\u003E\n\n\u003Cp\u003EMoxtra provides users the simplicity of having everything organized in one place, which, in this instance comes in the form of a mobile binder. Users collect their essential digital content from wherever: Dropbox, Box, remote desktop, camera roll, or take a photo or video, and add it to their Moxtra Binder. Users can see their content as if on paper with no need to “open” each file–the content is automatically and attractively displayed. Virtually any type of digital content can be added to a Moxtra Binder: photos, videos, notes, web pages, receipts, documents, email attachments, etc.\u003C/p\u003E\n\n\u003Cp\u003EOne key element of the Moxtra Binder is the Moxtra Note. With the Moxtra Note, you or anyone you invite to your binder can quickly create a multi-media presentation using annotations and voice-over to personalize pages in the binder. The Moxtra Note can be shared via email, SMS or Facebook. Also, any member of the binder can start a Moxtra Meet, allowing invitees to view pages in the binder from any browser within a real-time web meeting.\u003C/p\u003E\n\n\u003Cp\u003EMoxtra turns iPads and iPhones into truly productive devices. \u003C/p\u003E\n\n\u003Cp\u003EMoxtra, a Silicon Valley-based company, focuses on designing mobile solutions to help people master the chaos of their busy on-the-go lifestyles. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0023/2378/232378v1-max-150x150.png"],
     [[223,
       62],
      "assets/images/resized/0023/2378/232378v1-max-250x250.png"],
     [[223,
       62],
      "assets/images/resized/0023/2378/232378v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder \u0026 CEO",
    "person":
     {"first_name": "Subrah",
      "last_name": "Iyar",
      "permalink": "subrah-iyar-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}