{"name": "MR Engineering",
 "permalink": "mr-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/mr-engineering",
 "homepage_url": "http://www.indiamart.com/m-r-engineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "air-compressors, high-pressure-air-compressors, single-stage-air-compressors-and-two-stage-air-compressors-",
 "alias_list": null,
 "email_address": "m-r-engineering@tradepassport.org",
 "phone_number": "",
 "description": "We are into manufacturing and supplying ",
 "created_at": "Fri Apr 05 11:38:08 UTC 2013",
 "updated_at": "Fri Apr 05 11:38:14 UTC 2013",
 "overview": "\u003Cp\u003EM. R. Engineering was incorporated in 2009 as amongst the leading manufacturers and suppliers of quality approved range of Air Compressors, High Pressure Air Compressors, Single Stage Air Compressors and Two Stage Air Compressors. We manufacture these products by utilizing quality approved components sourced from reputed vendors in the industry. Our products are configured with advanced technologies and methods thereby rendering maximum client satisfaction. Under the guidance of our managers, Mr. N. Raja \u0026amp; Mr. Karthick we are able to deliver quality approved product range for our valuable clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality being the sole priority we manufacture and supply entire product range as per the international standards of quality. We fabricate the entire product range utilizing quality approved components sourced from certified vendors in the industry. Our products are tested on each stage of production process right from the initial to the final stage of delivery. We test the entire product range on varied parameters thereby ensuring its flawlessness.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have well equipped infrastructure facility that is embedded with advanced technologies and methods and are managed by diligent work force. Advanced machinery and tools installed in our facility are manned by experienced professionals and assist us to complete the assigned tasks in well organized time. Owing to our spacious infrastructure we are able to place bulk orders in well defined time frame.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur organization is blessed by experienced and dedicated professionals who put their complete efforts in fabricating quality approved product range to our valuable clients. Our professionals work in 24* 7 environments to achieve the desired organizational goals in well defined time frame. We have employed a team of research and development personnel who continuously upgrade the skills of our professionals so that we can fabricate the entire product line as per the quality standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nAir Compressors, High Pressure Air Compressors, Single Stage Air Compressors and Two Stage Air Compressors.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       114],
      "assets/images/resized/0024/8590/248590v2-max-150x150.jpg"],
     [[235,
       180],
      "assets/images/resized/0024/8590/248590v2-max-250x250.jpg"],
     [[235,
       180],
      "assets/images/resized/0024/8590/248590v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}