{"name": "MRX Technologies",
 "permalink": "mrx-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/mrx-technologies",
 "homepage_url": "http://www.mrx.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "NeilGerardo",
 "category_code": "biotech",
 "number_of_employees": 10800,
 "founded_year": 1976,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "neilgerardo@mrx.com",
 "phone_number": "",
 "description": "Aerospace, Defense, Medical",
 "created_at": "Wed May 15 20:23:24 UTC 2013",
 "updated_at": "Thu May 16 01:31:14 UTC 2013",
 "overview": "\u003Cp\u003EMRX provides advanced technologies to the Department of Defense, the State Department, Intelligence Agencies, the Department of Energy and the Department of Homeland Security with the interdisciplinary research and development required for establishing and advancing the underlying enabling technologies demonstrating global superiority in the intelligence, aerospace, drone, defense and medical industries. \u003C/p\u003E\n\n\u003Cp\u003EMRX Technologies provides global scientific, engineering, systems integration, technical services and advanced technological solutions to all branches of the U.S. Military, the Department of Defense, the Department of Energy, the State Department, the Diplomatic Community, Intelligence Agencies, the U.S. Department of Homeland Security and other U.S. Government Civil Agencies, as well as solving complex technical challenges requiring innovative solutions for customers in selected international commercial markets. \u003C/p\u003E\n\n\u003Cp\u003EProviding initiatives that identify, evaluate and commercialize technology for the specific goal of rapidly developing and deploying products and services that meet the specific operational requirements of the Department of Homeland Security\u0026#8217;s operating components.\u003C/p\u003E\n\n\u003Cp\u003EThe MRX Technology provides for biological, biomedical and defense applications including detection, identification, tracking, targeting, remote molecular specific targeting and dissociation, remote radiative catalysis, remote molecular imaging and analysis, medical diagnostics, molecular specific ablation via resonance absorption, molecular specific medical therapies and scientific applications within numerous disciplines.\u003C/p\u003E\n\n\u003Cp\u003EMRX provides research \u0026amp; development to advance the underlying enabling technologies \ndemonstrating global superiority in the intelligence, aerospace, drone, defense and medical industries.\u003C/p\u003E\n\n\u003Cp\u003EProviding advanced technologies to elevate Diplomatic Relations between Governments\nand promote goodwill, understanding, purpose, reason and living standards between populations.\u003C/p\u003E\n\n\u003Cp\u003EInternational Relations.\nBack Channel Diplomatic Strategies and Services.\u003C/p\u003E\n\n\u003Cp\u003EStatus: Public Company, Organized in 1976, Private Equity controlled since 1996.\nGovernment Contractor: Prime; DOD, DOE, Government Agencies.\u003C/p\u003E\n\n\u003Cp\u003EIn 2012, MRX remains privately held, with operations in over 100 Countries, comprised of more than 300 Corporations, employing over 9000, generating annual revenues of $7.5B USD. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[111,
       111],
      "assets/images/resized/0026/2775/262775v2-max-150x150.jpg"],
     [[111,
       111],
      "assets/images/resized/0026/2775/262775v2-max-250x250.jpg"],
     [[111,
       111],
      "assets/images/resized/0026/2775/262775v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Neil Gerardo",
    "person":
     {"first_name": "Chair",
      "last_name": "\u0026 CEO",
      "permalink": "chair-ceo",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "MRX Technologies",
    "address1": "Box 530704",
    "address2": "",
    "zip_code": "89053-0704",
    "city": "Henderson",
    "state_code": "NV",
    "country_code": "USA",
    "latitude": 36.0254779,
    "longitude": -114.9966904}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}