{"name": "Multiblitz USA - Studio Lighting for Photography",
 "permalink": "multiblitz-usa-studio-lighting-for-photography",
 "crunchbase_url": "http://www.crunchbase.com/company/multiblitz-usa-studio-lighting-for-photography",
 "homepage_url": "http://multiblitzusa.com",
 "blog_url": "http://blog.multiblitzusa.com",
 "blog_feed_url": "http://feed.multiblitzusa.com",
 "twitter_username": "multiblitzusa",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "photography, photo-gear, studio-lighting, photography-lighting",
 "alias_list": null,
 "email_address": "info@multiblitzusa.com",
 "phone_number": "(410) 296 4105",
 "description": "Studio Lighting Online Store",
 "created_at": "Wed May 29 19:26:06 UTC 2013",
 "updated_at": "Fri May 31 20:31:48 UTC 2013",
 "overview": "\u003Cp\u003EMultiblitz - Revolutionizing Photography since 1948\u003C/p\u003E\n\n\u003Cp\u003EMultiblitz Dr. Ing. D.A. Mannesmann GmbH was founded by inventor and entrepreneur Dr. Mannesmann in 1948 in Cologne, Germany, and is one of the worlds leading manufacturers of state-of-the-art photography lighting equipment. The first ever Multiblitz strobe, in fact the first German electronic flash unit ever, was the Multiblitz I built in 1948. Dr. Mannesmann decided to build high-quality photographic lighting equipment and strobes that can flash multiple times. Hence he named the strobe and subsequently the brand Multiblitz after Harold \u0026#8220;Doc\u0026#8221; Edgerton\u0026#8217;s multi-flash experiments from the late 40s (Blitz is German for flash). In the 50s and 60s strobes like the Multiblitz Reporter II and the Multiblitz Press Universal were extremely popular among press photographers. Since 1973, Multiblitz has been managed by visionary engineer and CEO Hans-Gerd Wulms and has grown to become one of the world’s leading manufacturers for premium studio lighting and photography lighting equipment. Under Wulms, Multiblitz forever changed the studio lighting world when it introduced the industry’s first compact and portable studio light, the now legendary Mini-Studio 202 in 1976. Since then, Wulms and Multiblitz are accountable for many inventions and products in photography lighting that were well ahead of their time including the most successful Profilite and Variolite monolight strobes, and the famed Profilux (now Profilux Classic) studio light with its lightweight yet rugged design and peak performance in the 90s. Today, a broad range of Multiblitz photography lighting equipment is used by leading professional photographers around the world and all aspects of modern photography. With over 65 years of experience in developing premium lighting equipment, Multiblitz is the most experienced manufacturer for photography lighting equipment in the world. We take pride in the fact that we are the only European brand that is solely manufacturing award-winning products in Germany.\nMultiblitz USA\u003C/p\u003E\n\n\u003Cp\u003EMultiblitz USA was founded in 2010 to establish a permanent presence of the Multiblitz brand in North America. For the first time, Multiblitz products are available to consumers in the US and Canada directly from the manufacturer at the Multiblitz USA online store that was launched in 2011. The store provides North American photographers the chance to easily experience award-winning photography lighting products with the convenience of ordering directly online – just a click away! This new strategy guarantees a customer friendly pricing structure and improved service by a new team dedicated to deliver the best possible Multiblitz experience. We are approaching the US market with new 110V and multi-voltage studio lights that deliver premium quality and highest reliability. The recent success of the award winning Profilux Plus monolight system (named Best Flash System: TIPA Award 2010) and the recently introduced Profilux (Profilux ECO outside the US) shows that we are on the right track to continue the unparalleled international Multiblitz success of the past. In addition to pursue growth on a national level through online sales, we are building relationships with local photographers in the DelMarVa region. If you are interested in getting a presentation of our photography lighting products or want to schedule a full-on demo photo shoot, please get in touch with us: info@multiblitzusa.com\u003C/p\u003E\n\n\u003Cp\u003ERead more: http://multiblitzusa.com/about-us/#ixzz2UiALSUij\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0026/8813/268813v2-max-150x150.png"],
     [[225,
       75],
      "assets/images/resized/0026/8813/268813v2-max-250x250.png"],
     [[225,
       75],
      "assets/images/resized/0026/8813/268813v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Multiblitz USA",
    "address1": "P.O. Box 6708",
    "address2": "",
    "zip_code": "21285",
    "city": "Baltimore",
    "state_code": "MD",
    "country_code": "USA",
    "latitude": 39.3996185,
    "longitude": -76.6054535}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}