{"name": "MustDoToday",
 "permalink": "mustdotoday",
 "crunchbase_url": "http://www.crunchbase.com/company/mustdotoday",
 "homepage_url": "http://mustdotoday.com/",
 "blog_url": "http://mustdotoday.com/",
 "blog_feed_url": "http://mustdotoday.com/",
 "twitter_username": "mustdotoday",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "productivity-app, iphone-app, must-do-today, time-management-app",
 "alias_list": null,
 "email_address": "jeff.morris@mustdotday.com",
 "phone_number": "",
 "description": "Time Management App",
 "created_at": "Wed May 29 14:18:19 UTC 2013",
 "updated_at": "Thu May 30 23:36:57 UTC 2013",
 "overview": "\u003Cp\u003EPossibly the very 1st true time management app.\u003C/p\u003E\n\n\u003Cp\u003EMust Do Today is the world’s first app for iPhone and iPad that incorporates three powerful productivity concepts. To learn more, watch this entertaining video at http://www.MustDoToday.com/video\u003C/p\u003E\n\n\u003Cp\u003EWhat’s quite novel is the app actually comes with an embedded e-Book that explains and teaches the Must Do Today time management system and how to use the app with it. \u003C/p\u003E\n\n\u003Cp\u003EThe most important principle in the system is Parkinson’s Law, that states: “Work expands so as to fill the time available for its completion.”  In other words, the more time you give yourself to do a task, the more time that particular task will take.\u003C/p\u003E\n\n\u003Cp\u003EWhen you set up a new “Must Do” task in the app, it asks you to set a time goal for its completion and then by touching the timer, it tracks and records your actual time so you know exactly where your time has gone.  On the main Must Do Today screen you can view your day’s productivity stats at a glance. Do you have eight hours of work slated for the day? The app shows you how many hours you’ve worked and percentage of completion. Clearly, you don’t want to be at 30% completion near the end of the workday.  This performance tracking instantly lets you see what you’ve accomplished.\u003C/p\u003E\n\n\u003Cp\u003ESecond, the app teaches you the Rule of 5. Each morning you are asked to create a to-do list with no more than 5 tasks that you absolutely must do before the end of the workday. This is designed to keep you focused on what really matters. In fact, productivity drops when you try to work from an “open” to-do list that has a multitude of to-dos from your busy work and personal life. And, if you happen to finish the first 5 tasks and still have time, the app prompts you to add a few more tasks to complete during the day. \u003C/p\u003E\n\n\u003Cp\u003EThird, the app stresses the need for prioritization and automatically ranks your Must Dos according to what is most important at the top. This time management method is attributed to consultant Ivy Lee and has been cited as the most profitable advice received by Charles M. Schwab, American steel magnate. Schwab is said to have paid a $25,000 bonus for such simple, but effective advice. The app automatically renumbers the Must Do list as each task is completed. You can also move the Must Dos up or down on the list with your finger to change priority as needed. Moreover, if any Must Do remains unfinished, it can be moved to become the #1 to do for the next day. \u003C/p\u003E\n\n\u003Cp\u003EThe navigation menu at the bottom provides an intuitive user interface. You can also maintain a master Task List that inventories every task you need to do with a robust sort feature, showing tasks alphabetically, work vs. personal, by due date or the level of priority. The screen also has a handy alphabetical index, like the IOS Contacts app, for speedy access to any task on the list.\u003C/p\u003E\n\n\u003Cp\u003EMust Do Today offers a unique and innovative features that are terrific for project management. For example, Must Do Today includes a built-in Planner that allows you to set up multiple tasks for the days ahead. Planner gives you a Day View or a Week View, together with a summary of the estimated hours needed to get that work done. No more filling the plate with more than you can handle; you can structure your day or week to fit in the tasks you most need to do. Importantly, the app also provides the convenience of syncing tasks with iCal so that critical to-dos can be scheduled in between meetings and other commitments.\u003C/p\u003E\n\n\u003Cp\u003EBest of all, the app has a fairly unique delegation tracker that lets you keep a separate list of all tasks that have assigned to others for completion.  The Delegated Task List shows when those delegated tasks are due and has an auto-email feature so that you can easily follow up with the person who has responsibility for completion of that task. Delegated tasks are also sorted by due dates, so you can immediately recall what delegated tasks soon need to be returned.\u003C/p\u003E\n\n\u003Cp\u003EAnother interesting productivity feature of the app is the data and reporting functions. Must Do Today emails a back up of all task details through a .csv file, readable by Excel and other spreadsheet programs. For those who need to account for their time, the app also exports a .csv file of all completed tasks, estimated time, recorded time and a description of work completed. A sort can be carried out in Excel by customer number or task name.\u003C/p\u003E\n\n\u003Cp\u003EStart keeping track of your Must Dos and find out how easy it is to achieve your goals! Stop missing important deadlines and start delivering cost efficient services. View instant reports of your performance and get on track to maximize your productivity today with this one simple app! For more information on Must Do Today visit www.mustdotoday.com.  Free promo codes are available on request and subject to availability. Contact Jeff Morris at jeff.morris@mustdotoday.com for further assistance.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0026/8681/268681v2-max-150x150.png"],
     [[240,
       240],
      "assets/images/resized/0026/8681/268681v2-max-250x250.png"],
     [[240,
       240],
      "assets/images/resized/0026/8681/268681v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Jeff",
      "last_name": "Morris",
      "permalink": "jeff-morris",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}