{"name": "muvee Technologies",
 "permalink": "muvee",
 "crunchbase_url": "http://www.crunchbase.com/company/muvee",
 "homepage_url": "http://muvee.com",
 "blog_url": "http://blog.muvee.com/",
 "blog_feed_url": "http://blog.muvee.com/feed/",
 "twitter_username": "muvee",
 "category_code": "software",
 "number_of_employees": 55,
 "founded_year": 2002,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "contact@muvee.com",
 "phone_number": "",
 "description": "",
 "created_at": "Wed May 07 21:31:32 UTC 2008",
 "updated_at": "Mon May 06 10:13:01 UTC 2013",
 "overview": "\u003Cp\u003E\u003Ca href=\"http://www.muvee.com/en/\" title=\"Muvee\" rel=\"nofollow\"\u003EMuvee\u003C/a\u003E provides consumer software for creating home movies and slide shows. muvee develops consumer video editing software for Windows, Mac and Android. muvee\u0026#8217;s global customers include LG, HTC, HP, Dell, Olympus and Nikon. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[95,
       60],
      "assets/images/resized/0001/8143/18143v1-max-150x150.png"],
     [[95,
       60],
      "assets/images/resized/0001/8143/18143v1-max-250x250.png"],
     [[95,
       60],
      "assets/images/resized/0001/8143/18143v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "muvee autoProducer",
    "permalink": "muvee-autoproducer",
    "image": null},
   {"name": "muveeNow",
    "permalink": "muveenow",
    "image": null},
   {"name": "muveeShow",
    "permalink": "muveeshow",
    "image": null},
   {"name": "muvee autoProducer unPlugged",
    "permalink": "muvee-autoproducer-unplugged",
    "image": null},
   {"name": "muvee Reveal",
    "permalink": "muvee-reveal-2",
    "image": null},
   {"name": "shwup",
    "permalink": "shwup",
    "image": null},
   {"name": "muvee Pixie",
    "permalink": "muvee-pixie",
    "image": null},
   {"name": "muvee Reveal Express",
    "permalink": "muvee-reveal-express",
    "image": null},
   {"name": "muvee Turbo Video Cutter",
    "permalink": "muvee-turbo-video-cutter",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Pete",
      "last_name": "Kellock",
      "permalink": "pete-kellock",
      "image":
       {"available_sizes":
         [[[150,
            69],
           "assets/images/resized/0025/9170/259170v1-max-150x150.png"],
          [[250,
            116],
           "assets/images/resized/0025/9170/259170v1-max-250x250.png"],
          [[450,
            209],
           "assets/images/resized/0025/9170/259170v1-max-450x450.png"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "Chief Executive Officer",
    "person":
     {"first_name": "Terence",
      "last_name": "Swee",
      "permalink": "terence-swee",
      "image":
       {"available_sizes":
         [[[150,
            72],
           "assets/images/resized/0025/9166/259166v1-max-150x150.png"],
          [[250,
            120],
           "assets/images/resized/0025/9166/259166v1-max-250x250.png"],
          [[450,
            217],
           "assets/images/resized/0025/9166/259166v1-max-450x450.png"]],
        "attribution": ""}}}],
 "competitions":
  [{"competitor":
     {"name": "Animoto",
      "permalink": "animoto",
      "image":
       {"available_sizes":
         [[[150,
            45],
           "assets/images/resized/0000/0493/493v15-max-150x150.png"],
          [[250,
            75],
           "assets/images/resized/0000/0493/493v15-max-250x250.png"],
          [[450,
            135],
           "assets/images/resized/0000/0493/493v15-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "Slide",
      "permalink": "slide",
      "image":
       {"available_sizes":
         [[[108,
            40],
           "assets/images/resized/0004/5997/45997v1-max-150x150.png"],
          [[108,
            40],
           "assets/images/resized/0004/5997/45997v1-max-250x250.png"],
          [[108,
            40],
           "assets/images/resized/0004/5997/45997v1-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "71 Ayer Rajah Crescent",
    "address2": "#06-23",
    "zip_code": "139951",
    "city": "Singapore",
    "state_code": null,
    "country_code": "SGP",
    "latitude": 1.2967695,
    "longitude": 103.7869138}],
 "milestones":
  [{"description": "muvee Launches New Video Software Tools ",
    "stoned_year": 2008,
    "stoned_month": 6,
    "stoned_day": 11,
    "source_url": "http://www.topix.com/content/prweb/2008/06/muvee-launches-new-video-software-tools-to-bring-home-movies-to-the-masses",
    "source_text": "- muvee, the leader in automatic video editing software and services, today announced two new additions to its product line-up giving users advanced tools to turn their photos and videos into professional looking home movies. muvee Reveal is the latest PC version of muvee's automatic video editing software, which allows people to edit their photos and video and set them to music in a matter of seconds with just the click of a mouse button. shwup is a totally new concept in collaborative editing technology allowing users to create, edit and share content online with select friends and family members. The site allows upload and download directly to and from muvee Reveal and can also be used independently to upload photos and video to make muvees in a completely online environment. \r\n\r\n'Research has shown that only 14 percent of US adults have ever shared a photo by uploading to a sharing site, yet we know people create home movies because they want to share,' said Terence Swee, co-founder and CEO of muvee. 'These two new products give people the tools they need to quickly and easily turn their hours of video and hundreds of photos into an emotionally engaging video and then effortlessly share these videos with their private network.' \r\n\r\nResearch highlights that consumers waste content they create\r\nResearch conducted by muvee showed that while nearly everybody takes video on their mobile phone or digital camera, more than 80 percent never do anything with it. Consumers simply save it to their PC or leave it on their device. Nearly two-thirds don't know what they can do with the content they create and more than 80 percent never upload their video to private or public sharing sites on the Internet. Filmed interviews with some of these consumers can be viewed at www.muvee.com/en/campaigns/shwup-reveal/.\r\n\r\nIt's all about the editing:\r\nmuvee Reveal, the successor product to the award-winning muvee autoProducer, represents the next generation of automatic video editing. With muvee's style-based and music-driven Artistic Intelligence, a few clicks allows users to simply choose from the eight editing styles and add their own music track, to instantly create a movie or 'muvee'. muvee Reveal also sports a powerful new underlying video rendering architecture, which enables users to preview their project immediately in full-screen HD quality, full-framerate, complete with a new set of 3D effects and transitions specially created for their media. The user interface of the product was designed around a single user experience from creation to sharing; a result of hundreds of hours of usability tests and discussions with users.\r\n\r\nVideos mean nothing if they aren't shared:\r\nshwup is a natural extension of muvee's easy-to-use desktop experience, providing users with a free platform to easily aggregate and share their precious memories and collaboratively edit them with their friends and family. Users can create albums of events and invite other participants to come and privately view the content without having to sign up. Friends and family can also add their own content to the same album, which shwup's engine - featuring the same patented technology as muvee Reveal - then automatically transforms into one collaborative 'muvee' of an event. Users can also choose to make 'muvees' on their own with one of the more than twenty styles featured on shwup. In three simple steps, shwup allows users to pool together media in different formats, from multiple cameras present at the event, while still allowing individuals to create their own versions of that combined album, expressing their own personal style.\r\n\r\nmuvee has been developing automatic video editing technology since 2001 allowing people to create and share professional-quality instant home movies out of unedited video, photos and music. muvee licenses consumer software products for a range of platforms and devices including PCs, digital still cameras, camera cell phones , photo kiosks and social media sites. It has global agreements with consumer electronics giants including HP, Dell, Nokia LG, Olympus and Nikon. \r\n\r\nmuvee Reveal is available today at www.muvee.com and shwup is now open to all at www.shwup.com. \r\n\r\nAbout muvee:\r\nmuvee's software and services feature patented technology that lets people create and share professional-quality instant home movies out of unedited video, photos and music. muvee develops consumer products for a range of platforms and devices including PCs, the online space (shwup), digital cameras, camera-equipped mobile phones and photo kiosks. muvee's global customers include HP, Dell, Nokia, LG, Olympus, Nikon and Creative Technology. Visit www.muvee.com and www.shwup.com for more information.",
    "source_description": "muvee Launches New Video Software Tools to Bring Home Movies to the Masses ",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "muvee Technologies",
      "permalink": "muvee"}},
   {"description": "muvee and Cyworld Announce Collaboration and New Service",
    "stoned_year": 2008,
    "stoned_month": 7,
    "stoned_day": 18,
    "source_url": "http://www.socialmediaportal.com/PressReleases/2008/07/muvee-and-Cyworld-Announce-Collaboration-and-New-Service.aspx",
    "source_text": " Singapore, Korea, and San Francisco (PRWEB) -- muvee Technologies Pte Ltd, the pioneer and leader in automatic video editing, and Cyworld, South Korea's largest social networking site, today announced a new video editing service for Cyworld members. This new offering, which puts the power of muvee's patented technology in the hands of Cyworld's more than 20 million users, allows consumers to add music and unique styles to their videos and photos and create emotionally engaging muvees to share with their online friends and family. Cyworld users will ultimately have access to hundreds of online editing styles, which they can use with Cyworld credits called dotoris to automatically create muvees and then easily display on their mini Hompy (Home Pages).\r\n\r\n\"Years before the term 'Web 2.0' was coined in the West, Korea had already been at the forefront of what we now call social media and virtual worlds,\" said Terence Swee, CEO of muvee. \"muvee is proud to be Cyworld's chosen platform provider for a service that can both satisfy the ease of use and interactivity demands of discerning Korean internet consumers, and match the scale of Cyworld's service level requirements. This partnership is a strategic addition to our internet business, which complements global partners we have in the PC and mobile space.\"\r\n\r\nmuvee's goal is to help people to relive and share their special moments -- the planned, the unexpected, and everything in between. While Cyworld members can already share their personal media in its original form, they now have the opportunity to create something fun and new that will add an exciting twist and change the way they can express themselves.\r\n\r\nA recent study by the Organization for Economic Co-Operation and Development (OEDC) found that South Korea has the world's highest household broadband penetration. South Korea is also known to have the most advanced mobile cellular network in the world. This has helped the South Korean population to become the most advanced consumers of social networking services both online and on mobile wireless networks.\r\n\r\nThe muvee making service is available today at www.cyworld.com.\r\n\r\nAbout muvee\r\nmuvee's software and services feature patented technology that lets people create and share professional-quality instant home movies out of unedited video, digital pictures and music. muvee develops consumer products for a range of platforms and devices including PCs, digital cameras, mobile phones and photo kiosks. muvee's global customers include HP, Dell, Nokia, LG, Sony, Olympus, Nikon and Creative Technology. Visit www.muvee.com for more information. ",
    "source_description": "muvee and Cyworld Announce Collaboration and New Service",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "muvee Technologies",
      "permalink": "muvee"}},
   {"description": "Quick creation, instant upload, and a Netbook-friendly design are the highlights of the latest automatic video editing software from muvee",
    "stoned_year": 2010,
    "stoned_month": 7,
    "stoned_day": 19,
    "source_url": "http://www.muvee.com/en/news/item/209",
    "source_text": null,
    "source_description": "muvee launches muvee Pixie for the YouTube generation ",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "muvee Technologies",
      "permalink": "muvee"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}