{"name": "My Cheapest Car Insurance",
 "permalink": "my-cheapest-car-insurance",
 "crunchbase_url": "http://www.crunchbase.com/company/my-cheapest-car-insurance",
 "homepage_url": "http://www.mycheapestcarinsurance.com/",
 "blog_url": "http://www.mycheapestcarinsurance.com/articles/",
 "blog_feed_url": "http://feeds.feedburner.com/MyCheapestCarInsurance",
 "twitter_username": "MyCheapestCarIn",
 "category_code": "web",
 "number_of_employees": 4,
 "founded_year": 2009,
 "founded_month": 2,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cheap-car-insurance, cheapest-auto-insurance, cheap-insurance",
 "alias_list": null,
 "email_address": "info@mycheapestcarinsurance.com",
 "phone_number": "877-864-2513",
 "description": "Compare Cheap Car Insurance Quotes",
 "created_at": "Wed Jan 02 02:52:17 UTC 2013",
 "updated_at": "Thu Jan 03 05:14:46 UTC 2013",
 "overview": "\u003Cp\u003EMyCheapestCarInsurance.com is a website that allows you to quickly request and compare new car insurance quotes. The goal of the website is to provide a place where you can comparison shop for the best car insurance out there.\u003C/p\u003E\n\n\u003Cp\u003EOne of the things that make MyCheapestCarInsurance.com so unique is the fact that there is an area where you can learn the basics of car insurance. This area titled “Cheap Car Insurance 101” is designed to educate the consumer on the specific criteria that they need to consider when shopping for new car insurance. This area of the website can prove to be very valuable as it will arm you with the necessary knowledge to make an informed purchase decision.\u003C/p\u003E\n\n\u003Cp\u003EAn additional feature of the MyCheapestCarInsurance.com website to compare car insurance is that there is a database of articles that give real world examples of how car insurance is to work for the average consumer. The database of articles have different topics that can be researched and used to help make a decision on the insurance that needs to be purchased. Furthermore, the articles can serve as a “how to” when it comes to comparing the different benefits of each type of car insurance. By knowing what you are looking for, and how to look for it, the individual consumer will be in an ideal situation.\u003C/p\u003E\n\n\u003Cp\u003EGiving valuable information about all of the most popular car insurance companies is an additional feature of mycheapestcarinsurance.com that helps make it a valuable resource for consumers. The information regarding the insurance companies can be compared together in an effort to determine the differences between each company. MyCheapestCarInsurance.com is a third party website that has no affiliation with each of these companies. The idea of the website is to give consumers as much information as possible so that a correct purchase decision can be made at the appropriate time.\u003C/p\u003E\n\n\u003Cp\u003EThe information that you need in terms of insurance companies and quotes for policies can be in hand within a matter of minutes when using mycheapestcarinsurance.com. The process that the website uses is very simple and will allow the consumer to enter in their zip code and be returned a listing of car insurance companies that work with drivers. At that point the consumer can then request a free rate quote from each of the companies that they may want to work with. After the form is filled out it is not unusual to have a quote in hand within a matter of minutes if the information on the form was 100% accurate.\u003C/p\u003E\n\n\u003Cp\u003EMyCheapestCarInsurance.com is also well known and respected because there is absolutely no sales pressure from the website itself. You will never be persuaded or pointed towards a particular company that would benefit mycheapestcarinsurance.com in any way. Instead the consumer is allowed to compare different policies and make the decision that best fits their current situation and needs. This practice makes MyCheapestCarInsurance.com one of the car insurance comparison websites that people use when they need a pressure free way to compare coverage’s.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0022/7600/227600v2-max-150x150.png"],
     [[250,
       44],
      "assets/images/resized/0022/7600/227600v2-max-250x250.png"],
     [[395,
       70],
      "assets/images/resized/0022/7600/227600v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}