{"name": "My CLick Job",
 "permalink": "my-click-job",
 "crunchbase_url": "http://www.crunchbase.com/company/my-click-job",
 "homepage_url": "http://PartTimeOnWork.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 8,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "data-entry-services",
 "alias_list": null,
 "email_address": "Mahesh@myclickjob.com",
 "phone_number": "9904970812",
 "description": "Free Submit Resume Here",
 "created_at": "Thu Aug 19 14:38:21 UTC 2010",
 "updated_at": "Thu Aug 19 19:24:14 UTC 2010",
 "overview": "\u003Cp\u003ESome of the things that you should research and advance would be the possible interview questions that you are going to come up against for that particular position. These can often be found on the Internet, and knowing them ahead of time can really assist you in being able to answer them intelligently. You should also make sure that you research the company carefully, so that whenever you are asked specific questions about the company you are able to answer them without hesitation. Finally, one of the more important and often overlooked job interview techniques is to make sure that you understand when and where the interview is going to take place. Being late for an interview is not a good way to start off a potentially new job.\u003C/p\u003E\n\n\u003Cp\u003EJob searching is a full-time job. Putting together your resume and modifying it for every job you apply to, keeping your records organized, searching online job boards and company websites, networking, and on and on. Unfortunately in a recession, you have to work overtime. There is no room for error or downtime as the competition is fierce.\u003C/p\u003E\n\n\u003Cp\u003EHow are you differentiating yourself from your competition? Below are a few tips to get started:\u003C/p\u003E\n\n\u003Cp\u003EOpen www.MyClickJob.com \u0026amp; Upload your resume.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}