{"name": "My Diabetes Home",
 "permalink": "my-diabetes-home",
 "crunchbase_url": "http://www.crunchbase.com/company/my-diabetes-home",
 "homepage_url": "http://mydiabeteshome.com/",
 "blog_url": "http://mydiabeteshome.wordpress.com/",
 "blog_feed_url": "http://mydiabeteshome.wordpress.com/feed/",
 "twitter_username": "MyDiabetesHome",
 "category_code": "biotech",
 "number_of_employees": 20,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "health, diabetes, health-platform, medication, medications, prescriptions",
 "alias_list": null,
 "email_address": "admin@mydiabeteshome.com",
 "phone_number": "",
 "description": "Defeating Diabetes with Technology",
 "created_at": "Tue Jun 05 20:41:16 UTC 2012",
 "updated_at": "Sat Jun 09 17:21:53 UTC 2012",
 "overview": "\u003Cp\u003EWe are proud to launch My Diabetes Home \u0026#8211; your one-stop place for managing your diabetes. Join us now and be part of the community! It’s here that you’ll find ideas and information to help you make the best decisions for your health, including:\u003C/p\u003E\n\n\u003Cp\u003EMedSimple \u0026#8211; the most comprehensive application for managing diabetes\nArticles on nutrition, fitness, blood glucose management and more\nRecipes for diabetic-friendly main dishes, snacks and more\nDiabetes news that matters to you\u003C/p\u003E\n\n\u003Cp\u003EMedSImple is a FREE medication management tool. For even greater convenience, you can access the tool on your mobile phone (iPone and Android), iPad and iPod Touch by downloading the FREE app in the iTunes App Store and the Andoid Marketplace.\u003C/p\u003E\n\n\u003Cp\u003EMedSimple makes tracking your medications simple and convenient. You’ll have instant access to what meds you’re taking, the dosage and how and when to take them. You can also set up reminders for taking your medicines and getting them refilled. Above all, you will be able to know about all cost saving options (low cost medicines,  money-saving coupons and prescription assistance programs) for your specific medicines.\u003C/p\u003E\n\n\u003Cp\u003EThe Authority Behind My Diabetes Home\nMy Diabetes Home was created by Anuj Bhargava, MD, MBA,CDE, FACP, FACE, an endocrinologist and founder of the Iowa Diabetes and Endocrinology Research Center (www.iderc.org).\u003C/p\u003E\n\n\u003Cp\u003EDr. Bhargava has devoted his career to defeating diabetes and is passionate about helping people with diabetes live better lives. This passion developed years ago, after Dr. Bhargava watched his favorite uncle die from diabetes complications. “I was 14 and his death had a major impact on me,” said Dr. Bhargava. “I also saw how hard it was for his family, especially his children. He was only in his 40s when he died of a heart attack, because he did not take care of his diabetes or his health.” \u003C/p\u003E\n\n\u003Cp\u003EMy Diabetes Home is part of Dr. Bhargava’s ongoing mission to improve the health and lives of people affected by diabetes. In addition to Dr. Bhargava, My Diabetes Home is staffed by a team of other health care professionals, including registered dietitians, pharmacists and certified diabetes educators. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       142],
      "assets/images/resized/0019/4073/194073v2-max-150x150.jpg"],
     [[250,
       237],
      "assets/images/resized/0019/4073/194073v2-max-250x250.jpg"],
     [[450,
       426],
      "assets/images/resized/0019/4073/194073v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "50314",
    "city": "Des Moines",
    "state_code": "IA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}