{"name": "My Focusbook",
 "permalink": "my-focusbook",
 "crunchbase_url": "http://www.crunchbase.com/company/my-focusbook",
 "homepage_url": "http://myfocusbook.com.au",
 "blog_url": "http://blog.myfocusbook.com.au",
 "blog_feed_url": "http://blog.myfocusbook.com.au/rss",
 "twitter_username": "myfocusbookapp",
 "category_code": "software",
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "report-writing, teachers, school, education",
 "alias_list": null,
 "email_address": "hello@blog.myfocusbook.com.au",
 "phone_number": "",
 "description": "Student note taking for teachers",
 "created_at": "Tue Oct 09 00:23:32 UTC 2012",
 "updated_at": "Thu Oct 18 00:05:07 UTC 2012",
 "overview": "\u003Cp\u003EMy Focusbook is a web-based application revolutionising report writing for teachers. My Focusbook has been purposely built for teachers to facilitate the report writing process by allowing teachers to create and maintain progress reports on their students throughout the year. Say goodbye to the pain of writing end of term, semester or year reports, and say hello a smooth and seamless report writing process.\u003C/p\u003E\n\n\u003Cp\u003EMy Focusbook gives teachers peace of mind. No longer will student progress be recorded in a disregarded and often misplaced notebook or USB. With My Focusbook, notes can be saved securely online for easy access from the classroom, the home, or during a spare minute at the café.\u003C/p\u003E\n\n\u003Cp\u003EPerfect for primary and secondary school teachers alike, My Focusbook has many features to suit any school. For instance, My Focusbook complies with the new ‘focus’ and ‘observation’ model for primary school report writing, meaning no stress in introducing the new system. Secondary school teachers on the other hand benefit from the note-sharing options, making it easy to collaborate with a substitute or other teacher of the same subject.\u003C/p\u003E\n\n\u003Cp\u003EOur mission statement.\nThe Team at My Focusbook believes teachers are fundamental members of our society, particularly in their capacity as role models, educators and life coaches to our children. In this way, My Focusbook was founded to aid teachers in providing accurate and constructive feedback, to ensure our children receive the utmost benefit from student reports and parent-teacher interviews.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/4779/214779v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0021/4779/214779v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0021/4779/214779v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}