{"name": "My Tasker",
 "permalink": "my-tasker",
 "crunchbase_url": "http://www.crunchbase.com/company/my-tasker",
 "homepage_url": "http://www.mytasker.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mytasker",
 "category_code": "consulting",
 "number_of_employees": 16,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "virtual-assistant, remote-assistant, virtual-administrative-assistant",
 "alias_list": null,
 "email_address": "info@mytasker.com",
 "phone_number": "(212) 913-9208",
 "description": "Virtual desk for all your tasks!",
 "created_at": "Tue Aug 14 18:20:10 UTC 2012",
 "updated_at": "Fri Aug 17 14:58:33 UTC 2012",
 "overview": "\u003Cp\u003EIn today\u0026#8217;s world, sometimes we wonder how life would be if we have more than 24 hours in a day. We will have extra time to focus in our businesses, personal life and many more which we always wanted to do but cannot because of time. This is where My Tasker steps in by providing extra hours and extra hands in the lives of the busy people around the world.\u003C/p\u003E\n\n\u003Cp\u003EBelow are few details on what we do in MyTasker.com.\u003C/p\u003E\n\n\u003Cp\u003EMy Tasker is a Virtual Assistance Service provider. We provide support to Small Business Owners, Entrepreneurs, Busy Professionals who hardly get time to perform their Lifestyle as well as business related tasks which can be done over the phone, internet or fax.  My Tasker provides support 24/7 and is eying to reach every busy individual to make their lives easy.\u003C/p\u003E\n\n\u003Cp\u003EKeeping our subscriber requirements in mind, we have divided our plans into two categories, Lifestyle Assistance and Professional Assistance.\u003C/p\u003E\n\n\u003Cp\u003ELifestyle Assistance is task based subscription offering customers to manage their day to day lifestyle related task such as Restaurant reservations, Hotel bookings, booking Flight Tickets, booking Rental Cars, Ordering Flowers, Finding Maid Services, Scheduling appointment with Doctors, Spa or Salon, etc. and many more. Our Lifestyle Assistance Plan offers 30 Tasks in 30 Days for USD 39.00. We also offer 3 day FREE trial to evaluate our services with 5 lifestyle related tasks.\u003C/p\u003E\n\n\u003Cp\u003EProfessional Assistance is an hourly based subscription where we assist our customers by performing both Lifestyle as well as business related tasks such as Document Editing, Social Media Account Monitoring \u0026amp; Management, Call Answering Service, Email Monitoring \u0026amp; Support, Online Calendar Management, Online QuickBooks/Salesforce Entry, PowerPoint Presentations, Product Listings and Management (For eBay, Amazon, etc.), Data entry, Word Processing, Designing works, and any other Administrative Office Works. Our Professional Assistance services offer plans starting from USD 12/hour to USD 5/hour depending upon the chosen plan. We offer 3 day FREE trial which includes 3 hours of support with business related tasks.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       95],
      "assets/images/resized/0020/6068/206068v2-max-150x150.jpg"],
     [[250,
       158],
      "assets/images/resized/0020/6068/206068v2-max-250x250.jpg"],
     [[450,
       285],
      "assets/images/resized/0020/6068/206068v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}