{"name": "MyCreditVault",
 "permalink": "mycreditvault-2",
 "crunchbase_url": "http://www.crunchbase.com/company/mycreditvault-2",
 "homepage_url": "http://www.MyCreditVault.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "MyCreditVault",
 "category_code": "security",
 "number_of_employees": 0,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-authentication-retail-transaction-credit-card-processing-id-theft-prevention-solution-credit-monitoring-credit-bureaus-authentication-credit-file",
 "alias_list": null,
 "email_address": "partners@mycreditvault.com",
 "phone_number": "",
 "description": "Highlights ID Theft Prevention Solution",
 "created_at": "Sat Jul 28 17:01:09 UTC 2012",
 "updated_at": "Tue Jul 31 04:30:49 UTC 2012",
 "overview": "\u003Cp\u003EMyCreditVault provides a blueprint for a future of secure financial transactions. Our Mission is to end Identity Theft, as we know it, by giving consumers control.\u003C/p\u003E\n\n\u003Cp\u003ETurn Your Money ON/OFF In Seconds!\nWith MyCreditVault, if thieves obtain your Social Security, bank account, credit or debit card numbers, unauthorized transactions will be denied approval.\u003C/p\u003E\n\n\u003Cp\u003EFinally, A Solution To End Identity Theft!\nCredit monitoring only tells you after theft may already occurred. Fraud alerts work better, but are temporary and can still allow fraud to slip thru. Credit freezes are effective but are difficult to set up and extremely inconvenient as they can take up to three days to turn on and off. MyCreditVault will work like a \u0026#8220;Real-Time Credit Freeze\u0026#8221; giving you \u0026#8216;lock \u0026amp; key\u0026#8217; control over your credit files, credit/debit cards \u0026amp; bank account transactions.\u003C/p\u003E\n\n\u003Cp\u003EImportant Questions About Your Credit\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EIs your good credit as valuable as your cash or is it more valuable?\u003C/li\u003E\n\u003Cli\u003EIf access to your cash requires a pin, why doesn\u0026#8217;t your credit?\u003C/li\u003E\n\u003Cli\u003EWhat is stopping the protection of your credit as your cash?\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EIdentity Theft May Soon Be History (with your help)!\nAn estimated 25 million Americans pay an average of $12.50 per month, for credit monitoring services. MyCreditVault believes many more would pay this monthly fee, for the peace in knowing their cash and credit accounts were more secure. Providing an improved service should increase adoption and even allow for increased fees. However, 100% of Americans could be covered for only $1/month at the same cost it now takes to pay for credit monitoring services for 25 million Americans. Albeit, for MyCreditVault to be fully embraced by banks, credit bureaus and credit monitoring service providers, the opportunity for increased revenues must exist.\u003C/p\u003E\n\n\u003Cp\u003ESo how do we make MyCreditVault a reality? If those paying $12.50/month for credit monitoring services doubled to near 50 million Americans, or near 20% of all Americans, this would add about $3.75 billion in revenues. Javelin Research estimated fraud cost consumers and businesses $54 billion in 2009. CNN says that the healthcare industry alone is bilked of $100 billion/year, half being paid by Medicare with our tax dollars. In total, the estimated cost of ID theft to America is near $150 billion/year. If banks, credit bureaus and credit monitoring service providers were paid 50% of savings in the reduction of the financial losses due to Identity Theft and losses were reduced by 1/3, an additional $8.3 billion in revenues would be added. In total, new revenues for those protecting our financial accounts could rise $12 billion/year, thus replacing the estimated $6.6 billion/year in revenues banks lost from debit card processing, post-Durbin amendment, and add $5 billion, for those providing ID Theft prevention services. Plus America, would save about $33 billion/year and perhaps billions of hours a year!\u003C/p\u003E\n\n\u003Cp\u003EEven if this system cost $100 million to build, it makes the estimated $50 billion/year in healthcare and tax return fraud, paid for with our tax dollars, pale in comparison. If at all possible, tax dollars should not be used for development of this system. Banks and credit bureaus, the TRUSTED SERVICE PROVIDERS and GUARDIANS OF OUR CASH \u0026amp; CREDIT, should step up now to strongly support MyCreditVault!\u003C/p\u003E\n\n\u003Cp\u003EWe need a credible and courageous media source to tell our story!\nWORKING TOGETHER, WE CAN END IDENTITY THEFT!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder and CEO",
    "person":
     {"first_name": "Randy",
      "last_name": "Smith",
      "permalink": "randy-smith",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Worldwide Headquarters",
    "address1": "",
    "address2": "",
    "zip_code": "92656",
    "city": "Aliso Viejo",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        84],
       "assets/images/resized/0020/3320/203320v2-max-150x150.jpg"],
      [[250,
        140],
       "assets/images/resized/0020/3320/203320v2-max-250x250.jpg"],
      [[450,
        253],
       "assets/images/resized/0020/3320/203320v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}