{"name": "mydeliverychoices.com",
 "permalink": "mydeliverychoices-com",
 "crunchbase_url": "http://www.crunchbase.com/company/mydeliverychoices-com",
 "homepage_url": "http://www.mydeliverychoices.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "delivery, parcels, packages, address, electronic-documents, data, environment, advertising, marketing",
 "alias_list": null,
 "email_address": "info@mydeliverychoices.com",
 "phone_number": "1-888-568-6691",
 "description": "delivery management",
 "created_at": "Sat Oct 23 21:44:30 UTC 2010",
 "updated_at": "Mon Oct 25 00:45:44 UTC 2010",
 "overview": "\u003Cp\u003EStarting in early 2011 an entirely new approach to the delivery of documents, marketing messages, data, and packages in Canada.\u003C/p\u003E\n\n\u003Cp\u003EUntil now both businesses and consumers have been faced with different and often incompatible solutions when it came to exchanging information and goods. One of the reasons for this is the wide divergence of delivery methods that have evolved over the last 15 years - email, web sites, point-to-point systems, delivery depots, etc. The solutions currently available often appear to better serve the priorities of the delivery company than they do either the Sender or the Recipient.\u003C/p\u003E\n\n\u003Cp\u003EWith all of the appropriate security and privacy concerns in place, in a spam-free environment, consumers and businesses will be able to manage how, when, and where they receive their electronic and physical deliveries utilizing their own unique personal and portable delivery address. Utilizing each Recipient\u0026#8217;s unique and universal address, Senders will be able to ensure that they get their electronic or physical delivery to their customer correctly, the first time, every time! Both businesses and consumers will also be able to take advantage of optional unique data offerings for both cost-saving and analytical purposes.\u003C/p\u003E\n\n\u003Cp\u003EAll of this will be achieved using the reference point that everyone has, and everyone is comfortable with, their mailing address. Utilizing unique technology a corresponding electronic mailbox will be established for every street and delivery address in Canada. These electronic mailboxes will be the heart of the system that allows Senders and Recipients to reliably, securely, and economically communicate with each other according to the delivery choices of the Recipient, be that electronic documents, data, or paper-based mail.\u003C/p\u003E\n\n\u003Cp\u003EFull details are available on our web site.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0010/6985/106985v2-max-150x150.png"],
     [[250,
       63],
      "assets/images/resized/0010/6985/106985v2-max-250x250.png"],
     [[450,
       113],
      "assets/images/resized/0010/6985/106985v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "55 Browns Line",
    "address2": "",
    "zip_code": "M8W 3S2",
    "city": "Toronto",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}