{"name": "myKFIT",
 "permalink": "mykfit",
 "crunchbase_url": "http://www.crunchbase.com/company/mykfit",
 "homepage_url": "http://www.mykfit.com",
 "blog_url": "http://www.mykfit.com/blog",
 "blog_feed_url": "",
 "twitter_username": "mykfit",
 "category_code": "education",
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fitness, health, sports, tracking, food, nutrition, exercise",
 "alias_list": null,
 "email_address": "info@thekgroup.biz",
 "phone_number": "",
 "description": "Clean Fitness and Exercise",
 "created_at": "Sun Nov 25 12:29:58 UTC 2012",
 "updated_at": "Wed Dec 12 07:55:19 UTC 2012",
 "overview": "\u003Cp\u003EmyKFIT believes in the redefinition of the word “Athlete”. Society tends to believe that Athletes are born with the natural ability to perform physical exercise. myKFIT clearly defines that all persons possess the natural ability necessary for physical exercise or sports.\u003C/p\u003E\n\n\u003Cp\u003EAthletes are not simply born, myKFIT believes they are made. There are no restrictions to age, weight, gender, religion or origin. The beauty of sports is reflected by each individual. Nelson Mandela said that “Sports has the power to change the world”.\u003C/p\u003E\n\n\u003Cp\u003EmyKFIT wants to change you. They want to change the world and have set out to make a global difference by making a significant contribution to your health and well being.\u003C/p\u003E\n\n\u003Cp\u003EmyKFit.com was built from the ground up for them and for you. They believe that a healthy diet in combination with an empowered and active athletic lifestyle are critical and vital for each one of us to live a long, fulfilling and power driven life. myKFIT wants to inspire you to pursue the best within you.\u003C/p\u003E\n\n\u003Cp\u003EThey believe that community and accountability tied together with education and commitment in all the things we do on a daily basis reflect our achievements. The platform offers guidance, engages in conversation, creates community and informs through relevant information. All this is supplemented with their easy to use online tools to assist you in the process.\u003C/p\u003E\n\n\u003Cp\u003EOriginally, KFit was a fitness and nutrition routine, no different then what was on the market, yet targeted to the everyday man, developed by Hermann Kratochwill using a combination of sports and exercises to enable himself and his brother to get in shape during an off-season. KFIT caught on and was then used through personal fitness coaching, at sports teams and clubs and fitness gyms, however KFIT is not just an exercise routine. Its a mindset. Its a choice. Its a way of life.\u003C/p\u003E\n\n\u003Cp\u003EmyKFit engages with you through their online community. It is easy to slack off and procrastinate, but they want to create accountability for you. They want to challenge you in your daily choices and ultimately have you change your mindset.\u003C/p\u003E\n\n\u003Cp\u003EThey provide the resources and applications along side their tools to make it easier for you to visualize your daily goals and long term achievements. Through their food and fitness trackers you can leverage from a large food and fitness database to inform and utilize yourself to make smart choices. The site continuously grows with information, from recipes to meal options. myKFIT believes that you are what you eat and you shouldn’t need to sacrifice what you love, however it is their aim to make you realize how to enjoy all foods and diets through living healthy.\u003C/p\u003E\n\n\u003Cp\u003EChanging your mindset and lifestyle is YOUR choice. myKFIT wants to help you.\u003C/p\u003E\n\n\u003Cp\u003EThey don’t claim to be Gurus, but offer expert advice through certified professionals in the diet, nutrition, wellness and lifestyle categories.\u003C/p\u003E\n\n\u003Cp\u003EThe content you will find on myKFIT.com is engaging and solution oriented through practical advice, blogs, videos, forums, chats, personal and group sessions, Q\u0026amp;A series, etc.\u003C/p\u003E\n\n\u003Cp\u003EHealth and Fitness is continuously evolving and there are numerous websites and places that preach on living healthy and what the next fitness trend will be. That is not who they are. myKFIT believes in creating an environment where you are encouraged to decide on what works for you.\u003C/p\u003E\n\n\u003Cp\u003EThe myKFIT community is engaging, connecting, informing and inspiring.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[130,
       150],
      "assets/images/resized/0022/2065/222065v2-max-150x150.jpg"],
     [[218,
       250],
      "assets/images/resized/0022/2065/222065v2-max-250x250.jpg"],
     [[336,
       385],
      "assets/images/resized/0022/2065/222065v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Hermann",
      "last_name": "Kratochwill",
      "permalink": "hermann-kratochwill",
      "image":
       {"available_sizes":
         [[[99,
            150],
           "assets/images/resized/0022/2444/222444v2-max-150x150.jpg"],
          [[166,
            250],
           "assets/images/resized/0022/2444/222444v2-max-250x250.jpg"],
          [[299,
            450],
           "assets/images/resized/0022/2444/222444v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Barcelona",
    "state_code": null,
    "country_code": "ESP",
    "latitude": 41.3850639,
    "longitude": 2.1734035}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe src=\"http://player.vimeo.com/video/47261354?badge=0\" width=\"430\" height=\"270\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen\u003E\u003C/iframe\u003E ",
    "description": "\u003Cp\u003EmyKFIT Introduction\u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[150,
        109],
       "assets/images/resized/0022/2063/222063v2-max-150x150.png"],
      [[250,
        182],
       "assets/images/resized/0022/2063/222063v2-max-250x250.png"],
      [[450,
        328],
       "assets/images/resized/0022/2063/222063v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        110],
       "assets/images/resized/0022/2064/222064v2-max-150x150.png"],
      [[250,
        183],
       "assets/images/resized/0022/2064/222064v2-max-250x250.png"],
      [[450,
        330],
       "assets/images/resized/0022/2064/222064v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}