{"name": "mykiddistore",
 "permalink": "mykiddistore",
 "crunchbase_url": "http://www.crunchbase.com/company/mykiddistore",
 "homepage_url": "http://www.mykiddistore.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mykiddistore",
 "category_code": "ecommerce",
 "number_of_employees": 12,
 "founded_year": 2010,
 "founded_month": 5,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "baby, baby-shop, online-baby-shop, baby-shops, maternity, baby-gifts",
 "alias_list": null,
 "email_address": "customerservice@mykiddistore.com",
 "phone_number": "0800 678 5231",
 "description": "Baby Shop",
 "created_at": "Tue Oct 02 21:36:38 UTC 2012",
 "updated_at": "Mon Oct 15 19:21:23 UTC 2012",
 "overview": "\u003Cp\u003EWelcome to mykiddistore,\u003C/p\u003E\n\n\u003Cp\u003EThe online baby shop and nursery store for maternity, nursery, feeding, car seats, prams, safety, bathing, clothing, toys and gifts and much more. mykiddistore’s buying team (most of which are parents themselves) have been working extremely hard over the years to bring you only the very latest and best baby products of which we are now proud to have over 2,500 – all at low prices with great savings to be made and delivered quickly to you. We specialise in brand new baby goods that can be found on the high street.\u003C/p\u003E\n\n\u003Cp\u003EWe offer free UK delivery for orders over £29.99 and also offer UK next day delivery with an hour slot to suit you. We ship worldwide. We offer free advice and helpful information whether you are a new mum or dad to be, already have children, or are looking for a thoughtful gift for a newborn / baby / toddler / child – we’re here to help. Welcome to the one-stop shop for babies, we aim to be the best baby store on the internet – feel free to let us know how we’re doing.\u003C/p\u003E\n\n\u003Cp\u003EWe have a wide range of categories at www.mykiddistore.com to cater from maternity, right up to children. Here is a quick breakdown of what’s in each category:\u003C/p\u003E\n\n\u003Cp\u003EMaternity: We Offer Pregnancy Essentials, Dopplers, Support Belts, Pregnancy And Nursing Pillows, Maternity Clothes, More\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EBathing: Bath Toys, Baby Baths, Changing Mats, Nappy Changing Accessories, Baby Toiletries, Baby Towels And Much More..\u003C/p\u003E\n\n\u003Cp\u003ENursery: Baby / Toddler / Child Bedding Including Pillows, Mattresses And Quilts, Changing Stations, Cots, Cribs, Cotbeds, Cot Accessories, Travel Cots, Nightlights And Mobiles, Gro Bags, Moses Baskets And Stands, Nursery Accessories, Nursery Furniture, Nursery Playtim, Kids Bedroom, Bedding And Bed Guards, Bedroom Furniture, Beds, Curtains And Blinds, Child Alarm Clocks, Playroom Furniture And Much More\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EPushchairs: Travel Systems, Buggy Footmuffs, Changing Bags, Pram Accessories, Pushchair Toys, Ride On Buggy Boards, Twin, Tandem And Triplet Pushchairs And Much More..\u003C/p\u003E\n\n\u003Cp\u003ECar Seats: Car Seats, Car Seat Footmuffs, Baby Carriers, Car Accessories, Travel Toys And Much More..\u003C/p\u003E\n\n\u003Cp\u003ESafety: Baby And Child Home Safety Essentials / Babyproofing / Childproofing Accessories, Baby Health, Baby Monitor, Floatation Aids, Playpens, Room Dividers, Stairgates And Safety Gates And Much More..\u003C/p\u003E\n\n\u003Cp\u003EFeeding: Baby Feeding Timers, Bibs, Bottles, Bottle Accessories, Breastfeeding, Breast Pumps, Feeding Accessories, Feeding Out And About, Highchairs And Booster Seats, Muslin, Sterilising Equipment, Weaning And Much More..\u003C/p\u003E\n\n\u003Cp\u003EClothing: Baby Shoes, Socks, Booties, Sun Protection, Swimming Accessories.\u003C/p\u003E\n\n\u003Cp\u003EToys \u0026amp; Gifts: Baby Walkers, Bouncers, Rockers And Swings, Comforters, Casting Kits, Development Toys, Hanging Toys, Infant Toys, Play Gyms, Rocking Animals, Ride Ons, Soft Musical Plush Toys, Summer And Outdoor / Garden Toys And Much More..\u003C/p\u003E\n\n\u003Cp\u003EPersonalised Gifts: Personalised Baby Gifts, Personalised Baby Blankets, Personalised Baby Bibs, Personalised Comforters, Personalised Money Boxes, Personalised Baby on Board Signs, Personalised Keepsake Boxes, Personalised Photo Album, Personalised Door plaques, Personalised Photo Frames, Personalised Baby CDs and lots more\u0026#8230;\nWe stock a wide range top brands including:\u003C/p\u003E\n\n\u003Cp\u003EAmeda, Angelcare, Baby Banz, Baby Dan, Baby Einstein, Bettacare, Brother Max, Caboodle, Clevamama, Clippasafe, D for Diamond, Dr. Browns, East Coast, Emmay, Eurobambino,The First Years, Fisher Price, Flexibath, Hippychick, Infantino, JJ Cole, Konfidence, Lamaze, Lindham, Little Bird Told Me, Prince Lionheart, Red Kite, Safety 1st, Skibz, Summer Infant, Sunshine Kids, Taf Toys, Tiny Love, Tomy, Tommee Tippee, Samsonite, Koo-di.\u003C/p\u003E\n\n\u003Cp\u003EDon’t forget to sign up to the mykiddistore newsletter to gain £5.00 off of your first order with mykiddistore, free voucher codes, news and new products, like mykiddistore on Facebook and instantly unlock your free discount voucher right now, follow mykiddistore on Twitter to win free baby products.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        128],
       "assets/images/resized/0021/3934/213934v2-max-150x150.jpg"],
      [[250,
        214],
       "assets/images/resized/0021/3934/213934v2-max-250x250.jpg"],
      [[450,
        386],
       "assets/images/resized/0021/3934/213934v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://pinterest.com/mykiddistore/",
    "title": "mykiddistore on Pintrest"},
   {"external_url": "https://www.facebook.com/Mykiddistore",
    "title": "mykiddistore on Facebook"},
   {"external_url": "https://twitter.com/#!/MyKiddiStore",
    "title": "mykiddistore on Twitter"},
   {"external_url": "https://plus.google.com/111402000682886946927/posts",
    "title": "mykiddistore on Goolge +"},
   {"external_url": "http://www.youtube.com/user/MyKiddiStore",
    "title": "mykiddistore on Youtube"}]}