{"name": "MyPaintingsGallery",
 "permalink": "mypaintingsgallery",
 "crunchbase_url": "http://www.crunchbase.com/company/mypaintingsgallery",
 "homepage_url": "http://www.mypaintingsgallery.com",
 "blog_url": "http://www.mypaintingsgallery.com/blog",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "oil-paintings, original-handmade-paintings, abstract-art-for-sale, water-color-paintings, cityscape-paintings",
 "alias_list": null,
 "email_address": "aarpeeinfotech@gmail.com",
 "phone_number": "",
 "description": "MyPaintingsGallery.com is one of the gen",
 "created_at": "Fri May 06 21:18:03 UTC 2011",
 "updated_at": "Fri May 13 13:56:07 UTC 2011",
 "overview": "\u003Cp\u003EMyPaintingsGallery.com(MPG)  is one of the genuine Indian based paintings gallery which provides all types of  paintings like  abstract,  Semi abstract, Landscapes Digital Paintings Ceramics, Figurative Paintings, Cityscape, Still Life and including sculptures etc.  MPG has  created colossal Space for art lovers and creative painters in the world. MPG is unique gallery which is created by few painters and art lovers in year 2010 and implemented on internet as an online gallery in May 2011. MPG comes in to the market with broader sense of   global awareness about original handmade paintings using variety of medium like oil, water color, Pastel, tempera etc. \u003C/p\u003E\n\n\u003Cp\u003EAll the paintings provided online by MPG is meticulously checked and selected by team of   Experts in this field so that customer could enjoy genuine   and original art works. MPG believes in providing magnificent, high-quality   Artworks to their customer so that customer could enjoy the real art while decorating   their homes, offices, restaurants with their own ideas and taste. They host almost all types of Paintings using variety of mediums.  Their   Priority   is providing   hassle-free services to the customer with safe and secure transaction. \u003C/p\u003E\n\n\u003Cp\u003EThe Main mission of this online gallery is to   provide opportunity to the talented contemporary artists to show their art work to whole world. They   always   exhibit   professional artist so that   customer could save their precious   timing   in searching beautiful   Professional   Artworks.\u003C/p\u003E\n\n\u003Cp\u003EIf   anybody   looking for 100% hand painted, museum quality paintings then MPG is of the appropriate one stop gallery  where  every  art lover  and layman could enjoy real art with great variety  and  genuinity.  More over we can say that most of the person are  in search of painting galleries  only  while time comes to decorate their  homes, offices and restaurants  etc. and  This  is the reason painting become main ingredient  while decorating any place.\u003C/p\u003E\n\n\u003Cp\u003EWhy to opt for MypaintingsGallery.com\u003C/p\u003E\n\n\u003Cp\u003EEasy Credit Cards Option\nTime Bound Delivery Guarantee\n24 Hours Customer Support\nGenuine Handmade Paintings\nOffer and Discounts all the time \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}