{"name": "Mysore Light",
 "permalink": "mysore-light",
 "crunchbase_url": "http://www.crunchbase.com/company/mysore-light",
 "homepage_url": "http://www.indiamart.com/mysorelight-luminaireworks/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mysorelight-luminaireworks@tradepassport.org",
 "phone_number": "9916281400",
 "description": "turnkey fit out \u0026 furnishing of luxury h",
 "created_at": "Thu Apr 04 12:41:30 UTC 2013",
 "updated_at": "Thu Apr 04 12:41:33 UTC 2013",
 "overview": "\u003Cp\u003EMysore Lights Interior Division was established in Bangalore in 2006 by professionals backed by decades of rich industry experience ad supported by the famous Mysore Lights Brand which is a household name in the country, specializing in manufacturing of lighting that has been in the market since 1990. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed a highly advanced and ruggedly constructed infrastructural set-up, where spread across an extensive area and well-outfitted with advanced equipment as well as machinery. To carry out effective and trouble operations, we have segregated our entire infrastructure into various departments. The machinery we have installed here is upgraded on timely basis, in order to remain in pace with the existing market developments. \u003C/p\u003E\n\n\u003Cp\u003ETalented Team Of Professionals:\nWe are ably meeting the bulk and desired expectations of our valuable customers and it is just because of the relentless support and dedication of our talented and adroit professionals. They efficiently conduct market surveys to understand the existing trends and requirements and then strive to deliver products accordingly. The regular training sessions are conducted to enhance the skills of our employes in India and abroad.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur company works towards its aim of delivering quality products and services to international standards. We use high grade materials and components in our product development process, which are procured by us from the authentic and reliable market vendors. All products are quality tested by our experts on well defined parameter prior to the final delivery to clients.\u003C/p\u003E\n\n\u003Cp\u003ECustomer Delight:\nRendering maximum satisfaction to our customer is Mysore Light\u0026#8217;s prime objective. We provide them turnkey fit out solutions , which is according to the details and specifications provided by them. We ensure that the product and services offered at excellent nature and quality and within scheduled time period.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7906/247906v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7906/247906v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7906/247906v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}