{"name": "MyTrust.",
 "permalink": "mytrust",
 "crunchbase_url": "http://www.crunchbase.com/company/mytrust",
 "homepage_url": "http://www.mytrust.co",
 "blog_url": "http://0361f32.netsolhost.com/wordpress/?page_id=27",
 "blog_feed_url": "http://0361f32.netsolhost.com/wordpress/?page_id=27",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 21,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "freedom-meets-innovation-private-trust-law-common-law-trust-create-a-trust-private-trust",
 "alias_list": null,
 "email_address": "mytrust.co@gmail.com",
 "phone_number": "703 896 0568",
 "description": "Private Trusts, Freedom \u0026 Innovation",
 "created_at": "Sun Dec 16 05:50:47 UTC 2012",
 "updated_at": "Fri Dec 21 06:19:36 UTC 2012",
 "overview": "\u003Cp\u003EWe are a team of contract law experts passionate about creating a world from a foundation of free.  It is our alliance to those past present and future who ever dared such a world to be possible.  A key to that vision is you the Authors and innovators.  \u003C/p\u003E\n\n\u003Cp\u003EDare yourself in Trust 2012 and beyond on a mission of  societal \u0026amp; planetary freedom through innovation.  \u003C/p\u003E\n\n\u003Cp\u003EWe are the magnetic tone of purpose shining fourth the idea from the observation of a world based on self sustainability, a world which represents a demonstration in all life the true light and purpose of living.  a day looks back only to seal the spark of times past now manifest the constant knowing that we must bring fourth our gift and demonstrate the presence of our own truth.\u003C/p\u003E\n\n\u003Cp\u003EWe live in a societal structure businesses communicate a sense of identity that is a destination however is life is a constancy and its legacy which comes from purpose rather than a destination.    \u003C/p\u003E\n\n\u003Cp\u003EWe decided to create a legal structure and template that allows people to be free to create what they want and to be safely protected no matter what in the hopes to bringing home a grand sense of purpose and service to what they are doing for the world.   Before this was possible you had to go through an army of lawyers where the process is entirely hidden and you had to go through thousands of dollars to go through weeks if not years to create a corporate structure that harbors your Private Trust.  Now you require nobody outside of you and done in a matter of hours while being entirely accessible.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}