{"name": "Nadanu",
 "permalink": "nadanu",
 "crunchbase_url": "http://www.crunchbase.com/company/nadanu",
 "homepage_url": "http://www.nadanu.com/index.html",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "donations",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Charitable Donations Platform",
 "created_at": "Mon Apr 19 03:40:39 UTC 2010",
 "updated_at": "Mon Apr 19 03:43:32 UTC 2010",
 "overview": "\u003Cp\u003ENadanu Technolgies is devoted to providing services, technology and solutions for integrated desktop and mobile giving of charitable donations in a friendly, graphical and fun way. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       76],
      "assets/images/resized/0008/4094/84094v2-max-150x150.png"],
     [[224,
       114],
      "assets/images/resized/0008/4094/84094v2-max-250x250.png"],
     [[224,
       114],
      "assets/images/resized/0008/4094/84094v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$500k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "http://www.prnewswire.com/news-releases/nadanu-launches-multimedia-enhanced-e-giving-solutions-for-desktop-and-mobile-with-seed-round-of-funding-90945259.html",
    "source_description": "Nadanu Launches Multimedia-Enhanced E-Giving Solutions for Desktop and Mobile With Seed Round of Funding ",
    "raised_amount": 500000.0,
    "raised_currency_code": "USD",
    "funded_year": 2010,
    "funded_month": 4,
    "funded_day": 15,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [{"description": "Company Launch ",
    "stoned_year": 2010,
    "stoned_month": 4,
    "stoned_day": 15,
    "source_url": "http://www.prnewswire.com/news-releases/nadanu-launches-multimedia-enhanced-e-giving-solutions-for-desktop-and-mobile-with-seed-round-of-funding-90945259.html",
    "source_text": "Fun, Visual and Easy-to-Use, Nadanu Enables Anyone to Easily Donate at Any Time, From Anywhere - Micropayments or All-At-Once, Tailored Solutions for Religious and Secular Giving; Available Immediately for PC, Mac, Web and BlackBerry, iPhone and Facebook within 30 Days\r\nNEW YORK and ATLANTA, April 15 /PRNewswire/ -- Nadanu Technologies, LLC today announced the official launch of the company and its unique e-Charity solution, taking advantage of the full range of multimedia technologies available on the Web, desktop and mobile devices. Nadanu provides services, technology and solutions for integrated desktop, Web and mobile e-Charity donations.\r\nBased on the ancient Sumero-Akkadian word for \"giving\", Nadanu specifically chose this word to represent its company and philosophy.  As Abraham, a common father of Judaism, Christianity and Islam spoke this language, so Nadanu seeks to unite all people regardless of faith, creed and belief into a powerful force for making the world a better place for all. \r\nNadanu's logo is the cuneiform symbol for Nadanu and serves as the logo branding for the company's current range of products.\r\nThe company is launching with a seed round of funding from a corporate investor (totaling between $500,000 and $1M) as it seeks to transform the currently complex setup and usage of electronic giving into a simple, fun experience for users and charities alike.  Using Nadanu's 3 different solutions (eCharityBoxâ„¢ for Jewish and secular charities, eOfferingPlateâ„¢ for Christian charities and MyCharityBoxâ„¢ to donate to a growing database of more than 6,000 Charity Navigatorâ„¢ rated non-profits) is extremely simple:\r\nFor consumers:\r\nDonors register an account through text message or on a custom-branded registration Web page\r\nDonor downloads a custom-branded mobile or desktop application\r\nDonor contributes on their own terms in a fully-secure fashion via a range of payment solutions, including Authorize.net and PaypalÂ®\r\nWhen their box is \"full\", the credit card on file is charged and an automated tax receipt is sent\r\n\r\nNadanu also provides a complete turnkey solution for charitable organizations, including:\r\nMarketing materials to help promote the service to donors\r\nAutomated branded tax receipt system\r\nBack-end management tools to track your campaign\r\nBranded iPhone mobile-enhanced site and launcher\r\nBranded BlackBerry mobile-enhanced site and launcher\r\nBranded PC desktop application\r\nBranded MAC desktop application\r\nBranded registration and download page\r\n\r\nThe company currently supports MicrosoftÂ® WindowsÂ® and AppleÂ® MacÂ® OS X on the desktop as well as RIMÂ® BlackBerryÂ® and standard mobile phones for its solutions. An Apple iPhoneÂ®, iPod TouchÂ® and iPadÂ® app has been submitted for approval to Apple and is expected to be available within 30 days or less. GoogleÂ® AndroidÂ® support is under active development and FacebookÂ® and other social networking platform-specific applications will be available in the 1st half of 2010.\r\n\"We are very excited to be launching Nadanu at a time when charities are experiencing a real need to increase their services and support to worthy causes all over the world,\" said Getzy Fellig, co-founder and CEO of Nadanu, Technologies, LLC.  \"Our goal is to offer a brand-new experience that will make giving fun, natural and a recurrent part of people's daily lives.\"\r\nAbout Nadanu\r\nNadanu Technologies, LLC is devoted to providing services, technology and solutions for integrated desktop and mobile giving of charitable donations in a friendly, graphical and fun way.\r\nBased on the ancient Sumero-Akkadian word for \"giving\", Nadanu specifically chose this word to represent its company and philosophy - as Abraham, a common father of Judaism, Christianity and Islam spoke this language, so Nadanu seeks to unite all peoples regardless of faith, creed and belief into a powerful force for making the world a better place for all.\r\nNadanu, eCharityBox, eOfferingPlate and MyCharityBox are all trademarks of Nadanu Technologies, LLC.  All other trademarks and registered trademarks previously cited are hereby acknowledged.",
    "source_description": "Nadanu Launches Multimedia-Enhanced E-Giving Solutions  For Desktop and Mobile with Seed Round of Funding",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Nadanu",
      "permalink": "nadanu"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}