{"name": "Nakoda Creations",
 "permalink": "nakoda-creations",
 "crunchbase_url": "http://www.crunchbase.com/company/nakoda-creations",
 "homepage_url": "http://www.indiamart.com/nakoda-creations/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "nakoda-creations@tradepassport.org",
 "phone_number": "9880287890",
 "description": "manufacturing, exporting, wholesaling",
 "created_at": "Fri Apr 05 11:41:42 UTC 2013",
 "updated_at": "Fri Apr 05 11:41:45 UTC 2013",
 "overview": "\u003Cp\u003EDriven by advanced technology, we, Nakoda Creations are a prominent manufacturer, exporter, wholesaler and supplier of a wide assortment of Mens Shirts \u0026amp; Sweatshirts. We came into existence in the year 2002 and have successfully achieved desired place in the industry by providing desired range in the market. We have received huge appreciation from clients due to our products’ unmatched features such as exclusive patterns, fine stitches, easy maintenance, color fastness, elegant designs, wear and tear resistant.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nQuality always remains at the top of our priority list, as we have maintained it since establishment of our organization. For this, we have developed a sophisticated quality control laboratory, where all quality related operations are efficiently carried out by skilled professionals. Our quality controllers stringently check the excellence of products on well-defined parameters prior to their final dispatch into the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nCreative and highly talented professionals are working in our organization, which helps us in meeting the rising demands of clients. They keep themselves aware with the prevailing market demands and make persistent effort in providing solutions accordingly. For our workers, we conduct training programs and seminars on regular intervals, which enhance their knowledge and make them able to cater to the upcoming demands appropriately. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nIt is our team’s dedication and determination that we have achieved a commendable market position. Our prompt delivery schedules, quality approved range and cost effective solutions have assisted us in acquiring large satisfied base of clients from all over the country.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8594/248594v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8594/248594v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8594/248594v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}