{"name": "Nalpeiron",
 "permalink": "nalpeiron",
 "crunchbase_url": "http://www.crunchbase.com/company/nalpeiron",
 "homepage_url": "http://www.nalpeiron.com",
 "blog_url": "http://blog.nalpeiron.com/",
 "blog_feed_url": "http://feeds.feedburner.com/Nalpeiron",
 "twitter_username": "nalpeiron",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2005,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@nalpeiron.com",
 "phone_number": "888-800-8818",
 "description": "Hosted software analytics \u0026 licensing",
 "created_at": "Sat Jun 28 00:48:37 UTC 2008",
 "updated_at": "Mon Jan 21 01:51:30 UTC 2013",
 "overview": "\u003Cp\u003ENalpeiron was founded 20 years ago (in 1991) and has grown to become a leader in the Software License Management and Analytics business.\u003C/p\u003E\n\n\u003Cp\u003ENalpeiron offers hosted Software analytics and licensing solutions that reduce infrastructure costs, drive user adoption and generate new revenues while providing deep insight into Software usage. \u003C/p\u003E\n\n\u003Cp\u003EEasily retrofit your Software and then Nalpeiron analytics and licensing services capture all the critical elements of a customer\u0026#8217;s interaction with your products, control and manage that usage and present the information in real-time in a non-technical, easy to use, dashboards. \u003C/p\u003E\n\n\u003Cp\u003EReduce business risk with better information, increase revenue by understanding what drives user adoption, and control user interaction and focus your resources with facts on what users want and how they use it. \u003C/p\u003E\n\n\u003Cp\u003ELet Nalpeiron take some of the guesswork out of your business decisions while giving you total control over your Software.\u003C/p\u003E\n\n\u003Cp\u003ENalpeiron was the first to offer a cross platform, cloud-based, licensing service methods that allowed our Customers to remove the need for all the costs, time and hassles of setting up their own licensing infrastructure. At the time outsourcing to hosted services like ours was in its infancy and we lead the charge to lowering costs and speeding time to market for Software ISVs.\u003C/p\u003E\n\n\u003Cp\u003EToday we have expanded our offering to encompass not only basic licensing but also extensive analytics, marketing and reporting functions that add even more value to our Customer’s business - driving new revenues from Software Copy Protection, trial optimization, piracy revenue recovery and sales tools.\u003C/p\u003E\n\n\u003Cp\u003ENalpeiron has also spent years with millions of end users perfecting the most robust but user friendly activation process available today – it offers users ease of use and access to their records, while offering you the ISV the lowest operational costs.\u003C/p\u003E\n\n\u003Cp\u003EWith 100\u0026#8217;s of Software ISVs, large and small, across the world we are the partner of choice for anyone looking for modern licensing solutions in the cloud.\u003C/p\u003E\n\n\u003Cp\u003ENalpeiron is a privately held corporation based in the US and the UK.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       32],
      "assets/images/resized/0023/0691/230691v1-max-150x150.png"],
     [[187,
       40],
      "assets/images/resized/0023/0691/230691v1-max-250x250.png"],
     [[187,
       40],
      "assets/images/resized/0023/0691/230691v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Jon",
      "last_name": "Gillespie-Brown",
      "permalink": "jon-gillespie-brown",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head office",
    "address1": "2225 E Bayshore Road",
    "address2": "Suite 200",
    "zip_code": "94303",
    "city": "Palo Alto",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.4498742,
    "longitude": -122.1209066}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}