{"name": "Nano Pure Technology",
 "permalink": "nano-pure-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/nano-pure-technology",
 "homepage_url": "http://www.indiamart.com/nanopuretechnology/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "nanopuretechnology@tradepassport.org",
 "phone_number": "9944685411",
 "description": "manufacturers of a range of Foam Generat",
 "created_at": "Fri Apr 05 15:00:27 UTC 2013",
 "updated_at": "Fri Apr 05 15:00:30 UTC 2013",
 "overview": "\u003Cp\u003ENano Pure Technology is a sole proprietorship based business concern, which was incorporated in the year 2011 at Coimbatore, Tamil Nadu. We are enlisted among the reputed manufacturers and suppliers of the market engaged in offering an extensive range of Fly Ash, Industrial Mixers, Forming Agents and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe boast a state-of-the-art infrastructure that is sprawled over a massive area of land. It is divided into several departments, which help us carry out our business related processes in a well organized manner. Our manufacturing unit is operational with cutting-edge technology based machines and equipment, which holds high production capacity.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by an assiduous squad of talented and trained professionals, who strive hard to contribute in success and growth of the company. Our professionals possess immense experience of the industry, which help them develop products as per the latest market trends. These professionals work with clients in close tandem, in order to offer exact customized products as per their actual needs.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality-centric business firm, it is our priority to provide only quality assured products to our clients at reasonable prices. Our product line is manufactured in compliance with set industrial guidelines using high grad materials. These materials are sourced by us from the trusted and certified market vendors. We practice rigorous quality control system in our production process to deliver reliable products in the market.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are able to earn the trust and confidence of our valued clients by strictly adhering to quality standards and prompt delivery schedules. Our manufacturing unit holds high production capacity, which helps us efficiently meet the rising demands of our clients. The well qualified professionals of our company are dedicated to assist the clients in best possible manner.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8804/248804v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8804/248804v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8804/248804v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}