{"name": "Narkhede Group",
 "permalink": "narkhede-group",
 "crunchbase_url": "http://www.crunchbase.com/company/narkhede-group",
 "homepage_url": "http://www.indiamart.com/narkhedegroupofindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "narkhedegroupofindustries@tradepassport.org",
 "phone_number": "+(91)-(253)-2380013/6697415",
 "description": "manufacturing, supplying, exporting",
 "created_at": "Sat Apr 06 05:39:27 UTC 2013",
 "updated_at": "Mon Apr 08 00:14:00 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1974, we, “Narkhede Group of Industries”, are an ISO 9001:2008 certified organization engrossed in manufacturing, supplying, exporting and trading a value for money and efficient range of Low Voltage Panel, Medium Voltage Panel, Compact Secondary Substation and Indoor \u0026amp; Outdoor Breaker. \u003C/p\u003E\n\n\u003Cp\u003EMission:\nDiligently pursue the development \u0026amp; consistent delivery of Quality product to our Clients. Deliver the product faster, smarter \u0026amp; better than the completion, exercise exemplary corporate citizenship to the community \u0026amp; to create an environment in which we promote \u0026amp; reward employee contribution. As a fabrication \u0026amp; erection entity our mission is to achieve superior long term company financial value.\u003C/p\u003E\n\n\u003Cp\u003ESafety Policy:\nSafety policy is formulated to ensure that the hazards which affect the safety of the personnel, the integrity of facilities \u0026amp; conservation of environment are properly \u0026amp; adequately considered. Based on this policy, all the personnel’s have been introduced to the execution of work to ensure the retention of excellent \u0026amp; well proven engineering practices that are taught to them.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nProfessionals having immense knowledge and experience have been associated with us. Their determination and potential enables us to being forth a wide range of Low Voltage Panel, Medium Voltage Panel, Compact Secondary Substation and Indoor \u0026amp; Outdoor Breaker.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe at, \u0026#8216;Narkhede Group of Industries\u0026#8217;, are committed to provide our valued clients with a wide range Low Voltage Panel, Medium Voltage Panel, Compact Secondary Substation and Indoor \u0026amp; Outdoor Breaker having commendable attributes.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe posses systematically developed infrastructure setup at Ambad and Satpur. To ensure hassle free flow of production, we have segregated our setups into multiple divisions. All the segregated divisions are fitted with latest machinery and advanced amenities.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nBeing a customer oriented organization, we leave no stone unturned to acquire total satisfaction of our clients with our business practice. To meet their expectations, we ensure that offered range Low Voltage Panel, Medium Voltage Panel, Compact Secondary Substation and Indoor \u0026amp; Outdoor Breaker is developed up of high-grade quality required basic material in accordance with the ISO 9001:2008 and IEC.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/9056/249056v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/9056/249056v2-max-250x250.jpg"],
     [[450,
       202],
      "assets/images/resized/0024/9056/249056v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}