{"name": "National Space and Aeronautics Administration",
 "permalink": "nasa-2",
 "crunchbase_url": "http://www.crunchbase.com/company/nasa-2",
 "homepage_url": "http://www.nasa.gov/",
 "blog_url": "http://blogs.nasa.gov/cm/newui/blog/blogs.jsp",
 "blog_feed_url": "",
 "twitter_username": "nasa",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1958,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "space, aeronautics, government, technology, robotics, space-exploration, scientific-discovery",
 "alias_list": "NASA, nasa",
 "email_address": "",
 "phone_number": "(202) 358-0001",
 "description": "Space \u0026 Aeronautics",
 "created_at": "Thu Dec 16 09:01:11 UTC 2010",
 "updated_at": "Thu Dec 16 09:18:34 UTC 2010",
 "overview": "\u003Cp\u003ENASA\u0026#8217;s mission is to pioneer the future in space exploration, scientific discovery and aeronautics research.\u003C/p\u003E\n\n\u003Cp\u003ETo do that, thousands of people have been working around the world \u0026#8211; and off of it \u0026#8211; for 50 years, trying to answer some basic questions. What\u0026#8217;s out there in space? How do we get there? What will we find? What can we learn there, or learn just by trying to get there, that will make life better here on Earth?\u003C/p\u003E\n\n\u003Cp\u003EA Little History\u003C/p\u003E\n\n\u003Cp\u003EPresident Dwight D. Eisenhower established the National Aeronautics and Space Administration in 1958, partially in response to the Soviet Union\u0026#8217;s launch of the first artificial satellite the previous year. NASA grew out of the National Advisory Committee on Aeronautics (NACA), which had been researching flight technology for more than 40 years.\u003C/p\u003E\n\n\u003Cp\u003EPresident John F. Kennedy focused NASA and the nation on sending astronauts to the moon by the end of the 1960s. Through the Mercury and Gemini projects, NASA developed the technology and skills it needed for the journey. On July 20, 1969, Neil Armstrong and Buzz Aldrin became the first of 12 men to walk on the moon, meeting Kennedy\u0026#8217;s challenge.\u003C/p\u003E\n\n\u003Cp\u003EMeanwhile, NASA was continuing the aeronautics research pioneered by NACA. It also conducted purely scientific research and worked on developing applications for space technology, combining both pursuits in developing the first weather and communications satellites.\u003C/p\u003E\n\n\u003Cp\u003EAfter Apollo, NASA focused on creating a reusable ship to provide regular access to space: the space shuttle. First launched in 1981, the space shuttle has had 120 successful flights. In 2000, the United States and Russia established permanent human presence in space aboard the International Space Station, a multinational project representing the work of 16 nations.\u003C/p\u003E\n\n\u003Cp\u003ENASA also has continued its scientific research. In 1997, Mars Pathfinder became the first in a fleet of spacecraft that will explore Mars in the next decade, as we try to determine if life ever existed there. The Terra and Aqua satellites are flagships of a different fleet, this one in Earth orbit, designed to help us understand how our home world is changing. NASA\u0026#8217;s aeronautics teams are focused on improved aircraft travel that is safer and cleaner.\u003C/p\u003E\n\n\u003Cp\u003EThroughout its history, NASA has conducted or funded research that has led to numerous improvements to life here on Earth.\u003C/p\u003E\n\n\u003Cp\u003EOrganization\u003C/p\u003E\n\n\u003Cp\u003ENASA Headquarters, in Washington, provides overall guidance and direction to the agency, under the leadership of the Administrator. Ten field centers and a variety of installations conduct the day-to-day work, in laboratories, on air fields, in wind tunnels and in control rooms.\u003C/p\u003E\n\n\u003Cp\u003ENASA Today\u003C/p\u003E\n\n\u003Cp\u003ENASA conducts its work in four principal organizations, called mission directorates:\u003C/p\u003E\n\n\u003Cp\u003EAeronautics: pioneers and proves new flight technologies that improve our ability to explore and which have practical applications on Earth.\u003C/p\u003E\n\n\u003Cp\u003EExploration Systems: creates capabilities for sustainable human and robotic exploration.\u003C/p\u003E\n\n\u003Cp\u003EScience: explores the Earth, solar system and universe beyond; charts the best route of discovery; and reaps the benefits of Earth and space exploration for society.\u003C/p\u003E\n\n\u003Cp\u003ESpace Operations: provides critical enabling technologies for much of the rest of NASA through the space shuttle, the International Space Station and flight support.\u003C/p\u003E\n\n\u003Cp\u003EIn the early 21st century, NASA\u0026#8217;s reach spans the universe. Spirit and Opportunity, the Mars Exploration Rovers, are still studying Mars after arriving in 2004. Cassini is in orbit around Saturn. The restored Hubble Space Telescope continues to explore the deepest reaches of the cosmos.\u003C/p\u003E\n\n\u003Cp\u003ECloser to home, the latest crew of the International Space Station is extending the permanent human presence in space. Earth Science satellites are sending back unprecedented data on Earth\u0026#8217;s oceans, climate and other features. NASA\u0026#8217;s aeronautics team is working with other government organizations, universities, and industry to fundamentally improve the air transportation experience and retain our nation\u0026#8217;s leadership in global aviation.\u003C/p\u003E\n\n\u003Cp\u003EThe Future\u003C/p\u003E\n\n\u003Cp\u003ENASA is making significant and sustained investments in:\nTransformative technology development and demonstrations to pursue new approaches to space exploration, including heavy-lift technologies;\nRobotic precursor missions to multiple destinations in the solar system;\nU.S. commercial spaceflight capabilities;\nExtensions and increased utilization of the International Space Station;\nCross-cutting technology development in a new Space Technology Program;\nClimate change research and observations;\nNextGen and green aviation; and\nEducation, including focus on Science, Technology, Engineering and Math (STEM).\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[140,
       119],
      "assets/images/resized/0011/4297/114297v1-max-150x150.png"],
     [[140,
       119],
      "assets/images/resized/0011/4297/114297v1-max-250x250.png"],
     [[140,
       119],
      "assets/images/resized/0011/4297/114297v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Administrator",
    "person":
     {"first_name": "Charles",
      "last_name": "F. Bolden, Jr.",
      "permalink": "charles-f-bolden-jr",
      "image": null}},
   {"is_past": false,
    "title": "Deputy Administrator",
    "person":
     {"first_name": "Lori",
      "last_name": "Garver",
      "permalink": "lori-garver",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "NASA Headquarters",
    "address1": "E Street SW",
    "address2": "Suite 5K39",
    "zip_code": "20546-0001",
    "city": "Washington",
    "state_code": "DC",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/NASA",
    "title": "Facebook Page"},
   {"external_url": "http://en.wikipedia.org/wiki/NASA",
    "title": "Wiki Page"}]}