{"name": "Nathan E. Leavitt, DC",
 "permalink": "nathan-e-leavitt-dc",
 "crunchbase_url": "http://www.crunchbase.com/company/nathan-e-leavitt-dc",
 "homepage_url": "http://www.chiropractorknoxvilletoday.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "KnoxvilleChiro",
 "category_code": "other",
 "number_of_employees": 4,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "chiropractor, chiropractic, chiropractor-clinic, headaches, neck-pain, back-pain, fibromyalgia, whiplash, carpal-tunnel-syndrome",
 "alias_list": null,
 "email_address": "drnathanleavittdc@chiropractorknoxvilletoday.com",
 "phone_number": "865-522-7966",
 "description": "Knoxville Chiropractor, Nathan Leavitt ",
 "created_at": "Fri Jan 18 19:40:23 UTC 2013",
 "updated_at": "Sat Jan 19 22:20:49 UTC 2013",
 "overview": "\u003Cp\u003EDr. Nathan Leavitt has been a licensed Chiropractic Physician since 2003. He graduated Magna Cum Laude from Palmer College of Chiropractic with other high honors. He continues to take education courses to keep up on the latest technology and advances in Chiropractic.\nDr. Leavitt has taken care of tiny babies to seniors to athletes. He has successfully treated hundreds of patients.\nIt is his deep commitment and desire to help improve the health and quality of life of others that make his profession so rewarding to him. He is educated in and provides a variety of techniques, physiotherapy procedures, exercise and nutritional instruction to provide the best quality of care to his patients.\nDr. Leavitt strives to serve the community by offering educational workshops on a variety of health topics to help improve the health and well-being of others. He also spends time working with youth in the community.\nDr. Leavitt’s favorite past time is spending time with his wife and three children. He enjoys getting outdoors whenever he gets a chance. He enjoys hiking and camping. He also enjoys playing sports including basketball and golf.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}