{"name": "Nature’s One",
 "permalink": "natures-one",
 "crunchbase_url": "http://www.crunchbase.com/company/natures-one",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "baby",
 "created_at": "Thu Aug 16 12:18:01 UTC 2012",
 "updated_at": "Fri Aug 17 18:56:21 UTC 2012",
 "overview": "\u003Cp\u003EWhether you need a formula for your toddler or a nutrition supplement for your younger child, Nature’s One gives you the organic options you and your family need. Don’t settle for anything less than the best for your child. Choose our products for the health, nutrition, and quality ingredients you’ll receive.\u003C/p\u003E\n\n\u003Cp\u003EOrganic products have become increasingly available in today’s health-conscious world. We take the \u0026#8220;organic\u0026#8221; distinction beyond the name itself. Our company focuses on finding quality organic dairy farms that are family-owned whenever possible. We believe that the quality of ingredients starts at the source.\u003C/p\u003E\n\n\u003Cp\u003EWe label our products as toddler formulas because we believe that when possible mothers should use their breast milk to feed their infants and young babies. Despite the labels for toddlers, all our formulas meet the nutritional guidelines set forth by Congress’s Infant Formula Act. The 1980 act requires all formulas for infants to meet specific nutritional standards. \u003C/p\u003E\n\n\u003Cp\u003EBreast milk gives your baby the best possible nutrition, health benefits, and immune protection, however, our formulas provide adequate nutrition whenever breast milk is not an option.\u003C/p\u003E\n\n\u003Cp\u003EAvailable Products\u003C/p\u003E\n\n\u003Cp\u003ETake a look at the available options from our product catalog:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EBaby’s Only Organic® Dairy Formula: Our feature organic formula.\u003C/li\u003E\n\u003Cli\u003EBaby’s Only Organic Dairy with DHA \u0026amp; ARA Formula: The only available organic formula providing an organic-compliant DHA and ARA fatty acid.\u003C/li\u003E\n\u003Cli\u003EBaby\u0026#8217;s Only Organic® LactoRelief Formula: For babies with lactose intolerance.\u003C/li\u003E\n\u003Cli\u003EBaby\u0026#8217;s Only Organic® Soy Formula: Soy-based formula for families choosing to follow a vegetarian diet.\u003C/li\u003E\n\u003Cli\u003EPediaSmart® Dairy Complete Nutritional Beverage: For children in need of added calories or nutrition.\u003C/li\u003E\n\u003Cli\u003EPediaSmart® Soy Complete Nutritional Beverage:  For dairy sensitive children in need of added calories or nutrition.  \u003C/li\u003E\n\u003Cli\u003EPediaVance® Electrolyte Solution: Provides essential electrolytes to quickly and effectively treat dehydration.\u003C/li\u003E\n\u003Cli\u003EBaby\u0026#8217;s Only Essentials® DHA \u0026amp; ARA Fatty Acid Supplement: Naturally-derived DHA and ARA fatty acid supplement for your baby’s diet.\u003C/li\u003E\n\u003Cli\u003EBaby\u0026#8217;s Only Essentials® Probiotic Supplement: Help’s maintain your baby’s natural levels of healthy bacteria for digestion and other bodily functions.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003ENo matter your baby’s dietary or nutritional needs, we provide healthy, organic options. Keep your baby healthy and happy with our wide range of formulas and supplemental beverages. To learn more about our company, products, and news, please visit our company website at www.naturesone.com today.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0020/6355/206355v2-max-150x150.png"],
     [[250,
       153],
      "assets/images/resized/0020/6355/206355v2-max-250x250.png"],
     [[260,
       160],
      "assets/images/resized/0020/6355/206355v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}