{"name": "Nature's Feast Food and Grocery Suppliers",
 "permalink": "natures-feast-food-and-grocery-suppliers",
 "crunchbase_url": "http://www.crunchbase.com/company/natures-feast-food-and-grocery-suppliers",
 "homepage_url": "http://naturesfeast.in",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "naturesfeastin",
 "category_code": "ecommerce",
 "number_of_employees": 37,
 "founded_year": 2012,
 "founded_month": 10,
 "founded_day": 24,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "grocery, online-shopping, health, beauty, stationary, adaptive, technology, home-delivery",
 "alias_list": null,
 "email_address": "info@naturesfeast.in",
 "phone_number": "",
 "description": "Enjoy Home Shoping",
 "created_at": "Mon Feb 11 11:14:34 UTC 2013",
 "updated_at": "Mon Mar 25 01:20:46 UTC 2013",
 "overview": "\u003Cp\u003EEnjoyable Online Grocery, Health \u0026amp; Beauty and Stationary Shopping!\u003C/p\u003E\n\n\u003Cp\u003EFour IIT brains supporting Nature’s Feast India to implement Hybrid retail model in India especially in the zones of Wal-Mart \u0026amp; Amazon.\u003C/p\u003E\n\n\u003Cp\u003EOur two years customer focused research aims at creating ‘Integrated Multi Channel Retailing’ Model for providing best service to people. We aim to help consumers save more money and enjoy shopping by introducing ‘Adaptive Technology ‘ \u0026amp;  ‘Hybrid Retail System’.\u003C/p\u003E\n\n\u003Cp\u003ENature’s Feast India’s enjoyable online shopping Portal www.naturesfeast.in provides wide range of online products in Vegetables, Fruits, Bakery \u0026amp; Milk products, Everyday grocery like Staples/wheat/Rice, Beverages, Detergents and Soaps, World Foods, Baby Care, Health \u0026amp; Beauty Range, School \u0026amp; Office Stationary. Our virtual Store offers user friendly search options to choose either by your favorite brand, category or specific item name. We are associated with most popular brands \u0026amp; committed to provide best quality items to our consumers.\u003C/p\u003E\n\n\u003Cp\u003EAuto Subscription Based delivery for Grocery, vegetables, Fruits, Meat, Fish, Frozen foods on preferred slots.\nRecurring orders benefits\nReliable grocery delivery service to your home or office\nPersonalized shopping lists\nFaster checkout facility\nFlexible payment options(Credit card/Debit card/Netbanking/Cash on Delivery/Swipe on delivery)\nIn line with Comprehensive E-commerce portal, Our Hybrid Retail model is just getting closer to you in your neighborhoods \u0026amp; communities from April 2013 Onward. This Multi channel retail environment facilitates supply from your morning tea till good night dinner with enhanced customer service across channels. We are reaching every corner of India creating 1,00,00+ jobs within next 18 Months Span operating in both B2C \u0026amp; B2B segment. Our B2B associates get value for investment \u0026amp; earn with peaceful mind.\u003C/p\u003E\n\n\u003Cp\u003EOur widely connected network with direct farmer’s community, organic food producers, best quality food product suppliers, top nutritionists helps us in supplying fresh food directly to our consumers. Currently we have joined hands with 300 farmers soon expanding our reach to 10,000+ farmers.\u003C/p\u003E\n\n\u003Cp\u003EWe are starting our operations in Pune soon expanding to Mumbai, Nagpur, Ahmadabad, Baroda, Jaipur, Lucknow, Chandigarh, Dehradun, Kanpur, Patna, Ranchi, Kolkata, Guwahati, Bhubaneswar, Vijayawada, Hyderabad, Chennai, Coimbatore, Trivandrum, Cochin, Bangalore, Indore, Bhopal, Raipur, Ludhiana, Ghaziabad, Noida, Gurgaon, Surat.\u003C/p\u003E\n\n\u003Cp\u003EWe look forward to your continued support in this mission. If you want to cooperate us in technology, product sourcing, operations, Logistics, Finance, Real Estate, Farming, Legal, Media, and Investment, partners / Associates You are most welcome. Get in touch at support@naturesfeast.in.\u003C/p\u003E\n\n\u003Cp\u003EWe have bigger plans in the pipeline which you can surely keep yourself updated about by subscribing to us. You can get in touch with us here.\u003C/p\u003E\n\n\u003Cp\u003EOur Registration started for Pune, Mumbai, Bangalore, Hyderabad and Delhi. To become an registered member, avail our early invite offers by mailing at info@naturesfeast.in with Subject line ‘Registration for [Your City Name].’\u003C/p\u003E\n\n\u003Cp\u003EWant to receive our exclusive savings, hear the latest news and find out interesting facts about food? Follow us on Twitter, ‘Like’ our Facebook page and read our Blog and you’ll never miss out!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Randhir",
      "last_name": "Kumar",
      "permalink": "randhir-kumar-2",
      "image": null}},
   {"is_past": false,
    "title": "GM",
    "person":
     {"first_name": "Deepak",
      "last_name": "Singh",
      "permalink": "deepak-singh-3",
      "image": null}},
   {"is_past": false,
    "title": "Director",
    "person":
     {"first_name": "Tejaswini",
      "last_name": "Kharade",
      "permalink": "tejaswini-kharde",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "Walmart eCommerce",
      "permalink": "walmart-ecommerce",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Level-2",
    "address1": "Connaught Place",
    "address2": "Bund Graden Road",
    "zip_code": "411001",
    "city": "Pune",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.indiainfoline.com/Markets/News/Natures-Feast-set-to-create-benchmark-with-innovative-strategy/5643574475",
    "title": "Nature’s Feast set to create benchmark with innovative strategy"},
   {"external_url": "http://knowledgepartner.co.in/grocery-shopping-affordable-convenient-tech-savvy-puneites/",
    "title": "\"Grocery shopping becomes affordable \u0026 convenient for tech-savvy PUNEites"}]}