{"name": "NCG",
 "permalink": "ncg",
 "crunchbase_url": "http://www.crunchbase.com/company/ncg",
 "homepage_url": "http://www.newcogs.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": 8,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "data-driven, digital-marketing, china, online-marketing, market-research, shanghai, digital-media, research, marketing, advertising, dfr-asia",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+86 (21) 6384-6605",
 "description": "Data-Driven Digital Marketing Solutions",
 "created_at": "Tue Mar 27 10:46:04 UTC 2012",
 "updated_at": "Tue Mar 27 23:40:27 UTC 2012",
 "overview": "\u003Cp\u003EFounded in 2009 by market research veterans and consumer behavior experts, NCG is one of China’s emerging new leaders in digital marketing and online market research. \u003C/p\u003E\n\n\u003Cp\u003ENCG provides in-depth data on Chinese consumers and highly detailed demographic profiles that help brands learn more about their customers. This “deep data” is made possible by the company’s proprietary DIG (Dynamic Insights Gathering) platform.\u003C/p\u003E\n\n\u003Cp\u003EWith the company’s YAM advertising solution, brands increase their reach by delivering online advertising campaigns simultaneously across multiple social media platforms. The company’s MRX service provides consumers with incentives to participate in online market research panels that help clients target specific audiences.\u003C/p\u003E\n\n\u003Cp\u003ENCG provides local and multinational clients with data-driven digital marketing solutions and comprehensive online market research services. A pioneer in applying market research methodologies and professional codes of practice to online advertising and marketing, NCG works with many of Asia’s most trusted brands and companies. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder and CEO",
    "person":
     {"first_name": "Patrick",
      "last_name": "Pun",
      "permalink": "patrick-pun",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}