{"name": "NeoHire",
 "permalink": "neohire",
 "crunchbase_url": "http://www.crunchbase.com/company/neohire",
 "homepage_url": "http://www.neohire.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 14,
 "founded_year": 2007,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "tech-recruiting, startups, web-development",
 "alias_list": "",
 "email_address": "info@neohire.com",
 "phone_number": "888-552-4440",
 "description": "",
 "created_at": "Tue Sep 16 22:04:02 UTC 2008",
 "updated_at": "Sat Mar 03 08:37:34 UTC 2012",
 "overview": "\u003Cp\u003ENeohire finds top talent to fill key roles for companies operating across multiple verticals and disciplines in the online space. Our team has filled hundreds of positions that have contributed tens of millions of dollars to our client\u0026#8217;s bottom lines. We work with leading companies, large and small, providing incredible energy and non-stop commitment to your growth needs. Besides talent, clients can leverage our network for strategic introductions, partnerships, and landscape intelligence.\u003C/p\u003E\n\n\u003Cp\u003ENeohire is not a standard agency. We only take those that want to win and make a difference in the marketplace, and we take a vested interest in their long-term success. Any agency can produce names of qualified people, but it takes a different caliber to find the missing pieces to your puzzle. At Neohire, we pride ourselves on our industry knowledge, deep contacts, and to plug in not just a qualified candidate but the one right for you. We produce not candidates but catalysts.\u003C/p\u003E\n\n\u003Cp\u003EThe professionals at NeoHire share a strong sense of teamwork. Our recruiters are organized into specific technology and sector groups and work in teams that maximize specialization and knowledge-sharing. These teams are supported by first-rate research and backed by state-of-the-art technology to provide the competitive advantage necessary to recruit and develop world-class technology teams.\u003C/p\u003E\n\n\u003Cp\u003EWith every client, we take the time to assess the proper personnel requirements and required skill sets for your team to succeed. Our unique Search Methodology and Candidate Assessing System are what enable us to deliver the right candidate to you accurately, quickly and efficiently. Quality is at the center of everything we do and customer feedback is solicited at every opportunity in order to continually improve our service.\u003C/p\u003E\n\n\u003Cp\u003EAt NeoHire, we share an intense passion for our work, care about your needs and goals, bring high energy to all aspects of a project and are persistent in successfully completing the search.\u003C/p\u003E\n\n\u003Cp\u003ESuccessful companies consist of people who can navigate the business landscape and produce a string of victories, people who can establish real ambitious objectives and then achieve them.\u003C/p\u003E\n\n\u003Cp\u003EFinding and securing the person who can do both is not easy. It requires careful analysis of your needs, challenges, and plans that reach far beyond a job description. It requires collaborating with an industry savvy recruiting firm that understands your business, and can help you locate and secure the people who will contribute to your enduring success. NeoHire is that company. When the right people come together, technology shines.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0002/5302/25302v3-max-150x150.png"],
     [[190,
       33],
      "assets/images/resized/0002/5302/25302v3-max-250x250.png"],
     [[190,
       33],
      "assets/images/resized/0002/5302/25302v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Josh",
      "last_name": "Stomel",
      "permalink": "josh-stomel",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Jason",
      "last_name": "Stomel",
      "permalink": "jason-stomel",
      "image": null}},
   {"is_past": true,
    "title": "VP of Technical Recruiting",
    "person":
     {"first_name": "Ted",
      "last_name": "Hekman",
      "permalink": "ted-hekman",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "1750 14th st.",
    "address2": "Suite D",
    "zip_code": "90404",
    "city": "Santa Monica",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 34.016171,
    "longitude": -118.4893368},
   {"description": "NYC Office",
    "address1": "154 Grand st.",
    "address2": "Floor 3",
    "zip_code": "10013",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        86],
       "assets/images/resized/0003/5922/35922v2-max-150x150.jpg"],
      [[250,
        144],
       "assets/images/resized/0003/5922/35922v2-max-250x250.jpg"],
      [[450,
        260],
       "assets/images/resized/0003/5922/35922v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}