{"name": "Neon Engineers",
 "permalink": "neon-engineers",
 "crunchbase_url": "http://www.crunchbase.com/company/neon-engineers",
 "homepage_url": "http://www.indiamart.com/neonengineers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "neonengineers@tradepassport.org",
 "phone_number": "9825026997",
 "description": "supplies and exports Material Handling E",
 "created_at": "Fri Apr 05 15:46:10 UTC 2013",
 "updated_at": "Fri Apr 05 15:46:13 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2005, we, “Neon Engineers”, are reputed firm involved in manufacturing, supplying and exporting a wide range of Material Handling Equipment, Valve, Idler and Industrial Plant. In our range, we offer Telescopic Chute, Swing Arm Elevator, SS Rotary Air Lock Valve, Rotary Air Lock Valve, Mechanical Conveyor System, Screw Conveyor and Troughing Angle Impact Idler. Additionally, we offer Stone Crushing Plant, Sugarcane Handling Plant, Mechanical Vibrating Feeder and Crusher.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Professionals for sales and marketing\n    Researcher\n    Developers\n    Production manager and staff\n    Quality experts\n    Engineers\u003C/p\u003E\n\n\u003Cp\u003EQuality Standards:\nSince inception, we have focused towards offering qualitative and high standard products to the clients. Our professionals source only premium quality raw material to manufacture the offered range of products. Moreover, our quality controller keep an eagle eye on all the stages production to eliminate the chances of any kind of flaw.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have established a sophisticated infrastructure facility, so as to deliver the best to the clients. Our infrastructure in divided into various units that includes a production, quality testing, research \u0026amp; development and a capacious warehousing unit. All these units are equipped with ultramodern machines and equipment that enable us in retaining excellent production rates.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client centric-organization, who wholeheartedly work towards the maximum contentment of the clients in every aspect. We ensure that only premium quality and flawless products reach the clients\u0026#8217; destination. Moreover, our team of sincere professionals maintain a close and cordial relationship with the clients, to understand their exact requirements and offer products accordingly. Further, we strive to maintain fair trade practices and transparency in all our dealings so the clients find us as an reliable source for their products. Owing to all the above factors, we have been able to spread our wings across the Indian Subcontinent. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8852/248852v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8852/248852v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8852/248852v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}