{"name": "Neosperience",
 "permalink": "neosperience",
 "crunchbase_url": "http://www.crunchbase.com/company/neosperience",
 "homepage_url": "http://www.neosperience.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Neosperience",
 "category_code": "mobile",
 "number_of_employees": 30,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@neosperience.com",
 "phone_number": "",
 "description": "Augmenting Customer Experience",
 "created_at": "Thu Mar 07 17:07:06 UTC 2013",
 "updated_at": "Thu Mar 07 17:31:56 UTC 2013",
 "overview": "\u003Cp\u003ENeosperience, invented by Neos Spa, is the powerful mobile application platform that takes your customer experience to the next level to acquire and retain your customers, extend your brand and engage your customer communities.\u003C/p\u003E\n\n\u003Cp\u003EA revolutionary product with amazing capabilities, Neosperience delivers Customer Experiences across the widest range of devices in an easy way. Unlike other app framework and builders, Neosperience adapts presentation by discovering your customers\u0026#8217; context: location, identity, relationships and intentions, tailoring information and products that increase engagement and sales like magic.\u003C/p\u003E\n\n\u003Cp\u003EA set of cloud-based customer experience scalable products: Neosperience Engage, Store, Catalog, Customer Service, built on world renowned scalable foundation, allows your organization to deliver Customer Experience apps that include 3D, augmented reality and context discovery, with profiling based on Facebook Open Graph integration and geo-location features, also linked to Apple iOS Passbook.\u003C/p\u003E\n\n\u003Cp\u003EIn Neosperience we have blended with passion insight, creativity and technology, in an enterprise market where every company has to set up their mobile apps ecosystem to interact with customers in richer and more meaningful ways. It is a huge market expected to grow at a 7% CAGR by 2015, representing a $50 billion opportunity, the next big wave after the PC-based web in the next 5 years. \u003C/p\u003E\n\n\u003Cp\u003EWith Neosperience ACE (Application Creation Environment), our cloud-based back-office, you can easily deliver apps that have been validated by global and highly demanding organizations like Oracle, Walt Disney and Zegna and is now being discovered also by small and medium-sized enterprises to massively scale.\u003C/p\u003E\n\n\u003Cp\u003ENeosperience is a game changing product with a unique positioning to deliver vibrant customer experience apps that expand your business in a new way that was previously technically and economically unfeasible. \u003C/p\u003E\n\n\u003Cp\u003EIn fact, Neosperience: \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EDelivers magical customer experience apps, with profiling and personalization, 3D and augmented reality, in SaaS, starting from Euro 49/month, delivering a value of 40-50k Euro or more if each app was custom made. \u003C/li\u003E\n\u003Cli\u003ESupports b2c, b2b and b2e marketing and sales processes, targeting billions smartphone and media tablet users\u003C/li\u003E\n\u003Cli\u003ERemoves the complexity of a fragmented market, with incompatible iOS, Android, Windows Phone, HTML5, web and Facebook. \u003C/li\u003E\n\u003Cli\u003EGenerates revenues by bringing customers and sales to organizations, both increasing traffic to physical stores - adding a digital layer to the physical world - and expanding e-commerce sales.\u003C/li\u003E\n\u003Cli\u003EReduces costs associated to print and physical delivery of paper catalogs, enhancing any paper or digital publication via Augmented Reality and turning them into e-commerce anchors.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EIts broad appeal to date and the capability of our product portfolio to energize your revenues have proved the scalability and replicability of our business model.\u003C/p\u003E\n\n\u003Cp\u003EIn terms of positioning and go-to-market, Neosperience represents a \u0026#8220;non-disruptive disruption\u0026#8221;, that is, a technology that offers you game-changing benefits, easy for you to adopt, without requiring any modification to your existing processes or environments.\nYou can benefit from Neosperience without much in the way of adoption hurdles, by offering profiled and interactive 3D stores, catalogs, smart promotions and dematerialized loyalty cards, starting from a simple and readily available content such as Pdf catalog, brochure or product images, adding social media profiling, personalization, augmented reality and e-commerce, as simply as dragging on the product and inserting a product code, price and currency.\u003C/p\u003E\n\n\u003Cp\u003EAnd this is a global need, that Neos can serve thanks to our investment and cooperation with our strategic shareholders and business partners including IBM, Oracle and PayPal in Europe, US and South America. \u003C/p\u003E\n\n\u003Cp\u003ENeos team is young, restless and outstanding and has built with passion a significant entry barrier, combining technology with sell-side pre-configured business processes, as recognized by Gartner and Red Herring, among others. \u003C/p\u003E\n\n\u003Cp\u003EIn addition, Italy has been the best country to invent and nurture Neosperience:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003Ebecause of its attitude towards design and creativity\u003C/li\u003E\n\u003Cli\u003Ebecause it is the 1st country in Europe for mobile devices penetration and 5th in the world (2012 KPVB report)\u003C/li\u003E\n\u003Cli\u003Ebecause of Italy\u0026#8217;s tough economic situation, where only a few could invest in tech development in the past years attracting first class talents, as we did.\nPlus for the same reason we can find here one of the best skill/cost ratio in Europe, further improving in the years to come.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EIn April 2012, Neos won the prestigious Red Herring Top 100 Europe Award, surpassing in the due diligence hundreds of tech companies and finally winning both as the only company in Italy and as the best European player in its market segment, \u0026#8220;the most innovative, unique and promising company for its technology innovation, quality of management, financial performance, execution of strategy, and disruption\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003EIn September 2012 Neos has been included as key technology player in both the Mobile Consumer Applications on Demand and Mobile Enterprise Applications on Demand market segments (Neos has been included in both 2012 Gartner Mobile App Platforms Magic Quadrant report and IT Market Clock for Enterprise Mobility).\u003C/p\u003E\n\n\u003Cp\u003EIn November 2012 \u0026#8220;Prada - Il Palazzo\u0026#8221; iPad app, based on Neosperience Store, is a global success and considered among the most successful marketing apps ever released in the customer experience market.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "Via Tadini 47",
    "address2": "",
    "zip_code": "25125",
    "city": "Brescia",
    "state_code": null,
    "country_code": "ITA",
    "latitude": 45.5214336,
    "longitude": 10.187495},
   {"description": "Milan Office",
    "address1": "Corso Indipendenza 5",
    "address2": "",
    "zip_code": "20129",
    "city": "Milan",
    "state_code": null,
    "country_code": "ITA",
    "latitude": 45.468246,
    "longitude": 9.2121082}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://vimeo.com/61273075",
    "title": "Neosperience - Augmenting Customer Experience"},
   {"external_url": "http://www.redherring.com/events/red-herring-europe/europe-2012-top-100/",
    "title": "Neos Spa wins 2012 Red Herring Europe Top 100 Europe"}]}