{"name": "Neotopica",
 "permalink": "neotopica",
 "crunchbase_url": "http://www.crunchbase.com/company/neotopica",
 "homepage_url": "http://www.neotopica.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "SustainableNet",
 "category_code": "other",
 "number_of_employees": 5,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "jhujsak@gmail.com",
 "phone_number": "619-672-1234",
 "description": "Augmented Social Cognition",
 "created_at": "Tue Mar 01 14:41:38 UTC 2011",
 "updated_at": "Fri May 17 03:56:44 UTC 2013",
 "overview": "\u003Cp\u003ENeotopica is Big Data start-up effort currently developing an online suite of knowledge driven decision support services based on knowledge extraction from historical and real-time worldwide news and information sources. The initial focus is on risk reduction for large, costly, complex, high risk, cross disciplinary projects such as renewable energy and sustainability. The technology, however,  is inherently cross-domain and can be applied to defense, health-care, biomedical, scientific, political, social or other domains. The objective is to raise project success rates by providing highly tailored parametric data on public perceptions, cost, success rates, vendors, technologies, technology readiness levels, geolocations, econometrics, regulatory, environmental and safety. \u003C/p\u003E\n\n\u003Cp\u003ELarge, complex, technology intensive projects such as renewable energy farms, smart grids, sustainable communities/cities, border surveillance, large scale IT systems, and defense systems have historically poor success rates (Chaos Report, Standish Group 2009). Only 32% are completed on-time and on-budget with all planned features and functions. 44% are completed and operational but are over budget, have slipped schedules or complete restarts, and have fewer features and functions than originally specified. 24% are cancelled at some point during the project life-cycle and never restarted. US$ billions are lost in failed and restarted projects every year as a result. By introducing a decision support and simulation step between conventional design and implementation, we have shown that significant risk reduction can be achieved by capturing lost requirements, revealing hidden costs, identifying technologies with low technology readiness levels, flagging environmental impacts, project side-effects, and more. An example use case is a municipal leader launching a waste-to-energy program to create jobs, increase revenue, foster growth, and improve community sustainability. Typically the municipal leader is not a technical expert but must make the call between competing vendors where cost, experience, technology readiness, environmental impact, safety and other considerations must be quickly mastered. \u003C/p\u003E\n\n\u003Cp\u003EA graphic recent example of this nearly universal problem is the recent cancellation of Boeing\u0026#8217;s Secure Border Initiative (SBI), a high tech border monitoring project designed to automate border surveillance for US DHS. Originally bid at for 1,969 miles of protection, the project was cancelled after expending $1.1 billion (initial phase budgeted at US$67 million) and covering just 53 miles for slipped schedule, cost overruns and poor performance of the technology. The daily global news is full of examples of similar technology intensive projects being cancelled or restarted.\u003C/p\u003E\n\n\u003Cp\u003EThe technology, however, is horizontal and can be applied to medical, technological, political, commercial, or other domains. It has a fundamental built-in capability of automated crowd building, achieved by sourcing large amounts of \u0026#8220;actionable\u0026#8221; knowledge to customer communities. For example, a company manufacturing sports footwear could use this technology to foster and grow large customer communities by providing \u0026#8220;sports centric\u0026#8221; as opposed to \u0026#8220;product centric\u0026#8221; actionable knowledge. Knowledge that helps the customer achieve success (in a holistic sense) in their activity, be it marathon running, triathlete competition, or other intensive sports activities.\u003C/p\u003E\n\n\u003Cp\u003EAt the entry level, mined information from news, search engine, web site, conventional media, and social media sources is filtered, clarified, de-noised, categorized, tagged, and republished as enhanced domain specific news in social media environments to drive automated crowd building. Injected news links back to the decision support site where at a deeper level retrospective knowledge repositories provide role based decision support for social augmented cognition. User roles including investor, educator, researcher, industrial, media, municipal, leadership, consumer, trainer, etc. can be specified to extract finer grained knowledge perspectives. Deeper levels support project specific knowledge discovery and aggregation.\u003C/p\u003E\n\n\u003Cp\u003EThe first demonstration of top level data republishing can be viewed in Twitter @SustainableNet. In just under 90 days the synthesized content achieved over 1,000,000 page impressions per day in controlled experiments. The channel remains open today in a daily release mode and continues to grow. Over 60 categories of energy and sustainability news are re-interleaved and delivered through this channel with temporal content structure imposed.\u003C/p\u003E\n\n\u003Cp\u003ENeotopica technology is an augmentation to major search engines such as Google, not a competitor. Major search engines and social media environments are used to provide first pass, coarse grained, firehose ingest streams for Neotopica post processing. We are a knowledge extraction, crowd building and decision support solution as opposed to a conventional search solution. We are, in a sense, a potential fused hybrid model for future news, library, advertising and decision support.\u003C/p\u003E\n\n\u003Cp\u003EThe underlying concepts and technologies have been explored and tested by the founders in various domains for over two decades, continuously refining the techniques across various domains and verticals including national intelligence, tactical intelligence, digital libraries, E-Commerce, biomedical \u0026amp; pharmaceutical, energy \u0026amp; sustainability, manufacturing, software development, and investing. The current Neotopica platform represents an aggregation of these resources in a virtualized, cloud based paradigm that can be delivered to globally distributed projects.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       29],
      "assets/images/resized/0012/6704/126704v2-max-150x150.jpg"],
     [[250,
       49],
      "assets/images/resized/0012/6704/126704v2-max-250x250.jpg"],
     [[450,
       88],
      "assets/images/resized/0012/6704/126704v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Irv",
      "last_name": "Beiman",
      "permalink": "irv-beiman",
      "image": null}},
   {"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Jonathan",
      "last_name": "Hujsak",
      "permalink": "jonathan-hujsak",
      "image": null}},
   {"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Peter",
      "last_name": "Rowell",
      "permalink": "peter-rowell",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "R\u0026D",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Sebastapol",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "R\u0026D, Management",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Ramona",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "Business Development",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Shanghai",
    "state_code": null,
    "country_code": "CHN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}