{"name": "Net-Flow Solutions",
 "permalink": "net-flow-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/net-flow-solutions",
 "homepage_url": "http://www.net-flowsolutions.com",
 "blog_url": "http://www.net-flowsolutions.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "network_hosting",
 "number_of_employees": 25,
 "founded_year": 2005,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it-consulting, managed-services, it-managed-services, online-backup, disaster-recovery, consulting, it",
 "alias_list": null,
 "email_address": "sales@net-flowsolutions.com",
 "phone_number": "678-637-2645",
 "description": "IT Managed Services",
 "created_at": "Mon Nov 22 19:15:25 UTC 2010",
 "updated_at": "Tue Nov 23 00:39:13 UTC 2010",
 "overview": "\u003Cp\u003ENet-Flow Solutions - we support your NETwork, while you increase your NET PROFIT.\u003C/p\u003E\n\n\u003Cp\u003ENet-Flow Solutions\u0026#8217; VCare Managed Services provides a comprehensive solution for managing critical IT infrastructure in order to ensure a consistent, high-level of system availability, performance, and security. Subscribing to the VCare Managed Services; your organization gains unprecedented visibility into the service quality and health of technology investments through Net-Flow Solutions continuous monitoring of the entire network infrastructure, critical services, and other key components. While proactively managing service availability and performance, Net-Flow Solutions identifies and resolves technical problems before they adversely impact your business operations.  In addition, VCare Managed Services provides you with a 24x7 Help Desk to support your PCs when an issue arises through Net-Flow Solutions redundant US-based call centers.\u003C/p\u003E\n\n\u003Cp\u003EPreparing for disaster is rarely an enjoyable task, however with proper planning the risk and costs associated with a disaster is greatly minimized. Net-Flow Solutions\u0026#8217; VBus service is ideal for small or midsized businesses as well as government agencies. The VBus solution provides a onsite network appliance that will provide failover to a virtual server that is being backed up onto our system, the device also encrypts and compresses the bit-level data on your servers and uploads it to two data centers.  With our  24x7 service staff monitoring the servers being backed up and robust hosting infrastructure allows our customers to enjoy a robust fail-over solution at a fraction of the cost of do-it-yourself or competing solutions. \u003C/p\u003E\n\n\u003Cp\u003EWith each consulting engagement, we take a business-centric approach, working closely with your executive and functional staff to align people, process, and technology with corporate objectives. By combining our comprehensive infrastructure and application expertise with best practices and proven processes, such as our Network Engagement Methodology and Business Value Justification, we are able to deliver consistent and exemplary results that help improve your business operations and create a foundation for continuous improvement.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "dynasis",
      "permalink": "dynasis",
      "image":
       {"available_sizes":
         [[[150,
            33],
           "assets/images/resized/0011/2654/112654v1-max-150x150.png"],
          [[238,
            53],
           "assets/images/resized/0011/2654/112654v1-max-250x250.png"],
          [[238,
            53],
           "assets/images/resized/0011/2654/112654v1-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "radical support",
      "permalink": "radical-support",
      "image": null}},
   {"competitor":
     {"name": "BlueWave Computing",
      "permalink": "blue-wave-computing",
      "image":
       {"available_sizes":
         [[[150,
            88],
           "assets/images/resized/0015/3719/153719v1-max-150x150.jpg"],
          [[196,
            116],
           "assets/images/resized/0015/3719/153719v1-max-250x250.jpg"],
          [[196,
            116],
           "assets/images/resized/0015/3719/153719v1-max-450x450.jpg"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Atlanta - Headquarters",
    "address1": "3651 Peachtree Parkway",
    "address2": "Suite E380",
    "zip_code": "30024",
    "city": "Suwanee",
    "state_code": "GA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}