{"name": "Netcore Solutions",
 "permalink": "netcore-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/netcore-solutions",
 "homepage_url": "http://www.netcore.in",
 "blog_url": "http://emergic.org",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 500,
 "founded_year": 1998,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sales@netcore.co.in",
 "phone_number": "+91 (22) 6662 8000 ",
 "description": "A Digital Communications Company",
 "created_at": "Wed Apr 03 10:48:04 UTC 2013",
 "updated_at": "Wed Apr 03 18:46:31 UTC 2013",
 "overview": "\u003Cp\u003EnetCORE is a leader in digital communications space.\u003C/p\u003E\n\n\u003Cp\u003EThe mission of the company is to help clients communicate effectively for marketing and business needs. netCORE has pioneered innovative technology-based solutions in mailing \u0026amp; mobility domains. Headquartered in Mumbai, and operating from 8 other locations, netCORE has a pan-India presence.\u003C/p\u003E\n\n\u003Cp\u003EnetCORE has a suite of products and services for digital marketing. It proudly stands at no.1 in email marketing and ranks in the top 3 in SMS services in India. Its Email Marketing suite offers access to a scalable technology platform. Mobile marketing solutions span from group SMS based solutions, mobile coupons, SMS competitions and polls, integration to back-end systems like ERP, CRM or Loyalty solutions as well as voice solutions on IVR, toll free numbers, missed calls or shortcodes and longcodes for receiving incoming messages.\u003C/p\u003E\n\n\u003Cp\u003EIts platform also includes a multi-modal response management solution that helps keep track of campaign responses across products. Marketing solutions and services are coupled with an experienced solution selling team that helps ideate on usage of the medium to get the most effective communication. Its messaging products are one-stop solutions to build the back-end infrastructure in large enterprises as well as small \u0026amp; medium-sized businesses. From Email to VPN, firewall to bandwidth management, virus protection to Spam filtering, netCORE covers it all!\u003C/p\u003E\n\n\u003Cp\u003EDuring last 14 years of its existence, netCORE has earned 2000+ enterprise associations that include some of the most noteworthy names in the country like ICICI Bank, Future Group, IDBI Bank, HDFC Bank, India Today to name a few and have innumerable proven success stories in\u003C/p\u003E\n\n\u003Cp\u003EBrief of our services that would help our client’s to cater to their customers \u0026amp; associates:\u003C/p\u003E\n\n\u003Cp\u003E Mailing Solutions (with delivery tracking, read tracking \u0026amp; click tracking also)\u003C/p\u003E\n\n\u003Cp\u003E Mobility Solutions (Reach out to your own clients, associates \u0026amp; prospects too)\u003C/p\u003E\n\n\u003Cp\u003E Voice Solutions (IVR \u0026amp; OBD\u0026#8217;s)\u003C/p\u003E\n\n\u003Cp\u003E Web Based Solutions (One India, Click.in) \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       68],
      "assets/images/resized/0024/7313/247313v2-max-150x150.jpg"],
     [[207,
       94],
      "assets/images/resized/0024/7313/247313v2-max-250x250.jpg"],
     [[207,
       94],
      "assets/images/resized/0024/7313/247313v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}