{"name": "New Vision Digital Pvt. Ltd",
 "permalink": "new-vision-digital-pvt-ltd-2",
 "crunchbase_url": "http://www.crunchbase.com/company/new-vision-digital-pvt-ltd-2",
 "homepage_url": "http://www.newvisiondigital.co/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 20,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "search-engine-marketing, brand-promotions, social-media-marketing, internet-marketing, ppc-advertising, website-design, web-development",
 "alias_list": null,
 "email_address": "info@newvisiondigital.co",
 "phone_number": "+91 9811407200",
 "description": "Digital Marketing Agency",
 "created_at": "Fri Apr 05 07:26:40 UTC 2013",
 "updated_at": "Tue Jun 04 07:52:58 UTC 2013",
 "overview": "\u003Cp\u003ENew vision Digital Pvt Ltd. is a pioneer in digital marketing solutions which includes web development, designing, SEO, link building, Pay per Click, website development, website designing, SMO, etc. providing quality web based services to start ups, small and large enterprises. We started out 3 years ago as an SEO company and have since then consistently grown to offer a gamut of services to our clients today.\u003C/p\u003E\n\n\u003Cp\u003EOur core expertise and knowledge lies in Search Engine Optimization and we understand that generating revenue is an arrangement of increasing traffic to the website and then converting those visitors into paying clients. By leveraging our experience across many sectors, we implement online tools that enable us to deliver our projects successfully on time. We implement the latest internet marketing techniques and social media campaigns to help businesses to diversify and increase their online revenues.\u003C/p\u003E\n\n\u003Cp\u003EOur team comprises of young creative minds that are committed to continually developing their skills and expertise to offer stunning results for our clients. We work closely with our clients to understand their demands and requirements and develop a business solution that deliver results for you within your budget.\u003C/p\u003E\n\n\u003Cp\u003ENew Vision Digital has a varied portfolio and some of our work speaks for themselves why we are the natural choice for businesses looking for digital marketing specialists. Our technical skills coupled with   competitive pricing provide a lucrative avenue for the business organizations struggling to strengthen or retain their foothold in the booming internet market.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       55],
      "assets/images/resized/0027/0993/270993v1-max-150x150.png"],
     [[237,
       87],
      "assets/images/resized/0027/0993/270993v1-max-250x250.png"],
     [[237,
       87],
      "assets/images/resized/0027/0993/270993v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "IIIrd Floor, C-89c",
    "address2": "Sector 8",
    "zip_code": "201301",
    "city": "Noida",
    "state_code": null,
    "country_code": "IND",
    "latitude": 12.9280047,
    "longitude": 77.5533472}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}