{"name": "New York Digital Health Accelerator",
 "permalink": "new-york-digital-health-accelerator",
 "crunchbase_url": "http://www.crunchbase.com/company/new-york-digital-health-accelerator",
 "homepage_url": "http://digitalhealthaccelerator.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "NYeHealth",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "healthcare, health-care, accelerator, incubator, venture-capital, health-it",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Health IT Accelerator",
 "created_at": "Wed Apr 25 19:31:56 UTC 2012",
 "updated_at": "Fri May 11 10:06:08 UTC 2012",
 "overview": "\u003Cp\u003EThe New York Digital Health Accelerator is a program run by the New York eHealth Collaborative and the New York City Investment Fund for early- and growth-stage digital health companies that are developing cutting edge technology products in care coordination, patient engagement, analytics and message alerts for healthcare providers.\u003C/p\u003E\n\n\u003Cp\u003EThe program’s participating providers are actively looking for new technology products that will help them effectively implement the new Health Home model, which is part of New York’s Medicaid redesign initiative. Approximately 975,000 patients with multiple chronic illnesses are being transitioned from fee-for-service to this new managed care model.\u003C/p\u003E\n\n\u003Cp\u003EProgram Features\u003C/p\u003E\n\n\u003Cp\u003E• 12 tech companies accepted into the 9 month program will receive direct mentorship and feedback from senior-level executives at a broad network of provider organizations in New York State.\u003C/p\u003E\n\n\u003Cp\u003E• The program will provide up to $300,000 of funding per company from a syndicate of leading venture capital and strategic investors.\u003C/p\u003E\n\n\u003Cp\u003E• Selected companies will have priority access to the technology platform that is connecting electronic health records across New York State, the Statewide Health Information Network of New York (SHIN-NY).\u003C/p\u003E\n\n\u003Cp\u003E• A leadership program which provides an opportunity to interact with a network of healthcare leaders, successful entrepreneurs and investors.\u003C/p\u003E\n\n\u003Cp\u003EWho Should Apply\u003C/p\u003E\n\n\u003Cp\u003E• We are interested in early- and growth-stage companies where access to clinical and technical feedback from provider organizations could have a meaningful impact on the company’s development prospects.\u003C/p\u003E\n\n\u003Cp\u003E• At a minimum, the company should have a beta version of its technology.\u003C/p\u003E\n\n\u003Cp\u003EApplications are now being accepted.  The deadline to apply is Friday, June 1, 2012.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       97],
      "assets/images/resized/0018/6020/186020v2-max-150x150.png"],
     [[250,
       161],
      "assets/images/resized/0018/6020/186020v2-max-250x250.png"],
     [[450,
       291],
      "assets/images/resized/0018/6020/186020v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}