{"name": "New Panacea Traders",
 "permalink": "new-panacea-traders",
 "crunchbase_url": "http://www.crunchbase.com/company/new-panacea-traders",
 "homepage_url": "http://www.medx4u.com",
 "blog_url": "http://www.medx4u.com/shopblogslistings.asp",
 "blog_feed_url": "http://www.medx4u.com/sitemap.xml",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "generic-viagra, generic-viagra-store, generic-viagra-pills, generic-viagra-tabs, generic-cialis",
 "alias_list": null,
 "email_address": "info@medx4u.com",
 "phone_number": "",
 "description": "Bulk Generic Drugs @ lowest rates.",
 "created_at": "Mon Sep 26 05:32:34 UTC 2011",
 "updated_at": "Sat Nov 19 05:19:42 UTC 2011",
 "overview": "\u003Cp\u003EABOUT US\u003C/p\u003E\n\n\u003Cp\u003EWhen it comes to safety, security, and reliability, www.medx4u.com is the future of the online medication business. Our Pharmacy company offers a one of a kind service that will protect you from the countless levels of Internet fraud directly affecting the online pharmaceutical industry.\u003C/p\u003E\n\n\u003Cp\u003EMedx4u is the most reliable medication provider for generic drugs without prescription including Generic Viagra. We provide the best no prescription meds and over 1000 generic products like Generic Vigra, Cialis, Generic Levitra, kamagra oral jelly, Generic Xenical, Generic Propecia and many more. All of our health care products are as effective as any other brand name medications, since they are equally safe and equally reliable.\u003C/p\u003E\n\n\u003Cp\u003EMany people put their trust in the power of branded and generic products in general, thus, www.medx4u.com escrow service guarantees that you receive nothing but the best quality and customer service. Buy medicines without prescription and get just what you are looking for from a reliable online pharmacy: superior quality products, unbeatable prices, effectiveness, safety, discretion, fast shipping, and total satisfaction guaranteed.\u003C/p\u003E\n\n\u003Cp\u003EFor www.medx4u.com, quality and customer satisfaction are the top priority, which drive us to be committed to professionalism and trust. We specialize in high quality Generic Viagra versions of the top selling brand name products.\u003C/p\u003E\n\n\u003Cp\u003Ewww.medx4u.com online pharmacy has the lowest prices to buy generic medications without prescription on the web. If you find a website that offers lower prices, we\u0026#8217;ll match that price.\u003C/p\u003E\n\n\u003Cp\u003EWe are certain that you will love the quality of the medicine and the service. If by any reason, you are not completely satisfied, we guarantee to replace your purchase. We also guarantee your delivery, meaning that if your package did not arrive in time, we will reship your order for free.\u003C/p\u003E\n\n\u003Cp\u003EWhenever you buy cheap Generic Medicines online from www.medx4u.com, we make sure to provide confidentiality and security in every purchase. We process the order using Secure Sockets Layer (SSL) protocols to protect your privacy when you use the multiple payment options available. www.medx4u.com ships all orders within 10 to 12 business.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.newpanacea.com",
    "title": "Generic Viagra"}]}