{"name": "New Organizing Inst",
 "permalink": "new-organizing-inst",
 "crunchbase_url": "http://www.crunchbase.com/company/new-organizing-inst",
 "homepage_url": "http://www.neworganizing.com",
 "blog_url": "http://neworganizingeducation.com/blog",
 "blog_feed_url": "",
 "twitter_username": "neworgnaizing",
 "category_code": "other",
 "number_of_employees": 34,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "date, tech, new-media, organizing, organizers, teaching, training, tools, elections",
 "alias_list": null,
 "email_address": "info@neworganizing.com",
 "phone_number": "",
 "description": "For Organizers, By Organizers",
 "created_at": "Fri Mar 16 14:53:58 UTC 2012",
 "updated_at": "Sat Mar 24 01:04:33 UTC 2012",
 "overview": "\u003Cp\u003EFor Organizers, By Organizers\u003C/p\u003E\n\n\u003Cp\u003EWe\u0026#8217;re a community of organizers, and we\u0026#8217;re committed to solving the biggest challenges that stand in the way of change. Our basic belief is simple: if people have the skills to engage others, the tools to build powerful campaigns, and a community of practice to help them learn and grow, they can win real change, make measurable improvements in people\u0026#8217;s lives, and restore faith in our government and our democracy.\u003C/p\u003E\n\n\u003Cp\u003EWe train organizers to build and manage effective movements by integrating tried-and-true community organizing, cutting-edge digital strategy, and data-driven decision making. We provide free access to revolutionary tools, technologies, and research to help campaigns reach the next level. And we build a community of practice that connects organizers across issues, creating a more integrated, more diverse, and more dynamic movement for change.\u003C/p\u003E\n\n\u003Cp\u003EWe\u0026#8217;re working to produce the best leaders and strongest movements of our generation. We help campaigns win today, while working to build capacity and infrastructure that will allow us to keep winning into the next generation.\u003C/p\u003E\n\n\u003Cp\u003EJoin us today\u003C/p\u003E\n\n\u003Cp\u003EWhat We Face\u003C/p\u003E\n\n\u003Cp\u003EAt its core, America is built on one transcendent principle: democracy. Ask any schoolchild, any senior, any immigrant, any conservative or progressive or anyone in between, and they will tell you that we are a nation \u0026#8220;of the people, by the people, for the people.\u0026#8221; For over 200 years, America has risen to the top of the world because of this principle. Because democracy works. On the whole, \u0026#8220;the people\u0026#8221; make better choices for themselves than any dictator, aristocracy or CEO.\u003C/p\u003E\n\n\u003Cp\u003EAmerican democracy is in trouble, and the American people know it.\u003C/p\u003E\n\n\u003Cp\u003EBut today, American democracy is in real trouble. And the American people know it. Power \u0026#8211; political, economic and cultural power \u0026#8211; has become radically concentrated in the hands of a very few. Corporate lobbyists, Wall Street and inaccessible government officials write the rules. The rest of us play by them, grudgingly. We feel locked out, unheard, powerless. We feel like we can\u0026#8217;t protect our drinking water. We have to choose between our rent and our medicine. We can\u0026#8217;t get a job, and once we do, we can\u0026#8217;t keep it from moving overseas. We see-saw from feeling resigned and cynical, to feeling righteous and outraged. From both left and right, and all points in between, we hear angry, populist shouts: \u0026#8220;I want my country back!\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EOur democracy is resilient, and we can learn from those who have come before us.\u003C/p\u003E\n\n\u003Cp\u003ERighteous anger is nothing new in America, and neither are the social movements that spring from it. Tell the story of America, and you tell of visionary leaders who organized anger into profound social change. The Founding Fathers; the Abolitionists; the Progressives; the black and brown and gay and female and disabled and countless other activists of all stripes. All started under someone\u0026#8217;s thumb, but organized social movements to stand for justice, reclaim power, and ultimately change the world forever.\u003C/p\u003E\n\n\u003Cp\u003EToday, we face no less daunting challenges than our ancestors did. But, to add to our troubles, we also face a modern cultural landscape dominated by relentless advertising, in which we, the people, are valuable only as consumers, not citizens. Too many social campaigners and politicians have bought into this landscape. They\u0026#8217;ve decided that \u0026#8220;messaging\u0026#8221; and \u0026#8220;marketing\u0026#8221; to a passive public is the only way to win. \u0026#8220;No one has time to get involved,\u0026#8221; they say. \u0026#8220;But if they see our TV ad 75 times, maybe they\u0026#8217;ll send us some money.\u0026#8221; In the field, paid canvassers replace volunteers. We resort to television attack ads, preying on our neighbor\u0026#8217;s worst fears and insecurities.\u003C/p\u003E\n\n\u003Cp\u003EWe cannot buy our way to social justice.\u003C/p\u003E\n\n\u003Cp\u003EBut we cannot, it turns out, buy our way to social justice. The opposition\u0026#8217;s pockets are far too deep. For every battle we win using marketing and money, a dozen are lost \u0026#8211; often quietly, with a whimper, in smoke filled rooms and impenetrable legal documents.\u003C/p\u003E\n\n\u003Cp\u003EHowever, just as the Founding Fathers and Civil Rights leaders blazed new paths to winning their campaigns, so too can we. Today, that new path is Engagement Organizing.\u003C/p\u003E\n\n\u003Cp\u003EWe can re-build our democracy by engaging others in creating change.\u003C/p\u003E\n\n\u003Cp\u003EEngagement Organizers start with time-tested grassroots organizing strategies, grounded in the behavioral sciences and hardened in the field. We combine these strategies with emerging online tools and technology.\u003C/p\u003E\n\n\u003Cp\u003ESocial movements have always been built through social networks \u0026#8211; friends recruiting friends, one person at a time. So the emerging \u0026#8220;social web\u0026#8221; lends itself perfectly to grassroots organizing (even though it is often mistaken for just another marketing channel). Engagement Organizers simply put the pieces together. In so doing, we help people build real democratic power \u0026#8211; power enough to overcome political foes, inertia and cynicism.\u003C/p\u003E\n\n\u003Cp\u003EOf course, winning alone isn\u0026#8217;t enough. It\u0026#8217;s the way we win that matters. Whether waging a Presidential campaign or jumpstarting a farmer\u0026#8217;s market, Engagement Organizers live by four core principles:\u003C/p\u003E\n\n\u003Cp\u003EFight. Stand up and take responsibility, not just to criticize the world, but to forge a path forward.\nEngage. Invite others to join the fight, not just as bodies or wallets, but as whole people, with brains, skills, networks, and so much more.\nLearn. Rigorously analyze what\u0026#8217;s working and what\u0026#8217;s not, and empower everyone on the campaign with that data.\nWin. Settle for nothing less than real, concrete change that measurably improves our lives.\nJoin the Community of Engagement Organizers.\u003C/p\u003E\n\n\u003Cp\u003EWe champion Engagement Organizing as a specific practice, because we believe it is our best hope to revitalize democracy \u0026#8211; to create a future where Americans can change their communities with their voice, not just change the channel with their remotes. If Engagement Organizing succeeds, it will return us to a better balance of power, where groups of principled citizens actually stand a chance against unprincipled corporations and their cronies in government.\u003C/p\u003E\n\n\u003Cp\u003EIn the constant, running battle that is democracy, Engagement Organizing is the people\u0026#8217;s new weapon \u0026#8211; a weapon wielded by skilled, visionary leaders. We invite you to join our community of Engagement Organizers, and become the leader you were meant to be.\u003C/p\u003E\n\n\u003Cp\u003ELearn with us. Share with us.Train with us.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Executive Director",
    "person":
     {"first_name": "Judith",
      "last_name": "Freeman",
      "permalink": "judith-freeman",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "1850 M st. NW #1100",
    "address2": "",
    "zip_code": "20036",
    "city": "Washington",
    "state_code": "DC",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://crooksandliars.com/kenneth-quinnell/new-organizing-institute-launches",
    "title": ""},
   {"external_url": "http://zackexley.com/category/new-organizing-institute/",
    "title": ""},
   {"external_url": "http://uppitywis.org/blogarticle/new-organizing-institute-organizing-occupation",
    "title": ""},
   {"external_url": "http://www.good.is/post/q-a-a-west-point-for-community-organizing/",
    "title": ""}]}