{"name": "NewQuest Health Solutions",
 "permalink": "newquest-health-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/newquest-health-solutions",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "(615) 291-7039 ",
 "description": "",
 "created_at": "Sun Feb 27 17:20:56 UTC 2011",
 "updated_at": "Wed Mar 30 01:39:34 UTC 2011",
 "overview": "\u003Cp\u003EAmerican Capital Invests $35 Million in Independent Managed Care Organization\nBethesda, MD - March 8, 2005 - American Capital Strategies Ltd. (Nasdaq:ACAS) announced today it has invested $35 million in NewQuest Health Solutions LLC, an independent managed care organization primarily focused on providing Medicare Advantage HMO health plans to members in Alabama, Illinois, Tennessee and Texas. American Capital\u0026#8217;s investment takes the form of senior subordinated debt and supports GTCR Golder Rauner LLC\u0026#8217;s recapitalization of NewQuest. UBS Securities LLC is providing a revolving credit facility and investing in a senior term loan. NewQuest management and existing investors in NewQuest are rolling over a significant amount of equity.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;American Capital is pleased to invest for the fourth time with GTCR, a prominent sponsor with extensive experience in the healthcare industry,\u0026#8221; said American Capital COO Ira Wagner. \u0026#8220;We are proud to support the growth of NewQuest, one of the largest and fastest growing companies in the growing Medicare HMO marketplace. We were particularly impressed with NewQuest\u0026#8217;s substantial growth in revenue, EBITDA and membership base.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EAmerican Capital invested over $2.2 billion in the last twelve months and $364 million year to date. For more information about American Capital\u0026#8217;s portfolio, click here.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;American Capital is backing an outstanding management team with significant industry experience led by Herb Fritch, one of the most talented executives in the managed care industry,\u0026#8221; said American Capital Principal Ian Larkin. \u0026#8220;Over the past four years, the management team has successfully grown NewQuest and positioned it as a market leader within its geographical niches by renegotiating hospital and Independent Provider Association contracts, enhancing core operations, focusing on medical review and case management, increasing marketing efforts, broadening its geographic coverage and aligning with physicians to better serve its member base.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;NewQuest\u0026#8217;s expertise in utilization and disease management, strong local provider networks and good relationships with state regulatory bodies, solidify its position in its space,\u0026#8221; said American Capital Vice President Demian Kircher. \u0026#8220;By leveraging its competitive advantages and capitalizing on positive industry trends fueled by growing familiarity of managed care programs, attractive demographics, continued government support and better benefit packages resulting from increased reimbursement rates, NewQuest can substantially grow its business in existing and new markets.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EMedicare HMOs contract with the Centers for Medicare and Medicaid Services, a component of the U.S. Department of Health and Human Services, to provide healthcare coverage to Medicare beneficiaries in exchange for a predetermined monthly amount per member. The Medicare Prescription Drug Benefit, Improvement and Modernization Act of 2003 established the Medicare Advantage Program, formerly Medicare+Choice, which expands the role of private plans available to Medicare beneficiaries, including regional health care plan options.\u003C/p\u003E\n\n\u003Cp\u003EBased in Nashville, TN, NewQuest is an independent managed care organization primarily focused on providing Medicare Advantage HMO health plans through a comprehensive network of physicians and hospitals. The Company offers a broad continuum of value-added healthcare services to its members, including Independent Provider Association management services, prescription drug benefits, disease management, care enhancement and high-risk health management programs, and behavioral health and substance abuse services. Founded in 2000, NewQuest has grown from a single location in Tennessee to five facilities in Tennessee, Alabama, Illinois and Texas, serving over 100,000 beneficiaries in 60 counties and employing nearly 700. NewQuest operates four leading Medicare Advantage health plan providers: Tennessee HealthSpring, Alabama HealthSpring, HealthSpring of Illinois and Texas HealthSpring. In 2004, NewQuest was named one of Tennessee\u0026#8217;s Top 100 Companies by Business Tennessee. Also, in 2003, Nashville Business Journal awarded NewQuest one of its \u0026#8220;Best In Business\u0026#8221; Awards. Over the last four years, NewQuest has grown sales at approximately 61%, annualized, and recorded sales of over $600 million in 2004.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Having worked with American Capital in previous investments, we were very comfortable turning to them again for mezzanine financing,\u0026#8221; said GTCR Vice President Peter Stavros. \u0026#8220;The financial capabilities of American Capital, combined with the Company\u0026#8217;s exceptional staff, make them an ideal partner for GTCR. With the combined support of all investors, NewQuest can execute its growth initiatives and continue to deliver high quality healthcare benefits and services to a rapidly growing population.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EABOUT AMERICAN CAPITAL\u003C/p\u003E\n\n\u003Cp\u003EAmerican Capital is a publicly traded buyout and mezzanine fund with capital resources of more than $4.9 billion. American Capital is an investor in and sponsor of management and employee buyouts, invests in private equity buyouts, and provides capital directly to private and small public companies. American Capital provides senior debt, mezzanine debt and equity to fund growth, acquisitions and recapitalizations.\u003C/p\u003E\n\n\u003Cp\u003EAs of February 28, 2005, American Capital shareholders have enjoyed a total return of 348% since the Company\u0026#8217;s IPO - an annualized return of 22%, assuming reinvestment of dividends. American Capital has paid a total of $651 million in dividends and paid or declared $16.76 dividends per share since its August 1997 IPO at $15 per share.\u003C/p\u003E\n\n\u003Cp\u003ECompanies interested in learning more about American Capital\u0026#8217;s flexible financing should contact Mark Opel, Senior Vice President, Business Development, at (800) 248-9340, or visit our website.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0012/8139/128139v2-max-150x150.png"],
     [[248,
       95],
      "assets/images/resized/0012/8139/128139v2-max-250x250.png"],
     [[248,
       95],
      "assets/images/resized/0012/8139/128139v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "44 Vantage Way Ste 300 ",
    "address2": "",
    "zip_code": "37228",
    "city": "Nashville",
    "state_code": "TN",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}