{"name": "Nextappmedia.com",
 "permalink": "nextappmedia-com",
 "crunchbase_url": "http://www.crunchbase.com/company/nextappmedia-com",
 "homepage_url": "http://www.nextappmedia.com",
 "blog_url": "http://www.nextappmedia.com",
 "blog_feed_url": "http://www.nextappmedia.com",
 "twitter_username": "nextappmedia",
 "category_code": "mobile",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "app, mobile, mobile-app, iphone, android, blackberry, ipad, windows-phone, app-developer, app-development, mobile-developer, uk-app-developer, london-app-developer",
 "alias_list": null,
 "email_address": "info@nextappmedia.com",
 "phone_number": "02081237223",
 "description": "App Development Broker",
 "created_at": "Wed Dec 05 16:27:44 UTC 2012",
 "updated_at": "Wed Dec 12 08:09:41 UTC 2012",
 "overview": "\u003Cp\u003EABOUT NEXTAPPMEDIA.COM\nNextappmedia.com matches and connects businesses and entrepreneurs with high quality mobile app development agencies located within the UK, based on a careful understanding of each client’s individual app project requirements and constraints. Our mission is to assist each client in successfully sourcing a mobile agency that delivers their app project on time, on budget and to specification. Avoid the mess of searching the internet or navigating large, fragmented online marketplaces. We’ve done the hard work so you don’t have to. We know the ins and out of the developer community here in the UK, and we know which agencies have the capabilities to meet your individual requirements in a professional manner. There is no charge to clients for using the Nextappmedia.com service. We do however charge successful supplier agencies a % based on gross margins.\u003C/p\u003E\n\n\u003Cp\u003ECLIENTS WE ARE ABLE TO SERVICE\nGenerally speaking our services are aimed at financially committed clients who have firm ideas about what kind of mobile app they wish to achieve. Clients with no budget or who are looking for revenue sharing or equity deals may be better suited using other available services in the marketplace. The following categories represent the typical clients we look to service:\u003C/p\u003E\n\n\u003Cp\u003E Established Businesses\nEstablished businesses looking to bring their marketing and customer reach to the next level through the integration of mobile applications into their overall marketing program. \nEstablished businesses looking to create an app to enhance their business or employee productivity.\n Entrepreneurs\nEntrepreneurs building app based businesses / projects who are looking to outsource their mobile app development.\n Organisations\nEducational, government, not for profit, or other community organisations looking to build an app to better serve their user base.\n Marketing \u0026amp; Digital Agencies\nMarketing and other digital agencies who do not have an in-house app development team available can use us to match their clients and projects with the most suitable app development specialists in the UK.\n Business Consultants\nBusiness consultants, investors or other advisors can use our services to better match their clients with suitable mobile app firms within the UK.\n App Development Firms\nMobile app agencies who do not currently have the capabilities or time available to service a client lead can use our services to refer that client to a suitable app developer based within the UK.\u003C/p\u003E\n\n\u003Cp\u003EHOW IT WORKS\nEvery app project submitted to us is assigned a dedicated App Advisor who can provide assistance in translating your mobile app and business requirements into more technical or structured specifications. Your assigned App Advisor will aim to match and connect you with 3 to 6 firms from our supplier network, however this may vary in accordance with the scope of your project. Selected agencies will then provide you with a professional preliminary quote and outline of their services tailored to your project requirements.\u003C/p\u003E\n\n\u003Cp\u003EOUR SUPPLIER NETWORK\nOur supplier base comprises the largest specialised network of mobile application developers and related service agencies based in the UK. All developers and specialists are pre-screened and credentialed to ensure only high quality, credible firms with a history of app services and products in the market place are included within our supplier network. Our supplier network provides services across the full range of popular mobile and tablet app platforms, including both native and web browser based apps. Our supplier network does not generally include freelancers.\u003C/p\u003E\n\n\u003Cp\u003ETHE NEXT STEPS\nIf you wish to use our services or find out more information please feel free to contact us using the enquiry form here: http://nextappmedia.com/contact-us, or email us at clients@nextappmedia.com.\nAlternatively contact us on twitter or facebook.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0022/4009/224009v2-max-150x150.png"],
     [[193,
       52],
      "assets/images/resized/0022/4009/224009v2-max-250x250.png"],
     [[193,
       52],
      "assets/images/resized/0022/4009/224009v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Managing Director",
    "person":
     {"first_name": "Aaron",
      "last_name": "Garry",
      "permalink": "aaron-garry",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "70 Franciscan Rd",
    "address2": "",
    "zip_code": "SW178EQ",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.4305665,
    "longitude": -0.1561575}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        98],
       "assets/images/resized/0022/4008/224008v2-max-150x150.png"],
      [[250,
        163],
       "assets/images/resized/0022/4008/224008v2-max-250x250.png"],
      [[450,
        294],
       "assets/images/resized/0022/4008/224008v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}