{"name": "nextGRID",
 "permalink": "nextgrid",
 "crunchbase_url": "http://www.crunchbase.com/company/nextgrid",
 "homepage_url": "http://www.nextgrid.my",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": 7,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software-development, software-testing, fixed-mobile-convergence, mobile-apps, web-apps, network-apps, drm",
 "alias_list": null,
 "email_address": "info@nextgrid.my",
 "phone_number": "+603 6207 5714",
 "description": "Software Development and Testing",
 "created_at": "Wed Feb 08 19:22:43 UTC 2012",
 "updated_at": "Fri Feb 10 05:30:30 UTC 2012",
 "overview": "\u003Cp\u003EnextGRID sdn bhd provides a professional software development, software testing and outsourcing services to leading companies.  We provides enterprise solutions in web, mobile, and network application solutions. We have serve and support business in ASEAN and Middle East countries.  The Company leverages it strategic advantage from our talented team selected worldwide and their ability has been proven from many successful projects. \u003C/p\u003E\n\n\u003Cp\u003EBanking on our experience and versatile industry intelligence, we provide solutions that streamline business process and galvanize enterprise productivity.  With well-structured development methodologies, Global Delivery Model and rigid QA systems, we deliver business-critical solutions on-time, within budgets and within desired levels of performance.\u003C/p\u003E\n\n\u003Cp\u003EnextGRID\u0026#8217;s Application Development Services help customer balance costs, boost service levels and improve productivity through robust management of flexible, high-performance, business-critical applications. Leveraging the best-of-technologies and practices, we ensure that your business applications are developed, maintained and managed within optimal costs and agreeable time-frames to provide you secure and risk-free business environments. \u003C/p\u003E\n\n\u003Cp\u003EWith Mobile technology taking center stage in today\u0026#8217;s world, the company have made significant advancements in the mobile space. As mobile technology keeps the customers stay connected for almost all the time, enterprises are moving beyond the desktop world to keep attuned to their customer\u0026#8217;s needs.\u003C/p\u003E\n\n\u003Cp\u003EnextGRID offers mobile apps solutions that help organizations to communicate with their customers through smartphone and tablet. Leveraging on our experiences, we design and build user friendly and effective usage mobile apps.\u003C/p\u003E\n\n\u003Cp\u003EHaving worked across a spectrum of verticals, nextGRID brings the depth and breadth of its technological expertise and industry intelligence to its product development table. We adopt a holistic approach to product development, taking into account the current and possible future needs of businesses and organizations. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       52],
      "assets/images/resized/0017/3569/173569v2-max-150x150.png"],
     [[250,
       87],
      "assets/images/resized/0017/3569/173569v2-max-250x250.png"],
     [[340,
       119],
      "assets/images/resized/0017/3569/173569v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "CEO",
    "person":
     {"first_name": "Mohamad",
      "last_name": "Fathullah Hashim",
      "permalink": "mohamad-fathullah-hashim",
      "image": null}},
   {"is_past": true,
    "title": "Executive Director, Project Development",
    "person":
     {"first_name": "Mumtazah",
      "last_name": "Mustajab",
      "permalink": "mumtazah-mustajab",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "26-1 Jalan Wangsa Setia 4",
    "address2": "Wangsa Melawati",
    "zip_code": "53300",
    "city": "Kuala Lumpur",
    "state_code": null,
    "country_code": "MYS",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}