{"name": "Nexus Garments",
 "permalink": "nexus-garments",
 "crunchbase_url": "http://www.crunchbase.com/company/nexus-garments",
 "homepage_url": "http://www.indiamart.com/nexus-garments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "nexus-garments@tradepassport.org",
 "phone_number": "9843095666",
 "description": "manufacturer, supplier and exporter",
 "created_at": "Fri Apr 05 05:46:41 UTC 2013",
 "updated_at": "Fri Apr 05 05:46:44 UTC 2013",
 "overview": "\u003Cp\u003ENexus Garments is a partnership based business venture, which came into existence in their year 2007 at Tiruppur, Tamil Nadu. We are one of the most experienced manufacturer, supplier and exporter engaged in offering an excellent collection of Women\u0026#8217;s Wear, Men\u0026#8217;s Wear, Men\u0026#8217;s T-Shirts, Infant Wear and Kids Wear.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure\u003C/p\u003E\n\n\u003Cp\u003EWe have over the years been able to build superior infrastructure facility at Tiruppur, Tamil Nadu in order to ensure that our business activities are carried out in a planned manner. State- of- the-art machinery has been incorporated which helps us offer and produce products which are meant to perform as per the expectations of our clients. Our premises are bifurcated into different departments so as to further boost the activities and ensure a hassle free environment.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nAt Nexus Garments , we focus to design and develop high-end quality products for our clients which is at par with the global standards. All our products are made to go through stringent checks which ensures that the products which we offer are defect free. The quality control policies which we adhere to are appreciated across various market domains across the country. Our quality controllers are vigilant during entire manufacturing, procurement and various other processes to ensure that the products offered are defect free.\u003C/p\u003E\n\n\u003Cp\u003EWarehousing and Packaging:\nWe have an dedicated area for warehousing and packaging which has been incorporated with latest technologies which enables us to store our products in the best manner. Our categorical approach towards various aspects of the overall manufacturing process is commendable and the experience which we have gained in the industry is reflected in our ability to store our products for a long period. The packaging system is such that the complete process has been developed along the lines of set industrial standards.  \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have been in this business for long time and have always catered to the needs of the clients with utmost precision. The competitive styles that we offer have been delivered to the customers after a great deal of experience which is reflected in our products as well. Our modern manufacturing facilities and qualified professionals enable us to cater to the specific requirements of the clients in the most appropriate manner.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8282/248282v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8282/248282v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8282/248282v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}