{"name": "NH School of Management and Technology",
 "permalink": "nh-school-of-management-and-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/nh-school-of-management-and-technology",
 "homepage_url": "http://nhsmtindia.com",
 "blog_url": "http://nhsmt.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mba, bbm, bba, bsc-it, iim-alumni, iim, higher-education, ccie, ccna, ccnp, cisco, networkers-home, career, courses-user-experience, website, user-interface, ui, online-marketing, marketing",
 "alias_list": null,
 "email_address": "nhsmt3@gmail.com",
 "phone_number": "08049014703",
 "description": "Initiative by IIM grads ",
 "created_at": "Fri May 11 12:48:04 UTC 2012",
 "updated_at": "Wed May 23 14:10:10 UTC 2012",
 "overview": "\u003Cp\u003ENH School of Management \u0026amp; Technology (NHSMT) is a part of Networkers Home group of companies. Networkers Home, headed by its founder \u0026amp; CEO, Mr. Vikas Swami, is now the best CISCO training provider in the world. It is based on the vision of its founder and management team, comprising IIM alumni who share a passion and deep desire to improve the standards of BBM and MBA education in our country at all levels.\u003C/p\u003E\n\n\u003Cp\u003ENHSMT offers professional undergraduate and postgraduate courses in business management (BBM, MBA) with super specialization in IT and media. It runs on the simple philosophy of innovative learning. We at NHSMT feel that even though India has a large number of colleges providing higher education in every nook and corner of the country, only a few of them impart quality education. Barring the IIMs, there are not enough institutes imparting quality MBA education.\u003C/p\u003E\n\n\u003Cp\u003EWe at NHSMT are here to change the landscape of professional education and we intend to do so by providing the students, an excellent learning environment, combining the best of educational tools and practices employed worldwide and making innovation and leadership an integral part of learning. The dedicated placement cell of NHSMT would also ensure top placements and attractive salaries for all our students. The MBA placements offered at NHSMT would be amongst the best in industry.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}