{"name": "Niagara Conservation",
 "permalink": "niagara-conservation",
 "crunchbase_url": "http://www.crunchbase.com/company/niagara-conservation",
 "homepage_url": "http://www.niagaraconservation.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "NiagaraCnsvtion",
 "category_code": "other",
 "number_of_employees": 100,
 "founded_year": 1977,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-conservation, energy-conservation, conservation, sustainability, bill-cutler, environment, manufacturer, toilet, showerhead, aerator, toilets, showerheads, aerators, light-bulbs, utilities, utility, high-efficiency, weatherization, water, energy, gr",
 "alias_list": null,
 "email_address": "info@niagaraconservation.com",
 "phone_number": "8008318383",
 "description": "Water Conservation Products Manufacturer",
 "created_at": "Mon Jan 14 16:51:34 UTC 2013",
 "updated_at": "Thu Jan 17 07:54:10 UTC 2013",
 "overview": "\u003Cp\u003ENiagara Conservation Corporation is a manufacturer of water and energy conservation products engineered to maximize efficiency while still maintaining optimal performance.\u003C/p\u003E\n\n\u003Cp\u003ENiagara’s commitment to conservation and quality extends to its vast product line, including: the Stealth® UHET 0.8 GPF toilet, Niagara Flapperless™ low-flow toilets, a complete line of showerheads and faucet aerators with patented pressure compensator, high-efficiency lighting products and various weatherization materials.\u003C/p\u003E\n\n\u003Cp\u003ENiagara also has expertise in the planning, development and management of energy efficiency programs for the nation\u0026#8217;s leading electric, natural gas and water utility companies. Scores of government leaders, energy management officials and community-based conservation directors have called on Niagara to help customize their programs with innovative, turn-key conservation solutions.\u003C/p\u003E\n\n\u003Cp\u003ERecognizing the environmental and financial benefits of water conservation, William Cutler, driven by a vision to manufacture products that save natural resources, founded Niagara in 1977. The company began its product line by manufacturing low-flow showerheads called the “Niagara showerhead,” as well as other residential weatherization products for the newly-developing utility conservation program market.\u003C/p\u003E\n\n\u003Cp\u003ESince then, Niagara’s commitment to the development and production of innovative, reliable and affordable efficiency products has enabled the company to grow to a multi-million dollar organization. The corporate office is located in Fort Worth, Texas with satellite offices around the world including: Asia, Latin America, and the Middle East.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0022/9636/229636v2-max-150x150.jpg"],
     [[250,
       50],
      "assets/images/resized/0022/9636/229636v2-max-250x250.jpg"],
     [[450,
       90],
      "assets/images/resized/0022/9636/229636v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}