{"name": "nifo",
 "permalink": "nifo",
 "crunchbase_url": "http://www.crunchbase.com/company/nifo",
 "homepage_url": "http://www.nifo.com/",
 "blog_url": "http://blog.nifo.com/",
 "blog_feed_url": "http://blog.nifo.com/",
 "twitter_username": "NifoSphinx",
 "category_code": "web",
 "number_of_employees": 18,
 "founded_year": 2012,
 "founded_month": 2,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-media-management, digital-media, social-media-integration, twitter, facebook, email-integration, aggregated-social-operating-environment",
 "alias_list": null,
 "email_address": "info@nifo.com",
 "phone_number": "",
 "description": "global web technology digital media ",
 "created_at": "Thu Oct 25 14:35:14 UTC 2012",
 "updated_at": "Wed Dec 12 07:21:45 UTC 2012",
 "overview": "\u003Cp\u003Enifo is the creator of the world’s first Social Web Operating Environment (WOE), Sphinx. \u003C/p\u003E\n\n\u003Cp\u003EBased in New York City, nifo is a privately held, global web technology and digital media firm, developing products and technologies for consumers, professionals and small to medium size businesses. nifo holds six provisional patents on technologies that underlie the Sphinx platform. nifo’s flagship product, Sphinx combines emerging web applications and real life applications in a new and innovative way. \u003C/p\u003E\n\n\u003Cp\u003EThe private beta launch of Sphinx was in October 2012. This aggregated browser based Social Operating Environment combines a new generation of email client, rich media manager, social media management tools and an embedded HTML5 rich media player. Sphinx addresses many of the issues associated with users’ (professional or small business) inability to simplify marketing and community engagement. While Social Media and advancements in digital media, music, video and content management are expanding horizons for professionals and small businesses, they also present a challenge to users due to their complexity, lack of transparency and poor ROI. Even the largest, most established brands struggle with new complications associated with social media and brand management. nifo Holdings recognizes the user’s search for high yielding ROI and believes that introducing the new web and social operating environment, Sphinx, holds the answer. The nifo strategy is to simplify and enhance user experience by integrating and automating many of the functions that social users’ desire.\u003C/p\u003E\n\n\u003Cp\u003ESphinx allows users to operate and use products in multiple ways, while keeping their business and personal needs at their core. Working online will be simplified and integrated, resulting in a faster, simpler and more manageable user experience.\u003C/p\u003E\n\n\u003Cp\u003EThe Sphinx platform offers a unique integrated social media and web operating platform that comprises of a new generation of email client, rich media manager and social media management tools. It also includes the browser-based media player ‘Sphinx Eye’. All components and apps are referred to as ‘Sphinx Pearls’ and are securely integrated into one HTML5 based platform, allowing registered users maximum flexibility, high productivity and Social Media Network integration points. Additionally, Sphinx profile settings allow users to customize all features of the platform, including external profiles and ‘personas’ available in later releases.\u003C/p\u003E\n\n\u003Cp\u003ESphinx Mail provides powerful email and social media integration functions and features, such as list management, contact management, social media management and social aggregation. More advanced features will further automate functions related to running email marketing based campaigns right from the email client. Business users will enjoy a ‘one-stop marketing platform’ in the near future. \nSphinx Social provides key Social Media Management tools which are embedded into the platform. These tools will not only allow users to share email-based content via social networks, but they will also provide basic analytics information and functions related to integration of mail and social components. \u003C/p\u003E\n\n\u003Cp\u003ESphinx Gala is at the heart of the Sphinx Social Web Operating Platform – a browser-based rich media repository, capable of managing audio, video, image and personal data collections. Sphinx Gala is integrated with well-known socially aware rich media services such as Spotify, Pandora, YouTube and Vimeo, amongst others. Sphinx Gala can interpret and manage over 100 audio, video and personal data formats. One unique feature of Sphinx Gala is that it is integrated with Sphinx Mail, allowing users to manage their email attachments and to seamlessly integrate their email and media search functions. Sphinx Gala also manages users’ media playlists, while offering detailed information related to performers, lyrics, history, and other data that may be of interest. \u003C/p\u003E\n\n\u003Cp\u003EThe latest product to be launched from the nifo R\u0026amp;D Center is Sphinx Eye. This rich media player is available due to the recent development of HTML5 technology and is completely integrated into any web browser based environment. This feature enables users to choose where to position the player in their browser window. Sphinx Eye is an all-inclusive media player that can read, integrate and manage hundreds of rich media formats, while helping users with format conversion tools. nifo has successfully demonstrated that it can develop an innovative product, as well as package it as both a stand-alone product and by embedding the technology into a digital media platform. This was all achieved in a record time of weeks, not months. Sphinx Eye is the core technology behind Sphinx Gala and other components of the Sphinx platform. \nSphinx Eye can be used as a stand-alone desktop product or users can embed the product in their current web browser.  \u003C/p\u003E\n\n\u003Cp\u003Enifo has invested heavily into Research and Development (R\u0026amp;D) and will continue to bring exciting new products and innovative, cutting-edge features to the market. nifo’s vision is to combine the ease of use and unique user experience with progressive web and social media technologies, allowing users maximum flexibility, savings in time and increased productivity.  \u003C/p\u003E\n\n\u003Cp\u003ENew products are also essential in driving ROI for partners, investors and individual clients. Therefore R\u0026amp;D is extremely important to nifo as the aim is to continue developing pioneering products, product marketing and the integration of products and features that are not currently available on the market. nifo will be introducing more unique features related to media management, advertising, promotion and integration with other components within the platform and as stand-alone products. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       112],
      "assets/images/resized/0021/7181/217181v2-max-150x150.jpg"],
     [[250,
       187],
      "assets/images/resized/0021/7181/217181v2-max-250x250.jpg"],
     [[450,
       337],
      "assets/images/resized/0021/7181/217181v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder and Chief Creative Officer ",
    "person":
     {"first_name": "Timur",
      "last_name": "Khabirov",
      "permalink": "timur-khabirov",
      "image": null}},
   {"is_past": false,
    "title": "Chief Marketing Adviser",
    "person":
     {"first_name": "Alex",
      "last_name": "Romanovich",
      "permalink": "alex-romanovich",
      "image": null}},
   {"is_past": false,
    "title": "Executive Vice President",
    "person":
     {"first_name": "Alexsander",
      "last_name": "Kozlovski",
      "permalink": "alexsander-kozlovski",
      "image": null}},
   {"is_past": false,
    "title": "Managing Director",
    "person":
     {"first_name": "Mark",
      "last_name": "A. Suleman",
      "permalink": "mark-a-suleman",
      "image": null}},
   {"is_past": false,
    "title": "Director, Motion Graphics and 3D-Design",
    "person":
     {"first_name": "Alexei",
      "last_name": "Karyshnikov",
      "permalink": "alexei-karyshnikov",
      "image": null}},
   {"is_past": false,
    "title": "Digital and Social Media Coordinator ",
    "person":
     {"first_name": "Khrystsina",
      "last_name": "Tryboi",
      "permalink": "khrystsina-tryboi",
      "image": null}},
   {"is_past": false,
    "title": "Chief Information Officer",
    "person":
     {"first_name": "Andrey",
      "last_name": "Grubin",
      "permalink": "andrey-grubin",
      "image": null}},
   {"is_past": false,
    "title": "Director, Information Architecture ",
    "person":
     {"first_name": "Patrick",
      "last_name": "Argast",
      "permalink": "patrick-argast",
      "image": null}},
   {"is_past": false,
    "title": "Digital and Social Media Coordinator ",
    "person":
     {"first_name": "Abe",
      "last_name": "Garcia",
      "permalink": "abe-garcia",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "nifo Holdings, LLC ",
    "address2": "2719 Coney Island Avenue, ",
    "zip_code": " 11235 ",
    "city": "Brooklyn",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": 40.5860069,
    "longitude": -73.9418603}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        112],
       "assets/images/resized/0021/7178/217178v2-max-150x150.jpg"],
      [[250,
        187],
       "assets/images/resized/0021/7178/217178v2-max-250x250.jpg"],
      [[450,
        337],
       "assets/images/resized/0021/7178/217178v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        112],
       "assets/images/resized/0021/7179/217179v2-max-150x150.jpg"],
      [[250,
        187],
       "assets/images/resized/0021/7179/217179v2-max-250x250.jpg"],
      [[450,
        337],
       "assets/images/resized/0021/7179/217179v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        112],
       "assets/images/resized/0021/7180/217180v2-max-150x150.jpg"],
      [[250,
        187],
       "assets/images/resized/0021/7180/217180v2-max-250x250.jpg"],
      [[450,
        337],
       "assets/images/resized/0021/7180/217180v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.prweb.com/releases/2012/10/prweb10046000.htm",
    "title": "Press Release"}]}