{"name": "NJ System",
 "permalink": "nj-system",
 "crunchbase_url": "http://www.crunchbase.com/company/nj-system",
 "homepage_url": "http://www.indiamart.com/njsystemcontrols/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "njsystemcontrols@tradepassport.org",
 "phone_number": "",
 "description": "Manufacturer and Supplier",
 "created_at": "Thu Apr 04 08:13:54 UTC 2013",
 "updated_at": "Thu Apr 04 08:14:01 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2007, at New Delhi, (India), we, “N.J. System Controls,” are recognized as the prominent Manufacturer and Supplier of a broad assortment of Cubical Wall Panel, Floor Type Panel, AMF panel, Control Panel, Meter Board, Distribution Board, etc. Our exclusive range includes Power Factor Maintenance, Rising Mains, ACB Panels, AMF Panels, PLC Control Panels, Delta and Star Starter Panels, Power Controls, DOL Starter Panels, AC Low Voltage Switch Board Panels, Boiler Control, Industrial Electrical Panels, Meter Panels, Electrical Panels, MCC Panels, Distribution Panels, Distribution Control Panels, etc. These products are manufactured and designed under the guidance of skilled team of professionals using high grade raw materials and latest technology in accordance with international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\u003C/p\u003E\n\n\u003Cp\u003EManufacturer and Supplier of a broad assortment of Cubical Wall Panel, Floor Type Panel, AMF panel, Control Panel, Meter Board, Distribution Board, etc. Our exclusive range includes Power Factor Maintenance, Rising Mains, ACB Panels, AMF Panels, PLC Control Panels, Delta and Star Starter Panels, Power Controls, DOL Starter Panels, AC Low Voltage Switch Board Panels, Boiler Control, Industrial Electrical Panels, Meter Panels, Electrical Panels, MCC Panels, Distribution Panels, Distribution Control Panels, etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\u003C/p\u003E\n\n\u003Cp\u003EWe offer our valuable clients a high quality array of products that is manufactured using high grade raw material and advanced technology in our well-developed manufacturing unit. At our organization, the entire production process is strictly monitored by our expert quality analysts who have in-depth knowledge in this domain.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\u003C/p\u003E\n\n\u003Cp\u003EOwing to the efforts of our talented and skilled teams of professionals, we have earned reputation in the field of manufacturing and supplying the superior quality products. In-depth domain expertise, knowledge and rich industry experience have enabled us to meet the various requirements of the market as well as of our precious clients in the most efficient manner.\u003C/p\u003E\n\n\u003Cp\u003EManufacturing Facilities:\u003C/p\u003E\n\n\u003Cp\u003EOwing to our sophisticated manufacturing unit, we manufacture authentic range of Energy saving \u0026amp; Electrical LT panels that are known fro their qualitative features. Our high technology manufacturing machines helps us to meet the bulk requirements of the clients with in the given time frame.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\u003C/p\u003E\n\n\u003Cp\u003EWe offer high quality Cubical Wall Panel, Floor Type Panel, AMF panel, Control Panel, Meter Board, Distribution Board, etc. Owing to the high quality standards, we have been able to carve a niche in this competitive market.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\u003C/p\u003E\n\n\u003Cp\u003EAs one of the renowned company, in this domain we have been able to provide the highest level of satisfaction by providing our esteemed clients with supreme quality products within the stipulated time frame. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       114],
      "assets/images/resized/0024/7666/247666v2-max-150x150.jpg"],
     [[250,
       191],
      "assets/images/resized/0024/7666/247666v2-max-250x250.jpg"],
     [[250,
       191],
      "assets/images/resized/0024/7666/247666v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}