{"name": "NK Subbiah",
 "permalink": "nk-subbiah",
 "crunchbase_url": "http://www.crunchbase.com/company/nk-subbiah",
 "homepage_url": "http://www.indiamart.com/nkss-sons/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "nkss-sons@tradepassport.org",
 "phone_number": "9845010375",
 "description": "manufacturing, exporting and supplying",
 "created_at": "Fri Apr 05 12:13:38 UTC 2013",
 "updated_at": "Fri Apr 05 12:13:41 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1932, “N. K. Subbiah Setty \u0026amp; Sons” is a reputed manufacturer, exporter and supplier of a wide range of Agarbattis, Incense Sticks, Sambranis, Dashangas and Perfume Sachets. These Agarbattis are made using superior quality natural materials and herbs. Our product range is recognized in the market for high quality and long shelf life.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have built an ultra modern infrastructure which sprawled over a large area. The unit has all kinds of modern machinery and tools that are needed for our operations. In order to perform the different tasks in streamlined manner, we have segregated our infrastructure into different departments.  \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur workforce is a group of enthusiastic and talented professionals that work with utmost dedication and perfection. Our team consists of experienced procuring agents, quality controllers, storekeepers, packaging professionals and skilled labor. All the professionals of our team are well aware of the latest market trends and serve the clients efficiently. The professionals of our team work in proximity and complete the allotted task on time. We keep organizing training sessions at regular intervals to enhance the skills and knowledge of our team.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nBeing quality-conscious organization, we strongly believe in delivering highest quality Agarbattis, Incense Sticks, Sambranis, Dashangas and Perfume Sachets in the market. We follow strict quality management system and have developed a sophisticated quality testing unit to maintain consistency in the quality of our products. High quality natural ingredients are procured from the selected vendors of the market that are used to produce our products.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur organization is instrumental in manufacturing, supplying and exporting a wide assortment of Agarbattis. Entire range of these products is made by utilizing best quality ingredients that offers soothing fragrance. We offer our products in varied fragrances and in different sealed packaging. The offered products are provided at reasonable prices and are delivered on time. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8632/248632v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8632/248632v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8632/248632v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}