{"name": "Noble Tiles",
 "permalink": "noble-tiles",
 "crunchbase_url": "http://www.crunchbase.com/company/noble-tiles",
 "homepage_url": "http://www.indiamart.com/nobletiles/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fly-ash-aac-equipment, aac-machine, industrial-track",
 "alias_list": null,
 "email_address": "nobletiles@tradepassport.org",
 "phone_number": "9377768303",
 "description": "manufacturer of AAC Machine",
 "created_at": "Thu Apr 04 06:00:22 UTC 2013",
 "updated_at": "Thu Apr 04 06:00:34 UTC 2013",
 "overview": "\u003Cp\u003EIncorporated in the year 2009, we, “Noble Tiles”, are counted amongst the apex organizations which are engaged in manufacturing and supplying of a remarkable gamut of Fly Ash AAC Equipment, AAC Machine, Fly Ash Tank, Industrial Track, Industrial Trolley and Steam Boiler. Offered range encompasses Manual Spiral Gate Valve, Slurry Mixer, Autoclave, Fly Ash Screw Conveyor and Air Compressor. In addition to this, we are providing AAC Block Cutting Machine, Slurry Material Mixing Machine, Fly Ash Material Tank and Cement Tank. All these products are engineered by our highly adroit professionals in accordance with the market demands. Therefore, we manufactured the offered products with ultra-grade components, tools and other required raw material. Our professionals implemented latest technologies to manufacture these products so as to ensure their excellent functionality and suitability for industrial applications.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nManufacturing and supplying of a remarkable gamut of Fly Ash AAC Equipment, AAC Machine, Fly Ash Tank, Industrial Track, Industrial Trolley and Steam Boiler. Offered range encompasses Manual Spiral Gate Valve, Slurry Mixer, Autoclave, Fly Ash Screw Conveyor and Air Compressor. In addition to this, we are providing AAC Block Cutting Machine, Slurry Material Mixing Machine, Fly Ash Material Tank and Cement Tank. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a team of diligent professionals which enabled us to manufacture and supply a commendable array of Fly Ash AAC Equipment, AAC Machine, Fly Ash Tank, Industrial Track, Industrial Trolley and Steam Boiler.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe are committed to bring quality in all the products offered by us. Ours is a quality-centric manufacturer and supplier of Fly Ash AAC Equipment, AAC Machine, Fly Ash Tank, Industrial Track, Industrial Trolley and Steam Boiler.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       120],
      "assets/images/resized/0024/7562/247562v2-max-150x150.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7562/247562v2-max-250x250.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7562/247562v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}