{"name": "NOEX",
 "permalink": "noex",
 "crunchbase_url": "http://www.crunchbase.com/company/noex",
 "homepage_url": "http://www.reklame-noex.dk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 150,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "noex",
 "alias_list": null,
 "email_address": "brother1124@gazeta.pl",
 "phone_number": "48618108815",
 "description": "NOEX",
 "created_at": "Wed Nov 28 07:14:06 UTC 2012",
 "updated_at": "Mon Dec 03 06:53:16 UTC 2012",
 "overview": "\u003Cp\u003EWelcome,\nWe are an international company, the largest producer in Europe, producing promotional materials, gadgets and all kinds of products for everyday use. We rely on the materials of the highest quality, we do not allow ourselves to ignore the customer. We are perfectly harmonious team of people who do what they do, they do with passion. We started our company many years ago, so we have gained invaluable and necessary market experience in the industry in which we operate. In the work we put all his heart and so much more. We work in harmony with ecology, using the latest technology, machinery, materials. Working atmosphere in our \u0026#8220;company\u0026#8221; is healthy and promotes creative thinking, so that day by day the roziwjamy and expanding our horizons and expand business. We want to be the best and strive to do so. Achieve their goals sooner or later. Group of people working with us are qualified with relevant education and experience. All orders are made wczasie without slipping. We appreciate the openness and flexibility in dealing with our customers. We respect the work and mind their own business partners. We encourage you to familiarize yourself with our offer and use our professional services! We have many satisfied customers who have benefited from our products. Currently entering the Danish market, so it\u0026#8217;s highly recommended. Our motto is: act firmly and professionally, not boring and banal. Refer to your offer, please visit our website and contact us. Enjoy!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[94,
       150],
      "assets/images/resized/0022/2709/222709v2-max-150x150.png"],
     [[157,
       250],
      "assets/images/resized/0022/2709/222709v2-max-250x250.png"],
     [[177,
       281],
      "assets/images/resized/0022/2709/222709v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}