{"name": "Noitavonne",
 "permalink": "noitavonne",
 "crunchbase_url": "http://www.crunchbase.com/company/noitavonne",
 "homepage_url": "http://www.noitavonne.com",
 "blog_url": "http://2012tabletcomparison.blogspot.com/",
 "blog_feed_url": "http://feeds.feedburner.com/2012TabletComparison",
 "twitter_username": "noitavonne",
 "category_code": "hardware",
 "number_of_employees": 16,
 "founded_year": 2009,
 "founded_month": 11,
 "founded_day": 23,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "emerging-tech-company, startups, mobile, wireless, tablets, smartphones",
 "alias_list": null,
 "email_address": "admin@noitavonne.com",
 "phone_number": "(713) 660-6648",
 "description": "Mobile Device Manufacturer",
 "created_at": "Mon Oct 22 20:01:41 UTC 2012",
 "updated_at": "Fri Oct 26 18:36:19 UTC 2012",
 "overview": "\u003Cp\u003ENoitavonne™, Inc. is a broad based technology application company with emphasis placed on mobile device manufacturing and the promotion of its proprietary technology. IP “Loop Connectivity Protocol” provides a platform for its implementation with both consumers and enterprise clients as its end users while specializing in providing an excellent customer experience. Noitavonne™ is the answer to increasing demand. The public and private sectors want:\u003C/p\u003E\n\n\u003Cp\u003E(1) Access to mobile connectivity with ease and fewer barriers less the cost of infrastructure enhancements\n(2) Secured access to and storage of data on mobile platforms\n(3) Access at a cost that is manageable, in such a way that they are neither socially nor economically excluded from consumption\u003C/p\u003E\n\n\u003Cp\u003EThe company’s experience in business process analysis, data analysis, system design and development provides it an edge in developing innovative and useful products.\nThe Spirit of Noitavonne™ is best expressed through its very name which is “e-nnovation” spelled backwards. It is the technology house where innovations merge with possibilities and transform into an experience. The company’s patent pending “LOOP Connectivity Protocol” has become just one shining example of the high level of technological innovation that is produced at Noitavonne™. Another is “The Loop Tablet”, which has many capabilities including cellular, computing, video, e-Reader, music and controlling wireless IR remote applications. The device acts as a phone or it can be a smart phone companion where the cell phone wirelessly displays in the Loop Tablet User Interface allowing the user to perform all the cellular phone functions in addition to the full spectrum of tablet functions. The visionary behind this product, Lael A. Alexander, has a knack for building upon ideas to continually improve on what others might deem perfection. However, it is his experience in technology that spans decades and crosses multiple functional industry sectors ranging from healthcare to energy related segments that continue to prove up his concepts from a practitioners approach.\u003C/p\u003E\n\n\u003Cp\u003ECurrently, the company is focused on the launch of its developed line of products including the Noitavonne™ A357 series of Android smartphones; The Noitavonne™ Loop tablet which comes in two sizes (7” \u0026amp; 10”) and the company’s premier tablet, The Noit™ Embrace which won “Best In Show” at the CTIA Wireless Technology conference. All products are set to debut 2012-2013. In an ever changing environment, the last forty years has led to a rapid pace of technological advancement leaving consumers to shed personal computers for tablets, landline phones to smartphones and physical storage units to the “cloud”. However, the breakthroughs that Noitavonne™ has innovated will advance technology with lightening force into the realization of connectivity beyond the space age. Noitavonne™ finds itself on the cusp of one of those great moments, the birth of a new breed of technology, the Microsoft and Facebook moment when the intangible becomes tangible and the impossible becomes reality.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       28],
      "assets/images/resized/0021/6695/216695v2-max-150x150.png"],
     [[250,
       47],
      "assets/images/resized/0021/6695/216695v2-max-250x250.png"],
     [[450,
       86],
      "assets/images/resized/0021/6695/216695v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}