{"name": "Noor Plast India",
 "permalink": "noor-plast-india",
 "crunchbase_url": "http://www.crunchbase.com/company/noor-plast-india",
 "homepage_url": "http://www.indiamart.com/noorplast/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "noorplast@tradepassport.org",
 "phone_number": "9810976637",
 "description": "",
 "created_at": "Thu Apr 04 15:44:32 UTC 2013",
 "updated_at": "Thu Apr 04 15:44:41 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2007, at New Delhi (India), we, “Noor Plast India,” are highly recognized as the trusted manufacturer, exporter and supplier of an excellent range of Bathroom Fittings \u0026amp; Accessories, PVC Bath Fittings and PVC \u0026amp; P.T.M.T Bath Fittings.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\nWe are known as the foremost manufacturer, exporter and supplier of supreme quality Bathroom Fittings \u0026amp; Accessories, PVC Bath Fittings and PVC \u0026amp; P.T.M.T Bath Fittings. The following factors enable us to make a reputed position in the industry.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructural:\nOur state-of-the-art infrastructure facility ready with the latest manufacturing techniques enable us manufacture a high quality range of Bath Fittings \u0026amp; Accessories. We have segregated this facility into several in-housed the departments like production, quality control, research \u0026amp; development, warehouse \u0026amp; packaging, etc.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nAs an ISO 9001:2008 certified organization, Quality assurance has been always remained as one of the vital objectives of us. Our all business activities proceed in accordance with the international quality standards. Owing to our high quality standards, we promise that the products offered by us are highly durable and reliable. Properly installed with requisite testing techniques, our quality controllers help us deliver flawless range of products to our esteemed clients spread across the globe.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince the inception of our organization, we assertively believe in set up and maintain pleasant relationship with our valuable clients. Our transparent business policies and transparent dealings enable us to satisfy our clients optimally. Further, our professionals work in harmony with the clients to understand their specific requirements.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a team of competent team members, who are both committed as well as sincere in terms of their professionals. They are backed by years of experience in their own domain. With the help of these team members we are able to manufacture and supply our quality range of Pipe Fittings to our customers. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8044/248044v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8044/248044v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8044/248044v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}