{"name": "Novated by Fleetcare",
 "permalink": "novated-by-fleetcare",
 "crunchbase_url": "http://www.crunchbase.com/company/novated-by-fleetcare",
 "homepage_url": "http://novatedlease.fleetcare.com.au/",
 "blog_url": "http://novatedlease.fleetcare.com.au/news/blog.aspx",
 "blog_feed_url": "",
 "twitter_username": "novatefleetcare",
 "category_code": "other",
 "number_of_employees": 70,
 "founded_year": 1989,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "novated@fleetcare.com.au",
 "phone_number": "1300017137",
 "description": "Novated Lease Provider",
 "created_at": "Wed Oct 31 01:40:45 UTC 2012",
 "updated_at": "Fri Nov 02 19:34:45 UTC 2012",
 "overview": "\u003Cp\u003EWhy choose Novated by Fleetcare?\u003C/p\u003E\n\n\u003Cp\u003EHere are just some of the benefits you’ll receive with Novated by Fleetcare.\u003C/p\u003E\n\n\u003Cp\u003EDiscounted purchase prices\nBy using our superior purchasing power, we get you discounts on your new vehicle and save you money right from the very beginning. On top of this, we also do all the shopping and negotiating, which means less hassle for you.\u003C/p\u003E\n\n\u003Cp\u003EDiscounted fuel and maintenance\nAs we have access to discounted fuel from BP, Caltex and Shell, we pass these savings on to all of our Novated by Fleetcare clients. We can also save you money on your maintenance and repairs with discounted labour rates provided by our nation-wide supplier network. We also have lots of online tools to help you keep track of everything.\u003C/p\u003E\n\n\u003Cp\u003EPersonal account manager\nYou will be given your own dedicated account manager who will be your first point of contact for any and all queries regarding your Novated Lease. Their job is to help you understand and manage your Novated Lease in a way that gives you the best possible return on your time and money.\u003C/p\u003E\n\n\u003Cp\u003E24/7 roadside assistance \u0026amp; accident management\nYour Novated Lease also includes free roadside assistance via the auto club association so that you’re never left stranded. In the event of an accident, just leave it to us! We’ll handle all activities, including claim form completion, pickup and delivery of your vehicle, repair estimates and management, claims lodgment, assessment and third party recovery. Just another way Novated by Fleetcare helps to make your life easier.\u003C/p\u003E\n\n\u003Cp\u003EOnline access\nWith Novated by Fleetcare’s online access you get all the up to date information on your vehicle. Information on your fuel economy, servicing, registration, account balances and more are all available through our online service. The service also helps you keep track of your odometer details which are important come tax season.\u003C/p\u003E\n\n\u003Cp\u003ENo cost to change your lease structure\nSome Novated Lease providers charge clients to change the structure of their Novated Lease. Not us. We want to make sure you get the best possible lease for your situation, so we are more than happy to adjust the terms of your lease at no extra cost. If you leave your current employer, we will also transfer your Novated Lease to a new employer at no cost.\u003C/p\u003E\n\n\u003Cp\u003ENo up front payment on expenses\nOther providers make you pay for vehicle expenses from your own pocket and wait around for reimbursement. A Fleetcare Novated Lease covers these expenses immediately so you’re never left with a cash shortfall. In the event you wish to use a supplier outside of our network (i.e. insurance) our online reimbursement tool makes the process pain free and ensures you’re reimbursed as quickly as possible.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/7995/217995v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0021/7995/217995v2-max-250x250.png"],
     [[272,
       272],
      "assets/images/resized/0021/7995/217995v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}