{"name": "Noyasystem Technology",
 "permalink": "noyasystem-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/noyasystem-technology",
 "homepage_url": "http://www.noyasystem.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 5,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Web Design Company",
 "created_at": "Tue Oct 04 19:26:50 UTC 2011",
 "updated_at": "Sat Nov 19 01:17:56 UTC 2011",
 "overview": "\u003Cp\u003ENoya System Technology is an IT firm company offering cost effective, high quality and reliable design and result - oriented application, web, e-commerce solutions and desktop application on time for global entrepreneurs. Professionalism, Percision and Skill are the keys we use to make the website and application work for your business, bringing back in maximum return on your investment in shortest possible time.\u003C/p\u003E\n\n\u003Cp\u003EWe specialize in web design \u0026amp; development, search engine optimization, desktop application, web marketing, eCommerce, multimedia design, desktop application design, SEO, content writing, flash and animation design, graphics and logo design. All in one, Noya System Technology is solution to your needs. We build solutions, which evolve with the changing needs of your business and market.\u003C/p\u003E\n\n\u003Cp\u003EWe have a highly capable team of web consultants, creative designers, application designers, content writers, programmers and web marketing professionals who know how to yield results. We treat each of our clients individually and therefore we rarely offer set prices on any service.\u003C/p\u003E\n\n\u003Cp\u003EWe offer a complete range of web solutions including web designing, web hosting, e-commerce solutions, multimedia solutions, Internet marketing and Programming solution. We develop unique web solutions and desktop application which ensure increased efficiency and competitive advantage for your business and thus to your end users.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[130,
       127],
      "assets/images/resized/0015/6764/156764v2-max-150x150.jpg"],
     [[130,
       127],
      "assets/images/resized/0015/6764/156764v2-max-250x250.jpg"],
     [[130,
       127],
      "assets/images/resized/0015/6764/156764v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}