{"name": "Numbers Pay",
 "permalink": "numbers-pay",
 "crunchbase_url": "http://www.crunchbase.com/company/numbers-pay",
 "homepage_url": "http://www.numberspay.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "numberspay",
 "category_code": "ecommerce",
 "number_of_employees": 6,
 "founded_year": 2011,
 "founded_month": 4,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "daily-deals, cooperative-buying, cooperative-shopping, college-business, college, students, ecommerce",
 "alias_list": null,
 "email_address": "dcromwell@pecoraco.com",
 "phone_number": "7815725303",
 "description": "Daily Deal Cooperative Purchasing",
 "created_at": "Mon Aug 01 18:17:12 UTC 2011",
 "updated_at": "Thu Aug 04 19:27:30 UTC 2011",
 "overview": "\u003Cp\u003ENumbersPay is a group buying service that offers wholesale prices to individual consumers. We offer a range of products at significant discounts. Magic? Here\u0026#8217;s how we do it:\u003C/p\u003E\n\n\u003Cp\u003EMany retailers are willing to sell their products for lower-than-retail prices, but on one condition: they have to sell a lot of them. Unfortunately, most retailers don\u0026#8217;t know how to guarantee that they\u0026#8217;ll find enough buyers. Here\u0026#8217;s where we come in.\u003C/p\u003E\n\n\u003Cp\u003EAt NumbersPay.com, we display a wide array of products from retailers at abnormally low prices. When you sign up as a NumbersPay user, you can pledge to purchase any of the products we show. For the deals to actually go through, we need a minimum number of pledges before the deal expires. When this happens, the retailers are happy, the deal is official and your order ships at the end of the time limit. If the minimum number of pledges isn\u0026#8217;t reached by the time limit, the deal is cancelled and you aren\u0026#8217;t charged a thing.\u003C/p\u003E\n\n\u003Cp\u003EBut this is where it gets interesting. For many items, as the number of pledges grows we can continue to lower the prices they\u0026#8217;re offered at. Once the number of users pledging to buy an item reaches a bonus marker, its price drops by a certain percentage. Many of the items have multiple bonus deals, so by letting your friends know about NumbersPay and encouraging them to join, you can increase your chances of getting better and better deals. It boils down to this: the more people buying an item, the less it will cost. And we\u0026#8217;ve integrated the site with online social networks to make sharing easier.\u003C/p\u003E\n\n\u003Cp\u003EGet the Deal\u003C/p\u003E\n\n\u003Cp\u003EGetting started is simple. Subscribe to our newsletter and follow us on Facebook or Twitter to start receiving notifications about our latest deals. Once subscribed you will be in the loop and be the first to find any of our products at groundbreaking prices.In order to continuously tailor our shopping experience to our users, we have the suggest a product survey that lets your input guide our next offers. Sign up for free and give it a try!\u003C/p\u003E\n\n\u003Cp\u003EBuy it!\u003C/p\u003E\n\n\u003Cp\u003EFind an item you\u0026#8217;re interested in? Simply click the Buy! button to make your pledge. Remember, only the minimum pledge quota needs to be met in order for the deal to go through. You won\u0026#8217;t be charged a dime if your deal doesn\u0026#8217;t go down!\u003C/p\u003E\n\n\u003Cp\u003EShare, Share, Share!\u003C/p\u003E\n\n\u003Cp\u003EThe fun part for you and your wallet is sharing. In addition to prices going down as more users pledge to buy, our Refer \u0026amp; Save system actually gives you NumbersPay credit for getting your friends to sign up. Get a NumbersPay link connected to your own account at any time by clicking the Refer \u0026amp; Save button at the top of the page.\u003C/p\u003E\n\n\u003Cp\u003ELet the Good Prices Roll!\u003C/p\u003E\n\n\u003Cp\u003ESit back, relax, and bask in the great deal you just received courtesy of NumbersPay. Don\u0026#8217;t forget to let us know what products you want next and we\u0026#8217;ll do the work to bring it right to your computer screen! With your help, we can continue to bring the prices you want.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0014/7306/147306v2-max-150x150.png"],
     [[234,
       64],
      "assets/images/resized/0014/7306/147306v2-max-250x250.png"],
     [[234,
       64],
      "assets/images/resized/0014/7306/147306v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "",
    "address2": "",
    "zip_code": "07481",
    "city": "Wyckoff",
    "state_code": "NJ",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://money.cnn.com/galleries/2011/smallbusiness/1107/gallery.college_dorm_companies.fortune/6.html",
    "title": "CNN Money: 6 Hot Dorm Room Startups"}]}