{"name": "Nutech Applicator",
 "permalink": "nutech-applicator",
 "crunchbase_url": "http://www.crunchbase.com/company/nutech-applicator",
 "homepage_url": "http://www.nutechptfelinedvalves.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmaster@nutechptfelinedvalves.com",
 "phone_number": "9953352851",
 "description": "We, Nutech Applicator are a manufacturer",
 "created_at": "Thu May 02 12:11:30 UTC 2013",
 "updated_at": "Mon May 06 06:11:05 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Nutech Applicator”, are a profound organization engaged in manufacturing, supplying and exporting a top class gamut of Industrial Valves. Offered product line comprises provide Teflon Lined Ball Valve, Teflon Butterfly Valve, Teflon Lined Diaphragm Valve and others. Furthermore, we also offer Teflon Lined Plug Valve, Teflon Lined Ball Check Valve, Teflon Lined Sight Glass Valve and others. Offered valves that we come up with are appreciated for their durability, resistance against rust \u0026amp; and sturdy construction by our patrons.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are a reputed organization supported by a team of adroit professionals who actively indulge themselves in designing and developing of a compact array of Industrial Valves. These employees strive hard to maintain cordial relationships with the deemed customers in order to keep pace with current market trends. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are a profound industry of this domain, engaged in manufacturing, supplying and exporting a top class range of Industrial Valves to our reputed clients. We make sure to follow and keep pace with market trends that are being followed to stand tall on the clients expectations.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are supported by a state of the art infrastructure, which is segregated into various units that includes manufacturing, warehouse, administration cell that is further equipped with all the prerequisite and modern facilities that helps us to accomplish all the business related tasks in a fruitful manner and within the stipulated time frame. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nTo attain maximum level of patron satisfaction, our team mates put in their best efforts to bring forth an excellent range of Industrial Valves to keep pace with the market advancements and dynamics. These professionals make sure to maintain cordial relationship with the clients to become a renowned entity of this arena. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nprovide Teflon Lined Ball Valve, Teflon Butterfly Valve, Teflon Lined Diaphragm Valve and others. Furthermore, we also offer Teflon Lined Plug Valve, Teflon Lined Ball Check Valve, Teflon Lined Sight Glass Valve and others. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0025/7581/257581v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0025/7581/257581v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0025/7581/257581v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}