{"name": "Nutrac, Inc",
 "permalink": "nutrac-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/nutrac-inc",
 "homepage_url": "http://www.nutrac.us.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "K_Brand",
 "category_code": "consulting",
 "number_of_employees": 4,
 "founded_year": 2006,
 "founded_month": 2,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "saas---erp-integration-pc-media-application-deployment, hd-audiophile-class-a-digital-structured-cabling, voice, data, wifi-mobile-and-p-card-applications, social-networking-and-demand-generation-business-development, crm-and-sales-growth-strategy-process",
 "alias_list": null,
 "email_address": "ken_brandon@nutrac.us.com",
 "phone_number": "704-230-0199",
 "description": "Mindshare Business Intelligence",
 "created_at": "Tue Jun 12 01:04:44 UTC 2012",
 "updated_at": "Tue Jun 12 15:38:05 UTC 2012",
 "overview": "\u003Cp\u003EEstablished over twenty years, Nutrac\u0026#8217;s value proposition is custom collaboration. Nutrac aggregates c-suite, corporate sales, and technical relationships to tailor powerful mindshares for tactical business intelligence. Nutrac uses a strong pool of executive skill-sets and private networks to support business decision making. Especially, corporate selling, demand generation, opportunity management, transparency, sustainability, and process improvement.\u003C/p\u003E\n\n\u003Cp\u003ENutrac requires absolute integrity; full disclosure of financials, business practices, and dialogue directly with organizational managers. Nutrac knows corporate culture, multinational strategic communication, global consolidation initiatives, team-building, business development, social media, demand generation, opportunity management, CRM, wellness, quality certification, procurement, workforce reduction and reporting. Nutrac focuses on process enhancement to improve performance as well as applied metrics to measure and validate sustainable return-on-investment. \u003C/p\u003E\n\n\u003Cp\u003ENutrac\u0026#8217;s professional network accelerates sales-cycles, and minimizes expense and the bandwidth associated with Requests for Information (RFI\u0026#8217;s). Nutrac\u0026#8217;s business network is excellent for slipstreaming Requests for Proposal (RFP\u0026#8217;s) as well as establishing personal credibility and branding corporate identity. Nutrac matches qualified buyers with qualified sellers.\u003C/p\u003E\n\n\u003Cp\u003ENutrac compliments top-producers with established records of excellence; strong in corporate selling and managerial support to get things done quickly. Based on considerable trust equity, Nutrac provides \u0026#8216;top-down\u0026#8217; introductions and schedules presentations. We believe that top talent enjoys other top talent; especially teaming to deliver objectives. Nutrac saves time and resources.\u003C/p\u003E\n\n\u003Cp\u003ENutrac respects client privacy and protects network integrity. Nutrac operates by negotiated fee, retainer, commission, performance and barter agreements. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       106],
      "assets/images/resized/0019/4990/194990v2-max-150x150.png"],
     [[250,
       177],
      "assets/images/resized/0019/4990/194990v2-max-250x250.png"],
     [[311,
       221],
      "assets/images/resized/0019/4990/194990v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}