{"name": "Objectiva Software Solutions",
 "permalink": "objectiva-software-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/objectiva-software-solutions",
 "homepage_url": "http://www.objectivasoftware.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 500,
 "founded_year": 2001,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software-development, software-outsourcing, china-outsourcing",
 "alias_list": null,
 "email_address": "solutions@objectivasoftware.com",
 "phone_number": "",
 "description": "Outsourced Software Development",
 "created_at": "Mon Jan 09 23:59:17 UTC 2012",
 "updated_at": "Fri Jan 13 00:59:16 UTC 2012",
 "overview": "\u003Cp\u003EObjectiva Software Solutions (Objectiva) is the leading specialist of China-based software outsourcing services to ISV’s and Enterprise companies. \u003C/p\u003E\n\n\u003Cp\u003EA U.S. corporation headquartered in San Diego, California since 2001, our focus is to help our clients achieve time-to-market advantage, drive technology innovation, and gain economical access to world-class software engineering resources globally.From on-site to offshore, Objectiva’s software engineering teams deliver projects and products while helping our clients achieve their business goals. Our experienced U.S. and China based Project Management, Architecture, Software Development, QA, Testing, Support, and Professional Services experts are engaged in leading and supporting technology activities for our clients globally.\u003C/p\u003E\n\n\u003Cp\u003EWith facilities in San Diego, San Francisco, Indianapolis, Atlanta, Boston, Beijing and Xi’an, China, Objectiva helps clients develop customized enterprise software and solutions, web-based and client-server products and applications, software for wireless and mobile platforms, high-fidelity content and document management applications, and real-time data systems and applications.\u003C/p\u003E\n\n\u003Cp\u003EObjectiva’s teams are run by local technical leaders with multiple years of experience managing global software development operations on-premise, SaaS and Cloud platforms. Our technical leaders bring strong communication and collaboration skills that ensure smooth and efficient interaction between global teams.\u003C/p\u003E\n\n\u003Cp\u003EObjectiva Software Solutions increases clients software R\u0026amp;D performance.  Superior software quality, lower costs, on-time delivery, quicker time-to-market, and access to China are delivered.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       110],
      "assets/images/resized/0016/9443/169443v2-max-150x150.jpg"],
     [[250,
       184],
      "assets/images/resized/0016/9443/169443v2-max-250x250.jpg"],
     [[450,
       331],
      "assets/images/resized/0016/9443/169443v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}