{"name": "Obx Service Outer Banks Askew Plumbing",
 "permalink": "obx-service-outer-banks-askew-plumbing",
 "crunchbase_url": "http://www.crunchbase.com/company/obx-service-outer-banks-askew-plumbing",
 "homepage_url": "http://www.obxservice.com/",
 "blog_url": "http://outerbanksplumbing.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "OBX_Service",
 "category_code": "consulting",
 "number_of_employees": 15,
 "founded_year": 1981,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "outer-banks, kitty-hawk, nags-head, kill-devil-hills, plumbing, remodeling, cottage-consulting, technology-services, bathroom-remodeling, drain--septic-repair, drainage-contractors, plumbing-contractors, plumbing-contractors-commercial, plumbing-contracto",
 "alias_list": null,
 "email_address": "help@obxservice.com",
 "phone_number": "8043058045",
 "description": "Plumbing, Remodeling, Cottage Consulting",
 "created_at": "Thu Dec 08 18:06:35 UTC 2011",
 "updated_at": "Tue Dec 13 21:09:10 UTC 2011",
 "overview": "\u003Cp\u003EPlumbing, Remodeling, Cottage Consulting, \u0026amp; Technology Services\u003C/p\u003E\n\n\u003Cp\u003EOur company has three different divisions that fit the need of every aspect of the Property maintenance, construction, interior design, technology services \u0026amp; management industry. With almost 40 years in the outer banks real-estate and construction industry there is no area of expertise we have not covered. We provide and coordinate everything from cleaning services to full remodeling packages to connecting a wireless router.\u003C/p\u003E\n\n\u003Cp\u003EIn owning multiple ocean front homes our family owned and operated staff understands the weekly stress that can be placed on homes and knows what to expect and the correct standards a property must be left in to please a tenant. \u003C/p\u003E\n\n\u003Cp\u003EMany property management companies have opted to insource a lot of their work to help reduce owner costs and operate more efficiently. We have perfected this technique by providing a staff that is always available that mirrors your current crew with a few technical characteristics that set us apart.\u003C/p\u003E\n\n\u003Cp\u003EOur contractor services are supplied by Michael W. Askew with over 35 years experience on the Outer Banks he has been involved with a majority of the properties you see on a day to day basis. As a licensed plumbing and remodeling contractor and a Certified Simonton Windows installer he can eliminate the need for your owners paying for two service calls to solve one problem.\u003C/p\u003E\n\n\u003Cp\u003EOur cottage consulting is second to none we know how to work with your clients to help convince them to make some of the necessary changes suggested by their tenants at minimal costs. Terry Cargill our lead designer is here to help. From refinishing counter tops and cabinets to custom made blinds and furniture you clients will be amazed with their  properties new look and additional revenue and rebookings.\nComputer Tech Services are no longer just a guy with glasses at a help desk. Almost every aspect of our lives are now filled with technology from ocean front webcams to web based climate control systems our staff can help. Tenants no longer just want an ocean view they want to share their experiences at their fingertips with web based social media to digital surround sound systems. We offer two forms of tech support to save you clients and staff time and money. \u003C/p\u003E\n\n\u003Cp\u003EOur telephone and web based help desk can eliminate the need for many service calls to remote properties by simply answering the questions over the phone for the fraction of the cost of sending a carpenter to trouble shoot a wireless router. Our mobile technician is also trained and supplied with the correct tools to conquer almost any technological issue onsite the first time.\u003C/p\u003E\n\n\u003Cp\u003EWe also offer full time office support, is your phone system down or are you ready for a new network to accommodate up to 250 users we can help. Our technology and marketing department is staffed and diverse. We offer a full range of consulting \u0026amp; freelance design services ranging from corporate identity design, print \u0026amp; marketing, collateral creation and PowerPoint presentation design to, instructional manuals, administrative assertiveness seminars, and client relationship management strategies. \n• Seven years of accumulated skills including shadowing top designers.\n• A wide range of industries served including but not limited to Aeronautical, healthcare, photography, health \u0026amp; safety, online marketing, and real estate.\n• 100% Costumer satisfaction with 90% of my business being generated by referrals.\n• Worked with top companies such as CBRE Richard Ellis, Cabell Childress \u0026amp; Associates, \u0026amp; Tre Properties. \u003C/p\u003E\n\n\u003Cp\u003EOur freelance real-estate division can produce the materials you need at a price you can afford. Do you not have time or the experience necessary to professionally photograph your listings and create top level marketing materials. Is mls not getting showings to your listings? Are your Clients Complaining you are not doing enough to get their home sold or rented? Do you think you could get and sell more listings if every property you listed had its own web page with virtual photos and endless space for information. Call today to find out how inexpensive these services can really be.\u003C/p\u003E\n\n\u003Cp\u003Einspections we have to on a weekly basis  photograph all rentals to show any potential upcoming damages to tenants that get payment protector plans if damage is to occur we repair or replace as necessary and are responsible for all applicable paperwork necessary to file the claim. We also have a crew that after each one of our cleaning staff goes thru a property reviews the work of the staff member and certifies the property ready for occupancy\u003C/p\u003E\n\n\u003Cp\u003EProperty preservation from fire restoration to storm preparation we cover all aspects of property preservation. During the winter months many of our clients opt to have their homes fully secured for the non rental season we fully winterize the home including  removing all water from water lines, secure all windows to prevent storm damage and break ins, cut back any necessary landscaping…ect \u003C/p\u003E\n\n\u003Cp\u003EWhen it comes to repair we do everything from new construction to remodeling from new concrete to roof tops.\u003C/p\u003E\n\n\u003Cp\u003EBATHROOM REMODELING, DRAIN \u0026amp; SEPTIC REPAIR, DRAINAGE CONTRACTORS, PLUMBING CONTRACTORS, PLUMBING CONTRACTORS-COMMERCIAL , PLUMBING CONTRACTORS-LICENSED , PLUMBING DRAIN \u0026amp; SEWER CLEANING , PLUMBING \u0026amp; ELECTRICAL , PLUMBING \u0026amp; HEATING , PLUMBING REPAIR , REMODELING \u0026amp; REPAIRING-BUILDING CONTRACTORS , REMODELING SERVICE , TRENCHING SERVICE , WATER HEATERS-REPAIRING , WATER HEATERS-REPAIRING \u0026amp; REPLACEMENT \u003C/p\u003E\n\n\u003Cp\u003E4129 N. Virginia Dare Trail\nKitty Hawk, NC 27949\n804-305-8045\n252-982-6230\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.obxservice.com/\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.thumbtack.com/nc/kitty-hawk/plumbing/plumbing-remodeling-consulting-tech-services\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.merchantcircle.com/business/Obx.Service.252-982-6231\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.facebook.com/#!/pages/Obx-service/153222454769253\u003C/p\u003E\n\n\u003Cp\u003Ehttps://twitter.com/#!/OBX_Service\u003C/p\u003E\n\n\u003Cp\u003Ehttp://outerbanksplumbing.blogspot.com/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[140,
       58],
      "assets/images/resized/0016/5756/165756v2-max-150x150.jpg"],
     [[140,
       58],
      "assets/images/resized/0016/5756/165756v2-max-250x250.jpg"],
     [[140,
       58],
      "assets/images/resized/0016/5756/165756v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Information Technology",
    "person":
     {"first_name": "Jeff",
      "last_name": "Cargill",
      "permalink": "jeff-cargill",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Kitty Hawk",
    "address1": "4129 N. Virginia Dare Trail",
    "address2": "",
    "zip_code": "27949",
    "city": "Kitty Hawk ",
    "state_code": "NC",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        83],
       "assets/images/resized/0016/5753/165753v2-max-150x150.jpg"],
      [[250,
        139],
       "assets/images/resized/0016/5753/165753v2-max-250x250.jpg"],
      [[450,
        251],
       "assets/images/resized/0016/5753/165753v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        83],
       "assets/images/resized/0016/5754/165754v2-max-150x150.jpg"],
      [[250,
        139],
       "assets/images/resized/0016/5754/165754v2-max-250x250.jpg"],
      [[450,
        251],
       "assets/images/resized/0016/5754/165754v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        83],
       "assets/images/resized/0016/5755/165755v2-max-150x150.jpg"],
      [[250,
        139],
       "assets/images/resized/0016/5755/165755v2-max-250x250.jpg"],
      [[450,
        251],
       "assets/images/resized/0016/5755/165755v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.obxservice.com/",
    "title": ""},
   {"external_url": "http://www.thumbtack.com/nc/kitty-hawk/plumbing/plumbing-remodeling-consulting-tech-services",
    "title": ""},
   {"external_url": "http://www.merchantcircle.com/business/Obx.Service.252-982-6231",
    "title": ""},
   {"external_url": "http://www.facebook.com/#!/pages/Obx-service/153222454769253",
    "title": ""},
   {"external_url": "https://twitter.com/#!/OBX_Service",
    "title": ""},
   {"external_url": "http://outerbanksplumbing.blogspot.com/",
    "title": ""}]}