{"name": "OCLOCKSOFTWARE",
 "permalink": "oclocksoftware",
 "crunchbase_url": "http://www.crunchbase.com/company/oclocksoftware",
 "homepage_url": "http://www.oclocksoftware.com",
 "blog_url": "http://www.oclocksoftware.com",
 "blog_feed_url": "http://www.oclocksoftware.com",
 "twitter_username": "oclocksoftwares",
 "category_code": "software",
 "number_of_employees": 50,
 "founded_year": 2009,
 "founded_month": 6,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "professional-web-design, chennai-web-design, india-web-design, india-web-developement, php, joomla, virtuemart, oscommerce, wordpress, phpfox, asp, -net, designer, seo, sem, webmaster, virtual-assistant",
 "alias_list": null,
 "email_address": "bala@oclocksoftware.com",
 "phone_number": "9600012340",
 "description": "web design and development",
 "created_at": "Sat Aug 20 06:09:06 UTC 2011",
 "updated_at": "Fri Aug 26 21:16:47 UTC 2011",
 "overview": "\u003Cp\u003EO Clock Software - Hire Dedicated Programmers\u003C/p\u003E\n\n\u003Cp\u003EO Clock Software (OCS) Chennai is an Indian software company located in chennai india with a team of creative web designers and custom code developers with over 10+ years of experience and multi-skill sets in Web Technology. We define design develop deploy your project from scratch. We provide our services to clients in United States, United Kingdom and Asia. Effective communication is our key of success.\u003C/p\u003E\n\n\u003Cp\u003EWant to hire Full Time Indian Programmers in US or Indian Programmers in UK? contact 1-559-477-4988!\u003C/p\u003E\n\n\u003Cp\u003EHire Dedicated Programmers Full Time from OCS at low cost to work on your website and start saving your business expense, our full time programming services are as follows Monthly programmer full time, Weekly programmer full time, Daily programmer full time.\u003C/p\u003E\n\n\u003Cp\u003EWe provide software solutions for web based applications in asp, php, .net and custom software development which brings innovative ideas and cutting-edge technologies into the business of our customers. Secure your successful project with OCS. Thanks to all customers from United States, United Kingdom, Netherland, Norway for giving continuous business. Hire best website design company in India with best website designers and best web programmers at affordable prices.\u003C/p\u003E\n\n\u003Cp\u003EWe provide the full-cycle services in the area of web designing, developing, integrating and maintaining web based applications, search engine optimization, software solutions, portal development that enables enterprises to solve complex and critical business problems. We have been promoted by technically experienced professionals dedicated to provide the best and interactive solutions with intelligent technology. Not only with focusing on latest technology gadgets, we offer the most user friendly customized solutions with the most knowledgeable and experience hands.\u003C/p\u003E\n\n\u003Cp\u003ELooking for a SEO Programmers Chennai India? Want to see Proven Results on more website email us @ seoservices@oclocksoftware.com.\u003C/p\u003E\n\n\u003Cp\u003EHire Indian Programmers with expertise in Open Source Customization, custom php development, custom asp development, custom shopping cart development, Wordpress Designs \u0026amp; Integration, Joomla Design \u0026amp; Integration, Virtuemart Design \u0026amp; Integration, Phpfox Design \u0026amp; Integration, Zencart Design \u0026amp; Integration, Magento Design \u0026amp; Integration customization of all opensource and skin integration. We have dedicated PHP programmers, web designers with 8+ years of experience. We are specialized in Payment Gateway Integration. Most of our clients say \u0026#8220;OCS is the best indian company among the indian software compaines, OCS provide best solution for opensource\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003ELooking for a indian software company to work on custom php programming? O Clock Software has dedicated programmers to work on PHP, Opensource Customization and Opensource Integration\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       54],
      "assets/images/resized/0015/0299/150299v2-max-150x150.jpg"],
     [[250,
       90],
      "assets/images/resized/0015/0299/150299v2-max-250x250.jpg"],
     [[450,
       163],
      "assets/images/resized/0015/0299/150299v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}