{"name": "OFFiceVP",
 "permalink": "officevp",
 "crunchbase_url": "http://www.crunchbase.com/company/officevp",
 "homepage_url": "http://www.officevp.com",
 "blog_url": "http://blog.officevp.com",
 "blog_feed_url": "",
 "twitter_username": "officevp",
 "category_code": "public_relations",
 "number_of_employees": 6,
 "founded_year": 2004,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "email-markeing, video-email, video-email-marketing, html5-hosting, web-forms, mobile-video",
 "alias_list": null,
 "email_address": "appdeveloper@officevp.com",
 "phone_number": "(830) 693-1429",
 "description": "Email Marketing",
 "created_at": "Tue Feb 05 23:32:24 UTC 2013",
 "updated_at": "Fri Feb 08 05:39:26 UTC 2013",
 "overview": "\u003Cp\u003EOfficeVP is an email marketing and online marketing platform with just about every online marketing tool you can imagine.  They provide an easy way for users to send email newsletters, video email, manage subscriber lists, and track campaign performance. \u003C/p\u003E\n\n\u003Cp\u003EThey have the best video email and audio email system, and the video will play on just about every web enabled mobile device.  Includes a host of online marketing tools such as; an easy to use email campaign design gallery full of professionally designed email templates.  Web form generation packed full of pre designed web forms with full customization that includes video enabled web form generation, “With QR Codes” for mobile marketing.  Online page generation allowing you to place HTML5 video and web forms on your newsletters and lead capture pages.  HTML5 video hosting, List management, A/B split testing, Email triggers, Calendar, task manager, and social media tools that allow you to make a single post, or create scheduled posts across your social media accounts.  And their contact management is CRM like with contact details, activities, autoresponder tracking, and even custom field creation with the ability to add notes to the contact record.  They even provide you with an online web calendar you can include in your email, web site, blogs and social sites.  Their Prospector module is in a league all of its own.  It allow you to not just manage contacts by list name, it allows you to actually create folders, set rules in your email and video email that will move contact from folder to folder based on their responses to your email and/or video email. Plus, with it’s over views, makes it impossible for a contact to fall between the cracks.  You can also create sub accounts, create and share content with user groups.\u003C/p\u003E\n\n\u003Cp\u003EOfficeVP leverages knowledge, experience and expertise to help suggest, develop, empower and deliver industry strategies, standards, commitments, education and initiatives to their customers. Their long time leadership of Video, Data Management and Retention solutions ensures that they build upon both our experience, and their customer\u0026#8217;s experience, with a result benefiting our customers.  OfficeVP employees and executives also are believers and supporters of industry organizations dedicated to the good of all. They enjoy doing what they do, and most of all, serving their customers with a solution that just plain makes life a little easier.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Jesse",
      "last_name": "Musick",
      "permalink": "jesse-musick",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "USA Headquarters",
    "address1": "207 Ridge Harbor Drive",
    "address2": "P.O. Box 401",
    "zip_code": "78669",
    "city": "Spicewood",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}