{"name": "OfficialVirtualDJ",
 "permalink": "officialvirtualdj",
 "crunchbase_url": "http://www.crunchbase.com/company/officialvirtualdj",
 "homepage_url": "http://www.officialvirtualdjmusic.co.uk",
 "blog_url": "http://www.officialvirtualdjmusic.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "VirtualMusics",
 "category_code": "games_video",
 "number_of_employees": 102,
 "founded_year": 2009,
 "founded_month": 6,
 "founded_day": 21,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "officialvirtualdj, officialvirtualdjmusic, official-virtual-dj",
 "alias_list": "",
 "email_address": "admin@officialvirtualdjmusic.co.uk",
 "phone_number": "02072587854",
 "description": "Virtual Music Player",
 "created_at": "Sat Jul 11 17:01:57 UTC 2009",
 "updated_at": "Tue Jul 21 20:07:42 UTC 2009",
 "overview": "\u003Cp\u003EOfficialVirtualDJMusic give\u0026#8217;s people\u0026#8217;s and member\u0026#8217;s to download and many more.\u003C/p\u003E\n\n\u003Cp\u003EOfficialVirtualDJ born in East London and making music of himself with wholy owned record\u0026#8217;s with his Music Mixing Studio. VirtualDJ mixe\u0026#8217;s music\u0026#8217;s like Genre\u0026#8217;s like \u0026#8220;HipHop / Rap / Bass / Bollywood / Bhangra / RnB / Grime / Crime / and all sorts.\u003C/p\u003E\n\n\u003Cp\u003EVirtualDJ used to work in Amazon.Co.Uk for about 2 to 2 Year\u0026#8217;s and left the company and became an VirtualDJ of his choice to make and create music\u0026#8217;s in different kind of Genre\u0026#8217;s.\u003C/p\u003E\n\n\u003Cp\u003EHe\u0026#8217;s family went in a BIG Holiday to Bangladesh for about 3 Year\u0026#8217;s included his all 4 sister\u0026#8217;s and 3 brother\u0026#8217;s, he is only living with his 5th Sister which is about 17 Year\u0026#8217;s old and VirtualDJ take\u0026#8217;s care of her, VirtualDJ became a massive fan of HipHop Music\u0026#8217;s and Rap\u0026#8217;s and then he became a Mixer himself.\u003C/p\u003E\n\n\u003Cp\u003EVirtualDJ was born in 1986 in the Bangladeshi Ethnic, he is muslim from East London, over the past 4 Year\u0026#8217;s, he\u0026#8217;s family told him to be an Company Business Manager which they mean to be a Business Man with all those best Degree\u0026#8217;s that VirtualDJ had.\u003C/p\u003E\n\n\u003Cp\u003EVirtualDJ will be mixing music\u0026#8217;s about 2 in one week\u0026#8217;s, so he want\u0026#8217;s you people to SUBSCRIBE to our OfficialVrtualDJ YouTube Channel, and get the latest\u0026#8217;s info and also Rate his Music\u0026#8217;s in the best World\u0026#8217;s Video Sharing Site YouTube Broadcast Yourself.\u003C/p\u003E\n\n\u003Cp\u003EVirtualDJ will be releasing a Music Download List\u0026#8217;s where people can finally download his music\u0026#8217;s to your Computer or Burn it to a CD which you can BLAST IT in the street\u0026#8217;s in your country/city.\u003C/p\u003E\n\n\u003Cp\u003EDJ ARMZ\u003C/p\u003E\n\n\u003Cp\u003EDj armz is a diverse and innovative Asian mixer \u0026amp; producer, he has created many instrumentals for various artists for the uk music scene and has acclaimed many compliments for his efforts. his works have earned him respect, reputation and credits throughout uk.\u003C/p\u003E\n\n\u003Cp\u003EHis music styles have been questioned only because he touches many genres in his production. Hip Hop / RnB / Garage / Grime / Indian / Jungle / DnB / House / Mixes / etc / etc.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8216;if it\u0026#8217;s music, i\u0026#8217;ll make it\u0026#8221; - dj armz\u003C/p\u003E\n\n\u003Cp\u003EIn account Dj Armz has mixed a variety of legendery rap poets from Tupac Shakur, Notourious B.I.G, Big L, BiG PuN to Nas, 50 Cent, iCE Cube, Bone Thugs\u0026#8230;\u0026#8230;\u0026#8230;etc. There are a few mix tapes and instrumental albums under his belt, and is heading to be the only east indian hip hop producer to climb the music ladder in the uk. There are many doubts and many few upcoming similiar artists are showing hatred towards his work. the following comment was his opinion about these \u0026#8216;haters\u0026#8217;.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8221;i love haters, cos of the haters real players still exist\u0026#8221; - dj armz\u003C/p\u003E\n\n\u003Cp\u003Einfo - Dj Armz was born in 1986, he is from a Bangladeshi ethnic background. His childhood was based in the streets and estates of Tower Hamlet (shoreditch) in east London. In mid 96 his family moved home to Newham (east ham) away from central city but still remaining in east London. Since his adolescents era he formed a keen interest in music and how \u0026#8216;music\u0026#8217; is made, and set fourth to create music himself, with the help of accumulated knowledge. He started using software based studio FL Studio \u0026amp; Audacity, and has advanced into many other software/hardware based equipments, still in practice he has crafted and formed diverse production skills, which can only match his own skills.\u003C/p\u003E\n\n\u003Cp\u003ETERMS OF USE\u003C/p\u003E\n\n\u003Cp\u003EOfficialVirtualDJ Terms of Use\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EThis is a contract between you and OfficialVirtualDJ Site (located at 23, Rue Eugene Ruppert, Immeubale Laccolith, 1st and 2nd\nFloor, L-2543.). We will refer to ourselve\u0026#8217;s in this contact as \u0026#8220;OfficialVirtulDJ\u0026#8221;, \u0026#8220;We\u0026#8221;,\u0026#8221;Us\u0026#8221;, or our. A printable version of the\nmost current form of this contract is posted online at http://www.officialvirtualdj.piczo.com (for a successor webpage.)\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EThis contract cover\u0026#8217;s your use of the OfficialVirtualDJ Site Interactive service\u0026#8217;s, and gover\u0026#8217;s any other related service\u0026#8217;s for\nwhich you choose to sign up (for example, specific chatting online, download\u0026#8217;s, get music new\u0026#8217;s and update\u0026#8217;s), content, and other\nmusic media\u0026#8217;s. We refer to all this as the \u0026#8220;Service\u0026#8221; and, except where context require\u0026#8217;s otherwise and even if not expressly\nreferenced in the application section, \u0026#8220;Service\u0026#8221; include\u0026#8217;s any \u0026#8220;other item\u0026#8217;s\u0026#8221; (defined in Section 8) that you might obtain access\nto through or in relation to other aspect\u0026#8217;s of the \u0026#8220;Service\u0026#8221;. To avoid any confussion, when you register to use the Site and Service,\nyou are registering for both OfficialVirtualDJ and the Live Downloading,Chatting for Live Service\u0026#8217;s.\u003C/p\u003E\n\n\u003Cp\u003EThis service is offered to you conditioned on your acceptance of all terms in this contract. By \u0026#8220;ACCEPT\u0026#8221; below, you are representing\nthat you are atleast 18 years old (and have reached the \u0026#8220;age of majority\u0026#8221;) if that is not 18 years of age where you live) and you are\nattaching your electronic signature on OfficialVirtualDJ Site Automatically to and agrieeng to all term in this contract. In addition\nif you were a party prior version of this contract, that version may have stated that the the contract can only be updated on 30\nday\u0026#8217;s notice.\u003C/p\u003E\n\n\u003Cp\u003EThis website \u0026#8220;OfficialVirtualDJ\u0026#8221; has been protected by the Law and Enforcement\u0026#8217;s on bringin this Site to the best and next level,\nwe are updating this site regulary to ensure people that they understand the site rule\u0026#8217;s in hundred percent. This website has also\nan CCTV Alert Camera for violating our website rule\u0026#8217;s (for example, you have violated the Terms of Use Rule\u0026#8217;s, or you have been\nviolating our website\u0026#8217;s Code of Conduct information\u0026#8217;s.) or you maybe have been violating an \u0026#8220;Strong Language\u0026#8221;, \u0026#8220;Sexually Talk\u0026#8217;s\u0026#8221; or\nany other porno talk\u0026#8217;s. These are not accepted/welcomed in the Site of \u0026#8220;www.OfficialVirtualDJMusic.Co.Uk\u0026#8221; which is heavenly protected.\u003C/p\u003E\n\n\u003Cp\u003ECODE OF CONDUCT\u003C/p\u003E\n\n\u003Cp\u003Ehe OfficialVirtualDJ Code of Conduct\u003C/p\u003E\n\n\u003Cp\u003E1.This is a Contrat between you and OfficialVirtualDJ\u003C/p\u003E\n\n\u003Cp\u003EThe Code of Conduct outline\u0026#8217;s the rule\u0026#8217;s that you need to follow to ensure that OfficialVirtualDJ.co.uk are fun for everyone.\u003C/p\u003E\n\n\u003Cp\u003EWHAT NOT TO DO:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EDon\u0026#8217;t use OfficialVirtualDJ Site to do anything illegal. OfficialVirtualDJ is not responsible  for anything you say on the service/\nwebsite or for anything that happen\u0026#8217;s because of what you say; you are alone are responsible.\n*Don\u0026#8217;t harras, Abuse, or Spam other people on the site,\n*Don\u0026#8217;t Threaten People or Stalk other player\u0026#8217;s\n*Don\u0026#8217;t Distribute, Post, Publish, upload, dissemnate or discuss defamatory, infringing, obscene, sexual or other unlawful material\u0026#8217;s\nlike child pornography or illegal drug\u0026#8217;s including image\u0026#8217;s, audio, video or text\u0026#8217;s.\n*Don\u0026#8217;t post link\u0026#8217;s to other website\u0026#8217;s that violate\u0026#8217;s the Code of Conduct.\n*Don\u0026#8217;t give out your Information\u0026#8217;s that personally identifie\u0026#8217;s you (such as your real name, address, phone number, credit card number\netc.) while you\u0026#8217;re chatting. This include\u0026#8217;s voice chat\u0026#8217;s and the nam\u0026#8217;s you create during chat online box. This information\u0026#8217;s could be\nused by other member\u0026#8217;s for illegal or harmful purpose\u0026#8217;s. Also don\u0026#8217;t give out  information of other member\u0026#8217;s.\n*Dont create a Name that other user\u0026#8217;s may be offended by, this include\u0026#8217;s comment\u0026#8217;s that look, sound like, stand for, hint at,\nabbreviate, or insinuate any of the following\u0026#8217;: profane words/phrase\u0026#8217;s, sexually explicit language, sexual innuendo, hate speech\n(including but not limited to racial, ethnic, or religious slur\u0026#8217;s), illegal drug\u0026#8217;s/ controlled substance\u0026#8217;s, or illegal activities.\n*Don\u0026#8217;t create an Name that reference\u0026#8217;s controversial religious topic\u0026#8217;s, notorious people, orgranisations, or sensitive current or\nhistorical event\u0026#8217;s that may also be consirded inappropiate.\n*Don\u0026#8217;t post link\u0026#8217;s to material\u0026#8217;s that could harm other Member\u0026#8217;s that are Chatting, computer\u0026#8217;s or would allow others to inappropriately\naccess software\u0026#8217;s or website\u0026#8217;s.\n*Don\u0026#8217;t impersonate or harass OfficialVirtualDJ\u0026#8217;s employee\u0026#8217;s, moderator\u0026#8217;s, or staff member\u0026#8217;s\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EIf you Violate the Code of Conduct or the Terms of Use that you agreed to, action may be taken against your account. Some offence\u0026#8217;s\nwarrant an Immediate account cancellation, including but not Limited to hacking, modding, severe racial remaker\u0026#8217;s, continued creation\nof profane Name\u0026#8217;s, and posting viruse\u0026#8217;s or URL\u0026#8217;s to viruse\u0026#8217;s. In addition , trying to avoid a temporary ban by creating a string of\nnew account\u0026#8217;s may result in a permanent ban on the new user account and a possible escalation of punishment to the origial account\nand all related account\u0026#8217;s. if you create an inappropiate Name\u0026#8217;s then you maybe required to change it.\u003C/p\u003E\n\n\u003Cp\u003EHOW CAN YOU AVOID GETTING INTO TROUBLE? That\u0026#8217;s Easy. Just follow the Rule\u0026#8217;s.\u003C/p\u003E\n\n\u003Cp\u003EWHAT YOU CAN DO:\n*Use your friend\u0026#8217;s to keep track of the people you would like to chat with.\n*On the Site, choose an best Name\u0026#8217;s that you would like to prefer to keep and alway\u0026#8217;s chat with the name, (Think before you Type),\n(If you think someelse is using the same name as you then you can report it easily by scrolling down and find the form called\n\u0026#8220;Report someone is using my name\u0026#8221; and the submission will take about less than 1 minute for our employee\u0026#8217;s to help.\n*Take a Break when you are tired talking to you\u0026#8217;re friend\u0026#8217;s (Just Say \u0026#8220;Be Right Back\u0026#8221; or \u0026#8220;I am Tired Be Right Back\u0026#8221;).\n*Send a Negative Feedback on the a user by scrolling down and find the \u0026#8220;Negative Feedback\u0026#8221; Form and complete it.\n*If you find someone that you love to talk with then tell them \u0026#8220;Let me have your MSN please?\u0026#8221; then see what the chatter say\u0026#8217;s back\nto you, \u0026#8220;If he/she say\u0026#8217;s no then still you can come here and chat here all over again or continue chatting from last time\u0026#8221;.\n*If you encounter an obnoxious  player, you can report a bug by scrolling down and finding the form called \u0026#8220;Encounter a Obnoxious\nChatter\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003ECOMMUNITY GUIDELINES\u003C/p\u003E\n\n\u003Cp\u003EThe community guidelines will help you to saty safe on the site, there are varies thing\u0026#8217;s you have to follow to not get banned, suspended or removed from the site, the site is fully protected by the law, and it will result an illegal consequence\u0026#8217;s in your country. This website has been protected by Bot\u0026#8217;s of CCTV Camera on the site page\u0026#8217;s, we have created and installed a new programme technology which can detect a person\u0026#8217;s website ip address for anything bad happen\u0026#8217;s to the site,\u003C/p\u003E\n\n\u003Cp\u003Ewww.officialvirtualdjmusic.co.uk is not responsable of anythign you do the site, it will be held in a illegal consequence\u0026#8217;s against your account and other\u0026#8217;s, these are the rule\u0026#8217;s you need to follow of not to get banned, suspended or removed from the site and also the illegal consequence\u0026#8217;s in your country,\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EDo NOT download any music\u0026#8217;s from the site to fast or you\u0026#8217;ll trigger an alarm which our bot\u0026#8217;s will notify us by important email, and this will cause something bad happen to your account.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EDo NOT violate our Terms of Use and Code of Conduct, this can make your account banned by automatically, sending bad name\u0026#8217;s can make your account suspended, or making fake detail\u0026#8217;s like, name, age, location\u0026#8217;s and username can make your account for imidiate remove.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EDo NOT create fake [name\u0026#8217;s, location\u0026#8217;s, age\u0026#8217;s and username, that will make our system remove you permanetly, because this tell\u0026#8217;s us that you are an spammer that would like to download music\u0026#8217;s too fast.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EDo NOT treat or harrass people on the site, this will make an Illegal Consequence\u0026#8217;s in your country.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ETHESE ARE THE THING\u0026#8217;S YOU CAN:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EChat with people nicely, and also if that person is safe then you may tell him/her of their msn or anythey have and then you can talk, chat, or text chat them anytime.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EDownload music\u0026#8217;s from our site by taking your time, this will not trigger an alarm for suspension, please take your time by downloading a music.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EFollow the code of conduct to stay safe on the site and terms of use.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ENEVER create fake Names, Age\u0026#8217;s, Username\u0026#8217;s and Location\u0026#8217;s, if you do it correctly then you won\u0026#8217;t be banned or anything.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EWhen signing up for anything like tool\u0026#8217;s or anyither, please use your real informations by not making any fake information\u0026#8217;s.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EIf you think that the website has triggered an alarm and it wasn\u0026#8217;t you by downloading the music\u0026#8217;s too fast then you may submit a form to us in the [Download has Exeeded] Page under the word called [Update\u0026#8217;s] at the top, and find a form that should say something about the music.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EOnce submitted then we can give the music to you as fast as we can, please be patient.\u003C/p\u003E\n\n\u003Cp\u003EThank\u0026#8217;s for Reading\nThe Community Guidelines\nKind and Best Regards\nOfficialVirtualDJMusic Team\u003C/p\u003E\n\n\u003Cp\u003EThe OfficialVirtualDJMusic, Community, LLC\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       12],
      "assets/images/resized/0005/3736/53736v2-max-150x150.jpg"],
     [[250,
       20],
      "assets/images/resized/0005/3736/53736v2-max-250x250.jpg"],
     [[450,
       37],
      "assets/images/resized/0005/3736/53736v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Technologie's",
    "permalink": "technologies",
    "image": null},
   {"name": "Product's Maker",
    "permalink": "products-maker",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Joynul",
      "last_name": "Miah",
      "permalink": "joynul-miah-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "€25M",
 "funding_rounds":
  [{"round_code": "a",
    "source_url": "http://www.officialvirtualdjmusic.co.uk",
    "source_description": "OfficialVirtualDJMusic",
    "raised_amount": 25000000.0,
    "raised_currency_code": "EUR",
    "funded_year": 2009,
    "funded_month": 7,
    "funded_day": 11,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Created in London",
    "address1": "11 Eggleston view",
    "address2": "",
    "zip_code": "DL3 9SH",
    "city": "London",
    "state_code": "DC",
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[136,
        106],
       "assets/images/resized/0005/2615/52615v2-max-150x150.jpg"],
      [[136,
        106],
       "assets/images/resized/0005/2615/52615v2-max-250x250.jpg"],
      [[136,
        106],
       "assets/images/resized/0005/2615/52615v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.officialvirtualdj.blogspot.com",
    "title": "BlogSpot"},
   {"external_url": "http://www.youtube.com/user/officialvirtualdj",
    "title": "YouTube Channel"}]}