{"name": "Om Display",
 "permalink": "om-display",
 "crunchbase_url": "http://www.crunchbase.com/company/om-display",
 "homepage_url": "http://www.indiamart.com/omdisplay/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "jewelry-display-stands, decorative-jewelry-boxes, jewelry-boxes, jewellery-busts, necklace-display-busts-and-long-necklace-stands",
 "alias_list": null,
 "email_address": "omdisplay@tradepassport.org",
 "phone_number": "9821072760",
 "description": "Manufacturers and suppliers ,",
 "created_at": "Fri Apr 05 15:26:28 UTC 2013",
 "updated_at": "Fri Apr 05 15:26:32 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2000, we, “Om Display” are one of the trusted business entities engaged in manufacturing and supplying an attractive range of Display Props, Jewellery Boxes and Trays. We offer an extensive range of Jewellery Display Props, Jewelry Display Stands, Decorative Jewelry Boxes, Jewelry Boxes, Jewellery Busts, Necklace Display Busts and Long Necklace Stands, among others. Our range is widely appreciated across the nation for its attractive design, durable make and fine finishing. These products are best suited for displaying jewellery items in shops, enhancing the overall appearance of the product.\u003C/p\u003E\n\n\u003Cp\u003ETeam of Experts:\nWe have streamlined all our business activities with the assistance e and support of our professionals. The professionals we have employed are highly skilled, qualified and experienced having through understanding of the entire process. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructural Facilities:\nWe are strategically located at the industrial township of Maharashtra, India across a sprawling plot area. The unit is well-equipped with advanced facilities that help us manufacture the products in bulk quantity. The use of hi-tech machines ensures that the products are manufactured in strict tandem with the set industry standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality is top-most priority of our organization and we pay utmost care towards maintaining it throughout our business activities. We have developed in-house quality management system, wherein all quality measures re followed by our professionals as per the policy of our organization. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nDisplay Props, Jewellery Boxes and Trays. We offer an extensive range of Jewellery Display Props, Jewelry Display Stands, Decorative Jewelry Boxes, Jewelry Boxes, Jewellery Busts, Necklace Display Busts and Long Necklace Stands, among others.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8830/248830v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8830/248830v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8830/248830v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}