{"name": "OMBalavinayaga Enterprises",
 "permalink": "ombalavinayaga-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/ombalavinayaga-enterprises",
 "homepage_url": "http://www.indiamart.com/ombalavinayaga-enterprises/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ombalavinayaga-enterprises@tradepassport.org",
 "phone_number": "9790754653",
 "description": "manufacturer, supplier and exporter",
 "created_at": "Thu Apr 04 10:37:55 UTC 2013",
 "updated_at": "Thu Apr 04 10:37:57 UTC 2013",
 "overview": "\u003Cp\u003EOM Balavinayaga Enterprises started their business operation in the year 1998 as a sole proprietorship firm. We are based in Chennai which is also the capital of the state Tamil Nadu, India. We are a renowned manufacturer, exporter and supplier of Hair Extensions \u0026amp; Human Hair. Our range is huge and is catering to the diverse needs of customers, our range includes Indian Human Hair, Single Drawn Human Hair, Natural White Hair, Curly Human Hair, Machine Weft Hair, Natural Remy Hair, Straight Human Hair, Brown Natural Hair, Bleached Hair, Unprocessed Human Hair and Human Hair Extensions. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed an advanced infrastructural facilities at Chennai (Tamil Nadu), which is segregated into different units like cleaning, designing, processing, warehousing, packaging and others. All these departments are managed by our team of experts, who ensures to make judicious utilisation of all the available resources.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality is not only important but is the keyword to success in our business. We are catering to the needs of clients with our quality products. Quest for quality starts with procurement of products from vendors with whom we have built relations over the years.\u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nWe are catering to the diverse needs of domestic and an international client, as we are aware of the fact in order to flourish in business client’s happiness is inevitable. Thus, all our business activities are conducted with a prime focus on achieving maximum client’s satisfaction. We pay great heed to the feedback that we receive from our clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have been running a profitable and huge business for number of years now, owing to our ethical business practices. We have developed a great expertise in understanding the need of clients. Being into business for so many years has given us enormous experience of processing Human Hair in different shades, colors, sizes and textures. We are a client centric firm and do every possible thing for their better experience each time.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7813/247813v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7813/247813v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7813/247813v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}