{"name": "Omnify Software",
 "permalink": "omnify-software",
 "crunchbase_url": "http://www.crunchbase.com/company/omnify-software",
 "homepage_url": "http://www.omnifysoft.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2002,
 "founded_month": 10,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "plm, enterprise-software, document-management, collaboration, change-control, bill-of-material, compliance, iso, medical-device, quality, qms, capa, 21cfr, life-cycle, cloud-software, manufacturing",
 "alias_list": null,
 "email_address": "",
 "phone_number": "978-988-3800",
 "description": "PLM Software SMB",
 "created_at": "Wed Mar 20 18:14:19 UTC 2013",
 "updated_at": "Wed Mar 20 18:31:32 UTC 2013",
 "overview": "\u003Cp\u003EOmnify Software provides product life cycle management (PLM) solutions that are easy to use and configure. \u003C/p\u003E\n\n\u003Cp\u003EInstallations include VC funded start-ups, small business and mid sized companies. The software products are applicable for workgroups of 3-20 users and enterprises of 50 - 2500 users. \u003C/p\u003E\n\n\u003Cp\u003EEmpower Suite PLM solutions are the backbone for new product development teams, manufacturing operations and quality and compliance operations. The collaboration, workflow engine, and project management tools are enterprise class products capable of supporting work groups, off-site teams, global engineering operations, subsidiaries and off-shore manufacturing operations.  \u003C/p\u003E\n\n\u003Cp\u003EKey functionality includes: Real-time Dashboards, Managing Product Master Records, Parts, Document Management, Bill of Materials (BOMs), Parts, Change Control, BOM redlining, Effectivity, Supply Chain and Vendor management, Manufacturing Process Management, Manufacturing Instructions, Quality, CAPA, CARS, SCARS, Compliance, ISO 9001, ISO 13485, 21CFR PART11, 820, ISO 16949.\u003C/p\u003E\n\n\u003Cp\u003EThe Omnify team were the first to deliver Business Ready PLM which includes on-premise, public and hybrid cloud based deployments. The architecture supports out of the box configurations as well as highly configurable and customizable solutions based on user and enterprise level requirements.\u003C/p\u003E\n\n\u003Cp\u003ECorporate headquarters are based in Tewksbury MA.\nOffices in Silicon Valley, UK, Netherlands, Sweden,\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate Office",
    "address1": "2 Highwood Drive",
    "address2": "Suite 202 ",
    "zip_code": "01876",
    "city": "Tewksbury",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": 42.6427907,
    "longitude": -71.2365919}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}