{"name": "One-Red",
 "permalink": "one-red",
 "crunchbase_url": "http://www.crunchbase.com/company/one-red",
 "homepage_url": "http://www.one-red.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "patent",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Fri Dec 14 18:15:30 UTC 2012",
 "updated_at": "Fri Dec 21 05:59:45 UTC 2012",
 "overview": "\u003Cp\u003EOne-Red, LLC, is a joint venture between Koninklijke Philips Electronics N.V., Sony Corporation and Pioneer Corporation. Beginning on July 1, 2012, One-Red will offer patent licenses on behalf of LG, Philips, Pioneer and Sony for DVD products. One-Red will also administer patent licensing for One-Blue, LLC for Blu-Ray Disc products and for Philips for CD and DVD products.\u003C/p\u003E\n\n\u003Cp\u003EOne-Red’s patent license agreements are designed to ensure that manufacturers and brand owners have access to the essential patent rights that they require for their products. One-Red seeks to create a level playing field for our licensees through strict enforcement policies and market education measures. One-Red also offers per-batch licensing that allows licensees to better track their shipments and helps prevent improperly licensed products from entering the marketplace.\u003C/p\u003E\n\n\u003Cp\u003ECreated in 2011 and based in Sunnyvale, California, One-Red operates 15 offices in 13 jurisdictions. One-Red has extensive expertise in managing patent licensing programs and a staff of highly experienced professionals \u0026#8211; most of whom previously worked for Philips in the company’s optical storage licensing unit.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "MobileMedia Ideas LLC",
      "permalink": "mobilemedia-ideas-llc",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}