{"name": "Oneflare",
 "permalink": "oneflare",
 "crunchbase_url": "http://www.crunchbase.com/company/oneflare",
 "homepage_url": "https://www.oneflare.com.au/",
 "blog_url": "http://blog.oneflare.com.au/",
 "blog_feed_url": "",
 "twitter_username": "Oneflare",
 "category_code": "web",
 "number_of_employees": 8,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "home-services, marketplace, renovations, electrician, carpenter, startup, online-company",
 "alias_list": null,
 "email_address": "support@oneflare.com.au",
 "phone_number": "+61 2 9321 7900",
 "description": "Home Services Made Easy",
 "created_at": "Fri May 11 01:20:22 UTC 2012",
 "updated_at": "Mon Jun 17 09:05:14 UTC 2013",
 "overview": "\u003Cp\u003EOneflare is a new online startup that connects customers with home services providers.\u003C/p\u003E\n\n\u003Cp\u003EOneflare challenges the traditional Yellow Pages model by creating a revolutionary online marketplace. This marketplace eliminates the need for customers to search for tradies and tradies to search for customers. \u003C/p\u003E\n\n\u003Cp\u003EWith Oneflare, all it takes is one stop to get any job done. Entrepreneur and Co-founder Tommy Lim explains, ‘Our aim is to make hiring a service provider as easy as booking a flight on Expedia.’\u003C/p\u003E\n\n\u003Cp\u003EOneflare tips the process of looking for a service provider on its head. Requesting a service is effortless and free. Customers complete a simple form detailing the job then sit back and relax while Oneflare does the finding. Oneflare’s unique matching technology alerts relevant businesses of each request, allowing them to submit competing price quotes for the job. Quotes are then pre-filtered and presented to the customer, ensuring that the only work the customer has to do is make the buying decision. \u003C/p\u003E\n\n\u003Cp\u003ELaunched in January 2012, Oneflare’s innovative offering has driven drastic growth. Oneflare features 90,000 businesses spanning 40 categories throughout Australia.  90% of requests posted receive 3 or more competing quotes which leaves extra cash in happy customers’ pockets. With most quotes appearing within 15 minutes, Oneflare also puts free time back into busy customers’ schedules. Oneflare’s winning combination has generated over $5 million worth of jobs to date.  \u003C/p\u003E\n\n\u003Cp\u003EWhile saving time and money is exciting, 69% of customers have stated that reputation comes before price when hiring tradies (Newspoll Survey sourced by Oneflare). Oneflare has implemented an assortment of trust and safety features to ensure that customers always find a quality service provider. Reviews and ratings by previous customers coupled with business profiles featuring photos, testimonials and verification create an open community on the platform. Oneflare’s Home Care Guarantee also covers customers up to $500 if something goes wrong, providing the ultimate peace of mind no matter the size of the job. \u003C/p\u003E\n\n\u003Cp\u003ECustomers aren’t the only ones who Oneflare caters to. Oneflare has created a unique value proposition for businesses which only requires them to pay for successful connections. It’s free for service providers to register for the site and it’s free to receive leads, providing businesses with an incredible incentive to join. Gone are the days of businesses submitting their advert to the Yellow Pages, hoping it will lead to sales. Instead, Oneflare brings the work to them.\u003C/p\u003E\n\n\u003Cp\u003EOneflare is driven by clever technology that is hidden behind a user-friendly interface. Oneflare uses natural language processing to match every request to the right service provider. Real time SMS and email updates are sent to customers and businesses alike. Users on the go can enjoy the Oneflare mobile site which can be particularly useful for those pesky jobs that need to get done fast. With a patented iPhone App in the pipeline, Oneflare has utilised the latest technology to deliver superior customer service.   \u003C/p\u003E\n\n\u003Cp\u003EIn the future, Oneflare aims to take Australian households into the 21st century by becoming the go to source for hiring quality tradies.\u003C/p\u003E\n\n\u003Cp\u003Ewww.oneflare.com.au\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0018/9022/189022v2-max-150x150.jpg"],
     [[250,
       96],
      "assets/images/resized/0018/9022/189022v2-max-250x250.jpg"],
     [[450,
       173],
      "assets/images/resized/0018/9022/189022v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Lead Developer",
    "person":
     {"first_name": "James",
      "last_name": "Martin",
      "permalink": "james-martin-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "83 York Street",
    "address2": "",
    "zip_code": "2000",
    "city": "Sydney",
    "state_code": null,
    "country_code": "AUS",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        124],
       "assets/images/resized/0018/9355/189355v2-max-150x150.png"],
      [[250,
        207],
       "assets/images/resized/0018/9355/189355v2-max-250x250.png"],
      [[450,
        373],
       "assets/images/resized/0018/9355/189355v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}