{"name": "Online Product Designer",
 "permalink": "online-product-designer",
 "crunchbase_url": "http://www.crunchbase.com/company/online-product-designer",
 "homepage_url": "http://www.online-product-designer.com/",
 "blog_url": "http://www.online-product-designer.com/blog",
 "blog_feed_url": "http://feeds.feedburner.com/online-product-designer/YpOq",
 "twitter_username": "designertool",
 "category_code": "software",
 "number_of_employees": 100,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-product-designer-tool, product-design-tool, online-t-shirt-designer-tool, custom-banner-designer-application, online-sign-design-tool, shoes-designer-tool, online-skin-design-tool, online-button-design-tool, laptop-skin-designer-tool",
 "alias_list": null,
 "email_address": "sales@onlineproductdesigner.com",
 "phone_number": "+1 832-426-2277 ",
 "description": "Top-Notch Software Development Company",
 "created_at": "Fri Aug 31 09:18:06 UTC 2012",
 "updated_at": "Thu May 16 02:42:09 UTC 2013",
 "overview": "\u003Cp\u003EOPD, acronym for Online Product Designer, is a global service provider of professional web application development, software application management, software integration and customization, existing application maintenance. Putting its deep knowledge and focussed programming capability, the company delivers highly responsive online product designer tools : Online T-Shirt Designer Tool, Custom Banner Designer Application, Online Sign Design Tool, Shoes Designer Tool, Online Skin Design Tool, Online Button Design Tool, Laptop Skin Designer Tool, Online iPhone Design Application, Online Letter Design Tool and more.     \u003C/p\u003E\n\n\u003Cp\u003EThe company is one of the few reliable software development companies offering a broad portfolio of powerful product design tools powered by latest technologies such as jQuery, Flex, Flash, Ajax and PHP. All rich internet web 2.0 applications developed by Online Product Designer come with Lifetime Software Validity with no revenue sharing policy. These tools are designed strategically only for e-commerce website engaged actively in e-merchandising. They play a big role in improving e-reputation of an e-commerce website. Thereby, it helps clients compete and grow in an increasingly competitive online marketplace. \u003C/p\u003E\n\n\u003Cp\u003EOver 90% of Online Product Designer revenue come from its existing customers. Today, the company has a global presence across India, United States, United Kingdom, North America, Europe, Asia-Pacific, China, Canada, Australia, and Japan.     \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Online Product Designer",
    "address1": "10685-B, Hazelhurst Dr. # 11631, Houston, Texas 77043 United States of America",
    "address2": "",
    "zip_code": "77043",
    "city": "HOUSTON",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.online-product-designer.com/blog/?p=234",
    "title": "Online Product Designer Introduces Web Based Custom Product Designer Applications"}]}