{"name": "onlinecouponisland.com",
 "permalink": "onlinecouponisland-com",
 "crunchbase_url": "http://www.crunchbase.com/company/onlinecouponisland-com",
 "homepage_url": "http://www.onlinecouponisland.com/",
 "blog_url": "http://onlinecouponisland.com/blogs",
 "blog_feed_url": "http://onlinecouponisland.com/blogs",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": 2000,
 "founded_month": 1,
 "founded_day": 17,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "coupons, codes, vouchers",
 "alias_list": null,
 "email_address": "oci.socialteam@gmail.com",
 "phone_number": "",
 "description": "Coupon Codes",
 "created_at": "Wed Dec 05 09:44:01 UTC 2012",
 "updated_at": "Thu Dec 06 05:53:52 UTC 2012",
 "overview": "\u003Cp\u003EOnline Coupon Island is a website featuring online promo codes and especially designed keeping in mind the constant diversifying trends in all aspects of the market. May it be Fashion, Domestic, Occasional, the market trends tend to amend constantly and keeping up to date with the changing trends is of utmost importance. Many who are keen, have a knowhow of the latest trends but for those individuals who lag behind OCI has loomed up as a solution for them.\u003C/p\u003E\n\n\u003Cp\u003EWe are providing our valued customers the best discount promo codes so that they can avail this anywhere and anytime. With just a click and browsing to your favorite onlinecouponisland.com you\u0026#8217;ll get the best deals of brands through our website in the form of the amazing promo codes.\u003C/p\u003E\n\n\u003Cp\u003ETo keep the valued customers up-to date with the ongoing changing trends in the markets, OCI constantly updates its brands and their products so that the customers don\u0026#8217;t face any difficulty in keeping up with the diversifying trends. Moreover a free online assistance is given to the customers so they know what to buy when to buy and how to by their favorite brands in simple in easy steps, and then there are face book \u0026amp; twitter pages also that keep you up to date with all the different coupons in the online shopping website.\u003C/p\u003E\n\n\u003Cp\u003EOCI works with you by being a part of your shopping repercussions. We provide you the best of discount coupon and promotional vouchers of your favorite brands and stores on our website. Now you don\u0026#8217;t have to travel long for a shopping spree on actual amounts but you can get amazing offers which will give you an amazing saving opportunity.   \u003C/p\u003E\n\n\u003Cp\u003ESo when there are brands like Delias, Juliana Rae and Murval just a click away, who would want to go out for tiring round of shopping?\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}