{"name": "Opal Infotech",
 "permalink": "opal-infotech",
 "crunchbase_url": "http://www.crunchbase.com/company/opal-infotech",
 "homepage_url": "http://www.webmasterindia.com",
 "blog_url": "http://blog.webmasterindia.com",
 "blog_feed_url": "http://blog.webmasterindia.com/feed/",
 "twitter_username": "opal_infotech",
 "category_code": "other",
 "number_of_employees": 25,
 "founded_year": 1999,
 "founded_month": 2,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo, web-design, web-development, search-engine-marketing, email-marketing, search-engine-optimization, website-design",
 "alias_list": null,
 "email_address": "biz@webmasterindia.com",
 "phone_number": "079 - 26750333",
 "description": "Web Design SEO Company",
 "created_at": "Wed Aug 03 13:31:16 UTC 2011",
 "updated_at": "Thu Aug 04 18:37:31 UTC 2011",
 "overview": "\u003Cp\u003EOpal Infotech is an ISO 9001:2008 Certified complete web solution company in India offering SEO services, web design, web development email marketing etc. We also offer outsourcing services to other countries.\u003C/p\u003E\n\n\u003Cp\u003EOur affordable SEO services include Google SEO, web SEO, Search engine Marketing and internet marketing services. We also offer social media optimization (SMO) services which include submission in social networking websites like Facebook, Twitter, Linkedin etc.\u003C/p\u003E\n\n\u003Cp\u003EWe offer web design services which include flash website design, HTML page design, dynamic web design, static website design and SEO friendly website design. We also offer Facebook business page design which includes custom page design with Facebook using iFrame.\u003C/p\u003E\n\n\u003Cp\u003EOur web development services include CMS, shopping cart website, Joomla website development, open source shopping cart development, ecommerce website development, PHP web development.\u003C/p\u003E\n\n\u003Cp\u003ESteered by Jigney Bhachech having 23 years experience in computers and telecommunications, and his dynamic team who are mainly involved in developing web solutions for building business and image identities. We offer web-based solutions for clients in India and abroad. Our strength lies in need assessment, visualizing the concept, managing content, applying cutting edge technology for web designing, software programming, web marketing, offering cost effective solutions, delivering jobs on time, and meeting our ultimate objective: client satisfaction.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Jigney",
      "last_name": "Bhachech",
      "permalink": "jigney-bhachech",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Opal Infotech",
    "address1": "411, Saman Complex",
    "address2": "Satellite Road",
    "zip_code": "380015",
    "city": "Ahmedabad",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}