{"name": "Opemed",
 "permalink": "opemed",
 "crunchbase_url": "http://www.crunchbase.com/company/opemed",
 "homepage_url": "http://www.opemed.net/",
 "blog_url": "http://opemed.wordpress.com/",
 "blog_feed_url": "http://opemed.wordpress.com/feed/",
 "twitter_username": "ceiling_hoists",
 "category_code": "hardware",
 "number_of_employees": 8,
 "founded_year": 1981,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ceiling-hoists, patient-lifting-equipment",
 "alias_list": null,
 "email_address": "sales@opemed.net",
 "phone_number": "01252 758858",
 "description": "Patient lifting equipment suppliers",
 "created_at": "Thu Jul 19 13:04:40 UTC 2012",
 "updated_at": "Thu Jul 19 19:44:56 UTC 2012",
 "overview": "\u003Cp\u003ECeiling hoists and lifting equipment for disabled patient handling in hospitals, nursing homes and the domestic environment.\u003C/p\u003E\n\n\u003Cp\u003EOpeMed not only offer market leading ceiling hoists, shower trolleys, changing tables, specialist baths and related items, but our experienced staff enable the process to be as smooth and with as little disturbance as possible, from concept right through to after-sales service.\u003C/p\u003E\n\n\u003Cp\u003EThe management team of OpeMed have over 30 years of patient handling knowledge and our R\u0026amp;D department pride themselves from the level of interaction with external experts in the field. All products are made in our state-of-the-art factory within the UK or Netherlands.\u003C/p\u003E\n\n\u003Cp\u003EProduct Advice\nOpeMed supply, install and maintain hoists, ceiling hoists, showering and changing equipment for a wide range of clients including hospitals, nursing homes, schools, day centres, hospices and private clients. We can help you at the planning stage save money by liaising directly with the builder and architect and pride ourselves on our honest and realistic approach. By dealing direct with the manufacturer, you are getting the best level of knowledge, support and advice straight from the people that design and build the products.\u003C/p\u003E\n\n\u003Cp\u003EInstallation\nAll installations are completed by trained and certified CSCS qualified installers who will train the user on basic use and fully test and commission each individual install according to LOLER and ISO10535.\u003C/p\u003E\n\n\u003Cp\u003EAfter Sales Support\nAfter each installation has been completed, staff are given appropriate training and issued with a training certificate if required. Further training can be supplied free of charge if required.\u003C/p\u003E\n\n\u003Cp\u003EMaintenance and Support\nAll lifting equipment falls under ISO10535 (and LOLER in the UK) and we follow these standards as a minimum for installation and after sales support. Our qualified engineers can test your equipment every 6 months as recommended by ISO10535 and LOLER. All engineers carry a full stock of spares and do not operate on commission.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[74,
       79],
      "assets/images/resized/0020/1879/201879v2-max-150x150.jpg"],
     [[74,
       79],
      "assets/images/resized/0020/1879/201879v2-max-250x250.jpg"],
     [[74,
       79],
      "assets/images/resized/0020/1879/201879v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Dogflud Way",
    "address2": "",
    "zip_code": "GU9 7UD",
    "city": "Farnham",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}