{"name": "Opentaks",
 "permalink": "opentaks",
 "crunchbase_url": "http://www.crunchbase.com/company/opentaks",
 "homepage_url": "http://www.opentaks.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-networking, social-networking, product-promotions, free-adverts",
 "alias_list": null,
 "email_address": "info@opentaks.com",
 "phone_number": "",
 "description": "Social Networking",
 "created_at": "Wed Oct 31 18:11:56 UTC 2012",
 "updated_at": "Sat Nov 03 19:33:07 UTC 2012",
 "overview": "\u003Cp\u003EOpentaks is a social networking website that caters to the business needs of professionals, employers and entrepreneurs. Designed for the core purpose of network and business, it offers free account services to individuals who seek rapid growth in their career and profession. For example, job seekers can use it to search jobs matching their job profiles and employers can use it to promote their product and services, and recruiting new employees. One can also use the website to find individuals they knew in the previous company, or people they have always wanted to connect with. \u003C/p\u003E\n\n\u003Cp\u003EInterestingly, you can have as many as accounts you want to have on opentaks – firstly, that’s because it’s a free service and most importantly, the more connection you’ll build using your  opentaks account, the greater opportunities you can have for professional growth. Moreover, a good network on opentaks, companies can make people aware about their product and services a bit more effectively and hence draw more and more potential customers to their websites. \u003C/p\u003E\n\n\u003Cp\u003EFollowing that on further, it’s always good to know people in your industry who may keep you updated on jobs, internships or other opportunities that are available in the market, and having an account on Opentaks account helps people achieve just the same, as it allows you to connect and talk to people who can help you achieve your business and professional goals. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       35],
      "assets/images/resized/0021/8137/218137v2-max-150x150.png"],
     [[153,
       36],
      "assets/images/resized/0021/8137/218137v2-max-250x250.png"],
     [[153,
       36],
      "assets/images/resized/0021/8137/218137v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}