{"name": "OPINATOR",
 "permalink": "opinator",
 "crunchbase_url": "http://www.crunchbase.com/company/opinator",
 "homepage_url": "http://www.opinator.net/",
 "blog_url": "http://www.opinator.net/blog",
 "blog_feed_url": "",
 "twitter_username": "OPINATOR_es",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "customer-feedback-survey",
 "alias_list": null,
 "email_address": "info@opinator.net",
 "phone_number": "",
 "description": "",
 "created_at": "Mon Sep 17 00:39:56 UTC 2012",
 "updated_at": "Mon Sep 24 17:09:00 UTC 2012",
 "overview": "\u003Cp\u003EOPINATOR sends your feedback instantly to the people truly responsible for your experiences as a consumer, so that you can tell them directly, at any time, and in any place, what you think about their products, services, or employees. \nSharing a great or a not-so-good experience with your contacts is fine, but with OPINATOR you have the CERTAINTY that your opinion is reaching the people that should be getting it loud and clear, so you can now speak up and tell them in their faces what you think about them! \nBusinesses care so much about your feedback that they are assigning codes (called OPIs) to their products and services in order to get specific opinions about each of them. To start giving feedback you just need to enter the OPI code of the thing or person you want to give your opinion about. For instance, if you want to send us your opinion about our service, just type the OPI code ‘OPINATOR’ and you’ll be instantly taken to the feedback screen. \u003C/p\u003E\n\n\u003Cp\u003EAnd it gets better: lots of businesses are offering incentives (coupons, prizes, etc.) to those who send them feedback.\nThe more you use OPINATOR, the more you change the world, as you contribute to improving the quality of the products and services you and others will enjoy. \u003C/p\u003E\n\n\u003Cp\u003EFeatures:\n•No registration required.\n•Private and anonymous feedback.\n•Quantitave (5-star ratings) and qualitative (free text) opinion.\n•Instant delivery of your feedback to businesses.\n•Potential additional incentives (coupons, special promotions, prizes, etc.).\nPlease send us your feedback to the OPI code ‘OPINATOR’ or to feedback@opinator.net\nTo businesses, we provide:\u003C/p\u003E\n\n\u003Cp\u003E•An open, direct, private, and bidirectional connection with your customers.\n•Instant access to your customers’ feedback, giving you the opportunity to act on it immediately to improve customer satisfaction.\n•A complete graphical dashboard with views of opinions per product, service, region, etc. \n•Quantitative reporting of the ratings for the particular KPIs you choose.\n•Qualitative analysis of your customers’ feedback based on the Natural Language Processing of their opinions.\n•A complete Incentives System that allows you to define, communicate, and award benefits to your customers, thus further increasing their loyalty.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       125],
      "assets/images/resized/0021/1571/211571v2-max-150x150.png"],
     [[174,
       145],
      "assets/images/resized/0021/1571/211571v2-max-250x250.png"],
     [[174,
       145],
      "assets/images/resized/0021/1571/211571v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Software Engineer",
    "person":
     {"first_name": "Ignacio",
      "last_name": "Bona",
      "permalink": "ignacio-bona",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}