{"name": "Optimus BT",
 "permalink": "optimus-bt",
 "crunchbase_url": "http://www.crunchbase.com/company/optimus-bt",
 "homepage_url": "http://www.optimusbt.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 50,
 "founded_year": 2002,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "enterprise-2-0-consultant, sharepoint-consultant, sharepoint-2010-consultant, sharepoint-custom-application-development, sharepoint-services",
 "alias_list": null,
 "email_address": "info@optimusbt.com",
 "phone_number": "770 569 1240",
 "description": "SharePoint \u0026 Enterprise 2.0 Consultants",
 "created_at": "Wed Jun 23 08:42:13 UTC 2010",
 "updated_at": "Fri Jun 25 23:14:17 UTC 2010",
 "overview": "\u003Cp\u003EProviding the Context with Agile Business Solutions\u003C/p\u003E\n\n\u003Cp\u003EOptimus BT, a Microsoft Gold Certified Partner and a privately held firm with locations in Atlanta, GA, US (HQ) and Bangalore, India, is a global leader in providing solutions that are primarily SharePoint based and utilize existing client infrastructure.  For over 5 years, Optimus BT has paved the road when implementing complex, global solutions in the areas of Sales, Finance, Procurement, Manufacturing, Human Resources, and others across industry segments around the world.  Starting with a client vision, Optimus BT helps take that vision through the entire process to ensure success!  From Conceptual Design through Deployment and User Training, Optimus BT has perfected its unique engagement model  to reduce costs, optimize existing infrastructure investments, and ensure the best returns on client investment!\u003C/p\u003E\n\n\u003Cp\u003EOptimus BT has been recognized for setting standards in design and development, and is acclaimed by clients for using a solution delivery model that is second to none. Our core competencies include Collaboration Solutions, Enterprise Content Management, Enterprise Applications, Sales Enablement, Business Intelligence, and Self Service and Social Applications. In addition, Optimus BT has a uniquely qualified engineering staff that have successfully helped many clients migrate Lotus Notes Applications, as well as other legacy systems, to a Microsoft platform.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Optimus BT",
    "address1": "2550 Northwinds Parkway, ",
    "address2": "Suite 140",
    "zip_code": "30009",
    "city": "Alpharetta",
    "state_code": "GA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}