{"name": "Option 1 Staffing",
 "permalink": "option-1-staffing",
 "crunchbase_url": "http://www.crunchbase.com/company/option-1-staffing",
 "homepage_url": "http://www.option1staffing.com",
 "blog_url": "http://www.linkedin.com/company/option-1-staffing",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 1991,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "option-1-staffing",
 "alias_list": null,
 "email_address": "",
 "phone_number": "650.941.5115",
 "description": "Option 1 Staffing's Crunchbase",
 "created_at": "Mon Apr 22 15:33:26 UTC 2013",
 "updated_at": "Mon Apr 29 15:45:00 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in 1991, Option 1 Staffing Services, Inc., assists client organizations in California\u0026#8217;s Bay Area by finding the candidates best suited to their needs. Leveraging experience serving businesses in fields ranging from accounting and finance to healthcare and information technology, the company applies its Perfect Placement Methodology to the solution of unique staffing challenges. This methodology includes five phases, the first of which centers on an analysis that helps Option 1 Staffing develop a thorough understanding of client needs. Subsequent phases include recruitment, evaluation, selection, and a 100 percent satisfaction guarantee. \u003C/p\u003E\n\n\u003Cp\u003EPresently, Option 1 Staffing assists nearly 25,000 employment candidates with skills applicable to many fields. The company attracts candidates by delivering the support necessary to find the right position in today\u0026#8217;s competitive marketplace. That support includes an extensive professional network, through which job candidates encounter career opportunities, as well as consultations with the company’s team of placement experts. Interested candidates can search job opportunities online at Option1Staffing.com or contact an Option 1 Staffing recruiter at (650) 941-5115. \u003C/p\u003E\n\n\u003Cp\u003EPursuant to its environmentally friendly values, Option 1 Staffing limits its impact on the natural world by relying more on electronic administration and less on paper, buying supplies from green vendors and encouraging its staff to utilize public transportation and carpooling. \u003C/p\u003E\n\n\u003Cp\u003EA community minded organization, Option 1 Staffing is helps Heald College students enter the workforce by participating in campus career events. The company also participates in the Career Closets clothing drive, which supports women re-entering the workplace. A company engaged with its broader professional community, Option 1 belongs to the American Staffing Association, an organization dedicated to ethical staffing services, in addition to the California Staffing Professionals, the National Association Women\u0026#8217;s Business Owners and the Los Altos Chamber of Commerce.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       61],
      "assets/images/resized/0025/3816/253816v2-max-150x150.jpg"],
     [[250,
       103],
      "assets/images/resized/0025/3816/253816v2-max-250x250.jpg"],
     [[450,
       185],
      "assets/images/resized/0025/3816/253816v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "4410 El Camino",
    "address2": "Suite 110",
    "zip_code": "94022",
    "city": "Los Altos",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}