{"name": "Orange Peel",
 "permalink": "orange-peel",
 "crunchbase_url": "http://www.crunchbase.com/company/orange-peel",
 "homepage_url": "http://www.orangepeelpr.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "OrangePeelSL",
 "category_code": "consulting",
 "number_of_employees": 4,
 "founded_year": 2007,
 "founded_month": 2,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sponsorship, sponsorship-sales, sponsorship-broker, sponsorship-agency, sponsorship-sales-agency, start-up-consultation, business-consultation, business-plan, marketing-plan, sales-plan",
 "alias_list": null,
 "email_address": "info@orangepeelpr.com",
 "phone_number": "+34933026692",
 "description": "Consultation \u0026 Sales",
 "created_at": "Tue Jan 25 15:50:08 UTC 2011",
 "updated_at": "Thu Feb 03 07:48:29 UTC 2011",
 "overview": "\u003Cp\u003EOrange Peel is an international multi-sector business consultation and business development company based in Barcelona, Spain that specialises in start-up consultation, dsitressed and under-achieving SMBs and sponsorship sales. \u003C/p\u003E\n\n\u003Cp\u003EOrange Peel has consulted on the start-up of Internet Communications, Fashion, Online Retail, Wine Marketing, Urban \u0026amp; Tourism Planning, Water Treatment Reselling, Bar, Nightclub, Music Styling and many other type of companies. The staff at Orange Peel are experts in the research and development of business plans, marketing plans and investment proposals, SEO, website architecture, social media marketing, affiliate marketing and online marketing.\u003C/p\u003E\n\n\u003Cp\u003ETheir business development services specialises in sponsorship sales of athletes, motorsport, polo, business events, film festivals, luxury events and luxury events attached to film festivals. The company also manages investment in feature films produced both in America and Europe and angel investment in SMBs.\u003C/p\u003E\n\n\u003Cp\u003ETheir core assets and capabilities are extensive international business experience, enormous and very valuable business network and fees that very competitive\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Office",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Barcelona",
    "state_code": null,
    "country_code": "ESP",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}