{"name": "Orangesoftpedia.com Pvt Ltd",
 "permalink": "orangesoftpedia-com-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/orangesoftpedia-com-pvt-ltd",
 "homepage_url": "http://www.orangesoftpedia.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "contact@orangesoftpedia.com",
 "phone_number": "",
 "description": "Data Recovery and File Recovery",
 "created_at": "Fri Aug 10 12:07:09 UTC 2012",
 "updated_at": "Mon Aug 27 07:50:08 UTC 2012",
 "overview": "\u003Cp\u003EWelcome to orange softpedia data recovery software\nWe provide here all top rated data recovery softwares. The data recovery software that we have reviewed here on the basis of their features effectiveness and ease of use. We also provide value of money. All the date recovery software are compared on the basis of their performances and value to provide the best software to you. \u003C/p\u003E\n\n\u003Cp\u003EData file recovery software can easily work with common data loss situations. For small to large problems, disc recovery program provides effective solution to your common data recovery needs. With use of simplified windows recovery software all the deleted files can be easily retrieved with effective lost file drive recovery results. For user’s ease, company provides NTFS Data Recovery Software (or popular as ntfs data recovery utilities), FAT Data Recovery Software especially for HDD drives partitioned for NTFS and FAT file system.\u003C/p\u003E\n\n\u003Cp\u003EThere are several types of data recovery products\n•Hardisk and partition recovery tools recover corrupted hard drive and partitions, repair formatted volumes and fix broken file system If you are looking for a tool to fix FAT, NTFS, ext2fs, or MacOS logical disk look here.\n•Database recovery and repair software fix corrupted database such as MS Access or FoxPro DBF.\n•Email recovery tools fix corruspted mailboxes and recover lost email in Microsoft exchange, Outlook, Outlook Express, Eudora, The Bat, or Vista mail.\n•Removable media recovery tools fix and repair data on corrupted USB sticks, ZIP drives, digital cameras, and memory cards such as SD, compact flash, MMC memory sticks. This category list tools for portable MP3 and video player such as iPod, iRiver and Zune.\n•CD and DVD recovey tools recover data from optical media with incomplete session , burns error or wrong disk parameter.\n•Undelete and unerease utilities simply recover deleted files, you will certaily find the right type of product if you are looking for a tool to quickly recover a few file.\n•Password recovery tools provide access to password protected document such as ZIP archives, MS Office and Adobe PDF documents.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0020/5462/205462v2-max-150x150.jpg"],
     [[250,
       82],
      "assets/images/resized/0020/5462/205462v2-max-250x250.jpg"],
     [[450,
       148],
      "assets/images/resized/0020/5462/205462v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.orangesoftpedia.com/Data-Recovery-Software.html",
    "title": "Data Recovery Software"},
   {"external_url": "http://www.orangesoftpedia.com/Email-Migration.html",
    "title": "Email Migration PST to NSF, NSF to PST"},
   {"external_url": "http://www.orangesoftpedia.com/Getdata-Photo-Recovery.html",
    "title": "Recover and Repair Deleted or corrupted Photos, jpeg, gif, bitmap and lot more"}]}