{"name": "Orbit Media",
 "permalink": "orbit-media",
 "crunchbase_url": "http://www.crunchbase.com/company/orbit-media",
 "homepage_url": "http://www.launchorbit.com",
 "blog_url": "http://blog.launchorbit.com",
 "blog_feed_url": "",
 "twitter_username": "launchorbit",
 "category_code": "mobile",
 "number_of_employees": 9,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "address-book, aggregation, aggregator, social-network, phone-book, facebook, twitter, sms, e-mail, voice, ui, mobile, wireless, iphone",
 "alias_list": null,
 "email_address": "info@launchorbit.com",
 "phone_number": "",
 "description": "Address Book 2.0",
 "created_at": "Sat Feb 20 21:27:26 UTC 2010",
 "updated_at": "Tue Mar 30 00:26:33 UTC 2010",
 "overview": "\u003Cp\u003EOrbit Media is a phone book application that allows the users to organize and moderate their contacts. Orbit groups the users\u0026#8217; friends into \u0026#8220;orbits\u0026#8221; so they can prioritize real-time notifications from their contacts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[145,
       150],
      "assets/images/resized/0007/7707/77707v2-max-150x150.png"],
     [[148,
       153],
      "assets/images/resized/0007/7707/77707v2-max-250x250.png"],
     [[148,
       153],
      "assets/images/resized/0007/7707/77707v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Alex",
      "last_name": "Panelli",
      "permalink": "alex-panelli",
      "image": null}},
   {"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Rish",
      "last_name": "Mehta",
      "permalink": "rish-mehta",
      "image": null}},
   {"is_past": false,
    "title": "VP of Marketing",
    "person":
     {"first_name": "Christine",
      "last_name": "Loredo",
      "permalink": "christine-loredo",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Legal",
    "is_past": false,
    "provider":
     {"name": "Gunderson Dettmer Stough Villeneuve Franklin \u0026 Hachigian, LLP",
      "permalink": "gunderson-dettmer-stough-villeneuve-franklin-hachigian-llp",
      "image": null}}],
 "total_money_raised": "$500k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 500000.0,
    "raised_currency_code": "USD",
    "funded_year": 2010,
    "funded_month": 1,
    "funded_day": 1,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "ATA Ventures",
         "permalink": "ata-ventures",
         "image":
          {"available_sizes":
            [[[150,
               70],
              "assets/images/resized/0002/2871/22871v1-max-150x150.jpg"],
             [[167,
               78],
              "assets/images/resized/0002/2871/22871v1-max-250x250.jpg"],
             [[167,
               78],
              "assets/images/resized/0002/2871/22871v1-max-450x450.jpg"]],
           "attribution": null}},
       "person": null},
      {"company": null,
       "financial_org":
        {"name": "Altos Ventures",
         "permalink": "altos-ventures",
         "image":
          {"available_sizes":
            [[[150,
               34],
              "assets/images/resized/0002/2815/22815v2-max-150x150.png"],
             [[219,
               50],
              "assets/images/resized/0002/2815/22815v2-max-250x250.png"],
             [[219,
               50],
              "assets/images/resized/0002/2815/22815v2-max-450x450.png"]],
           "attribution": null}},
       "person": null},
      {"company":
        {"name": "Trilibis",
         "permalink": "trilibis",
         "image":
          {"available_sizes":
            [[[150,
               94],
              "assets/images/resized/0003/1892/31892v3-max-150x150.jpg"],
             [[160,
               101],
              "assets/images/resized/0003/1892/31892v3-max-250x250.jpg"],
             [[160,
               101],
              "assets/images/resized/0003/1892/31892v3-max-450x450.jpg"]],
           "attribution": null}},
       "financial_org": null,
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "700 S Claremont Street",
    "address2": "Suite 110",
    "zip_code": "94402",
    "city": "San Mateo",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [{"description": "Orbit 2.0 Social Phone Book Launches",
    "stoned_year": 2010,
    "stoned_month": 3,
    "stoned_day": 24,
    "source_url": "http://www.marketwire.com/press-release/Orbit-20-Social-Phone-Book-Launches-Free-App-Offers-Faster-Download-Improved-Social-1137002.htmhttp://www.marketwire.com/press-release/Orbit-20-Social-Phone-Book-Launches-Free-App-Offers-Faster-Download-Improved-Soc",
    "source_text": "\r\nOrbitTM 2.0 Social Phone Book Launches: Free App Offers Faster Download, Improved Social Networking and Embedded Local Search\r\n\r\niPhone Users Enjoy a Smarter Way to Communicate via One Intuitive Interface That Keeps Them Connected to the People and Places That Matter Most\r\n\r\nLAS VEGAS, NV and SAN MATEO, CA--(Marketwire - March 24, 2010) -  Orbit Media, an innovative developer of social networking and mobile search applications for today's most popular smart phones and portable devices, today announced an updated version of Orbitâ„¢ Social Phone Book, which is now available in the Apple App Store.\r\n\r\nOrbit is a communications hub that allows iPhone users to easily connect via voice, text, email and social networking -- without having to switch from application to application. Orbit not only allows people to connect with their contacts, but also enables quick discovery and connection to a specific need such as a plumber or a nearby restaurant. \r\n\r\nOrbit delivers the classic address book features plus several new capabilities, including enhanced social networking, built-in \"Orbit\" categories to group like-minded contacts together for easy communications management and the ability to adjust the frequency of communications received via \"Social Volume,\" simply turn the volume up or down -- thereby increasing or decreasing the push of information to the handset. Capping off Orbit's improved feature set is \"Places,\" which allows users to search for local stores, restaurants and more. After a search, the user can choose to call the listing, view a map, send the information to friend or add it to their contacts. A default \"My Places\" Orbit is created upon download of the app, so users can easily organize favorite locales into one group.\r\n\r\n\"Orbit helps iPhone users get more out of a feature they use each day -- their address book,\" said Alex Panelli, CEO of Orbit Media. \"Whether using Orbits to organize conversations, Social Volume to adjust the quantity of information received from contacts, or My Places to search and save details on favorite shops, restaurants and businesses -- it's all about managing the information we access via our mobile phone and providing new ways of interacting with the people and places in our lives.\"\r\n\r\nOrbit -- The New and Improved Address Book\r\nOrbit 2.0 offers a faster set-up process, along with a progress bar to track the download status. Those with an extensive contact list can now choose how many contacts should be imported and paired with Facebook and Twitter accounts at a given time. After pairing, Orbit immediately populates with status updates from paired friends. Additionally, Orbit offers an enhanced A-to-Z scrolling feature to greatly improve the navigation of contacts on the iPhone's touch screen.\r\n\r\nAdditional features of Orbit 2.0 include:\r\n\r\n    * Built-In Orbits -- New default Orbits are provided for users to populate: Inner Orbit, Family, Friends and Co-Workers, as well as Orbits on the following popular categories: Live Music, Bars, Chinese Food, Italian Food, Mexican Food, Movies, Night Clubs, Pizza, Sushi, Thai Food and Wine Bars. Additional Orbits can be created at any time.\r\n    * Volume Control -- Social Volume, a feature completely unique to this app, lets users manipulate the level of communications, such as status updates, received from contacts. Turn the volume high and be alerted of updates in real-time or turn it down to receive updates at a set time or not at all.\r\n    * Local Search -- Within Orbit, users can now search local listings -- just enter a search term in the \"Search\" bar. This can also be done from the \"Places\" tab.\r\n    * Share Information -- After a search, users can choose to Call Now, View Map, Send to a Friend or Add to Contacts. A \"My Places\" Orbit lets users group favorite locations together for easy access.\r\n    * Easy Social Networking -- Orbit now allows users to more easily post status updates right from the \"Updates\" tab, as well as the ability to post status updates to multiple networks simultaneously.\r\n    * Connected Phonebook -- Orbit offers over-the-air updates for seamless content integration. The app also auto-generates a favorites list based on the people the user communicates with most.\r\n    * Photo Control -- Orbit allows each user to decide if they do or do not want their friends' Facebook photos to become the default images.\r\n\r\nFinally, within the Orbit address book there will also be a featured local listing with information on a nearby business, as well as mini advertisements on the \"Updates\" tab. Users can turn off all sponsored listings and advertisements for a monthly payment of $0.99. \r\n\r\nPricing and Availability\r\nOrbit is free and is available now for the iPhone from Apple's App Store or at the iTunes App Store at http://itunes.com/app/orbitsocialphonebook.\r\n\r\nAbout Orbit Media\r\n Orbit Media was built with the vision of providing simple and easy-to-use mobile applications that offer more control of one's communications. The founders of Orbit Media are mobile and Internet experts with consumer experience across social media, search and messaging applications. Leveraging years of experience, strong industry relationships and innovation in UI and product performance, Orbit Media will provide world class cross-platform, cross-network and cross-device mobile communication applications.\r\n\r\nOrbit Media's products currently include Orbitâ„¢ social phonebook which is an award-winning mobile application that provides a smarter way to communicate via mobile devices so that the user stays \"in the know\" about what matters.\r\n\r\nOrbit Media was spun out of Trilibis Mobile, a successful and reputable publisher of mobile applications, in January 2010. Orbit Media is a private company headquartered in San Mateo, California backed by Altos Ventures and ATA Ventures. For more information, please visit www.launchorbit.com. ",
    "source_description": "OrbitTM 2.0 Social Phone Book Launches: Free App Offers Faster Download, Improved Social Networking and Embedded Local Search",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Orbit Media",
      "permalink": "orbit-media"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}