{"name": "OSA Engineering",
 "permalink": "osa-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/osa-engineering",
 "homepage_url": "http://www.indiamart.com/osa-engineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "osa-engineering@tradepassport.org",
 "phone_number": "9043001970",
 "description": "manufacture and retail Water Treatment P",
 "created_at": "Fri Apr 05 16:21:35 UTC 2013",
 "updated_at": "Fri Apr 05 16:21:38 UTC 2013",
 "overview": "\u003Cp\u003EOSA Engineering was incorporated in the year 1998 in UAE by Indian Entrepreneurs to meet the local market requirements. As days passed more customers were interested in our service which forced us to spread our services to neighboring Middle East and African Market. In the year 2011, we started our India operations having our office in Chennai. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nThe complete and fully functional infrastructure backed by technically advanced production unit spreads over a large area. The manufacturing facility is spacious enough for smooth movement of material lifting cranes and other equipments. The segregation of electric room, generator room, machine oils storage spaces has been well defined so as to avoid hindrance in regular operations. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur organization is quality driven organization, hence we ensure to deliver defect free products to our valued clients. Moreover, the team of quality auditors appointed by us stringently check the range on rigorous parameters to ensure delivery of only flawless and safe to use products at client\u0026#8217;s destination.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe complete and fully functional infrastructure backed by technically advanced production unit spreads over a large area. The manufacturing facility is spacious enough for smooth movement of material lifting cranes and other equipments. \u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nOur clients have remained in business with us continuously since our inception. We have maintained a client centric approach. We do not hesitate to go an extra mile to meet the demands and requirements of our clients. Our Sales Force has been very strictly instructed to keep association with the clients for solving their queries. Our clients have always remained extremely satisfied with our world class goods and services.  \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are reputed manufacturers and retailers having vast experience and sound infrastructural facilities. We have a comprehensive range of Industrial products, which renders us the first choice of clients. We pay close and strict attention to the customer’s specific requirements.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8892/248892v2-max-150x150.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8892/248892v2-max-250x250.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8892/248892v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}