{"name": "OTS and Services",
 "permalink": "ots-and-services",
 "crunchbase_url": "http://www.crunchbase.com/company/ots-and-services",
 "homepage_url": "http://www.dnatestindia.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dna, paternity, genetics, sibling, parental-dna",
 "alias_list": null,
 "email_address": "hyderabad@dnatestindia.com",
 "phone_number": "+91 9963629998",
 "description": "DNA Test India",
 "created_at": "Fri Aug 27 19:19:12 UTC 2010",
 "updated_at": "Fri Aug 27 21:21:18 UTC 2010",
 "overview": "\u003Cp\u003Ewww.dnatestindia.com is a most trusted source of DNA Paternity Test in India.  One Touch Solution and Services is specialist provider of DNA testing  offering tests that are most accurate and affordable. For your peace of mind, you can be 100% assured that your DNA test is processed through our internationally accredited DNA testing laboratory.\u003C/p\u003E\n\n\u003Cp\u003EFor the accuracy of DNA test result, all are analyzed with the most advanced genetic identification systems on the basis of 16 Loci ( Genetic Markers).\u003C/p\u003E\n\n\u003Cp\u003EWe help individuals and families to prove relationships for many different reasons viz. Peace of Mind, Immigration Purpose, Legal Relationship Test etc. Explore our website, and you will find information about our DNA testing services, or give us a call to know more. We feel that DNA testing services should be made affordable and easily accessible to everyone who needs to resolve paternity concerns in the privacy of their own home. We can help you answer your paternity questions by sending you a confidential home paternity testing kit to your home. You will then simply acquire the DNA for us by swabbing your cheek, thus allowing us to perform the paternity parentage test.\u003C/p\u003E\n\n\u003Cp\u003EAdvantage:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Affordable-complete DNA test, no hidden fees\n* Available all over India, Srilanka, Pakistan and Middle East\n* Quick turn around time\n* DNA is collected pain free and confidentially in your home using a unique  DNA collection kit (Swabs)\n\n* Easy, Hassle Free, Convenient \u0026amp;amp; Affordable\n\n* Free Shipping of the collection kit to the client\n* Results can be obtained via email, mail, phone or online at no extra charge, you can select all (Fully confidential)\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EAccurate:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EWe use the 16 allele Identifilerâ„¢ Human Identification kit\u003C/li\u003E\n\u003Cli\u003EProbability of Paternity will be at least 99.99% for inclusions\u003C/li\u003E\n\u003Cli\u003EProbability of Paternity will be 0% for exclusions, all exclusions are run two times\u003C/li\u003E\n\u003Cli\u003ERun every sample 2 times to give Most accurate results\u003C/li\u003E\n\u003Cli\u003EState-of-the-art equipment and technology for all relationship tests\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EWe us a non-invasive, pain-free DNA identification collection method for DNA parentage analysis screening. No blood test or painful pin pricks required. We need DNA in order to perform the test, we like to use the most easily accessible and readily available DNA, cheek cells from the inside of the mouth. Swabs are used to obtain DNA identification material for paternity DNA testing. The cells lining the inside of the cheek, called \u0026#8220;buccal cells,\u0026#8221; can be painlessly rubbed off onto a foam tipped swab, and kept intact for long periods of time. The DNA identification material is then extracted from these cells and used for parentage identification testing.\nWe offer an accurate paternity test at a very low price without sacrificing DNA testing quality. We do not take shortcuts to offer you this affordable paternity test.  Our modern state-of-the-art equipment allows us to provide affordable pricing with enhanced accuracy and reliability.  Unlike other DNA laboratories, we pass these operational cost savings on to you, the consumer. Our both DNA laboratory are located in the United States \u0026amp; Australia.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       62],
      "assets/images/resized/0009/9695/99695v2-max-150x150.jpg"],
     [[250,
       104],
      "assets/images/resized/0009/9695/99695v2-max-250x250.jpg"],
     [[450,
       188],
      "assets/images/resized/0009/9695/99695v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}