{"name": "Thank you for the Science Fair",
 "permalink": "our-science-fair",
 "crunchbase_url": "http://www.crunchbase.com/company/our-science-fair",
 "homepage_url": "http://oursciencefair.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 1,
 "founded_year": 2009,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "science-fair, school",
 "alias_list": null,
 "email_address": "info@oursciencefair.com",
 "phone_number": "1-866-616-FAIR",
 "description": "science fair website and event planning",
 "created_at": "Mon Oct 05 20:14:04 UTC 2009",
 "updated_at": "Wed Apr 03 17:13:15 UTC 2013",
 "overview": "\u003Cp\u003EOur Science Fair is a free web-based service targeted at that often under-appreciated person who has graciously volunteered to coordinate the school science fair.\u003C/p\u003E\n\n\u003Cp\u003EThe job of the science fair coordinator at any school is to provide an inspirational learning experience for all students, as well as to host a fun and exciting event for the community.  Our Science Fair manages to help them achieve this without charging them a penny.  With Our Science Fair, the school gets its own customizable science fair website, where the coordinator can publish information about their fair, including the date, time, location, guidance for the students, rules, description of the prizes, etc.\u003C/p\u003E\n\n\u003Cp\u003EThe school\u0026#8217;s science fair website is professionally designed and includes several useful features to save the coordinator time and effort.  It contains a registration page where students can sign up to participate in the fair.  This eliminates the need to send home paper forms with each student, and makes it a lot easier for the coordinator to track the number of participants or send out email announcements to them.  The website contains a page to allow students or parents to order supplies (such as project display boards) for their science projects, which are delivered directly to the students\u0026#8217; classrooms.  Also, there is a page to allow students to upload photos of themselves working on their projects.  These photos are then used to produce a fun video slide show which can be shown at the fair.\u003C/p\u003E\n\n\u003Cp\u003EOur Science Fair was conceived and built by Rajeev Goel, a parent volunteer at his daughter\u0026#8217;s elementary school in Sammamish, WA. Last year, due to his efforts, the science fair was the single most popular event of the school year, with over 90% of the students participating.  He recognized that many parents are now pushing for schools to have a deeper online presence.  Parents prefer to be able to fill out school-related forms online rather than on paper, and pay for their supplies and fees with a credit card rather than having to send in a check with their child. This was the inspiration for developing Our Science Fair, is now being offered for free to any public or private school in the U.S.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       69],
      "assets/images/resized/0006/1719/61719v2-max-150x150.jpg"],
     [[250,
       116],
      "assets/images/resized/0006/1719/61719v2-max-250x250.jpg"],
     [[450,
       209],
      "assets/images/resized/0006/1719/61719v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Rajeev",
      "last_name": "Goel",
      "permalink": "rajeev-goel-3",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "2228 275th Ct. SE",
    "address2": "",
    "zip_code": "98075",
    "city": "Sammamish",
    "state_code": "WA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        121],
       "assets/images/resized/0006/1718/61718v2-max-150x150.png"],
      [[250,
        202],
       "assets/images/resized/0006/1718/61718v2-max-250x250.png"],
      [[450,
        364],
       "assets/images/resized/0006/1718/61718v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}