{"name": "Outdoor World Direct",
 "permalink": "outdoor-world-direct",
 "crunchbase_url": "http://www.crunchbase.com/company/outdoor-world-direct",
 "homepage_url": "http://www.outdoorworlddirect.co.uk/",
 "blog_url": "http://www.outdoorworlddirect.co.uk/blog/",
 "blog_feed_url": "http://www.outdoorworlddirect.co.uk/blog/feed",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "outdoor, ecommerce, online-retail",
 "alias_list": null,
 "email_address": "",
 "phone_number": "0871 271 11 87",
 "description": "Camping, Tents \u0026 Outdoor Equipment",
 "created_at": "Thu Feb 25 10:52:57 UTC 2010",
 "updated_at": "Thu Feb 25 23:40:29 UTC 2010",
 "overview": "\u003Cp\u003EOutdoor World is a specialist retailer of camping equipment, outdoor equipment and tents, stocking brands such as Vango, Coleman, Outwell, North Face, Regatta and many more. The company was founded in 1999 by Eric Scotland, opening the first high street store in Huddersfield, West Yorkshire. Renowned for high service levels and quality products, the shop has established a firm relationship with its loyal customers.\u003C/p\u003E\n\n\u003Cp\u003ESince then the company has grown through e-commerce with their successful website OutdoorWorldDirect.co.uk currently in its fifth year of online trading. The website now sells to over ten countries in the European Union and is constantly expanding its product ranges to meet the ever changing demands of the modern customer.\u003C/p\u003E\n\n\u003Cp\u003EThe website offers everything you could possible ever need for camping, from adventure mountain camping to family camping, OutdoorWorldDirect.co.uk has one of the finest selections of camping equipment from the best suppliers in the industry. All of the camping products sold by OutdoorWorldDirect.co.uk are tried and tested in the field before they even reach the marketplace to ensure that they will meet high customer expectations.\u003C/p\u003E\n\n\u003Cp\u003EOur assistants are fully trained and are available during the week to offer advice on any product in our range, their extensive knowledge can help you decide which products most suit your camping needs. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}