{"name": "Outsourcing Services India",
 "permalink": "outsourcing-services-india",
 "crunchbase_url": "http://www.crunchbase.com/company/outsourcing-services-india",
 "homepage_url": "http://www.outsourceservicesindia.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it-services, php-programming, website-design-and-development, wordpress-development, joomla-development, erp-development, software-development, ecommerce-website-development, data-entry, data-mining, data-collection, data-processing, data-conversion, tran",
 "alias_list": null,
 "email_address": "info@outsourceservicesindia.com",
 "phone_number": "",
 "description": "Outsourcing Partner",
 "created_at": "Sun May 26 07:15:37 UTC 2013",
 "updated_at": "Mon May 27 16:31:18 UTC 2013",
 "overview": "\u003Cp\u003EOutsource Services India is a most reliable and a rapidly growing outsourcing company by establishing global presence quickly and highest level of customer satisfaction. Outsource Services India works on its unique philosophy, mission and methodology to deliver accurate and quality IT Services, Financial Services, BPO Services, Engineering Services and KPO services.\u003C/p\u003E\n\n\u003Cp\u003EOutsource Services India is having domain expertise and operation excellence to understand our clients business values. Our consulting led approach to deliver business solutions makes us unique from others.  Contact us on info@outsourceservicesindia.com \u003C/p\u003E\n\n\u003Cp\u003EOutsource Services India offering spans of services in IT php programming, website design and development, wordpress development, joomla development, erp development, software development, ecommerce website development, In BPO data entry, data mining, data collection, data processing, data conversion, transcription, data extraction, scanning and indexing, in KPO editing service, writing services, proofreading services, dtp services, typesetting services, In Engineering services architectural design and drafting, mechanical design and drafting, strcutural design and drafting, electrical design and drafting , MEP serivces and BIM serivces, In FPO services bookkeeping and accounting and SEO services.\u003C/p\u003E\n\n\u003Cp\u003EOutsourcing Services India is rising swiftly in offshore outsourcing industry by building long term client relationship. Outsourcing Services India served several clients of various industries with its competitive, cost beneficial and brisk services .\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "380051",
    "city": "Ahmedabad",
    "state_code": null,
    "country_code": "IND",
    "latitude": 23.0010182,
    "longitude": 72.511609}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}