{"name": "OX Factory",
 "permalink": "ox-factory",
 "crunchbase_url": "http://www.crunchbase.com/company/ox-factory",
 "homepage_url": "http://www.oxfactory.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "The Startup Factory",
 "created_at": "Tue Apr 09 15:08:44 UTC 2013",
 "updated_at": "Tue Apr 16 11:16:31 UTC 2013",
 "overview": "\u003Cp\u003EOX Factory ® is an ICT-focused \u0026#8220;startup factory\u0026#8221; designed to build high potential businesses, taking projects from the idea stage to launch. OX sports a world-class management team, record funding and stellar advisors stemming from several key sectors (technology, finance, media, etc\u0026#8230;). OX seeks to close the knowledge and resource gap experienced by entrepreneurs as they embark on their adventure by building its own startups. Fundamentally, OX is built around the assumption that game-changing ideas (and likewise startups) are the fruit of great concepts deployed by great teams having at their disposal a powerful resource platform. We are that team, we strive to come up with great concepts and we have created the platform. We call all of this: the OX Ecosystem. And out of that Ecosystem, we seek to build the leading startups of tomorrow.\u003C/p\u003E\n\n\u003Cp\u003EOX is a subsidiary of Corm Capital ®. Corm Capital is a global private holding company diversified across 5 main business units: finance, investments, technology, real estate and retailing. In each of these business units, Corm Capital owns leading companies passionately active in their respective markets. As a whole, the Corm Capital companies provide a holistic and synergistic approach to business. In other terms, due to Corm Capital\u0026#8217;s diversified nature and the synergies existing between its companies, Corm Capital has an impressive reach: in terms of services provided by its companies and in terms of coverage of the different functions companies require (funding, technology, marketing, business development, global deployment, etc\u0026#8230;). Add to that one of the most high caliber global contact networks in business. OX heavily capitalizes on Corm Capital\u0026#8217;s extensive business influence and reach to build the OX Ecosystem.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       17],
      "assets/images/resized/0024/9887/249887v4-max-150x150.png"],
     [[250,
       29],
      "assets/images/resized/0024/9887/249887v4-max-250x250.png"],
     [[345,
       41],
      "assets/images/resized/0024/9887/249887v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}