{"name": "OYCO Systems",
 "permalink": "oyco-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/oyco-systems",
 "homepage_url": "http://www.oyco.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "web portal",
 "created_at": "Sun Dec 27 16:37:30 UTC 2009",
 "updated_at": "Sun Dec 27 16:42:49 UTC 2009",
 "overview": "\u003Cp\u003EOyco.com stands for Organize Your Communication Online and is the first web portal to converge 7 different web-based communications tools into a simple-to-use virtual desktop protected by biometric security.Apart from being able to use the hottest trend in technology today, voice over internet protocol (VOIP), Oyco users also receive an email account, text and instant messaging services, one or more customizable personal websites and blogs as well as the ability to video and audio chat live. Since Oyco is completely web-based users do not need to download any software but can access all of these services from any computer.Multiple instant messaging services can be set up on the Oyco Messenger. Being interoptable means that the Ocyo Messenger can be used to chat with anyone on MSN, Yahoo, ICQ and AIM messengers as well as users on Oyco. Video and audio chat options are also available across all these platforms through Oyco.The Oyo messenger uses AES security to encrypt sessions so that they are completely private. Biometric security further enhances the Oyco service and makes it the best available today for anyone concerned about privacy issues.Biometric security analyses each user\u0026#8217;s unique keystroke rhythm so that each Oyco user has a unique login based on his or her method of typing. Thus Oyco provides triple-layer security that is unprecedented in the marketplace until now.Constantly changing with the speed of technology today, Oyco is on the cutting edge in providing the world\u0026#8217;s first biometrically secure, web-based communications portal that is the choice for anyone who wants to communicate securely and in a simpler way online.Oyco Systems Inc. is a privately held company with offices in Abbotsford and Vancouver Canada and also London England\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$1.19M",
 "funding_rounds":
  [{"round_code": "unattributed",
    "source_url": "",
    "source_description": "EDGAR",
    "raised_amount": 1190000.0,
    "raised_currency_code": "USD",
    "funded_year": 2008,
    "funded_month": 2,
    "funded_day": 7,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "Level 10 Capital",
         "permalink": "level-10-capital",
         "image":
          {"available_sizes":
            [[[150,
               39],
              "assets/images/resized/0026/5156/265156v1-max-150x150.png"],
             [[250,
               65],
              "assets/images/resized/0026/5156/265156v1-max-250x250.png"],
             [[321,
               84],
              "assets/images/resized/0026/5156/265156v1-max-450x450.png"]],
           "attribution": null}},
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}