{"name": "Ozmerix",
 "permalink": "ozmerix",
 "crunchbase_url": "http://www.crunchbase.com/company/ozmerix",
 "homepage_url": "http://www.ozmerix.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 4,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "security-company, fraud-recovery, credit-score",
 "alias_list": null,
 "email_address": "contact@ozmerix.com",
 "phone_number": "302-353-1466",
 "description": "Fraud Recovery Services",
 "created_at": "Sun Sep 23 12:36:38 UTC 2012",
 "updated_at": "Wed Sep 26 23:05:57 UTC 2012",
 "overview": "\u003Cp\u003EOzmerix LLC is a security company dealing with the increasing threat of online identity theft, fraud and privacy protection. As an increasing number of people and businesses are storing their financial data as well as their personal details online, the internet has become a new target for criminal activity. The company provides complete coverage that includes monitoring the accounts of its clients 24 hours a day. At the first suggestion of any suspicious activity that involves a client\u0026#8217;s name, account number or credit card number, the security professional on call contacts the client by phone or by email to take urgent action. When action is taken to stop the theft quickly, it often avoids spending enormous amounts of time and money in finding and repairing the damage. If a client\u0026#8217;s account is compromised in any way, the online advisor will help in replacing the cards and in repairing any damage caused to the client\u0026#8217;s credit score.\u003C/p\u003E\n\n\u003Cp\u003ESecurity Goals\u003C/p\u003E\n\n\u003Cp\u003EBy using the most advanced technology to fight cyber crime, Ozmerix LLC can successfully serve its clients by keeping their accounts and personal information safe from vandals. The company goal is to establish crystal clear objectives for each customer, partner or employee, which uses the most ethical values to provide security measures that are effective, to be enthusiastic and innovative and to display a steady client commitment.  These goals are carried out as the company is unwavering in its help and goal of protecting both clients and consumers, providing services that are secure and innovative and through customer and brand support achieved by partnering and joint cooperation. \u003C/p\u003E\n\n\u003Cp\u003EIdentity Protection\u003C/p\u003E\n\n\u003Cp\u003EThrough the TrustedID service, Ozmerix can help its members who have been the victims of fraud or theft. Once they entrust their bank account numbers and credit card information with the service, they can contact the On-Call protection specialist for help in retrieving the information and in replacing the cards.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[139,
       86],
      "assets/images/resized/0021/2619/212619v2-max-150x150.jpg"],
     [[139,
       86],
      "assets/images/resized/0021/2619/212619v2-max-250x250.jpg"],
     [[139,
       86],
      "assets/images/resized/0021/2619/212619v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Office",
    "address1": "",
    "address2": "",
    "zip_code": "19801",
    "city": "WILMINGTON",
    "state_code": "DE",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.ozmerix.biz",
    "title": "Ozmerix - Fraud Recovery Professionals"},
   {"external_url": "http://www.ozmerix.org",
    "title": "What is Ozmerix ?"},
   {"external_url": "http://www.visualcv.com/ozmerix",
    "title": "Ozmerix Company Profile"}]}