{"name": "P.M.Leathers",
 "permalink": "p-m-leathers",
 "crunchbase_url": "http://www.crunchbase.com/company/p-m-leathers",
 "homepage_url": "http://www.indiamart.com/pm-leathers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "pm-leathers@tradepassport.org",
 "phone_number": "9790733558",
 "description": "manufacturer, supplier \u0026 exporter",
 "created_at": "Thu Apr 04 07:59:33 UTC 2013",
 "updated_at": "Thu Apr 04 07:59:35 UTC 2013",
 "overview": "\u003Cp\u003EP.M. Leathers was established in the year 2001 as a sole partnership entity at Chromepet, Chennai, Tamil Nadu, India. We have a large clientele and widely renowned as leading and prominent manufacturer, supplier and exporter of Animal Skin Leather of excellent quality. The firm has been adding on newer products of varied designs as per client’s suggestions, choices and acceptance. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nExtreme care is taken to maintain the quality standards of our vast ranges of leather products. Our innovations, intricate patterns and designs have always found the inclination of client’s choice. Development of mutual trust is also of prime concern to us.\u003C/p\u003E\n\n\u003Cp\u003ETeam \u0026amp; Manpower:\nThe activity of leathers business is team oriented.  Our team of professionals comprise of qualified, skilled \u0026amp; dedicated craftsmen and experienced designers who are the genuine masters of creativity. We have engaged the professionals who are best in industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a complete and fully functional infrastructure which is spread over a large area. Sophisticated and ultra hi-tech machinery, equipment and high precision tools are installed to enable workmen to skilfully perform the activity of manufacturing, quality controlling, assembling and finishing of the products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nQuality of our products is the essential element looked very vigilantly to keep our clients satisfied. Acting upon valuable suggestions for incorporating changes in the products to their choices, our extremely talented professionals and skilled personnel are competent enough to ably comply accordingly for all the desired quality parameters such as elegant looks, intricate patterns and attractive designs, smooth texture, perfect appearance and others. Quality tests are conducted for analysis of goodness of raw materials and at every stage of manufacturing.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7655/247655v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7655/247655v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7655/247655v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}