{"name": "P2P-Next",
 "permalink": "p2p-next",
 "crunchbase_url": "http://www.crunchbase.com/company/p2p-next",
 "homepage_url": "http://www.p2p-next.org/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": 2,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Social Media Conglomerate",
 "created_at": "Wed Feb 20 23:47:38 UTC 2008",
 "updated_at": "Thu Jan 03 19:03:15 UTC 2013",
 "overview": "\u003Cp\u003EP2P-Next, created by the founders of Tribler,  is a pan-European conglomerate of 21 industrial partners, media content providers and research institutions. They are building a \u003Ca href=\"http://torrentfreak.com/eu-invests-22-million-in-next-generation-bittorrent-client/\" title=\"\u0026#8220;next-generation\u0026#8221; P2P client\" rel=\"nofollow\"\u003E\u0026#8220;next-generation\u0026#8221; P2P client\u003C/a\u003E and announced a €15 million grant from the European Union in February 2008. Another €4 million is donated by 21 project partners, including the BBC.\u003C/p\u003E\n\n\u003Cp\u003EP2P-Next will develop an open source, efficient, trusted, personalized, user-centric and participatory television and media delivery mechanism with social and collaborative connotations using the emerging P2P paradigm, which takes into account the existing EU legal framework.\u003C/p\u003E\n\n\u003Cp\u003EFrom the company: \u003Cem\u003E\u0026#8221;The P2P-Next project will run over four years, and plans to conduct a large-scale technical trial of new media applications running on a wide range of consumer devices. If successful, this ambitious project could create a platform that would enable audiences to stream and interact with live content via a PC or set top box. In addition, it is our intention to allow audiences to build communities around their favourite content via a fully personalized system.  This technology could potentially be built into VOD services in the future and plans are underway to test the system for broadcasting the 2008 Eurovision Song Contest live online. We will have an open approach towards sharing results. All core software technology will be available as open source, enabling new business models. P2P-Next will also address a number of outstanding challenges related to content delivery over the internet, including technical, legal, regulatory, security, business and commercial issues.\u0026#8221;\u003C/em\u003E\u003C/p\u003E\n\n\u003Cp\u003EThe P2P-Next integrated project will build a next generation Peer-to-Peer (P2P) content delivery platform, to be designed, developed, and applied jointly by a consortium consisting of high-profile academic and industrial players with proven track records in innovation and commercial success.\u003C/p\u003E\n\n\u003Cp\u003EThe current infrastructure of the Internet is not suited to simultaneous transmission of live events to millions of people (i.e. broadcasting). The problem is that a dedicated stream of data must be sent to every single user. With millions of potential users, the simultaneous streams of data will easily congest the Internet. For several years, we have been told that the answer to this problem is \u0026#8220;multicasting\u0026#8221;, whereby the data stream is distributed to many local servers that subsequently \u0026#8220;re-broadcast\u0026#8221; the content to local users.\u003C/p\u003E\n\n\u003Cp\u003EHowever, most IP routers of the Internet cannot support multicasting—and there seems to be no financial incentive for the ISPs to introduce multicasting. Also, the use of Audiovisual Media is moving from a collective and passive approach to personal active behavior, at home and in mobile situations outside the home. At the same time use patterns are shifting towards non-linear usages, moving away from the classic model of linear broadcast TV. The TV set no longer has the monopoly of delivery of audiovisual content; the PC and related media centers, mobile phones, and potentially initiatives from new stakeholders are all becoming increasingly important.\u003C/p\u003E\n\n\u003Cp\u003EIn such heterogeneous environments, efficient content delivery needs optimized unicast, multicast, broadcast, and also support for new mechanisms that have been made possible by the recent advances in P2P grids. This situation has important consequences for the existing business models and institutions, as well as for content production, content distribution, and end user experience on various terminals. This particular holds for stakeholders that propose services based on heterogeneous terminals and networks, together with the demand from users of transparent service continuity.\u003C/p\u003E\n\n\u003Cp\u003EThis makes Peer-to-Peer -based technologies that can provide efficient and low-cost delivery of professional and user created content essential for the technologically-competitive future Europe.\u003C/p\u003E\n\n\u003Cp\u003EIn response to these challenges, the objective of P2P-Next is to move forward the technical enablers to facilitate new business scenarios for the complete value chain in the content domain from a linear unidirectional push mode to a user centric, time and place independent platform paradigm. A platform approach allows modular development and modular applications, enables knowledge sharing and facilitates technology integration, code- and skill re-use. This translates to fast development of new content delivery applications that build value for service and content providers.\u003C/p\u003E\n\n\u003Cp\u003EP2P-Next will develop a platform that takes open source development, open standards, and future proof iterative integration as key design principles. These requirements will be developed through collaboration with European and national initiatives, as well as some of the largest and most sophisticated actors in the media and telecommunications sector, ensuring industrial relevance and worldwide application reach. P2P-Next involves 21 partners in 12 different countries, including large European players to ensure the future project\u0026#8217;s sustainability, SMEs and Subject Matter Experts to manage highly-focused technology components.\u003C/p\u003E\n\n\u003Cp\u003EP2P-Next will advance the state-of-the-art in important areas, including evolutionary content distribution, easy access to vast amount of content with metadata federation, social networking, and innovative business models for advertising. The sum of these advances is a large step towards moving the information access from the hands of a producer to the hands of the consumer, and allowing consumers to enjoy and utilise content resources in a mobile and pervasive manner, across the great online space. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[88,
       72],
      "assets/images/resized/0001/3118/13118v1-max-150x150.png"],
     [[88,
       72],
      "assets/images/resized/0001/3118/13118v1-max-250x250.png"],
     [[88,
       72],
      "assets/images/resized/0001/3118/13118v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "€19M",
 "funding_rounds":
  [{"round_code": "a",
    "source_url": "http://www.tribler.org/P2P-Next/19Million-for-P2P",
    "source_description": "",
    "raised_amount": 19000000.0,
    "raised_currency_code": "EUR",
    "funded_year": 2008,
    "funded_month": 2,
    "funded_day": 1,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "European Union",
         "permalink": "european-union",
         "image":
          {"available_sizes":
            [[[62,
               43],
              "assets/images/resized/0003/1425/31425v1-max-150x150.png"],
             [[62,
               43],
              "assets/images/resized/0003/1425/31425v1-max-250x250.png"],
             [[62,
               43],
              "assets/images/resized/0003/1425/31425v1-max-450x450.png"]],
           "attribution": null}},
       "person": null},
      {"company":
        {"name": "BBC",
         "permalink": "bbc",
         "image":
          {"available_sizes":
            [[[103,
               29],
              "assets/images/resized/0001/7620/17620v2-max-150x150.png"],
             [[103,
               29],
              "assets/images/resized/0001/7620/17620v2-max-250x250.png"],
             [[103,
               29],
              "assets/images/resized/0001/7620/17620v2-max-450x450.png"]],
           "attribution": null}},
       "financial_org": null,
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": null,
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "NLD",
    "latitude": 52.132633,
    "longitude": 5.291266}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}