{"name": "Pacific Timesheet Software",
 "permalink": "pacific-timesheet-software",
 "crunchbase_url": "http://www.crunchbase.com/company/pacific-timesheet-software",
 "homepage_url": "http://www.pacifictimesheet.com",
 "blog_url": "http://www.pacifictimesheet.com/blog",
 "blog_feed_url": "",
 "twitter_username": "pacificts",
 "category_code": "software",
 "number_of_employees": 50,
 "founded_year": 2005,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "timesheet, time-tracking, timesheet-software, time-sheet, web-time-sheet, time-and-attendance-software",
 "alias_list": null,
 "email_address": "finance@pacifictimesheet.com",
 "phone_number": "8664162061",
 "description": "Web Timesheet Software ",
 "created_at": "Mon Dec 27 17:28:13 UTC 2010",
 "updated_at": "Thu Dec 30 18:00:45 UTC 2010",
 "overview": "\u003Cp\u003EPacific Timesheet software provides time tracking, project timesheet, project time tracking, project management, project portfolio management, job costing, product life cycle management, payroll timesheet, and time and attendance features in one system. Modules include automated approvals, billing and pay rates, time-off scheduling, resource scheduling, custom reporting, project management dashboard, time clock integration and payroll integration. Each module can be licensed separately. Pacific Timesheet supports all major operating systems and browsers, and is available in licensed or ASP/online versions. Pacific Timesheet is built on an open, scalable and J2EE compliant services oriented architecture. Pacific Timesheet\u0026#8217;s extensive customization support can meet virtually every end user requirement, and makes it the best platform to consolidate and standardize your time tracking systems. This platform provides maximum control, flexibility and visibility allowing managers and administrators to deploy and standardize their time and work tracking implementations quickly with little or no training required. Pacific Timesheet Enterprise integrates seamlessly with your existing IT infrastructure and other software assets so you can easily merge and compare data across key systems. Custom configurations are available for specialized requirements. Extensive training services, including End User training, Project management admin training, Supervisor training, and Application Admin training, and consulting services ensure that rollout is on-time and user acceptance is high. http://www.pacifictimesheet.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}