{"name": "Pampadour",
 "permalink": "pampadour",
 "crunchbase_url": "http://www.crunchbase.com/company/pampadour",
 "homepage_url": "http://pampadour.com",
 "blog_url": "http://dailypamp.com",
 "blog_feed_url": "",
 "twitter_username": "pampadour",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "beauty-cosmetics-luxury-makeup-health-socialnetwork-skincare-hair-celebrities-beautyproducts",
 "alias_list": null,
 "email_address": "info@pampadour.com",
 "phone_number": "(516) 829-3701",
 "description": "Beauty Social Network",
 "created_at": "Thu Feb 14 20:33:31 UTC 2013",
 "updated_at": "Fri Feb 15 02:52:33 UTC 2013",
 "overview": "\u003Cp\u003EPampadour (www.pampadour.com) is an online social platform to share everything beauty. \u003C/p\u003E\n\n\u003Cp\u003EThe site combines the best features from familiar online social media networks into one destination uniquely tailored to the beauty enthusiast. Pampadour is a place to store virtually all your favorite beauty products. With a simple click, you can easily organize them for future reference in your profile. The Pampadour Feed allows you to discover new products, looks, video tutorials and much more. You can start a beauty discussion with friends, brands, professionals, and beauty lovers, recreate the red carpet looks of major celebrity makeup artists, or “Pamp” (share) a product to a friend. One of the most unique feature is the ability to upload photos and videos and “Tag” them with products. \u003C/p\u003E\n\n\u003Cp\u003EAll products that are featured, tagged or shared on Pampadour are linked to retailers’ websites and can be directly purchased by users, bridging the gap between media and sales. Beauty brands and professionals can utilize Pampadour as an outlet to promote new collections, gain exposure and build personal relationships with their followers. \u003C/p\u003E\n\n\u003Cp\u003EPampadour is a family affair. The site was founded by brother and sister-in-law, Roy Hakimian and Jennifer Hakimian, a self-declared beauty junkie. Jennifer was looking for a place to share her beauty wisdom as she was getting personal requests from friends asking for makeup recommendations. She realized that few of her friends had the patience or the know-how to sort through endless products and that sharing beauty could be easier and more dynamic with a social network completely devoted to beauty. With Roy’s entrepreneurial experience in the luxury field and Natalie Mazloumi, a childhood friend of the Hakimians, who curated all the technological aspects of the intricate website, Pampadour came to life. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       34],
      "assets/images/resized/0023/5977/235977v2-max-150x150.jpg"],
     [[250,
       56],
      "assets/images/resized/0023/5977/235977v2-max-250x250.jpg"],
     [[450,
       102],
      "assets/images/resized/0023/5977/235977v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "New York",
    "address1": "60 Cutter Mill Road",
    "address2": "",
    "zip_code": "NY11021",
    "city": "Great Neck",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}