{"name": "PaperStreet Attorney SEO",
 "permalink": "paperstreet-seo-law-firm",
 "crunchbase_url": "http://www.crunchbase.com/company/paperstreet-seo-law-firm",
 "homepage_url": "http://www.lawfirmseoresults.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "lawyer-seo, attorney-seo, lawyer-internet-marketing, attorney-internet-marketing, internet-marketing-lawyer, internet-lawyer-marketing, law-firm-seo, law-firm-internet-marketing, firm-internet-law-marketing, internet-marketing-for-law-firm",
 "alias_list": null,
 "email_address": "pslawseo@gmail.com",
 "phone_number": "954 523 2181",
 "description": "PaperStreet Attorney SEO",
 "created_at": "Fri Oct 14 06:23:05 UTC 2011",
 "updated_at": "Thu Jul 19 09:25:18 UTC 2012",
 "overview": "\u003Cp\u003EPaperStreet is a SEO, Internet Marketing and web design company with more than a decade of experience serving the needs of lawyers, attorneys and law firms.\u003C/p\u003E\n\n\u003Cp\u003EOur founder, Peter Boyd, is a Florida attorney who started the company after realizing the vast potential of the web for generating high-quality inquiries and clients in exchange for a very reasonable investment of time and money.\u003C/p\u003E\n\n\u003Cp\u003EOver the past 10 years, the company has grown quickly in response to the increasing demand for SEO, Internet advertising and web design services for the legal community. PaperStreet has designed more than 600 web sites and runs complex Internet marketing campaigns across the globe.\u003C/p\u003E\n\n\u003Cp\u003EWe see some of our most dramatic results from our SEO clients, several of which have seen million-dollar growth in their bottom line and receive multiple daily inquiries from the web. Visit our Results page to read more details about such success stories.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}