{"name": "Paradoxes",
 "permalink": "paradoxes",
 "crunchbase_url": "http://www.crunchbase.com/company/paradoxes",
 "homepage_url": "http://www.paradoxesinc.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 12,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "market-research, analysis, positioning, market, marketing, research, data, data-analysis, messaging, measurement, reporting",
 "alias_list": null,
 "email_address": "",
 "phone_number": "(425) 827-7484",
 "description": "Research, Analysis and Positioning",
 "created_at": "Thu Mar 07 22:32:26 UTC 2013",
 "updated_at": "Thu Mar 07 22:32:32 UTC 2013",
 "overview": "\u003Cp\u003EParadoxes performs research, analysis and positioning services across a variety of industries, audiences and organization sizes.  Paradoxes has built a team that is passionate about listening to their client\u0026#8217;s audiences, extracting insights from existing information, and utilizing those insights to help clients establish and improve market position. \u003C/p\u003E\n\n\u003Cp\u003EParadoxes provides expertise and techniques to drive primary research and help clients discover more about their products, customers, competitors, and markets. With deep experience in both qualitative and quantitative methodologies, research teams collect the right data to guide important business decisions. Paradoxes also extracts maximum value out of existing data to analyze, synthesize, and visualize the data, discovering actionable insights and patterns to move business forward. Paradoxes analysis, measurement, and reporting services provide the visibility and clarity to make informed changes, improving ROI. Every organization wants to establish and sustain a meaningful and differentiated competitive position in their target customers minds. Paradoxes provides data-driven guidance to relevantly and distinctively position the organization, products, and services. \u003C/p\u003E\n\n\u003Cp\u003E::Research::\u003C/p\u003E\n\n\u003Cp\u003EQualitative research: Focus groups (in-person and online), In-depth interviews, Advisory councils, Ethnography\u003C/p\u003E\n\n\u003Cp\u003EQuantitative research: Web surveys, Telephone surveys, Direct mail surveys, Kiosk surveys, Machine read\u003C/p\u003E\n\n\u003Cp\u003E::Analysis::\u003C/p\u003E\n\n\u003Cp\u003EAnalysis methodologies: Existing Information Synthesis, Conjoint analysis, Data modeling, Grounded theory method \u003C/p\u003E\n\n\u003Cp\u003EReporting: Visualization, Data cubes, Dashboards, Scorecards\u003C/p\u003E\n\n\u003Cp\u003E::Positioning:: \u003C/p\u003E\n\n\u003Cp\u003EApproach: Market opportunity analysis, Audience analysis, Competitive analysis, Pricing analysis\u003C/p\u003E\n\n\u003Cp\u003EPositioning outcomes: Segmentation, Persona/archetype development, Value proposition development, Positioning and messaging framework, Product planning\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0024/0757/240757v2-max-150x150.jpg"],
     [[250,
       62],
      "assets/images/resized/0024/0757/240757v2-max-250x250.jpg"],
     [[450,
       112],
      "assets/images/resized/0024/0757/240757v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Paradoxes, Inc.",
    "address1": "",
    "address2": "",
    "zip_code": "98033",
    "city": "Kirkland",
    "state_code": "WA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}