{"name": "PAREXEL",
 "permalink": "parexel",
 "crunchbase_url": "http://www.crunchbase.com/company/parexel",
 "homepage_url": "http://www.parexel.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": 12695,
 "founded_year": 1983,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "biopharmaceutical, clinical-research, medical-communications, consulting",
 "alias_list": null,
 "email_address": "",
 "phone_number": "781-487-9900",
 "description": "biopharmaceutical services company",
 "created_at": "Wed Dec 05 21:33:06 UTC 2012",
 "updated_at": "Thu Dec 06 06:02:00 UTC 2012",
 "overview": "\u003Cp\u003EPAREXEL International Corporation, a biopharmaceutical services company, provides clinical research, medical communications, consulting, commercialization, and advanced technology products and services to the pharmaceutical, biotechnology, and medical device industries worldwide. \u003C/p\u003E\n\n\u003Cp\u003EThe company operates in three segments: Clinical Research Services (CRS), PAREXEL Consulting and Medical Communications Services (PCMS), and Perceptive Informatics (Perceptive). The CRS segment offers clinical trials management, observational studies, patient/disease registries and post-marketing surveillance, data management and biostatistics, epidemiology and health economics/outcomes research, clinical logistics, pharmacovigilance, and clinical pharmacology, as well as related medical affairs, patient recruitment, and investigator site services. This segment manages various aspects of clinical trials, including study and protocol design, case report form design, paper or electronic questionnaires design, patient enrollment, study monitoring and data collection, data analysis, report writing, and medical services. \u003C/p\u003E\n\n\u003Cp\u003EThe PCMS segment provides technical expertise and advice in various areas, such as drug development, regulatory affairs, product pricing and reimbursement, and good manufacturing practice compliance consulting; and market development, product development, and targeted communications services in support of product launch. Its consultants also identify alternatives and propose solutions to address clients\u0092 product development, registration, and commercialization issues. In addition, this segment provides reimbursement and market access services. \u003C/p\u003E\n\n\u003Cp\u003EThe Perceptive segment provides information technology solutions comprising medical imaging and systems integration services; ClinPhone RTSM, CTMS, and DataLabs EDC products; Web-based portals; and patient diary applications. \u003C/p\u003E\n\n\u003Cp\u003EThe company was founded in 1983 and is headquartered in Waltham, Massachusetts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       64],
      "assets/images/resized/0022/4082/224082v2-max-150x150.jpg"],
     [[250,
       108],
      "assets/images/resized/0022/4082/224082v2-max-250x250.jpg"],
     [[307,
       133],
      "assets/images/resized/0022/4082/224082v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Project Manager",
    "person":
     {"first_name": "Janice",
      "last_name": "Dahms",
      "permalink": "janice-dahms",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://jobs.parexel.com/",
    "title": "PAREXEL Jobs and Careers"}]}