{"name": "Parth Hydraulics",
 "permalink": "parth-hydraulics",
 "crunchbase_url": "http://www.crunchbase.com/company/parth-hydraulics",
 "homepage_url": "http://www.indiamart.com/parthhydraulicsengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "parthhydraulicsengineering@tradepassport.org",
 "phone_number": "09953359534",
 "description": "manufacturer, wholesaler and supplier",
 "created_at": "Fri Apr 05 14:25:53 UTC 2013",
 "updated_at": "Fri Apr 05 14:25:56 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2007 at Pune, (Maharashtra, India), we, “Parth Hydraulics And Engineering Company”, are engaged in manufacturing, wholesaling and supplying a highly durable range of Industrial Products like Square Tubes And Round Tubes, Tapper Nuts, Square Weld Nuts, Hex Weld Nuts, Special Nuts, Bolts, Ball Valve, GI Pipe Fittings, etc.\u003C/p\u003E\n\n\u003Cp\u003EAim / Vision / Mission:\n    Develop our technology and infrastructure continuously in order that we may offer the latest available product to meet our customers\u0026#8217; expectations and the ever changing demands of the market place\n    Understand our markets and customer needs and expectations and continuously improve our service to facilitate growth\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have established state-of-the-art infrastructure that is spread over a broad area. Further, our infrastructure is divided into diverse units like production, quality control, research \u0026amp; development, warehousing \u0026amp; packaging, etc.\u003C/p\u003E\n\n\u003Cp\u003ETeam / Manpower:\nOur company is backed by a team of trained and experienced professionals, who have proven track record in their respective field. Strenuous efforts and full commitment towards work of our team members, helps us to effectively meet the varied clients\u0026#8217; demands for Piping products. Our team mates are quick learners and easily adopt new business and technical skills. \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy / Processes:\nPrime objective of our company has been to maintain optimum quality in the entire business endeavours. To attain this objective, we have implemented strict quality initiatives in every stage of supply operations. Procured products are further tested by our quality control scientists on industry specific parameters to ensure delivery of flaw less range to the customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8765/248765v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8765/248765v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8765/248765v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}