{"name": "patchwork collective",
 "permalink": "patchwork-collective",
 "crunchbase_url": "http://www.crunchbase.com/company/patchwork-collective",
 "homepage_url": "http://patchworkco.wordpress.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "patchwork_ed",
 "category_code": null,
 "number_of_employees": 3,
 "founded_year": 2010,
 "founded_month": 4,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "central-new-york, syracuse, new-york, cny, deconstruction, waste, design, redevelopment, community, social, waste-to-building, decon, recycle",
 "alias_list": null,
 "email_address": "patchwork.us@gmail.com",
 "phone_number": "",
 "description": "",
 "created_at": "Fri Apr 23 01:45:53 UTC 2010",
 "updated_at": "Thu Sep 23 18:05:45 UTC 2010",
 "overview": "\u003Cp\u003EPatchwork is a community based collective that offers innovative design and development solutions that reestablish vibrant living conditions. We specialize in redesigning reclaimed building components, utilizing them to patch and revitalize decaying structures or create new ones.\u003C/p\u003E\n\n\u003Cp\u003EWhy is patchwork relevant?\nIn the US, our waste from construction \u0026amp; demolition currently amounts to over 20 percent of the total waste going to landfills!!! The emerging deconstruction markets offer very disorganized and highly decentralized ways of obtaining and reusing reclaimed building materials. These \u0026#8220;decon\u0026#8221; markets are being driven by the cycling of an older and dying generation of buildings, that often only need a little patchwork. We enter the decon market by bridging the gap between the available surplus decon materials and consumers.              \u003C/p\u003E\n\n\u003Cp\u003EWhat does patchwork have to offer?\nPatchwork collective offers services to individuals and community groups in need of vital building systems and small home improvements. We specialize in redesigning reclaimed building components re-fabricated to fit a particular project\u0026#8217;s needs. This offers clients an alternative to using new building materials.\u003C/p\u003E\n\n\u003Cp\u003ESo how exactly does patchwork operate? \nWe operate as a non-profit social enterprise. Our mission at patchwork collective is simple: to provide accessible packaged design services, efficiently utilizing valuable deconstructed materials. These materials are reinvested back into the community, preserving the sense of place, brick by brick. \u003C/p\u003E\n\n\u003Cp\u003EWhat is patchwork\u0026#8217;s projected impact on the community?\u003C/p\u003E\n\n\u003Cp\u003EPatchwork\u0026#8217;s projected impact on the community, as a social enterprise, is five-fold. \u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EConserve natural capital by diverting deconstructed and demolished building material away from landfills and seize upon significant opportunities for reinvestment back into the community. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EBuilding with deconstructed materials will necessitate the need for a new line of training. This new training should create more economically resilient communities by fostering higher skilled labor and new job opportunities.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EDevelop an education and awareness campaign marketing Patchwork to potential clients and community leaders. A word-of-mouth marketing campaign would foster a large amount of small scaled opportunities within the community to bring about change from the ground up.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EIn alliance with existing deconstruction networks, we hope to aid in tracking the reuse of deconstructed materials. Utilizing their databases would simultaneously aide in the creation of new historical narratives and the preservation of old historical narratives within the community.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EWe hope to create a sense of pride in neighborhoods through community involvement, increasing safety, health, and property values through the removal of debilitated structures, the revitalization of decaying structures, and the development of new private and public works.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E",
 "image":
  {"available_sizes":
    [[[150,
       44],
      "assets/images/resized/0008/4653/84653v2-max-150x150.png"],
     [[250,
       73],
      "assets/images/resized/0008/4653/84653v2-max-250x250.png"],
     [[450,
       132],
      "assets/images/resized/0008/4653/84653v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://ow.ly/2HwTG",
    "title": "Patchwork Solution to Urban Decay"}]}