{"name": "Patentula",
 "permalink": "patentula",
 "crunchbase_url": "http://www.crunchbase.com/company/patentula",
 "homepage_url": "http://patentula.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "patentula",
 "category_code": "software",
 "number_of_employees": 6,
 "founded_year": 2011,
 "founded_month": 3,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "patents, search, optimization, visualization",
 "alias_list": null,
 "email_address": "patentula@gmail.com",
 "phone_number": "415-652-2388",
 "description": "Patent Search Optimization",
 "created_at": "Tue Jun 21 09:42:14 UTC 2011",
 "updated_at": "Sat Dec 15 04:44:33 UTC 2012",
 "overview": "\u003Cp\u003E\u0026#8220;Wars may be fought with weapons, but they are won by men.\u0026#8221;\nGeorge S. Patton\u003C/p\u003E\n\n\u003Cp\u003EWe believe today\u0026#8217;s patent wars are no different- we are just building the new era of weapons! Search and analysis of large datasets has been a recurrent problem approached by different groups in different ways: most rely on keyword search and statistical analytics.\u003C/p\u003E\n\n\u003Cp\u003EThe USTPOs public dataset on US/International patents applications and grants has been approached in similar ways, and yet it has yet to be fully utilized. This neglect is linked to the datas poorly tailored structure for keyword search algorithms. The most notable example is Google Patents, where the hardships are evident in the attempt to implement keyword frequency analysis to streamline patent exploration. This niche space requires a disruptive concept that could cause a paradigm shift in the execution and visualization of search in conceptually linked data groups.\u003C/p\u003E\n\n\u003Cp\u003EThere exists a tangible market need to simplify and streamline patent searching and novelty exploration, especially infringement detection. This encompasses the simplification of patent filing, comparison and retrieval both for private/judicial and government agencies as well as a means for industry to interact with inventors or consulting firms to research future technological developments.\u003C/p\u003E\n\n\u003Cp\u003EBy building a visualization and search engine centered around non keyword based algorithms (our secret sauce - patent pending), we allow users to overcome the problems faced by competitor approaches and enhance their search experience. Our goal is to simplify the problem to where it may be crowdsourced!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0015/6767/156767v2-max-150x150.png"],
     [[250,
       214],
      "assets/images/resized/0015/6767/156767v2-max-250x250.png"],
     [[450,
       386],
      "assets/images/resized/0015/6767/156767v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://patentula.com",
    "title": "Patentula"}]}