{"name": "Patent Assistance Worldwide",
 "permalink": "patent-assistance-worldwide",
 "crunchbase_url": "http://www.crunchbase.com/company/patent-assistance-worldwide",
 "homepage_url": "http://patentassistanceworldwide.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 50,
 "founded_year": 1990,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "patent",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Patent Assistance Experts",
 "created_at": "Wed May 23 20:54:32 UTC 2012",
 "updated_at": "Sat Dec 15 04:37:33 UTC 2012",
 "overview": "\u003Cp\u003EPatent Assistance Worldwide is a team of committed professionals all focused on the same common goal – to provide support to individuals and groups in product development, innovation, and new ideas. Through a multi-focused approach of product analysis and review, risk determination, process guidance, and patent education, the company helps inventors and innovators at any stage of the patenting process.\u003C/p\u003E\n\n\u003Cp\u003EPatent Assistance Worldwide operates using a clearinghouse business model. What this means for clients is they will receive assistance in locating and securing a registered, independent patent attorney. Attorneys will help clients through the complex and often confusing legal process in securing a patent.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to attorney services, the company also provides unbiased, unfiltered market feedback based on client ideas. This process helps countless clients refine their ideas and inventions into considerably more marketable products and services.\u003C/p\u003E\n\n\u003Cp\u003EOur firm works with professionals from multiple industries, including universities, graphic designers, bonded draftsmen, attorneys, and licensing experts. This broad range of services allows the greatest amount of assistance possible for clients of all levels, industries, and markets. \u003C/p\u003E\n\n\u003Cp\u003EOur services also include the following:\u003C/p\u003E\n\n\u003Cp\u003E Innovation Feedback, Guidance, and Development\n Patent Searching Support\n Research and Documentation Assistance\n Patent Illustration Training\n Assistance with License and Agreement Drafting\u003C/p\u003E\n\n\u003Cp\u003EOur clearinghouse model allows clients from across the United States and Europe to receive professional, effective service. Our team works tirelessly to continue developing and maintaining professional relationships throughout multiple industries. Accordingly, our efforts reflect in the outstanding service we provide to clients.\u003C/p\u003E\n\n\u003Cp\u003EAt Patent Assistance Worldwide, we pride ourselves on client satisfaction. We have provided exemplary service to countless inventors, developers, and innovators, and continue to improve our services in the ever-changing industry. The entire team looks forward to continued service to innovators for years to come.\u003C/p\u003E\n\n\u003Cp\u003EAre you interested in patent assistance? Contact Patent Assistance Worldwide today at 888-238-3329 or visit our site at www.patents4ideas.com.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}