{"name": "PBTP Solar Contractors",
 "permalink": "pbtp-solar-contractors",
 "crunchbase_url": "http://www.crunchbase.com/company/pbtp-solar-contractors",
 "homepage_url": "http://pbtpsolarcontractors.com",
 "blog_url": "http://solarcontractors.weebly.com",
 "blog_feed_url": "http://solarcontractors.tumblr.com/",
 "twitter_username": "ContractorSolar",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "solar-company, solar-company-ca, solar-installation, solar-panel-installers, solar-installers-california, california, commercial-solar-contractors-california, commercial-solar-installers-california, commercial-solar-panel-installation, commercial-solar-pa",
 "alias_list": null,
 "email_address": "CynthiaDevault897@gmail.com",
 "phone_number": "(888) 751-6011",
 "description": "Solar Energy Contractors",
 "created_at": "Mon Feb 25 19:16:15 UTC 2013",
 "updated_at": "Tue Feb 26 08:01:43 UTC 2013",
 "overview": "\u003Cp\u003EWe help you take steps to reduce your impact on the planet, while saving you both time and money.\u003C/p\u003E\n\n\u003Cp\u003EHere at PBTP Solar Contractors, we keep it easy and effortless. We skillfully design and carefully install dependable and lucrative solar power systems to allow our clients to be more energy independent, decrease the burning of carbon-based fuels and save money. Our solar company provides assistance to both residential and commercial properties in Los Angeles, Orange County and Ventura County.\u003C/p\u003E\n\n\u003Cp\u003EOur solar installers take solar from theory to a actuality; in other words, we are on the way to getting it complete. As sunshine is so dominant, dependable and delivered every day – free of charge – the ordinary rooftop of almost every residence or business is an undeveloped site for a solar power plant. A solar panel is just like an engine, except you do not have to buy any fuel and they run for decades.\u003C/p\u003E\n\n\u003Cp\u003EOur solar company has the deepest knowledge in solar pool and domestic water heating. Our dedicated employees and service staff ensure quality service when executing their solar installation job. We look forward to supplying you with the system that you need for your home or business.\u003C/p\u003E\n\n\u003Cp\u003EWhat does all this experience mean for you? \u003C/p\u003E\n\n\u003Cp\u003EIt means composure because you are dealing with a company that drives more by after-the-scale technical and engineering concerns than by an easy desire to make the next sale. You can expect:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EStraight Answers\nCorrect system sizing for your unique needs and site factors\nRealistic expectations of system performance\nCorrect plumbing installation and system hydraulics\nThe most advanced, safe and trouble-free systems available today\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EPhone: \n(888) 751-6011\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       145],
      "assets/images/resized/0023/8223/238223v2-max-150x150.jpg"],
     [[250,
       241],
      "assets/images/resized/0023/8223/238223v2-max-250x250.jpg"],
     [[450,
       434],
      "assets/images/resized/0023/8223/238223v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}