{"name": "Pearls Tours and Travels",
 "permalink": "pearls-tours-and-travels",
 "crunchbase_url": "http://www.crunchbase.com/company/pearls-tours-and-travels",
 "homepage_url": "http://www.pearlsindiatour.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": 2013,
 "founded_month": 4,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "tour-package, southindia-tours",
 "alias_list": null,
 "email_address": "viji.seoteam@gmail.com",
 "phone_number": "0422 2330932",
 "description": "We are a duly recognized travel agency. ",
 "created_at": "Wed Jan 30 12:38:35 UTC 2013",
 "updated_at": "Fri Feb 01 20:35:52 UTC 2013",
 "overview": "\u003Cp\u003EWe are a duly recognized travel agency. We aim at promoting tourism in India by providing a variety of tour packages to all parts of India with all kinds of travel related services to make your tours memorable and enjoyable.\u003C/p\u003E\n\n\u003Cp\u003EWith long experience, our company is successful in offering the best travel related services to its clients.\u003C/p\u003E\n\n\u003Cp\u003EWe offer complete, cost effective and customized tour packages, showcasing India\u0026#8217;s every aspect at its best. \u003C/p\u003E\n\n\u003Cp\u003EOur primary services are :\u003C/p\u003E\n\n\u003Cp\u003ETour Packages - Coimbatore Online Travel Agency\u003C/p\u003E\n\n\u003Cp\u003EWe are one of the Coimbatore Online Travel Agency, we arrange a number of comprehensive tour packages covering cities, temples, beaches, wildlifes, monuments, pilgrimages, hillstations and festivals.\u003C/p\u003E\n\n\u003Cp\u003EOur holiday package includes all the famous tourists spots and suits every budget.\u003C/p\u003E\n\n\u003Cp\u003EStarting from Kashmir in the north to Kanyakumari in the south, Gujarat in the West to Kolkata in the east, all the remarkable sites are included in our packages.\nHotel Reservation - Coimbatore Travel Agency\u003C/p\u003E\n\n\u003Cp\u003ECoimbatore Travel Agency ,We also arranged the accommodation facilities in hotels of all categories for individual and groups in all parts of India.\u003C/p\u003E\n\n\u003Cp\u003EWith an extensive network of hotel booking services we offer discounted rates in all the hotels ranging from deluxe to standard hotels.\u003C/p\u003E\n\n\u003Cp\u003EOn request, we also provide stay in the houseboats and sanctuaries guest houses.\u003C/p\u003E\n\n\u003Cp\u003ECar/Coach Rental - Travel Agency of Coimbatore India\u003C/p\u003E\n\n\u003Cp\u003ETravel agency Of Coimbatore India - We offer car and coach rental services for hassle-free travel.\u003C/p\u003E\n\n\u003Cp\u003EFor sightseeing we boast a large fleet of cars like Ambassador, Tata Indica, Tata Sumo, Toyata Qualis, Maruti Suzuki, Fiat, Honda City, Mitsubishi Lancer, Mercedes- Benz and large coaches.\u003C/p\u003E\n\n\u003Cp\u003EOnly you have to inform us the place and time and our chauffeur along with the desired car will be there to receive you.\u003C/p\u003E\n\n\u003Cp\u003EAir Ticketing - Travel Agency of Coimbatore India\u003C/p\u003E\n\n\u003Cp\u003ECoimbatore Online Travel Agency, we do air ticketing services to our clients and customers.\u003C/p\u003E\n\n\u003Cp\u003EAll you have to do is inform us about the destinations and preferences and we will do the rest for you as soon as possible.\u003C/p\u003E\n\n\u003Cp\u003EDocumentation\u003C/p\u003E\n\n\u003Cp\u003EWe also assist you in documentation work regarding passport and visa.\u003C/p\u003E\n\n\u003Cp\u003EWe, on your behalf, make arrangements regarding documentation services to save your valuable time, ensuring comfort all the way long.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure\u003C/p\u003E\n\n\u003Cp\u003EOur workforce includes a team of well trained and dedicated professionals.\u003C/p\u003E\n\n\u003Cp\u003EWe also have a good network with other tour operators in the country who help us in air ticket bookings, hotels bookings and tour planning.\u003C/p\u003E\n\n\u003Cp\u003EClients\u003C/p\u003E\n\n\u003Cp\u003EOur clientele includes individuals, groups, corporate houses and government organisations. Many multinational companies have availed of our services in the recent past and have become our clients.\u003C/p\u003E\n\n\u003Cp\u003EMission\u003C/p\u003E\n\n\u003Cp\u003EOur main aim is to conserve the rich heritage of India and to present the Indian culture, religion, wildlife, pilgrimage in a unspoilt and unhindered way. \u003C/p\u003E\n\n\u003Cp\u003EBook immediately to get the special discount offer before March 15th 2013.\u003C/p\u003E\n\n\u003Cp\u003EBest regards\u003C/p\u003E\n\n\u003Cp\u003EViji\nfor Pearlsindiatour\nContact : 98422-55573 / 98422 55573 /  0422 2333922\nWebsite : www.pearlsindiatour.com \nE-mail : info@pearlsindiatour.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       109],
      "assets/images/resized/0023/2558/232558v2-max-150x150.png"],
     [[234,
       171],
      "assets/images/resized/0023/2558/232558v2-max-250x250.png"],
     [[234,
       171],
      "assets/images/resized/0023/2558/232558v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}