{"name": "pedant softech",
 "permalink": "pedant-softech",
 "crunchbase_url": "http://www.crunchbase.com/company/pedant-softech",
 "homepage_url": "http://www.pragnatechnologies.com",
 "blog_url": "http://pragnatechnologies.blogspot.in/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 10,
 "founded_year": 2006,
 "founded_month": 8,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sap-online-training, oracle-online-training, data-ware-housing-online-training, java-online-training, online-training-india",
 "alias_list": null,
 "email_address": "info@pragnatechnologies.com",
 "phone_number": "5133185902",
 "description": "it training company",
 "created_at": "Thu Jul 12 04:57:19 UTC 2012",
 "updated_at": "Thu Jul 12 17:44:58 UTC 2012",
 "overview": "\u003Cp\u003EPragna Technologies  a Hyderabad based online IT training company firmly believes in \u0026#8220;Translating knowledge into skills, accompanied by practice\u0026#8221; and \u0026#8220;Evolving vision with skills put to test in complex and exacting situations\u0026#8221; It is for this reason, Pragna adopts an empirical approach to IT training(Class room and online). Pragna offers incisive and insightful training in a range of platforms and in-demand technologies. The programs primarily focus on imparting the knowledge and skills necessary to keep pace with the latest advancements in software technology.  A singular strength of Pragna’s Training is its FACULTY, a highly skilled and vastly experienced team enriched with more than a decade’s exposure to the global IT industry. It is this wide-ranging real-world exposure, which places Pragna’s Training Programs a step ahead when it comes to future-focused IT training - for professionals and individuals alike.\u003C/p\u003E\n\n\u003Cp\u003EOur success, especially in the world of intense competition, is because of our continuous hard work, dedication, and passion. We are passionate about what we do and we are driven to excel in every aspect of our business.\u003C/p\u003E\n\n\u003Cp\u003ELeveraging on the expertise of our faculties, we have emerged as professional trainers in India offering impeccable trainings in various Online Technologies. We train the aspiring individuals on different technologies whilst making them experts by providing unmatched trainings and project exposure. Our courses are recognized in the corporate world and are accompanied with completion certificates.\u003C/p\u003E\n\n\u003Cp\u003EWe are among the trusted service providers of SAP Training, IT services, training services, implementation, consultation and many more. To render the complete satisfaction to our valued clients, we have adopted many techniques and methods that ensure reliability of our services. All the services offered by us are developed and executed in accordance with the client’s specifications by the experts. Our services comprise SAP – MM, SAP FI/CO, SAP BASIS, SAP –HR, SAP- PP and many more. \u003C/p\u003E\n\n\u003Cp\u003EWe offer Software Training and Other technologies training apart from SAP training. These software Training has become a rising need of all kinds of corporate and other establishments. Our clients can set up online systems through their different branch offices and operate the same from a single point. Easy to sue, maintain and follow up, this software can be used with ease by all.\u003C/p\u003E\n\n\u003Cp\u003EOurs is a reputed institution in India that offers unparalleled Online Training Services in different technological domains. We have with us expert faculties who design the courses to meet the varied requirements of corporate and other establishments. Our experts also help in setting online systems in their different branch offices and guide them in operating the same from their head office.\u003C/p\u003E\n\n\u003Cp\u003EWe also have the expertise in offering IT Consultancy Services to highly enthusiastic professionals. These services are provided by our experienced staff members who have considerable working experience in offering different types of IT Consultancy Services. Our personnel guide individuals in selecting appropriate career options and help them select a domain as per their comfort levels. We also guide individuals in selecting courses that will help them in their future growths.\u003C/p\u003E\n\n\u003Cp\u003EWe also have expertise in offering students and professionals with impeccable Auto CAD Training. Our faculty members guide students in effectively using the advanced tools and techniques of AutoCAD. We guide students in developing sophisticated product designs, architecture and other solutions using this software.\u003C/p\u003E\n\n\u003Cp\u003EWith the immaculate trainings that we offer in different technological domains, we also organize for excellent Academic Projects Training. Our association with reputed IT companies and corporate enable us acquire live projects, which we ask students to work upon. This gives them exposure to the industry competition and also gain in expertise in their chosen domain of work. We also undertake various Academic Training Projects and provide students with impeccable technology trainings.\u003C/p\u003E\n\n\u003Cp\u003EONLINE AND CLASS ROOM TRAININGS AT PRAGNA TECHNOLOGIES\nSAP • ABAP •FICO• HR• MM• PP• SD• BASIS • BI/BO • WM •CRM •HANA •SRM •OIL AND GAS• IS RETAIL•BPC•PLM•PM•PS•XI/PI\nCLOUD COMPUTING-SALES FORCE• AUTO CAD• TALLY• SAS• TESTING TOOLS \nDATA STAGE•INFORMATICA•OBIEE•TERADATTA• COGNOS 8.4\nORACLE APPS •ORACLE RAC• ORACLE FUSION•ORACLE HRMS •ANDROID• ORACLE FLEXCUBE• ORACLE 10g DBA• ORACLE 10g \u0026amp; D2K• ORACLE 9i•ORACLE WEBLOGIC SERVER• Oracle SOA\nPEOPLESOFT•TIBCO•LAMBORDI •ADOBE FLEX•ANDROID • PERL• Dot Net 4.0• DRUPAL• ETL• HIBERNATE • IBM Web Sphere Admin• J2EE •JAVA • JOOMLA • LOAD RUNNER • Basic Perl Scripting• PHP•SIEBEL•SHARE POINT•DYNAMICS•HYPERION\nSEO • Shell Scripting• Spring • Selenium •SQL Server DBA •Testing Tools •Web Designing\nProjects for B.Tech/MCA/MBA\nJAVA/.NET REAL TIME PROJECT WITH 100% PLACEMENT\nAUTO CAD Projects\nExcited about us! Let’s get in touch. You can meet us at\n     Pragna Technologies,\n     Flat No. 308,309,310,Nilagiri Block,\n     Aditya Enclave,\n     Ameerpet,\n     Hyderabad – 500 038. \n     Andhra Pradesh, India. \n     Please feel free to talk to us for your consulting, development and training requirements. \n     Hello: +91 40 4003 6678\n               +91 40 6457 5775, +91- 9246212199\n        US no:  +1 513 318 5902\nFor more details visit us at www.pragnatechnologies.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}