{"name": "PeopleClaim",
 "permalink": "peopleclaim",
 "crunchbase_url": "http://www.crunchbase.com/company/peopleclaim",
 "homepage_url": "http://www.peopleclaim.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "support@peopleclaim.com",
 "phone_number": "866-875-7221",
 "description": "Online dispute resolution",
 "created_at": "Fri Mar 25 18:41:26 UTC 2011",
 "updated_at": "Thu Apr 07 01:22:32 UTC 2011",
 "overview": "\u003Cp\u003EPeopleClaim is a completely NEW online dispute resolution system for people who have a dispute and do not want to spend valuable time and/or thousands of dollars on lawyers, lawsuits, or mediators. With PeopleClaim you can make your complaint online AND settle your complaint online!\u003C/p\u003E\n\n\u003Cp\u003EPeopleClaim provides easy to use, customer-friendly features. The process of making a complaint is simple and straightforward and gives fast results! No more waiting on lawyers and court dates!\u003C/p\u003E\n\n\u003Cp\u003EFile online to resolve complaints against product or service providers, websites, professionals government agencies and more! Users can negotiate their own terms to recover damages, refunds, overcharges, lost wages, debts or to address non-cash problems like repairs, rebates, etc.\u003C/p\u003E\n\n\u003Cp\u003EFiling a complaint is simple! We deal with all types of disputes - small claims, large claims, claims against people, claims against companies. Claims start at as little as $1.00 with no upper limit, and non monetary claims are covered as well. If you have a dispute, PeopleClaim can help you!\u003C/p\u003E\n\n\u003Cp\u003EHow it works:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EUsers fill out a complaint form on peopleclaim.com and submit it.\u003C/li\u003E\n\u003Cli\u003EThe complaint is delivered directly to the offending party.\u003C/li\u003E\n\u003Cli\u003EThe offending party then must respond to the complaint in a reasonable amount of time - two weeks, two months. It\u0026#8217;s your claim, you get to choose, no more waiting on lawyers and court dates.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EIf the offending party does not respond within the grace period, we post the complaint publicly on the internet - through multiple websites and social media outlets. When the offending party does respond, they negotiate the terms directly with you, through PeopleClaim.com, allowing you to come to an equitable resolution.\u003C/p\u003E\n\n\u003Cp\u003EAll online, any claim, anywhere in the world!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "The JACI Group",
    "address1": "2094 185th St Ste 24.",
    "address2": "",
    "zip_code": "52556",
    "city": "Fairfield",
    "state_code": "IA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}