{"name": "Pereira \u0026 Stryker",
 "permalink": "pereira-stryker",
 "crunchbase_url": "http://www.crunchbase.com/company/pereira-stryker",
 "homepage_url": "http://Pereira-Stryker.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "biotech, high-tech, engineering, consulting",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Project staffing and consulting co.",
 "created_at": "Wed Mar 21 03:29:15 UTC 2012",
 "updated_at": "Tue Mar 27 18:00:01 UTC 2012",
 "overview": "\u003Cp\u003EPereira-Stryker, LLC. is a premier executive recruitment and executive search firm in the San Francisco Bay Area . Everything we do throughout the executive recruiting process is directed toward one aim and one goal – aligning the most qualified andbest- fit candidates with our clients. \u003C/p\u003E\n\n\u003Cp\u003EEvery step we take in achieving a successful business recruiting campaign will benefit both employers and professionals. With over 15 years of experience in the industry, Pereira- Stryker has seen both the good and bad sides of traditional recruiting firms and has used that experience to build a company with clear strategic advantage in talent acquisition.\u003C/p\u003E\n\n\u003Cp\u003EWe strive to be the provider of high-quality executive recruitment services in the bay area, and leverage both our Retained and Contingency executive search practices to provide value to clients in both areas of recruiting services. We specialize in business recruiting for the following areas:\u003C/p\u003E\n\n\u003Cp\u003E• Engineering\n• Biotech\n• Business Management\n• \nOur regional business recruiting focus helps us foster strong relationships with local companies and candidates. We have gathered comprehensive information about most local employers, which helps us in understanding the cultural and personality traits of our clients and candidates. By keeping a close eye on our market, we find the best local companies and candidates to provide best recruiting practices.\u003C/p\u003E\n\n\u003Cp\u003E• We focus 100 percent of our time, energy, and investment delivering the skill set and cultural fit you need. We are focused on your goals.\n• Senior partners actually do the work. We meet with your hiring managers, we flush out requirements, we provide market intelligence, we write the specification, and we sell it in the market. We deliver results.\n• We care. We build long-term relationships and partnerships based on the success of our placements, our commitment to seeing the job through, constant communication, and prudence with your time and money. \n• Your success is our success. \u003C/p\u003E\n\n\u003Cp\u003EProject Staff\u003C/p\u003E\n\n\u003Cp\u003E*Leann Pereira is a human resources and organization development professional specializing in staffing. She has over fifteen years of experience both in corporate environments and in field environments. In 1997 Leann founded Recruiter.net where she worked with early-stage high-tech start-ups and established Fortune 500 software and bio-tech companies. Leann has extensive experience in search practice and methodology.   She holds an MS in Organization Development, a certificate in Human Resources Management, and two certificates in AIRS web search methodologies.  \u003C/p\u003E\n\n\u003Cp\u003E*Susan Stryker is a project manager with over fifteen years of experience in all phases of project management, program management, as well as experience in product development and marketing consulting. She has a BS and MS in Biosciences from UC Berkeley and has worked as a staff scientist at Lawrence Berkeley Laboratory and as research scientist at UCLA Medical School. She has a CPM from UC Berkeley in project management and has worked as a project manager and staffing consultant in private industry and research institutions.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}