{"name": "Perfection Machinery",
 "permalink": "perfection-machinery",
 "crunchbase_url": "http://www.crunchbase.com/company/perfection-machinery",
 "homepage_url": "http://www.perfectionmachinery.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 100,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "used-machinery, machinery-auctions",
 "alias_list": null,
 "email_address": "sales@perfectionmachinery.com",
 "phone_number": "866-314-4970",
 "description": "Used Machinery Dealers",
 "created_at": "Fri Dec 21 13:50:32 UTC 2012",
 "updated_at": "Sun Dec 23 06:22:03 UTC 2012",
 "overview": "\u003Cp\u003EPerfection Machinery has been buying and selling used assets around the world since 1963. Over the years we have steadily increased our services and made it our mission to help our customers meet and exceed their used asset goals. We have structured Perfection\u0026#8217;s operations into three distinct, but interwoven business units:\u003C/p\u003E\n\n\u003Cp\u003E• Perfection Machinery Sales\u003C/p\u003E\n\n\u003Cp\u003EWe are one of the world\u0026#8217;s largest stocking dealers of used industrial machinery and assets. If you are looking to buy or sell used machinery or other industrial assets we can help. If you are buying, choose from our large inventory or use our unparalleled database to locate the machine you require. If you are selling we can make you a cash offer or sell the asset for you using our extensive experience and our unparalleled database.\u003C/p\u003E\n\n\u003Cp\u003E• Perfection Industrial Sales\u003C/p\u003E\n\n\u003Cp\u003EWe have earned a global reputation as the number one source for buying, selling and remarketing used industrial assets. This reputation is built upon our more than 50 years of success and our tireless dedication to our customers\u0026#8217; goals and needs. Once we understand what a customer wants to achieve, a customized plan is presented. When the customer has reviewed and approved the tailored plan, Perfection Industrial Sales moves quickly to execute the plan and deliver industry-best results.\u003C/p\u003E\n\n\u003Cp\u003E• Perfection Investment Recovery\u003C/p\u003E\n\n\u003Cp\u003EPerfection\u0026#8217;s customized Investment Recovery Programs offer you unique, proactive approaches to maximizing return on your company\u0026#8217;s surplus, idle or soon to be idle assets. We use our 50 years of experience to expertly market your assets to a worldwide audience. By combining knowledgeable staff with hyper-aggressive, targeted marketing, we are able to find buyers who are willing and able to pay top dollar for your used assets.\u003C/p\u003E\n\n\u003Cp\u003EPerfection welcomes the opportunity to review your specific requirements and goals. We will provide a detailed, flexible, results-driven solution as we have successfully done for thousands of our clients.\u003C/p\u003E\n\n\u003Cp\u003EOur goal is to earn your business now and in the future. Thank you for the opportunity.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Home Office",
    "address1": "2550 Arthur Ave",
    "address2": "",
    "zip_code": "60007",
    "city": "Elk Grove Village ",
    "state_code": "IL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}