{"name": "PervelWater Management",
 "permalink": "pervelwater-management",
 "crunchbase_url": "http://www.crunchbase.com/company/pervelwater-management",
 "homepage_url": "http://www.indiamart.com/pervel/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "pervel@tradepassport.org",
 "phone_number": "9444898979",
 "description": "Manufacturing, supplying and exporting,",
 "created_at": "Fri Apr 05 08:34:31 UTC 2013",
 "updated_at": "Fri Apr 05 08:34:35 UTC 2013",
 "overview": "\u003Cp\u003EPervel Water Management Solutions was established in 1999 as a Sole Proprietorship firm engaged in manufacturing, supplying and exporting technically advanced array of Brackish Water RO Systems, Sea Water RO Systems, Ultrafiltration Systems, Industrial RO Systems, Commercial RO Systems, Residential RO Systems, Domestic RO Systems, Industrial RO Water Plants, Water Softeners, Iron Removal Plants, UV Sterilizers, Water Filtration Systems and Water Treatment Systems. \u003C/p\u003E\n\n\u003Cp\u003EOur Vision:\nTo satisfy the requirements of people everywhere through to provide technically advanced products and services.It is this vision that inspires Pervel to deliver products that aptly meet the needs of the market, building an unshakeable trust in Industrial, Commercial, Residential through the years. Pervel started in 2004, is one of the water management solution given company in Tamil Nadu. \u003C/p\u003E\n\n\u003Cp\u003ETechnology:\nThe driving force behind our successTechnology is the cornerstone of pervel products and services. Given the fast pace of change in technology it is imperative for every successful company to stay ahead of the times. Pervel ensures research and study in the field of water treatment and ensures use of the same in continuously upgrading the quality.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Facilities:\nWe are supported by a technically advanced manufacturing facility that is embedded with sophisticated tools and machinery. Our entire unit is well-segregated into different sections that assist us to streamline the entire business operations in most effective manner. Our professionals ensure that the entire machinery and equipment are regularly updated and lubricated to ensure smooth flow of production process.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur organization is supported by experienced and adept professionals who put their tireless efforts in catering diverse requirements of the clients in international market. Our teammates work round the clock to meet the diverse requirements of the clients in best possible manner. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nStrict to ensure safety and longevity of products By applying rigorous standards of quality, Pervel has been able to deliver sustained success through the years. Whether it’s about the safety of the products of their longevity, the processes and tests at Pervel ensure the customers get the best every time.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8437/248437v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8437/248437v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8437/248437v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}