{"name": "petdogtraining",
 "permalink": "petdogtraining",
 "crunchbase_url": "http://www.crunchbase.com/company/petdogtraining",
 "homepage_url": "http://ecdt.com.au/",
 "blog_url": "http://dog-obedience-trainer.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1981,
 "founded_month": 6,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dog-obedience-trainer, puppy-training, dog-obedience-class",
 "alias_list": null,
 "email_address": "dogschool10@gmail.com",
 "phone_number": "",
 "description": "Find the best dog obedience class",
 "created_at": "Tue Mar 19 11:17:13 UTC 2013",
 "updated_at": "Tue Mar 19 11:17:16 UTC 2013",
 "overview": "\u003Cp\u003EDo you love pets? What about dogs? Do you have one in your home? As we all know, a dog is human’s best friend that never cheats on him or leave him during difficulties. They are such creatures that will always stay honest towards you. They won’t lie, they won’t cheat behind you and they don’t have any ulterior motives. \u003C/p\u003E\n\n\u003Cp\u003EIf you are really passionate about them, then you must take them to dog obedience classes or hire the services of a skilled dog obedience trainer. With the increasing number of pet population, it would be equally important to implement standard life styles for them. Dog obedience classes can bring so many positive effects in your pup. \u003C/p\u003E\n\n\u003Cp\u003ETo enjoy the real joy of owning a pet, then it would be necessary that you know the importance of dog obedience classes. Through several training processes implemented in the puppy training and obedience classes, the dog obedience trainer would sort out all the behavioral problems and work for its modification. When our pets learn the real life obedience and how to socialize, then it will strengthen our communication line with them.\u003C/p\u003E\n\n\u003Cp\u003EThere are so many training schools that offer in home pet training, boarding services and puppy training classes. When you take an opportunity for giving proper socialization and training to our canine friends, then they will become one’s lifelong companion and a trusted member in the society.\u003C/p\u003E\n\n\u003Cp\u003EPuppy training classes given during 4 to 16 weeks of age should improve their overall temperament and prevents their common behavioral problems. Either you can train them by self or depend on a dog obedience trainer. But don’t forget to discuss the issues with your trainer once he starts the training sessions. Dogs just love you, just give that love back.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       107],
      "assets/images/resized/0024/3541/243541v2-max-150x150.jpg"],
     [[250,
       179],
      "assets/images/resized/0024/3541/243541v2-max-250x250.jpg"],
     [[450,
       322],
      "assets/images/resized/0024/3541/243541v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}