{"name": "Petition Partners",
 "permalink": "petition-partners",
 "crunchbase_url": "http://www.crunchbase.com/company/petition-partners",
 "homepage_url": "http://www.petitionpartners.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "A Petition Company",
 "created_at": "Wed May 30 14:36:40 UTC 2012",
 "updated_at": "Fri Jun 08 01:57:54 UTC 2012",
 "overview": "\u003Cp\u003EAt Petition Partners, we focus on facilitating your political goals. As full-service petition managers, we give your campaign some extra energy. Our professional petition managers gather signatures for you, allowing you to focus on other things.\u003C/p\u003E\n\n\u003Cp\u003EIf you want a candidate or referendum on a ballot, signatures are essential. Many campaigns and causes fail due to a lack of participation. We will circulate and track petitions and help you achieve your signature goals.\u003C/p\u003E\n\n\u003Cp\u003EThis company operates with the intent to bring professionalism and accessibility to politics. We help you get your voice heard. The world of politics can be overwhelming without professional assistance. Petition Partners helps you navigate the campaign process.\u003C/p\u003E\n\n\u003Cp\u003EYou are probably wondering what exactly Petition Partners can do for you. Here is a list of what you can expect from us:\u003C/p\u003E\n\n\u003Cp\u003E Professionalism. Our staff treats every client respectfully. We also focus on being honest knowledgeable. Each stage of our work with you is conducted with professionalism and transparency.\n Accessibility. You always have easy access to information about your campaign. Clients can reach our staff readily by phone or email. We also offer status reports with current campaign information. We aim to provide clarity throughout the process.\n Verification. While no one can promise 100% authentic signatures, we come close. Our petition managers use a five-point verification process. This creates reasonable assurance that the signatures we gather are authentic.\u003C/p\u003E\n\n\u003Cp\u003EWe also offer a large amount of advanced services. Other benefits include:\u003C/p\u003E\n\n\u003Cp\u003E Monitoring the signatures gathered by opposing parties.\n Creating and posting signs for your campaign.\n Staffing polling places.\n Conducting exit polls on Election Day.\n Technologically advanced processing and data entry.\u003C/p\u003E\n\n\u003Cp\u003EAs you can see, we present you with a wide selection of tools for success. We have worked on political projects for campaign managers, politicians, and activists. Our staff has a combined thirty years of experience. This includes everything from national races to school board elections.\u003C/p\u003E\n\n\u003Cp\u003EPetition Partners is truly a unique company. Currently, we are the only full-time petition managers in Arizona. Professional petition management can provide a critical leg-up in any political endeavor. Get ahead of your competition with Petition Partners.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}