{"name": "Phootime",
 "permalink": "phootime",
 "crunchbase_url": "http://www.crunchbase.com/company/phootime",
 "homepage_url": "http://www.phootime.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "network_hosting",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "photo-sharing, photo-storage, photography, gallery, album, backup-photo",
 "alias_list": null,
 "email_address": "support@phootime.com",
 "phone_number": "",
 "description": "Photo sharing and storage",
 "created_at": "Thu Nov 15 14:41:31 UTC 2012",
 "updated_at": "Fri May 03 02:47:46 UTC 2013",
 "overview": "\u003Cp\u003EA Brand New Photo Sharing and Storage Service!\u003C/p\u003E\n\n\u003Cp\u003EYour camera is too good. Images are too large. Not sure where to share or store your pictures?\u003C/p\u003E\n\n\u003Cp\u003EPhootime is a brand new service focusing on providing photo-shooting lovers the most valuable photo-sharing platform and also the solution for backup space problem. With the rapid technology of digital camera, both image pixel and size are rising. It is difficult to find a perfect space for users to store their image and protect the pictures from disappearing with the broken hard-drive. Phootime specify in providing users’ needs in protecting and sharing their pictures.\u003C/p\u003E\n\n\u003Cp\u003EPhootime is equivalent to a safe deposit for your images. It does not only provide a space for your images, but Phootime also cares about users needs for their image. The pictures that store at Phootime is guaranteed that with the unlimited uploads saved on Phootime will keep an out-standing quality even the user made a size-adjust on photos; which is hardly found on other platforms. It also values users’ experience and put users’ concerns in mind. Besides sharing photos on regular social platform, Phootime expands the sharing function for pro-users to embedding images/videos from YouTube and with paid users get to import their images from Flickr. A little addition on top of all the benefits for photographers is that all users can customize their own page into their own style. Phootime’s special features create a complete full service for photographers.\u003C/p\u003E\n\n\u003Cp\u003E•   Out standing quality\nPhootime protects your images at best quality after uploading and re-sizing.\u003C/p\u003E\n\n\u003Cp\u003E•   Unlimited backup space\nUnlimited images and videos upload space. Phootime also provides backup space  for pro-users to save RAW photos and get the original files back whenever you like.\u003C/p\u003E\n\n\u003Cp\u003E•   Sharing\nSharing your image to Facebook, Twitter and Google+ and automatically sync the photos on to Facebook album.\u003C/p\u003E\n\n\u003Cp\u003E•   User friendly\nDRAG-TO-UPLOAD without Flash; support HTML5. Phootime provides 3 browsing interface selections for users to choose base on individual’s taste of style. \u003C/p\u003E\n\n\u003Cp\u003E•   Group similar images\nYou have uploaded a lot of similar photos and can’t decide which ones to keep, so your viewers lose interests because the photos are too similar. “Grouping photos” is designed to remedy this. When you group the photos, Phootime will generate slideshows with the optimized grouped photos. This unique feature is available in all three layout formats to bring a better journey on viewing galleries.\u003C/p\u003E\n\n\u003Cp\u003E•   Customize\nAll users can customize your personal album through CSS/HTML/JavaScript and to use own domain name.\u003C/p\u003E\n\n\u003Cp\u003E•   Safe and private\nThe album is supported to protect by security code. It is 99.999999999% safe.\u003C/p\u003E\n\n\u003Cp\u003E•   Embed YouTube, Import to Phootime from Flickr\nPhootime will bring more importing source selections in the future.\u003C/p\u003E\n\n\u003Cp\u003EChoose your own image safe deposit! Phootimes released 3 plans for users to store and share the photos: Free, 39.95USD/year, 59.95USD/year all with 14 days trial. It only takes a little to store your memories on the most considerate photos sharing/storing platform.\u003C/p\u003E\n\n\u003Cp\u003EPlease visit the website for more information: http://www.phootime.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/1685/221685v2-max-150x150.png"],
     [[180,
       180],
      "assets/images/resized/0022/1685/221685v2-max-250x250.png"],
     [[180,
       180],
      "assets/images/resized/0022/1685/221685v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "Phootime",
    "permalink": "phootime",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [{"description": "Reach 10,000 members",
    "stoned_year": 2013,
    "stoned_month": 4,
    "stoned_day": 21,
    "source_url": "",
    "source_text": null,
    "source_description": "",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Phootime",
      "permalink": "phootime"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        119],
       "assets/images/resized/0022/1686/221686v2-max-150x150.png"],
      [[250,
        199],
       "assets/images/resized/0022/1686/221686v2-max-250x250.png"],
      [[450,
        359],
       "assets/images/resized/0022/1686/221686v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        110],
       "assets/images/resized/0022/1687/221687v2-max-150x150.png"],
      [[250,
        183],
       "assets/images/resized/0022/1687/221687v2-max-250x250.png"],
      [[450,
        330],
       "assets/images/resized/0022/1687/221687v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}