{"name": "Pictorama App",
 "permalink": "pictorama-app",
 "crunchbase_url": "http://www.crunchbase.com/company/pictorama-app",
 "homepage_url": "https://www.pictorama.com/",
 "blog_url": "https://blog.pictorama.com/",
 "blog_feed_url": "https://blog.pictorama.com/index.php/feed/",
 "twitter_username": "Pictoramaapp",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "pictorama-photography-apps-iphone-smartphone-mobile-devices-application-earn-money-cash-pictures",
 "alias_list": null,
 "email_address": "richard@pictorama.com",
 "phone_number": "+49 (0)40 8000 529 12",
 "description": "Photography app to license your pictures",
 "created_at": "Mon Aug 27 16:03:44 UTC 2012",
 "updated_at": "Thu Aug 30 11:50:17 UTC 2012",
 "overview": "\u003Cp\u003ETech crunch team, John Manoogian III, Steve O\u0026#8217;Hear,\u003C/p\u003E\n\n\u003Cp\u003EThis will be of special interest for the editors John Manoogian III (http://goo.gl/CY2B6) and Steve O\u0026#8217;Hear (http://goo.gl/KglQ8).\u003C/p\u003E\n\n\u003Cp\u003EFirst of all, I want to introduce this overview with a 5th way to monetize your smartphone application. In a second step I will introduce Pictorama to you. Finally this overview will analyse the weeknesses and strenghts of both platforms, Pictorama and Foap.\u003C/p\u003E\n\n\u003Cp\u003ESo, here we go. Next to the 4 monetization strategies for apps mentioned by John Manoogian III (http://goo.gl/CY2B6) there are additional monetization strategies - for example eCommerce applications. Therefore, in a first step lets exclude the traditional eCommerce services like amazon and ebay which developed apps as another channel to use an already established product and focus on innovations, apps that were developed to become a product that monetize itself over time. There are a couple of these services out there. Pictorama is clearly one of these services. Others are Clipflip, AppJobbler, Foap or Scoopshot.\u003C/p\u003E\n\n\u003Cp\u003EPictorama was founded for various reasons. 1. Camera phone technology has risen to a level that allows pictures taken with the iPhone or Android Phone to be as good as photos taken with professional equipment. 2. There is a hype for smartphone photography, as Instagram clearly proves. Photo sharing and editing apps are advancing in technology and the market is slowly moving towards consolidation. However, as of now, there are no apps that actually monetize this community or editing apps effectively in the long run. 3. The demand for microstock photography is stable and expacted to grow at a normal rate over the course of the next 3-4 years. The overall demand for licensed microstock photography exceeds 100 million photos a year. Pictorama is entering the market at a time when the market for microstock photography is consolidating. However, smartphone photography differs from professional photography. Which lead to the conclusion that the demand for smartphone photography is different than the demand for professional photography. 4. camera producers like Nikon are working on cameras that work on Android or iOS platforms. Nikon just released the Coolpix S800c, that functions on a Android platform.\u003C/p\u003E\n\n\u003Cp\u003EPictorama and Foap both try to monetize the hype for smartphone photography. However, both platforms follow different strategies to reach their goal. Foap\u0026#8217;s business concept is simple, each photo uploaded to Foap is sold for $10. This is a great entry strategy to attract many app users. However, in the long run most photos will not sell for that price, as the average market price for microstock photography is somewhere around $6-$7, and Foap users might be disappointed. Pictorama offers a more complex pricing strategy that allows Pictorama to offer a photo on average for $3-$4, which is below the average microstock level. That\u0026#8217;s how Pictorama tries to ensure that a high volume of photos will be purchased in the long run.\u003C/p\u003E\n\n\u003Cp\u003EAll the best,\nRichard\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       112],
      "assets/images/resized/0020/8336/208336v2-max-150x150.png"],
     [[250,
       187],
      "assets/images/resized/0020/8336/208336v2-max-250x250.png"],
     [[450,
       337],
      "assets/images/resized/0020/8336/208336v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[114,
        114],
       "assets/images/resized/0020/8333/208333v2-max-150x150.png"],
      [[114,
        114],
       "assets/images/resized/0020/8333/208333v2-max-250x250.png"],
      [[114,
        114],
       "assets/images/resized/0020/8333/208333v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        112],
       "assets/images/resized/0020/8334/208334v2-max-150x150.png"],
      [[250,
        187],
       "assets/images/resized/0020/8334/208334v2-max-250x250.png"],
      [[450,
        337],
       "assets/images/resized/0020/8334/208334v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[99,
        150],
       "assets/images/resized/0020/8335/208335v2-max-150x150.jpg"],
      [[125,
        188],
       "assets/images/resized/0020/8335/208335v2-max-250x250.jpg"],
      [[125,
        188],
       "assets/images/resized/0020/8335/208335v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.gruenderszene.de/interviews/pictorama",
    "title": "Article about Pictorama at Gründerszene"}]}