{"name": "Pigeonwave",
 "permalink": "pigeonwave",
 "crunchbase_url": "http://www.crunchbase.com/company/pigeonwave",
 "homepage_url": "http://www.pigeonwave.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "pigeonwave",
 "category_code": "enterprise",
 "number_of_employees": 2,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "communciation, sme, online, tool, free, social-networking, cms, content-management, business-directories, directory, website-builder",
 "alias_list": "",
 "email_address": "admin@pigeonwave.com",
 "phone_number": "",
 "description": "Online SME Communication Tool",
 "created_at": "Fri Feb 12 14:44:54 UTC 2010",
 "updated_at": "Mon Feb 15 22:21:34 UTC 2010",
 "overview": "\u003Cp\u003EPigeonwave is a online communication tool for businesses, particularly aimed at the SME sector.\u003C/p\u003E\n\n\u003Cp\u003EPigeonwave\u0026#8217;s goal is to help companies get closer to their business relations and customers. Over the years the internet has proven itself to be an important place for business, yet there are many companies still to embrace it - particularly in the SME sector.\u003C/p\u003E\n\n\u003Cp\u003EPigeonwave uses cutting edge technology, presented in a way familiar to most internet users, to deliver a socially powered website that will allow businesses to quickly and easily engage with customers and contacts, communicate effectively, and reach a wider audience.\u003C/p\u003E\n\n\u003Cp\u003EPigeonwave is designed to bring together the best of Social Networking, Business Directories, Website Builders and Content Management Systems, to empower any SME company.\u003C/p\u003E\n\n\u003Cp\u003EIt is a service with two sides:\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003EThe Outside\u003C/em\u003E; a page (called a portal) where businesses can communicate with the world, be it consumers or clients. Key information, directions, photos, products, and more can be presented to everyone.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003EThe Inside\u003C/em\u003E; a workspace where businesses can create, manage and share their information. Use the dashboard to see who has sent feedback, or keep things current with status updates. Manage contacts, invite other businesses to join, connect and communicate with other businesses, make changes to your portal and a whole lot more, \u003Cem\u003Ewith no cost\u003C/em\u003E.\u003C/p\u003E\n\n\u003Cp\u003EA small company with big ambition, proudly based in Scotland, looking forward to growing the network and helping business and consumers alike.\u003C/p\u003E\n\n\u003Cp\u003EAll the core functionality is free, and the website is in a beta phase.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0007/6873/76873v2-max-150x150.png"],
     [[240,
       240],
      "assets/images/resized/0007/6873/76873v2-max-250x250.png"],
     [[240,
       240],
      "assets/images/resized/0007/6873/76873v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}