{"name": "Pilz",
 "permalink": "pilz-gmbh-co-kg",
 "crunchbase_url": "http://www.crunchbase.com/company/pilz-gmbh-co-kg",
 "homepage_url": "http://www.pilz.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1948,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "automation-technology, pilz, control-technology, sensor-technology, safety-relay, safety-relays, pnoz, e-stop, machinery-safety, machine-safety",
 "alias_list": "",
 "email_address": "pilz.gmbh@pilz.de",
 "phone_number": "+49 711 3409-0",
 "description": "automation technology",
 "created_at": "Wed Feb 13 10:40:06 UTC 2013",
 "updated_at": "Thu Feb 14 05:40:34 UTC 2013",
 "overview": "\u003Cp\u003ECurrently employing more than 1,600 staff worldwide, Pilz operates internationally as technology leader in automation technology. In this area Pilz is consistently developing a role as a total solutions supplier for safety and control technology. \u003C/p\u003E\n\n\u003Cp\u003EIn addition to the head office in Germany, Pilz is represented by subsidiaries and branch offices in 28 countries. \u003C/p\u003E\n\n\u003Cp\u003EProducts include sensor technology, electronic monitoring relays, automation solutions with motion control, safety relays, programmable safety and control systems and an operating and monitoring range. Safe bus systems, Ethernet systems and industrial wireless systems are also available for industrial networking.\u003C/p\u003E\n\n\u003Cp\u003EPilz also provides a comprehensive range of services, including an extensive selection of training courses. The area of consulting and engineering provides a comprehensive, competent service - from plant assessment to risk assessment, through to system implementation and safety sign-off at the customer’s premises.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}