{"name": "Pioneer Enterprises",
 "permalink": "pioneer-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/pioneer-enterprises",
 "homepage_url": "http://www.indiamart.com/pioneer-enterprises-bengaluru/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ht-xlpe-cables, copper-flexible-cables, frfrls-wires-and-ethernet-cables-",
 "alias_list": null,
 "email_address": "pioneer-enterprises-bengaluru@tradepassport.org",
 "phone_number": "9845047407",
 "description": "Our company is reckoned for supplying, ",
 "created_at": "Thu Apr 04 14:17:32 UTC 2013",
 "updated_at": "Thu Apr 04 14:17:36 UTC 2013",
 "overview": "\u003Cp\u003EPioneer Enterprises was formed in the year 2008 as a Partnership firm. Since establishment, we are involved in supplying, distributing and wholesaling a wide assortment of HT XLPE Cables, Copper Flexible Cables, FR/FRLS Wires and Ethernet Cables. We are  authorised distributors for the POLYCAB Brand wires \u0026amp; cables. POLYCAB is the largest selling brand of wires \u0026amp; cables in India. POLYCAB wires \u0026amp; cables are approved in all major departments, consultants, contractors \u0026amp; industries. POLYCAB manufactures products using premium quality raw material, therefore they are highly acknowledged among clients for their matchless features such as tensile strength, heat resistance, shock proof, excellent conductivity, reliability and others. POLYCAB products are sourced from the reputed vendors. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality has always played a most important role in establishing our company’s name in the list of top-notch organizations. In order to carry out systematic and efficient testing operations, we have established a highly sophisticated quality control department at our premises. This unit is managed by our specialized and experienced team of quality controllers, who perform strict quality checks over the complete product range before their final dispatch in the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWith the support of our highly experienced and dexterous team of professionals, we are capably meeting the growing demands of clients. Team working with us holds unmatched experience and knowledge of respective domain by which we ably understand as well as provide solutions to clients accordingly. Moreover, our team performs in coordination to achieve set targets within given time period. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client focused firm, focused our entire efforts to supply range as per the exact requirements of clients. For this, various market surveys are conducted by our experts to understand the specifications of clients and provide solutions according to that only. By making transparent dealings, following ethical business practices and providing cost effective solutions, we have acquired huge support of clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n HT XLPE Cables, Copper Flexible Cables, FR/FRLS Wires and Ethernet Cables. We are  authorised distributors for the POLYCAB Brand wires \u0026amp; cables. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7963/247963v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7963/247963v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7963/247963v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}