{"name": "Pioneer Distributors",
 "permalink": "pioneer-distributors",
 "crunchbase_url": "http://www.crunchbase.com/company/pioneer-distributors",
 "homepage_url": "http://www.indiamart.com/pioneer-distributors/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "pioneer-distributors@tradepassport.org",
 "phone_number": "9833866890",
 "description": "trader and supplier of Kitchen Cabinets,",
 "created_at": "Thu Apr 04 12:48:18 UTC 2013",
 "updated_at": "Thu Apr 04 12:48:23 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2001, we, “Pioneer Distributors”, are counted amidst the apex organizations which are engaged in trading and supplying of an exemplary range of Kitchen Cabinets, Appliances and Chimneys. Furthermore, we are also involved in providing world-class Modular Kitchen Designing services to the clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe believe that a talented manpower is the essential part of any organization in order to suit the growing demands of its clients. Therefore, we paid utmost attention to our professionals while selecting them through a strict hiring process. It helped us to build a team of highly skilled and experienced team of professionals which is suitable to run our business operations in productive manner.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are counted amongst the quality-centric traders and suppliers of Kitchen Cabinets, Appliances and Chimneys. All these products are sourced only from the well-recognized vendors of the market so as to ensure their quality. We procure the offered products only form the vendors who follow strict quality-policy and utilize ultra-grade raw material for their manufacturing. Apart from it, we have developed a highly sophisticated in-house quality testing laboratory which is well-equipped with advanced technologies.\u003C/p\u003E\n\n\u003Cp\u003EManufacturing Facilities:\nThe following are the manufacturing facilities of our company:\n    Membrane Pressing\n    Veneer Pressing\n    Post Forming\n    4 Side Edge Bending\n    CNC Routing\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nTo ensure trading and supplying of an exemplary array of Kitchen Cabinets, Appliances and Chimneys in accordance with the clients\u0026#8217; growing demands, we have joined hands with some of the leading vendors of industry. We singed the deals with our vendors after studying and deeply analyzing them on varied parameters.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince our establishment, we have been striving to the gain optimum client-satisfaction at every stage of our business operations. For this, we take every possible measure and emphasize to meet their every single requirements. In order to meet our clients\u0026#8217; variegated requirements, we are involved in trading and supplying of a commendable array of Kitchen Cabinets, Appliances and Chimneys as well as providing highly reliable Shutter Designing services.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7909/247909v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7909/247909v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7909/247909v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}