{"name": "Piyush Pharma Machineries",
 "permalink": "piyush-pharma-machineries",
 "crunchbase_url": "http://www.crunchbase.com/company/piyush-pharma-machineries",
 "homepage_url": "http://www.indiamart.com/piyushpharmamachineries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "piyushpharmamachineries@tradepassport.org",
 "phone_number": "9737677664",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 05:06:42 UTC 2013",
 "updated_at": "Fri Apr 05 05:06:46 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1996, we “Piyush Pharma Machineries” are engaged in manufacturing and supplying a premium quality range of Pharmaceutical Machineries such as Storage Tank, Ribbon Blender, Pharmaceutical Furniture, Pharmaceutical Mixer \u0026amp; Oven, Pharmaceutical Vessel, Planetary Mixer, Filter Press and S.S Railing. All these pharmaceutical products are designed \u0026amp; developed in compliance with the industry standards and are offered to clients in varied models \u0026amp; specifications. Along with offering pharmaceutical products, we are also engaged in offering Fabrication Job Work for these machines and equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nA sole proprietorship firm, we have been able to create immense success and growth in this domain owing to our skilled professionals. In our team, we have engineers, quality controllers, technicians, research associates, warehouse personnel and sales \u0026amp; marketing executives. They are provided with requisite training to keep them abreast of the changing market trends.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality has been the foremost objective of our organization since our inception and we assure that all our products are made in compliance with the industry standards. Quality controllers at our premise are well aware of the changing market trends and assure that the raw material used in the production process are optimum in quality. They further check the finished range on well defined parameters before these are delivered to the clients.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWith half a decade of industry experience, we are well aware of the fact that it is essential to have sophisticated facilities to meet the growing demands of our clients. Thus, we have developed state-of-the-art infrastructure that spreads across a sprawling area and houses following facilities.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a customer oriented organization and ensure that all our products \u0026amp; services meet the exact demands of our clients. Thus, all our professionals are trained to follow ethical and client-centric practices throughout different stages of production and post production.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nPharmaceutical Vessel\nPlanetary Mixer\nFilter Press\nS.S. Railing\nFabrication Job Work\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       104],
      "assets/images/resized/0024/8235/248235v2-max-150x150.jpg"],
     [[250,
       174],
      "assets/images/resized/0024/8235/248235v2-max-250x250.jpg"],
     [[382,
       267],
      "assets/images/resized/0024/8235/248235v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}