{"name": "Planet Metrics",
 "permalink": "planet-metrics",
 "crunchbase_url": "http://www.crunchbase.com/company/planet-metrics",
 "homepage_url": "http://www.planetmetrics.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "clean-tech, carbon-emmision, carbon-footprint",
 "alias_list": null,
 "email_address": "info@planetmetrics.com",
 "phone_number": "(415) 814-1578",
 "description": "",
 "created_at": "Thu Nov 13 07:00:10 UTC 2008",
 "updated_at": "Fri Oct 09 17:18:33 UTC 2009",
 "overview": "\u003Cp\u003EPlanet Metrics is a carbon information management (CIM) software company that provides streamlined modeling, analytics and complex data visualization for corporate sustainability strategists and product innovation teams. Planet Metric\u0026#8217;s goal is to guide customers in their corporate decision making to achieve sustainability goals and improve financial performance. Working with major brands in automotive, consumer packaged goods, retail, technology, and other industries, Planet Metrics provides Rapid Carbon Modeling (RCM) technology which offers organizations software to model, visualize, and manage carbon reduction efforts throughout the company\u0026#8217;s operations. Integrated analytics and visualizations make it easy to identify hot spots of carbon intensity in packaging, supply chain, transportation, logistics, and disposal. Planet Metrics solutions are typically deployed in under 30 days, and integrate existing Lifecycle Assessment (LCA) data, GHG Inventories, and other enterprise business application data.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0002/8437/28437v1-max-150x150.png"],
     [[239,
       70],
      "assets/images/resized/0002/8437/28437v1-max-250x250.png"],
     [[239,
       70],
      "assets/images/resized/0002/8437/28437v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "CTO and Co-Founder",
    "person":
     {"first_name": "Aaron",
      "last_name": "Dallek",
      "permalink": "aaron-dallek",
      "image":
       {"available_sizes":
         [[[110,
            110],
           "assets/images/resized/0027/5197/275197v1-max-150x150.jpg"],
          [[110,
            110],
           "assets/images/resized/0027/5197/275197v1-max-250x250.jpg"],
          [[110,
            110],
           "assets/images/resized/0027/5197/275197v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$2.3M",
 "funding_rounds":
  [{"round_code": "a",
    "source_url": "http://www.siliconvalleywire.com/svw/2008/11/san-francisco-based-planet-metrics-raises-23-million-in-first-round.html",
    "source_description": "San Francisco-Based Planet Metrics Raises $2.3 Million in First Round",
    "raised_amount": 2300000.0,
    "raised_currency_code": "USD",
    "funded_year": 2008,
    "funded_month": 11,
    "funded_day": 12,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "Angel Investors LP",
         "permalink": "angel-investors-lp",
         "image": null},
       "person": null},
      {"company": null,
       "financial_org":
        {"name": "Draper Fisher Jurvetson (DFJ)",
         "permalink": "draper-fisher-jurvetson",
         "image":
          {"available_sizes":
            [[[150,
               87],
              "assets/images/resized/0001/0989/10989v2-max-150x150.png"],
             [[245,
               143],
              "assets/images/resized/0001/0989/10989v2-max-250x250.png"],
             [[245,
               143],
              "assets/images/resized/0001/0989/10989v2-max-450x450.png"]],
           "attribution": null}},
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "1111 Bayhill Drive,",
    "address2": "#255 ",
    "zip_code": "94066",
    "city": "San Bruno",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.628328,
    "longitude": -122.420814}],
 "milestones":
  [{"description": "Planet Metrics Chosen to Measure Carbon for World's Largest Consumer Technology Tradeshow - 2009 International CES",
    "stoned_year": 2008,
    "stoned_month": 11,
    "stoned_day": 11,
    "source_url": "",
    "source_text": "November 11, 2008, Burlingame, CA -  Planet Metrics, a Carbon Information Management (CIM) company, and the Consumer Electronics Association (CEA), producer of the International CES, the world's largest consumer technology tradeshow, today announced a partnership to measure and analyze the amount of carbon and other greenhouse gases (GHG) emitted as a result of 2009 International CES in Las Vegas to be held January 8-11.\r\n\r\nSee today's related press release, \"Planet Metrics Enters Carbon Information Management Market; Helps Customers Reduce Carbon and Increase Profit\" which announces the official launch of Planet Metrics and the close of $2.3 million in Series A funding from angel investors and Draper Fisher Jurvetson . Planet Metrics provides streamlined carbon modeling and visualization software for customers taking steps to reduce carbon emissions. \"Having the ability to measure and track performance through time will enable CEA to understand the reality of actual carbon output, set reduction targets, effectively reducing the environmental impact of the show,\" said Andy Leventhal, CEO and co-founder of Planet Metrics.\r\n\r\nPlanet Metrics has been working with CEA for several months to collect information, calculate models, and analyze the carbon footprint of the International CES, North America's largest annual tradeshow and the world's largest consumer technology tradeshow, which draws more than 130,000 attendees each year. Planet Metrics is working with CEA and its associated suppliers to collect necessary data to model the GHG emissions associated with CES' operations and activities including transportation, electricity, fuel usage and hotel room stays. Using Planet Metrics' RCM software, models have been developed to help identify the largest and most intensive emissions of CES operations and activities. CEA will employ a sustainability strategy to include the immediate purchase of offsets as well as making smarter decisions in the future to lower the emissions from the start. \"Using the carbon data model we built for CEA, not only will they identify environmental benefits but they will also understand the financial impact of how volatile energy and resource prices will reduce the carbon footprint of CES into the future,\" noted Leventhal.\r\nParker Brugge, Vice President of environmental affairs and industry sustainability for CEA commented, \"The greening of the International CES reflects the consumer electronics industry's commitment to environmentally sustainable practices. Attendees at the 2009 CES will witness the latest green technology innovations from among more than 2,700 exhibitors, and see how the industry's largest event takes a leading role in understanding and promoting pro-environment policies.\"\r\n\r\nPlanet Metrics offers Rapid Carbon Modeling solutions which model the impact of carbon and other greenhouse gas emissions. Employing a \"systems thinking\" approach, Planet Metrics customers can develop and deploy advanced strategies that reduce the impact of harmful emissions from necessary business processes. Reducing harmful emissions improves business efficiencies, which has a positive effect on operations, manufacturing, transportation, energy, waste, and supply chain that saves money while improving the planet's ecosystem.",
    "source_description": "Planet Metrics Chosen to Measure Carbon for World's Largest Consumer Technology Tradeshow - 2009 International CES",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Planet Metrics",
      "permalink": "planet-metrics"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}