{"name": "Playmatchup",
 "permalink": "playmatchup",
 "crunchbase_url": "http://www.crunchbase.com/company/playmatchup",
 "homepage_url": "http://Playmatchup.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "playmatchup",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 25,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "Playmatchup@gmail.com",
 "phone_number": "",
 "description": "Athletic ranking for friends",
 "created_at": "Thu Oct 04 00:58:29 UTC 2012",
 "updated_at": "Mon Oct 15 22:54:42 UTC 2012",
 "overview": "\u003Cp\u003E​Welcome to playmatchup.com We are a Website created for athletes from the average pick up game to the professional level. As competitive as sports get today we want to add another level. We want to put meaning into the average pick up game, at the same time see on a personal basis what average, high school, college, and professional athletes think of each other. Average Joes, High school, college, and professional athletes can add each other as friends, create groups together privately or publicly, rate each other 1-5 stars, and comment about their game on a personal basis. Whether you are teammates and want to talk about their work ethic, what scouts can’t see behind the curtain, or what it was truly like playing against them, you can. You can help recruiters, scouts, and other athletes analyze other athletes on a deeper level. Anyone can rate other athletes whether it\u0026#8217;s just a pick up game with friends, an NBA game where Kobe Bryant wants to talk about Lebron James and how he played tonight, or add to his 5 star rating. If you’re having trouble getting noticed by college or professional scouts you can use our site as your own athletic resume to help recruit yourself. If you can get a professional athlete to comment on your profile that will highly add to your credibility. Highly beneficial for competitive athletes, an extra level of competitiveness for the average pick up games for athletes, and a great tool for coaches and recruiters to analyze athletes. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       112],
      "assets/images/resized/0021/4147/214147v2-max-150x150.jpg"],
     [[250,
       187],
      "assets/images/resized/0021/4147/214147v2-max-250x250.jpg"],
     [[450,
       337],
      "assets/images/resized/0021/4147/214147v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}