{"name": "plentyoads.com/",
 "permalink": "plentyoads-com",
 "crunchbase_url": "http://www.crunchbase.com/company/plentyoads-com",
 "homepage_url": "http://plentyoads.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "PlentyOAds",
 "category_code": "advertising",
 "number_of_employees": 1,
 "founded_year": 2011,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "advertising, ads, publishers, advertisers, online-ads, online-advertising, cheap-ads, cheap-advertising",
 "alias_list": null,
 "email_address": "kman_311@yahoo.com",
 "phone_number": "8123814540",
 "description": "advertising publishers",
 "created_at": "Sun Sep 11 01:54:03 UTC 2011",
 "updated_at": "Fri Nov 11 20:39:08 UTC 2011",
 "overview": "\u003Cp\u003EHere at Plenty O Ads we believe in helping advertisers gain quality targeted ad clicks, as well as impressions, to any web page, Facebook ap, and other targeted ad campaigns. I will guarantee once you have used our highly motivated ad service you will NEVER advertise anywhere else again! The setup is easy to use and very cost effective!\u003C/p\u003E\n\n\u003Cp\u003EAttributes\u003C/p\u003E\n\n\u003Cp\u003EAdvertisers\u003C/p\u003E\n\n\u003Cp\u003EWe believe how you advertise should be your choice!\nGreat choice! Our highly targeted ads start out with a very simple $5 package. We have decided to make our Beginner package a low cost for any advertiser big or small to get a great start. There of course are other packages available earning up to 25% of your purchase price back to you!\nThank You and you have made the right choice!\u003C/p\u003E\n\n\u003Cp\u003EPublishers\u003C/p\u003E\n\n\u003Cp\u003EFreedom as a publisher is our #1 goal\u003C/p\u003E\n\n\u003Cp\u003EDo we have a treat for you!!!\nHere at Plenty O Ads we are counting on you! Every Publisher is treated with the utmost respect for the traffic sent to our advertisers! With Advertisers like, Google, Hoofinit Photography, and more. Plus 10% earnings from any referrals who could lose?\nIt is your choice on how you will be paid!\u003C/p\u003E\n\n\u003Cp\u003EI want to be the first to say Thank you! You have not only made a great choice as a publisher but the right choice as one! \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}