{"name": "Plutolife",
 "permalink": "plutolife",
 "crunchbase_url": "http://www.crunchbase.com/company/plutolife",
 "homepage_url": "http://www.plutolife.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": 1999,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-dating, mobile-social-networking, mobile",
 "alias_list": null,
 "email_address": "news@plutolife.com",
 "phone_number": "(1) 908-8322134",
 "description": null,
 "created_at": "Mon Jun 16 10:55:48 UTC 2008",
 "updated_at": "Sat Jan 19 04:49:59 UTC 2013",
 "overview": "\u003Cp\u003EA global leader in mobile community development and publishing of mobile content, Plutolife\u0026#8217;s products generate high levels of recurring revenue through continuous and persistent end-user experience. Mobile social networking and user-generated content are Plutolife\u0026#8217;s expertise.\u003C/p\u003E\n\n\u003Cp\u003EHistory\nEstablished in 1999 Plutolife\u0026#8217;s focus is mobile community platforms, community applications and mobile dating and chat applications.\u003C/p\u003E\n\n\u003Cp\u003EPlutolife is the result of a June 2004 merger between Plutonium Software (established 1999) and Live the Game (established 2000) in Norway. Both companies were known as true pioneers in developing mass-market mobile entertainment. Live the Game\u0026#8217;s success was in SMS-based games and dating services. This fused with Plutonium\u0026#8217;s unique expertise in JAVA-games, set the stage for a powerhouse within the mobile entertainment industry.\u003C/p\u003E\n\n\u003Cp\u003EPlutolife has over 8 years experience of managing communities in excess of 500,000 users ensuring users\u0026#8217; experience is fun, simple, exciting and safe. \u003C/p\u003E\n\n\u003Cp\u003EPlutolife today is the developer of the world\u0026#8217;s largest mobile dating platform that it publishes itself in Scandinavia and white labels for partners outside of Scandinavia. \u003C/p\u003E\n\n\u003Cp\u003EThe platform is currently connected and distributed successfully in 17 countries where active communities are managed and moderated to ensure the most pleasurable experience for all users. \u003C/p\u003E\n\n\u003Cp\u003EPlutolife act as technology supplier to some of the world\u0026#8217;s largest online dating brands and our technology today support the largest mobile dating platform in North America.\u003C/p\u003E\n\n\u003Cp\u003EToday Plutolife continues to expand it global distribution and presence to all 4 corners of the globe, spanning 5 continents. Plutolife has firmly established itself as a leader in mobile community entertainment with numerous hit applications distributed through 70+ partnerships to date.\u003C/p\u003E\n\n\u003Cp\u003EExpertise\nPlutolife is a pro in creating and delivering dating, flirting and mobile community entertainment that generates reoccurring revenue. Plutolife has a well-rounded approach to development and delivery that combines the best of technological know-how, end-user savvy and a sharp focus on the revenue line.\u003C/p\u003E\n\n\u003Cp\u003EPlutolife is also home to some of the world\u0026#8217;s top connected application Java gurus, having developed dozens of hit community mobile games and applications. Mobilove Java is one of Plutolife\u0026#8217;s latest forays into Java and aims to set a new standard on what is capable with Java on a mobile phone. With Mobilove Java, Plutolife has finally perfected the optimal mobile dating experience.\u003C/p\u003E\n\n\u003Cp\u003EAbove development and delivery of its own products, Plutolife has emerged as a master in mobile content distribution and delivery for third party vendors.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       54],
      "assets/images/resized/0002/0425/20425v1-max-150x150.png"],
     [[152,
       55],
      "assets/images/resized/0002/0425/20425v1-max-250x250.png"],
     [[152,
       55],
      "assets/images/resized/0002/0425/20425v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "Mobilove",
    "permalink": "mobilove",
    "image": null},
   {"name": "Mobiflirt",
    "permalink": "mobiflirt",
    "image": null},
   {"name": "Mobimodels",
    "permalink": "mobimodels",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "700 Irwin Street",
    "address2": "Suite 300",
    "zip_code": "94901",
    "city": "San Rafael",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.9668423,
    "longitude": -122.5218253}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://onlinepersonalswatch.typepad.com/news/2007/05/erik_neraal_plu.html",
    "title": "CEO Erik Neraal Interview  05/07"}]}