{"name": "PNC (UK) plc",
 "permalink": "pnc-uk-plc",
 "crunchbase_url": "http://www.crunchbase.com/company/pnc-uk-plc",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Thu Nov 22 11:30:50 UTC 2012",
 "updated_at": "Thu Nov 29 03:47:38 UTC 2012",
 "overview": "\u003Cp\u003EPNC supply practical advice and implementation expertise to companies who seek to expand their business via the internet. \u003C/p\u003E\n\n\u003Cp\u003EPNC have operated in the UK since 1992, providing high-end technically complex IT solutions.  Their client base now includes many of the most prestigious names in Media, Publishing, Banking and Finance such as Atlas, Bain \u0026amp; Co, Close Brothers, Goldman Sachs, Guardian Media, LexisNexis Reed Elsevier and WB.  \u003C/p\u003E\n\n\u003Cp\u003EPNC always work in partnership with internal management.  Typically using Open Source platforms, tools and technologies which allow clients to develop applcations rapidly and at low cost due to the license-free, royalty-free nature of Open Source.  \u003C/p\u003E\n\n\u003Cp\u003EBuild assignments in 2012 included web applications, transactional websites, customer portals, browser-delivered software and secure eBusiness platforms.  Consultancy projects centred around Online Sales Strategy and the creation of targeted programs to increase revenue and profitability for clients.\u003C/p\u003E\n\n\u003Cp\u003EA 2012 showcase project involved the creation of an online trading portal for a newly-founded alternative investment company.  In the first year of operation, turnover reached $13mm (£8mm).  Another project involved the automation of the booking system for a leading City agency which allowed 24/7/365 deal-booking, securely and from any location including mobile smartphones (iPhone, Android, Blackberry and Windows Mobile) and tablet (iPad) devices.\u003C/p\u003E\n\n\u003Cp\u003EIn 2013, PNC have announced they will launch two self-funded, self-developed online software-as-a-service (SAAS) products.  \u003C/p\u003E\n\n\u003Cp\u003ENOTE: Since 2009 they have been know simply as PNC (http://www.crunchbase.com/service-provider/pnc).\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Managing Director",
    "person":
     {"first_name": "Gordon",
      "last_name": "Tees",
      "permalink": "gordon-tees",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}