{"name": "PNMsoft",
 "permalink": "pnmsoft",
 "crunchbase_url": "http://www.crunchbase.com/company/pnmsoft",
 "homepage_url": "http://www.pnmsoft.com",
 "blog_url": "http://www.pnmsoft.com/about-us/news/",
 "blog_feed_url": "",
 "twitter_username": "pnmsoft",
 "category_code": "software",
 "number_of_employees": 100,
 "founded_year": 1996,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bpm, software, workflow, microsoft, intelligent, solutions",
 "alias_list": null,
 "email_address": "info@pnmsoft.com",
 "phone_number": "+ 44 (0)192 381 3420",
 "description": "BPM Software Vendor",
 "created_at": "Tue Nov 27 08:01:58 UTC 2012",
 "updated_at": "Sun Dec 02 02:35:18 UTC 2012",
 "overview": "\u003Cp\u003EPNMsoft is a software company which develops, markets, and supports BPM (Business Process Management) software. Its product, Sequence Kinetics, is a BPM software suite which integrates with Microsoft products such as Microsoft Office, Microsoft SharePoint, and Microsoft Dynamics, adding to them the capability to design and manage business processes. PNMsoft is a multinational company, with offices and business partners selling its product worldwide. PNMsoft customers are in the public sector, financial services, energy, manufacturing, telecommunications, travel, and pharmaceutical industries.\u003C/p\u003E\n\n\u003Cp\u003EPNMsoft\u0026#8217;s Sequence Kinetics is a Business Process Management Suite which provides a graphical flowchart interface that enables users to model, execute and monitor business processes and workflows. Business processes are broken down into discrete workflow units, representing human, server, database and web-based activities. Sequence Kinetics is a web-based platform with a .NET codebase, enabling developers to design end-user forms for multiple platforms in a web-based .NET editor. It uses an MS SQL Server to store and access data. Sequence is most commonly hosted in a SharePoint environment and can be integrated with ERP and CRM systems. Dashboards and reporting tools are included for management-level monitoring and decision-making. PNMsoft describes Sequence Kinetics as an Intelligent BPM solution which can support the requirements of mid-sized to large organizations with an interface that can be operated by both non-technical users and advanced .NET developers.\u003C/p\u003E\n\n\u003Cp\u003ESequence Kinetics is built using HotChange technology. PNMsoft describes HotChange as a technology which enables IT personnel to rapidly change processes while they continue to run in production, while maintaining process lifecycle governance and control. HotChange encompasses features such as multiple version control, multiple platforms, and integration capabilities.\u003C/p\u003E\n\n\u003Cp\u003EAt a Microsoft Office Developer Conference, PNMsoft was recognized by Microsoft Chairman Bill Gates in an address on BPM. PNMsoft was named a Gartner Cool Vendor in BPM space for 2010 and was placed on Gartner\u0026#8217;s iBPMS Magic Quadrant for 2012. Today, its customers include Amdocs, AON, AXA, Alcatel, Atos Origin, and Atkins.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0022/2475/222475v2-max-150x150.png"],
     [[229,
       60],
      "assets/images/resized/0022/2475/222475v2-max-250x250.png"],
     [[229,
       60],
      "assets/images/resized/0022/2475/222475v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}