{"name": "WePopp",
 "permalink": "popp",
 "crunchbase_url": "http://www.crunchbase.com/company/popp",
 "homepage_url": "http://www.wepopp.com",
 "blog_url": "http://www.wepopp.com/blog",
 "blog_feed_url": "",
 "twitter_username": "WePopp_",
 "category_code": "public_relations",
 "number_of_employees": 4,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "plan, friends, go-out, trips, hang-out",
 "alias_list": null,
 "email_address": "contact@wepopp.com",
 "phone_number": "",
 "description": "Easy planning with friends",
 "created_at": "Sun Feb 24 13:48:44 UTC 2013",
 "updated_at": "Tue Apr 30 13:29:47 UTC 2013",
 "overview": "\u003Cp\u003EThe most user-friendly web platform for collaborative planning, allowing friends to get together.\u003C/p\u003E\n\n\u003Cp\u003EYou’d like to see your friends, just for a drink, a dinner, or even a trip. But you\u0026#8217;re all busy people, and it\u0026#8217;s never easy to find the best time and place. Some people have to take the lead and plan everything for the group. But it is time consuming.\nYou send one group email and receive 10 text messages, get back to everyone, start a group chat on Facebook with a link to Doodle that only half of the people will click on, and send suggestions for the place, that half of the people will miss\u0026#8230; Even if everyone answers, you’ll have to spend time summing up everything and then browsing the internet to book a table or tickets.\nIt\u0026#8217;s a messy process, and you\u0026#8217;re pretty sure those who took the initiative will think twice before doing the planning again.\nBut that\u0026#8217;s no reason not to see your friends, right ?\u003C/p\u003E\n\n\u003Cp\u003EBecause it can get really hard for the organizer to deal with everyone’s answers, we will sort the information: one specific place for sharing availabilities, another one for sharing wishes. Streamlining the decision making process, you will then only need one click to book the table, flight or show the group agreed on.\nBecause we believe friendship is the most important,\nBecause we want people to be able to plan anything, fast and easily, without worrying about the practical aspects:\u003C/p\u003E\n\n\u003Cp\u003EWe offer the most user-friendly platform for collaborative planning, allowing friends to get together.\u003C/p\u003E\n\n\u003Cp\u003EWith easy-to-use polls and calendar features, everyone can share their wishes and availabili7es. You’ll never struggle to find the best time and place.\nWith our recommendation engine, no need to browse the internet to find the perfect restaurant, the perfect room or the perfect tickets. We bring the right offer to you and you’ll be just one click away from booking.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Julien",
      "last_name": "hobeika",
      "permalink": "julien-hobeika",
      "image": null}},
   {"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Nicolas",
      "last_name": "Marlier",
      "permalink": "nicolas-marlier",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Le Camping - Paris",
    "address1": "Palais Brongniart",
    "address2": "28 Place de la Bourse",
    "zip_code": "75002",
    "city": "Paris",
    "state_code": null,
    "country_code": "FRA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}