{"name": "Portugal Telecom",
 "permalink": "portugal-telecom",
 "crunchbase_url": "http://www.crunchbase.com/company/portugal-telecom",
 "homepage_url": "http://www.telecom.pt/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Telecommunications company",
 "created_at": "Mon Feb 04 18:54:05 UTC 2013",
 "updated_at": "Mon Feb 04 19:12:26 UTC 2013",
 "overview": "\u003Cp\u003EPortugal Telecom is a global telecommunications operator. \u003C/p\u003E\n\n\u003Cp\u003EPortugal Telecom has a diversified business portfolio in which quality and innovation are decisive aspects, alongside the most advanced international companies in this sector. \u003C/p\u003E\n\n\u003Cp\u003EThe company’s activity covers every segment of the telecommunications sector: fixed, mobile, multimedia, data and corporate solutions. \u003C/p\u003E\n\n\u003Cp\u003EThese telecommunications and multimedia services are available in Portugal, Brazil and in developing international markets. \u003C/p\u003E\n\n\u003Cp\u003EPortugal Telecom’s international footprint spreads to countries like Cape Verde, Mozambique, Timor, Angola, Kenya, China, Brazil, S. Tomé and Príncipe and Namíbia.\u003C/p\u003E\n\n\u003Cp\u003EIn the Brazilian market, PT is present in Oi, the largest telecommunications operator in South America, and in Contax, Brazil\u0026#8217;s leading contact center services company.\u003C/p\u003E\n\n\u003Cp\u003EThe company’s growth has been consolidating through the development of new business in areas of rapid growth, for example mobile voice and data services, multimedia and broadband internet access. With this, Portugal Telecom has contributed to the development of the Information Society which is a priority for the company in terms of developing innovative solutions and successfully dealing with the challenges from both enterprises and citizens. \u003C/p\u003E\n\n\u003Cp\u003EPartnerships and strategic agreements celebrated with key companies in each sector have contributed towards the improvement in capacity and product availability.\u003C/p\u003E\n\n\u003Cp\u003EIn terms of capital markets, Portugal Telecom is one of the most traded stock in Euronext Lisbon, and it is also quoted on the New York Stock Exchange.\u003C/p\u003E\n\n\u003Cp\u003EPT sees its human resource policy as the active management of the talents of its employees, rewarding and encouraging merit, creativity, excellence and believing in the continuous renewal of its resources.\u003C/p\u003E\n\n\u003Cp\u003EThe company assumes its social responsibility before the community by its constant support to several institutions, motivating its employees through a corporate volunteering policy. The company creates innovative solutions which aim to facilitate life for its customers with special needs, intervening also in the areas of education, environment, culture and sport.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[59,
       57],
      "assets/images/resized/0023/3556/233556v1-max-150x150.png"],
     [[59,
       57],
      "assets/images/resized/0023/3556/233556v1-max-250x250.png"],
     [[59,
       57],
      "assets/images/resized/0023/3556/233556v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo":
  {"valuation_amount": null,
   "valuation_currency_code": "USD",
   "pub_year": 1995,
   "pub_month": 7,
   "pub_day": 9,
   "stock_symbol": "NYSE:PT"},
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        98],
       "assets/images/resized/0023/3557/233557v1-max-150x150.png"],
      [[250,
        163],
       "assets/images/resized/0023/3557/233557v1-max-250x250.png"],
      [[450,
        294],
       "assets/images/resized/0023/3557/233557v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}