{"name": "PositiveTALK",
 "permalink": "positivetalk",
 "crunchbase_url": "http://www.crunchbase.com/company/positivetalk",
 "homepage_url": "http://www.positivetalk.com",
 "blog_url": "http://positivetalk.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "PositiveTalkNow",
 "category_code": "web",
 "number_of_employees": 7,
 "founded_year": 2011,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-media, facebook, twitter, app, personal-development, web",
 "alias_list": null,
 "email_address": "jim@positivetalk.com",
 "phone_number": "407-451-7110",
 "description": "Positive People Social Network",
 "created_at": "Sun Sep 11 00:30:51 UTC 2011",
 "updated_at": "Fri May 18 02:31:49 UTC 2012",
 "overview": "\u003Cp\u003EPositiveTALK is a FREE disruptive social media app for Facebook and Twitter that measures and improves the online “positivity” of people and their friends and following on social networks. \u003C/p\u003E\n\n\u003Cp\u003EPositiveTALK is a fun and engaging app that targets a rapidly growing online community of hundreds of millions of positive-minded people on Facebook, Twitter and other leading social media networks. The latest scientific research indicates that increasing the level of “positivity” can have a significant positive impact on a person’s health, wealth, relationships and happiness, and improve a person’s self esteem and influence with friends, family and co-workers. \u003C/p\u003E\n\n\u003Cp\u003EPositiveTALK calculates a proprietary PositiveTALK Score daily for people, companies, places and brands, based on the positive or negative sentiment of posts, quantity of posts, number of friends on Facebook and Twitter, as well as other analytic factors. The more positive a user’s posts are and the more often a user POSTS, LIKES or SHARES comments with friends on Facebook and Twitter, the higher their PositiveTALK Score (PT Score) will be and the more PositivePOINTS and Badges they will accumulate. \u003C/p\u003E\n\n\u003Cp\u003ETo help improve their PositiveTALK Score, users can post their own positive comments to friends on both Facebook and Twitter or can post positive quotes from PositiveTALK’s database of over 200,000 quotes and picture quotes from more than 23,000 famous authors. Users can also post regular status updates to both Facebook and Twitter that can include attached image files up to 3 MB each, allowing users to create, post and share their own inspirational images and positive picture quotes to their online friends. \u003C/p\u003E\n\n\u003Cp\u003EPositiveTALK provides tools and analysis to help improve a person’s positivity, including online “recommendations” to help users improve the quality of their posts on Facebook and Twitter, and Positivity Graphs to help analyze a person’s online positivity and the positivity of their friends and following. Users can analyze and compare the changes in PT Score for themselves and their friends over the last 7, 30 and 90 days and can earn PositivePOINTS and Badges based on achievements and activities.\u003C/p\u003E\n\n\u003Cp\u003EPositiveTALK is the only app available in the market that analyses and scores the positivity of posts, comments and tweets and calculates a daily \u0026#8220;PositiveTALK Score\u0026#8221; for all users and their friends and following, based on the company’s proprietary databases and sentiment analysis technology.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0015/3601/153601v2-max-150x150.jpg"],
     [[250,
       66],
      "assets/images/resized/0015/3601/153601v2-max-250x250.jpg"],
     [[450,
       120],
      "assets/images/resized/0015/3601/153601v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Jim",
      "last_name": "Tousignant",
      "permalink": "jim-tousignant",
      "image": null}},
   {"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Tom",
      "last_name": "D'Ambrosio",
      "permalink": "tom-dambrosio",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "9664 Weatherstone Court",
    "address2": "",
    "zip_code": "34786",
    "city": "Windermere",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"248\" src=\"http://www.youtube.com/embed/Sl8TDM-spVY\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003EPositiveTALK CEO Jim Tousignant Presenting at DEMO Spring 2012 in Silicon Valley\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}