{"name": "PositionClick",
 "permalink": "positionclick",
 "crunchbase_url": "http://www.crunchbase.com/company/positionclick",
 "homepage_url": "http://www.positionclick.com",
 "blog_url": "http://www.positionclick.com/blog",
 "blog_feed_url": "http://www.positionclick.com/blog/feed",
 "twitter_username": "positionclick",
 "category_code": "search",
 "number_of_employees": 7,
 "founded_year": 2005,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "search-engine-marketing",
 "alias_list": null,
 "email_address": "info@positionclick.com",
 "phone_number": "(740) 4-SEO-GUY",
 "description": "Search Engine Marketing Firm",
 "created_at": "Mon Dec 17 17:43:13 UTC 2012",
 "updated_at": "Thu Dec 20 08:22:47 UTC 2012",
 "overview": "\u003Cp\u003ESUMMARY:   PositionClick Corporation is the leading internet advertising agency in the world with a core competency in SEO, SEM, and PPC.  Based in Portsmouth, NH and utilizing its \u0026#8220;SEO Factory\u0026#8221; based in India staffed with computer programming experts and internet marketing experts the firm will fulfill its Mission to \u0026#8220;Help Businesses Grow via Internet Advertising\u0026#8221;.  \u003C/p\u003E\n\n\u003Cp\u003EMARKET:   According to SEMPO, the SEM (Search Engine Marketing) industry is estimated at $12 Billion. Digital media and the internet is the fastest growing segment of the advertising industry.\u003C/p\u003E\n\n\u003Cp\u003EOUR TEAM:   PositionClick was by a seasoned internet marketer \u0026amp; SEO guru Eric Melin (www.ericmelin.com/seo-guy) a Serial Entrepreneur, SEO Expert, Technologist, eRetail Exec \u0026amp; Former VP of several leading web-based businesses including VC backed entities.  Eric is a tech entrepreneur with extensive experience building high growth, profitable web ventures and a passion for building great businesses.  Over 12 USA-based staff members and over 20 remote contractors are onboard including marketing experts, programmers, SEO gurus, and PPC account managers.  A delivery team was recruited, trained and hand selected in New Delhi, India who are focused and dedicated purely to increasing traffic from search engines such as Google and Yahoo to client web properties.   \u003C/p\u003E\n\n\u003Cp\u003EOPPORTUNITY:   Today, few people are unaware of the massive influence of Google, Facebook, Yahoo, and other leading Internet Brands and the drastic shift in commerce to the web. However, in the rush to reach market most internet businesses have focused on dominating web traffic, eyeballs, visibility, leads, conversions, to their own websites - rather than services the needs of millions of businesses and ecommerce platforms who rushed to the internet in the past 10 years. PositionClick \u0026#8220;sells bullets\u0026#8221; in this war and provides an edge to the small business owner who now has to compete for visibility on a global scale.   \u003C/p\u003E\n\n\u003Cp\u003ECUSTOMERS: The PositionClick customer is a small business owner with a marketing budget of $100k-$2M per year. Typically a $1M to $10M top line small business – with-or-without a brick \u0026amp; mortar presence. These customers have an online advertising spend up to $10,000-$50,000 per month and have learned the effectiveness of Google Adwords® to generate new business via PPC - but have struggled with \u0026#8220;organic\u0026#8221; SEO to gain rankings in the search engines. \u003C/p\u003E\n\n\u003Cp\u003EKEY SUCCESS FACTORS: PositionClick competes in a highly fragmented marketplace where a global workforce is able to offer services in a highly skilled and specialized industry. Everyone with a computer now seems to claim SEO expertise; the business therefore has numerous cottage industry competitors, however, large Ad Agencies do not have technical competence to offer this highly labor-intensive service and resort to offering software-based SEO products that do very little to help clients. PositionClick offers a white-labeled solution to agencies allowing them to remain agencies-of-record without risking critical client relationships with poor SEO results.   \u003C/p\u003E\n\n\u003Cp\u003EDIFFERENCIATION:  PositionClick will Win because of its ability to produce a reliable, metrics-driven and results-driven delivery model via its \u0026#8220;SEO FACTORY\u0026#8221; in India where clients can gain a 24/7/365 real-time view into the work being performed on their behalf. SEO work is comparable to Farming and cultivating land - and about as exciting to watch – the work does not bear fruit for many months and clients are often are frustrated with lack of immediate results.  PositionClick Clients can track all work performed on their behalf via minute-by-minute computer screenshots. With the rage of social media and the \u0026#8220;always on\u0026#8221; internet mentality - PositionClick has an obsessive focus on delivering value to its customers and will leverage all forms of transparency to show customers precisely what work is being performed and the results that are being achieved - a rarity in a murky internet marketing industry.   \u003C/p\u003E\n\n\u003Cp\u003ECOMPANY:    PositionClick Corporation (www.positionclick.com) \nCorporate:  Delaware S Corporation, Founded in 2005 dormant until 2012 \nIndustry:   Internet Marketing \u0026amp; Marketing Services \nFinancing:  100% Privately Held. Seed funding via Founder \nSeeking:    Interns \u0026amp; Remote/work at home opportunities \nAdvisors:   Equity compensation available \nInvestors:  Future investment rounds may include outside investors\nValuation: $1M Current Valuation\u003C/p\u003E\n\n\u003Cp\u003EThe Ask:    $100K for 10% Preferred\nVenture Stage:   Generating Revenue, Referencable customers, Fortune 500 Client List. \u003C/p\u003E\n\n\u003Cp\u003EMISSION STATEMENT: \u0026#8220;PositionClick Corporation is focused on becoming the leading internet advertising agency in the world with a focus on SEO, PPC and SEM.\u0026#8221; \u003C/p\u003E\n\n\u003Cp\u003ECONTACT INFO: \u003C/p\u003E\n\n\u003Cp\u003EPositionClick Corporation\nEric Melin, Founder \u0026amp; CEO\n99 Chauncy Street, Suite 910\nBoston, MA  02111\n(740) 4-SEO-GUY sales\n(740) 473-6489  phone\n(617) 500-3458  mobile\n(617) 208-2481  efax \nseo-guy@positionclick.com\nfacebook.com/positionclick\nlinkedin.com/company/positionclick\ntwitter: positionclick\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Eric",
      "last_name": "Melin",
      "permalink": "eric-melin",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0022/5768/225768v2-max-150x150.png"],
          [[250,
            250],
           "assets/images/resized/0022/5768/225768v2-max-250x250.png"],
          [[250,
            250],
           "assets/images/resized/0022/5768/225768v2-max-450x450.png"]],
        "attribution": ""}}}],
 "competitions":
  [{"competitor":
     {"name": "iCrossing",
      "permalink": "icrossing",
      "image":
       {"available_sizes":
         [[[141,
            21],
           "assets/images/resized/0007/7657/77657v1-max-150x150.png"],
          [[141,
            21],
           "assets/images/resized/0007/7657/77657v1-max-250x250.png"],
          [[141,
            21],
           "assets/images/resized/0007/7657/77657v1-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "iProspect",
      "permalink": "iprospect",
      "image":
       {"available_sizes":
         [[[150,
            60],
           "assets/images/resized/0005/6648/56648v3-max-150x150.png"],
          [[250,
            100],
           "assets/images/resized/0005/6648/56648v3-max-250x250.png"],
          [[300,
            120],
           "assets/images/resized/0005/6648/56648v3-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "Didit Search Marketing",
      "permalink": "didit-search-marketing",
      "image":
       {"available_sizes":
         [[[108,
            106],
           "assets/images/resized/0002/3129/23129v1-max-150x150.png"],
          [[108,
            106],
           "assets/images/resized/0002/3129/23129v1-max-250x250.png"],
          [[108,
            106],
           "assets/images/resized/0002/3129/23129v1-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "Acquisio",
      "permalink": "acquisio",
      "image":
       {"available_sizes":
         [[[150,
            43],
           "assets/images/resized/0010/6940/106940v1-max-150x150.jpg"],
          [[160,
            46],
           "assets/images/resized/0010/6940/106940v1-max-250x250.jpg"],
          [[160,
            46],
           "assets/images/resized/0010/6940/106940v1-max-450x450.jpg"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}