{"name": "Pososhok.ru",
 "permalink": "pososhok-ru",
 "crunchbase_url": "http://www.crunchbase.com/company/pososhok-ru",
 "homepage_url": "http://pososhok.ru/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Pososhok",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2001,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "flights-booking, hotel-booking, online-tickets-booking, insurances, railway-tickets, russia, moscow",
 "alias_list": null,
 "email_address": "info@pososhok.ru",
 "phone_number": "+7 (495) 234 80 00",
 "description": "Online Ticket Sales",
 "created_at": "Tue Jul 27 06:45:05 UTC 2010",
 "updated_at": "Tue Jul 27 19:12:09 UTC 2010",
 "overview": "\u003Cp\u003ETickets online\nPososhok project was designed with single-minded determination to ease the hassle of travel planning and shopping and make the best deals in air fares available to users in the comfort of their homes and offices.\nIt is common knowledge that booking and buying almost all means of transportation services in Russia imply considerable complications. Firstly, you have to get through to the booking office, then make enquiries regarding time tables, next check availability, and, finally, make the booking and pay. Needless to say, this falls short of our expectations as it is time-consuming and nerve-racking. On top of that, that time-honored but old-fashioned way to buy tickets rules out choice of itinerary and pricing options..\nThe emergence of new means of telecommunications and advent of Internet have revolutionized this process having provided the tools to tackle the arduous tasks of booking and buying in a time- and cost-efficient manner without the need to leave offices and homes. Users were quick to appreciate the ease and convenience of these technological advances. Suffice it to say, that Internet sales account for up to 80 per cent of all air tickets sold in European countries on scheduled services..\nPososhok project implemented in the Russian environment by UniFest is a clone of this amazing concept that has conquered virtually the entire world. Pososhok represents a full-fledged booking engine featuring a wealth of functionalities.Not only does it allow to search for and book air tickets, it enables you to thoroughly scrutinize available options, map out your trip from door-to-door, select the best possible deals as well as to do self check-in for your flight..\nPososhok never stops evolving and improving. Nowdays available hotels booking worldwide, travel insurance (including \u0026#8220;airticket\u0026#8221; insurance) and transfers on-line booking service, special offers and sales are available. We provide easy trip planing service for air- and rail tours, and so on. Plans are afoot to introduce more and more services. It does not take a university degree to muster the use of Pososhok owing to exceptionally friendly interface making its comprehension a cinch.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}