{"name": "Powerfunder",
 "permalink": "powerfunder",
 "crunchbase_url": "http://www.crunchbase.com/company/powerfunder",
 "homepage_url": "http://www.powerfunder.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "powerfunder",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "crowd-funding, crowdfund, crowdfunder, jobs-act, investment, investment-platform, equity-exchange, investors, investing, entrepreneur, access-to-capital-act",
 "alias_list": null,
 "email_address": "info@powerfunder.com",
 "phone_number": "(+502) 55793938",
 "description": "Crowdsourced Investment Platform",
 "created_at": "Tue Aug 21 04:41:30 UTC 2012",
 "updated_at": "Sat Aug 25 01:07:26 UTC 2012",
 "overview": "\u003Cp\u003EPowerfunder is a platform that enables ANYBODY, anywhere to become an investor in the most viable projects and businesses in developing countries. Current SEC regulations in the USA do not allow average citizens to invest into startups and businesses. Powerfunder seeks to disrupt this beauracratic process by focusing on promoting projects and businesses constituted outside US soil which causes these SEC restraints to become obsolete. Powerfunder uses a crowdfunding model in which only the most viable projects and businesses originated in developing countries can become investment opportunities.  Powerfunder offers the potential investors relevant data on the promoted projects so that an informed investment decision can be made. The cutting edge information system incorporated in Powerfunder also allows and provides the tools so that: 1. The entrepreneurs and project leaders have a tool to handle the companies accounting and finances online as well as an effective communication 2 The investor can keep track of his investment and can communicate directly and participate with the entrepreneurs. Through Powerfunder great business ideas have an opportunity to get started, people anywhere can invest and be part of something that will generate a return, and last but not the least\u0026#8230;the implementation of new projects and businesses in a developing country can help bring jobs and economic growth to less fortunate societies.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       65],
      "assets/images/resized/0020/8051/208051v2-max-150x150.jpg"],
     [[250,
       109],
      "assets/images/resized/0020/8051/208051v2-max-250x250.jpg"],
     [[450,
       196],
      "assets/images/resized/0020/8051/208051v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}