{"name": "Power International",
 "permalink": "power-international",
 "crunchbase_url": "http://www.crunchbase.com/company/power-international",
 "homepage_url": "http://www.indiamart.com/powerinternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cable-pulling-winches, trefoil-clamps-and-fault-detection-equipments-",
 "alias_list": null,
 "email_address": "powerinternational@tradepassport.org",
 "phone_number": "9833052225",
 "description": "Manufacturing and trading ,",
 "created_at": "Fri Apr 05 13:45:00 UTC 2013",
 "updated_at": "Fri Apr 05 13:45:06 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2007, our organization, “Power International”, has been widely engaged in the extensive process of manufacturing and trading a wide range of Cable Laying Accessories. This range has been in wide demand for its major quality features and we have made this very sure that all our products are in complete compliance with the standards of the industry. In our offered range we have various kinds of other products such as Cable Pulling Winches, Trefoil Clamps and Fault Detection Equipments.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are empowered with a diligent team of professionals, who strive hard to provide an immaculate range of products to the clients. These professionals are employed after a rigorous assessment of their skills, knowledge and experience.\u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\nBeing a quality conscious firm, all our productions are inclined towards meeting the requirements of the customers while keeping the industrial standards in mind. In order to make this range completely reliable and quality tested, we conduct stringent quality checks over each and every product of ours before the final dispatch preparations. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have developed for ourselves a sophisticated infrastructural set-up that has been incorporated with a modern manufacturing unit. All our units are well equipped with high end tools and modern machines that enable us in effective manufacturing of our extensive range of products. Our acquired high end machinery has proved to be efficient for quick delivery of our quality products. With the help of our experts, we are able to manage smooth flow of production. \u003C/p\u003E\n\n\u003Cp\u003EInstallation Services:\nPeace Power and Power International are very young and dynamic engineering. A full installation service as well as a maintenance is available for our products. Our products, engineered solution and service are utilized through major electrical power utilities including Reliance Energy, Tata Power, MSEDCL, TNEB, Cairn India, JSPL, Ravin Cables, Crompton \u0026amp; Greaves, Areva, Scheinder, Universal Cables, KEI, Alstorm \u0026amp; many more and international power industry customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8714/248714v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8714/248714v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8714/248714v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}