{"name": "Power Brands Consulting",
 "permalink": "power-brands-consulting",
 "crunchbase_url": "http://www.crunchbase.com/company/power-brands-consulting",
 "homepage_url": "http://powerbrandsconsulting.com/",
 "blog_url": "http://powerbrandsreviews.com/",
 "blog_feed_url": "",
 "twitter_username": "PowerBrandsLLC",
 "category_code": "consulting",
 "number_of_employees": 25,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "power-brands-consulting, power-brands-reviews, power-brands",
 "alias_list": null,
 "email_address": "PowerBrandsConsulting@aol.com",
 "phone_number": "800-730-9445",
 "description": "Power Brands Consulting Reviews",
 "created_at": "Fri Oct 05 01:00:25 UTC 2012",
 "updated_at": "Tue Oct 16 16:32:40 UTC 2012",
 "overview": "\u003Cp\u003EIf you’ve ever had the desire to create your own beverage then you are fortunate that there are consulting businesses that you can turn to in order to help you in that endeavor. \u003C/p\u003E\n\n\u003Cp\u003EPower Brands Consulting is the perfect place to find information regarding the general beverage industry as well as the “to do’s” and the “need to do’s” regarding how you can turn your beverage ideas into reality. And when you know that Power Brands Reviews has earned various awards for their work in the beverage industry you know it’s a consulting business you can trust.\u003C/p\u003E\n\n\u003Cp\u003EIf you go to Power Brands Consulting’s website http://powerbrands.us and explore the various fields of work that go into making a successful new beverage you’ll have little doubt that the professionals at Power Brands Reviews are the perfect people to turn to. And their knowledge and work has resulted in various forms of recognition throughout the past several years.\u003C/p\u003E\n\n\u003Cp\u003EPower Brands Consulting first recognition came in the form of BevNet Awards 2008 Best Packaging Innovation for pHD. Soon, Power Brands Reviews projects garnered additional recognition with BevNet Awards for projects including Code Blue, LYF, Neuro, and RelaxZen. Power Brands Consulting played various roles in each of these beverage brands. In some cases, Power Brands Reviews worked strictly in a consultative role, for other beverage projects they worked on formulation, graphic design, and launching of the beverage product as well.\u003C/p\u003E\n\n\u003Cp\u003EPower Brands Consulting started achieving awards for their beverage work in 2008 and the awards continued into 2011. To date, Power Brands Reviews have earned 12 awards and recognitions. So if you have a beverage idea then turn to Power Brands Consulting. They have the experience and know-how to help new beverages make the market shelves. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[128,
       128],
      "assets/images/resized/0021/4320/214320v2-max-150x150.jpg"],
     [[128,
       128],
      "assets/images/resized/0021/4320/214320v2-max-250x250.jpg"],
     [[128,
       128],
      "assets/images/resized/0021/4320/214320v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}