{"name": "PowerCable Solution",
 "permalink": "powercable-solution",
 "crunchbase_url": "http://www.crunchbase.com/company/powercable-solution",
 "homepage_url": "http://www.indiamart.com/powercablesolution/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "powercablesolution@tradepassport.org",
 "phone_number": "9923818786",
 "description": "Trader and Supplier of Cable Tester",
 "created_at": "Fri Apr 05 16:15:13 UTC 2013",
 "updated_at": "Fri Apr 05 16:15:16 UTC 2013",
 "overview": "\u003Cp\u003EIncepted in the year 2006 at Pune (Maharashtra, India), we “Power cable Solution”” has emerged as a leading trader and supplier of Cable Tester and Cable Fault Detector. Also, we provide services for High Tension Underground Cable Fault Locating And Finding, High Voltage Pressure Testing, Cable Route Testing, Cable Identification Services etc.\u003C/p\u003E\n\n\u003Cp\u003ETeam:\nThe strength of our organization lies in the efficient hands of our workforce. It is due to their dedication and perseverance that we are able to establish ourselves in a short time frame. We have hired a team of highly knowledgeable and experienced professionals.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nOur company focuses mainly on manufacturing quality products to gain the trust and confidence of the customers. We are a quality oriented firm and our offered products meet the international quality standards. Our quality checkers keep strict vigilance on quality right from the beginning till the shipment.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe strive hard to reach the client\u0026#8217;s expectations by offering products as per their requirements and necessity. With our quality assurance policy and client centric approach, we are able to satisfy our clients by offering them best quality Cable Tester and Cable Fault Detector.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are the vendor and we supply all types of cable products. To offer finest quality products to customers, we have associated ourselves with trustworthy \u0026amp; credible market vendors. We select these vendors on the grounds of their market position, authenticity and financial stability.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8884/248884v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/8884/248884v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/8884/248884v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}