{"name": "Power Patriots",
 "permalink": "power-patriots",
 "crunchbase_url": "http://www.crunchbase.com/company/power-patriots",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": 1998,
 "founded_month": 5,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "power_patriots@yahoo.in",
 "phone_number": "",
 "description": "Power4Patriots",
 "created_at": "Fri Aug 10 09:40:11 UTC 2012",
 "updated_at": "Sun Aug 12 23:54:34 UTC 2012",
 "overview": "\u003Cp\u003EPower4Patriots\u003C/p\u003E\n\n\u003Cp\u003EPower conglomerates are companies that strip citizens of their ability to manage their energy sources. It meanwhile takes a heavy toll on their wallets and livelihoods. Power4Patriots is a do-it-yourself system that allows people to meet their own demands rather than answer to others. It shifts the control of power from major companies to individuals who need it most. \u003C/p\u003E\n\n\u003Cp\u003EThe Power4Patriots system is a revolutionary product which helps people avoid over-paying for power. The goal is to enable freedom from greedy energy conglomerates. Chances are, your energy usage habits aren’t changing, but your bill is increasing. Power4Patriots offers a direct solution to this play of power between the consumer and the provider. It strives to make you one in the same.\u003C/p\u003E\n\n\u003Cp\u003EFrank Bates is the revolutionary mind behind Power4Patriots. His deep interest in power trends, production, and development led him to found a company that makes people independent. The creative mind of Bates found a way to avoid the conspiracy between power companies and legislators. The massive revenue stream of conglomerate power companies came directly from the consumers. Bates discovered that control over energy had the potential to shift back to the right hands.\u003C/p\u003E\n\n\u003Cp\u003EPower4Patriots is a series of educational, informative instructions that allows customers to build their own power sources. These packages provide step-by-step directions on how to make your own wind turbines and solar panels. Additionally, the Power4Patiots system is an instructional aid for framing an energy system to match your needs. \u003C/p\u003E\n\n\u003Cp\u003EThe projects themselves have immediate monetary advantages. People are usually skeptical about making their own energy system for fear of the price point. While it is still a commitment, a brief look at the numbers always persuades people to make the move. Power4Patriots offers a far more efficient outlet for power than the big game of corporate energy. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0020/5431/205431v2-max-150x150.png"],
     [[250,
       153],
      "assets/images/resized/0020/5431/205431v2-max-250x250.png"],
     [[260,
       160],
      "assets/images/resized/0020/5431/205431v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}