{"name": "PoyntWorX",
 "permalink": "poyntworx",
 "crunchbase_url": "http://www.crunchbase.com/company/poyntworx",
 "homepage_url": "http://www.poyntworx.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "poyntworx",
 "category_code": "mobile",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@poyntworx.com",
 "phone_number": "1-612-547-6968",
 "description": "SoLoMo Development",
 "created_at": "Thu Sep 06 21:36:11 UTC 2012",
 "updated_at": "Sun Sep 09 19:36:59 UTC 2012",
 "overview": "\u003Cp\u003EAugmented Reality Development for your world.\u003C/p\u003E\n\n\u003Cp\u003EPoyntWorX is a full service marketing and AR application development company that works directly with publishers across all mediums to develop their brands, extend their communities, and most importantly generate revenue. PoyntWorX is a member of the Layar development network and understands the needs of publishers and advertisers in most any circumstance. We know that in the dynamic world of advertising and engagement, new technologies can be the line between success and failure.\u003C/p\u003E\n\n\u003Cp\u003EPoyntWorX is currently working directly with publishers from all across the United States to help build their brand and create new revenue streams for their companies. Some of the basics  we offer are:•Initial consultation at your place of business•Development of pricing models for AR Apps built for your media company•Assist with white label sales materials and training for your outside sales staff•Social Media promotion of your new application•A consistent partnership that is always here to help in anywayLet PoyntWorX help your business get ahead of the competition with real time cutting edge technologies and offer to your advertisers a solution for the cash rich time poor society that lives in the mobile space. PoyntWorX will create a fun and engaging consumer experience with applications that are all geo-local and offer real time results.\u003C/p\u003E\n\n\u003Cp\u003EPoyntWorX not only helps develop cutting edge technologies for our publishing partners, we also work with businesses, agencies, and even individuals on their social media marketing strategy.Lets face it, word of mouth is great, but this is a world of mouth society that we live in today and social strategy is inevitably a must-have! Let PoyntWorx help you kickstart your social marketing plan for your business today. We can poynt relevant followers, likes, and friends your way. We take a very hands on approach from the start and slowly start training you on maintaining your new found database of businesses and consumers so that you can be totally independent in a few short months. Don’t have the time to invest? No worries, we would be happy to remain your full-time social strategy company.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0021/0159/210159v2-max-150x150.png"],
     [[250,
       50],
      "assets/images/resized/0021/0159/210159v2-max-250x250.png"],
     [[450,
       91],
      "assets/images/resized/0021/0159/210159v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}