{"name": "Pradeep Engineering",
 "permalink": "pradeep-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/pradeep-engineering",
 "homepage_url": "http://www.indiamart.com/pradeepengineeringworks/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "electrical-cables, fuse-sets, tpmo-switches, acsr-conductors-",
 "alias_list": null,
 "email_address": "pradeepengineeringworks@tradepassport.org",
 "phone_number": "09953358867",
 "description": "Manufacturer, supplier.",
 "created_at": "Fri Apr 05 05:39:10 UTC 2013",
 "updated_at": "Fri Apr 05 05:39:13 UTC 2013",
 "overview": "\u003Cp\u003EIncepted in the year 1986, at Ghaziabad (Uttar Pradesh, India), we, “Pradeep Engineering Works”, are engaged in trading and supplying a comprehensive assortment of Electrical Products Electrical Poles, Electrical Cables, Fuse Sets, TPMO Switches, ACSR Conductors, Electrical Panels \u0026amp; Metal Products, etc . The offered products are sourced from some of the reliable vendors of the industry. Our products are usually acknowledged for their diverse features like reliable performance, low power consumption, robust construction, robust design, excellent finish and longer service life.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nOwing to a strong network of trustworthy vendors, we have been able to provide an impeccable quality array to the clients. Considering vendors as the backbone of any trading company, our procurement agents conduct intensive market researches to choose the reliable and authorized manufacturers that are spread all across the nation.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe always strictly adhere to the quality control procedures and therefore, provide flawless products to our valued customers. The offered products are procured from the most reliable vendors of the industry. We have recruited expert quality inspectors, who analyze our products right from the stage of procurement till the final dispatch. After procurement, all the products stringently undergo thorough various tests so as to ensure their flawlessness.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOwing to our skilled professionals, we are engaged in providing superior quality products that are offered as per the varied requirements of our prestigious customers. With their vow and enthusiasm, we have established ourselves as the reckoned name in the domain of trading and supplying high quality products. Our professionals keep themselves updated with new innovations and improvements that take place in the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nPower Transformers\nElectrical Poles\nElectrical Cables\nElectrical Panels\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8271/248271v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8271/248271v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8271/248271v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}