{"name": "Pragati Engineering",
 "permalink": "pragati-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/pragati-engineering",
 "homepage_url": "http://www.indiamart.com/pragati-engineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "die-machine-and-rope--roller-machine--products-included-in-this-range-are-toffee-cut-and-wrap-machine",
 "alias_list": null,
 "email_address": "pragati-engineering@tradepassport.org",
 "phone_number": "9879476877",
 "description": "We, Pragati Engineering, ",
 "created_at": "Thu Apr 04 13:56:09 UTC 2013",
 "updated_at": "Thu Apr 04 13:56:12 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2002, we, “Pragati Engineering”, are a renowned organization engaged in manufacturing, supplying and exporting a comprehensive range of Toffee \u0026amp; Candy Wrapping Machine, Candy Packaging Machine, Three Stage Cooling Conveyor, Cooling Plate Machine, Toffee \u0026amp; Candy Vacuum Cooker, Die Machine and Rope \u0026amp; Roller Machine. Products included in this range are Toffee Cut and Wrap Machine, Automatic Candy Wrapping Machine, One Side Twist Candy Wrapping Machine and Packaging Machine. Other products offered by us are Lollipop Double Twist Machine, Candy Packaging Machine, Tilting Cooling Plate, Fix Cooling Plate and many more. \u003C/p\u003E\n\n\u003Cp\u003EProduct Range:\n    Batch Stirrer\n    Candy Vacuum Cooker\n    3 Stage Cooling Conveyor\n    Single Side Twist Candy Wrapping Machine\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have associated with us, some of the highly qualified and experienced professionals, who hold in-depth knowledge about their respective domains and are engaged in offering a supreme quality range of Toffee \u0026amp; Candy Wrapping Machine, Candy Packaging Machine, Three Stage Cooling Conveyor, Cooling Plate Machine and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe have always stressed on delivering a qualitative range of Toffee \u0026amp; Candy Wrapping Machine, Candy Packaging Machine, Three Stage Cooling Conveyor, Cooling Plate Machine and many more to our clients end and hence pay maximum attention in fabricating these products using optimum quality raw material, obtained from trusted and reliable sources of the industry. Furthermore, our experts ascertain to use advanced tools and equipment in designing these machines, in absolute compliance with international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nSpread across a vast area of land, we have our own well-maintained infrastructure. Moreover, our entire unit has been segregated perfectly into a number of departments, in order to accelerate and carry out the production process at a steady rate. Additionally, these departments are excellently furnished with the latest tools \u0026amp; equipment and advanced machines, which enables us to deliver an absolutely flawless range of products to our esteemed customers. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7943/247943v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7943/247943v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7943/247943v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}