{"name": "Pranavan IT Services",
 "permalink": "pranavan-it-services",
 "crunchbase_url": "http://www.crunchbase.com/company/pranavan-it-services",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 12,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 12,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "nagaraju.b@pranavan.com",
 "phone_number": "",
 "description": "Rural IT Services",
 "created_at": "Tue Oct 23 18:31:45 UTC 2012",
 "updated_at": "Fri Oct 26 18:46:56 UTC 2012",
 "overview": "\u003Cp\u003EPranavan Software Solutions is started with energy driven enthusiastic individuals. We Focus on providing technology consulting, application services and Remote IT Infrastructure services.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to provide cost effective customer centric support with cutting edge technology. We are powered by a pool of talented IT and consulting professionals who bring their software expertise, Industry knowledge and best practices to every client engagement. All our services work on a global delivery model from our delivery centers mainly in Hyderabad, Andhra Pradesh and Bangalore, Karnataka-India. Our commitment, passion and entrepreneurial spirit have allowed us to maintain long-term client relationships across the Globe. \u003C/p\u003E\n\n\u003Cp\u003EOutsourcing software product development is the craze in the business world. By understand of today’s business market conditions our offshore software development team focused on outsourced product development, web design \u0026amp; development , software application development and RIM Services to provides one stop software products and business application development and support services to small and mid size organizations, worldwide.\nOur offshore software development outsourcing team implements advanced technologies, so that you can place yourself ahead of your competitors. Our dedicated software development \u0026amp; product development and RIM Support outsourcing team ensures very high quality of the software we develop.\nAt Pranavan, we offer flexible, customized, personalized and cost- effective outsourcing solutions. We combine the strengths to deliver trusted, reliable and cost-effective outsourced software development worldwide.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0021/6880/216880v2-max-150x150.png"],
     [[250,
       55],
      "assets/images/resized/0021/6880/216880v2-max-250x250.png"],
     [[450,
       100],
      "assets/images/resized/0021/6880/216880v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}