{"name": "PRDSoftware",
 "permalink": "prdsoftware",
 "crunchbase_url": "http://www.crunchbase.com/company/prdsoftware",
 "homepage_url": "http://www.helpmasterpro.com",
 "blog_url": "http://www.helpmasterpro.com/Community/Blogs.aspx",
 "blog_feed_url": "",
 "twitter_username": "HelpMaster",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 1996,
 "founded_month": 1,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "helpdesk-software, service-management, crm, itsm, customer-support",
 "alias_list": null,
 "email_address": "support@prdsoftware.com.au",
 "phone_number": "+61 2 62784664",
 "description": "HelpMaster helpdesk software",
 "created_at": "Thu Sep 13 14:05:51 UTC 2012",
 "updated_at": "Thu Oct 04 16:56:29 UTC 2012",
 "overview": "\u003Cp\u003EPRD Software is a privately held Australian company headquartered in the nations capital, Canberra.\nHelpdesk and service management focus\u003C/p\u003E\n\n\u003Cp\u003EOur primary focus is on developing the best value, high functionality software for the helpdesk and support services industry. Our flagship product, HelpMaster is now in it’s 15th year and has helped hundreds of organizations around the world to streamline their business practices, provide outstanding support and lower costs.  Helpdesk is our sole focus - its what we do and we\u0026#8217;re 100% committed to improving and supporting the software and the solution we write. \u003C/p\u003E\n\n\u003Cp\u003EPRD Software contributes regularly to the ITSM industry and all staff members are well versed in the popular service management best-practice frameworks such as ITIL and KCS.  We\u0026#8217;re big believers in #Back2ITSM and keeping it real.  We design software for the real world - not for software certification schemes, and our sales and client feedback have consistently told us were on the right track with this.\nThe team\u003C/p\u003E\n\n\u003Cp\u003EOur staff are friendly, enthusiastic and committed to providing professional service. Some have been with the company since it\u0026#8217;s beginning and draw upon their real-life experience working in and around the IT helpdesk and call centre industries.  We\u0026#8217;re also real and approachable - if you need or want to talk to anyone in the company - from the CEO to any member of the development team, all you have to do is pick up the phone and call. \nOur clients\u003C/p\u003E\n\n\u003Cp\u003EPRD Software has clients around the world, ranging from multi-national companies, to small business and start-ups.  Whatever the industry, all business have a basic need to log, track, manage and report on issues, client matters and staff workload.  Our smaller clients love the affordability of our licencing model and the rich feature set that HelpMaster delivers, whilst our larger clients find a capable and mature product that helps them address their helpdesk and ITSM needs.\nSoftware philosophy\u003C/p\u003E\n\n\u003Cp\u003EOur design philosophy is to create applications that look good, are easy and intuitive to use and offer outstanding functionality. We believe that a business application should serve the needs of the users, the business and their clients, not the needs or design of the developers. This means that PRD Software won\u0026#8217;t take development shortcuts just because a particular feature or technology is cumbersome, complex or technically challenging. In short, we believe that if you can think of a feature that would be useful, we can build it and implement it into our applications. That\u0026#8217;s our approach to development and our commitment to you.\u003C/p\u003E\n\n\u003Cp\u003EPRD Software maintains a public list of enhancements, bugs reports, suggestions, criticisms and other feedback about our products from the end-users. This valued information is used in planing for future product development and releases. At PRD Software we encourage all such feedback and welcome the opportunity to discuss your requirements.\nWhat about help desk software?\u003C/p\u003E\n\n\u003Cp\u003EAt the time of the first release of HelpMaster in 1996, there was a gaping hole in the help desk software market that needed to be filled. PRD Software realized at that time that there was no reasonably priced, Windows-based help desk software that offered a user-friendly interface, email capabilities and a solid workflow design. Most of the systems of that time (and some still today) were overpriced, overly complex, had poorly designed graphical user interfaces and required dedicated servers, administrators and SQL knowledge.\u003C/p\u003E\n\n\u003Cp\u003EThat\u0026#8217;s why we developed HelpMaster.\u003C/p\u003E\n\n\u003Cp\u003EHelpMaster was designed to provide small to medium enterprises with a full functional, powerful and friendly helpdesk package that is affordable and useable. Today HelpMaster is being used successfully in over 44 different countries and has been awarded a national development award for outstanding business software.\u003C/p\u003E\n\n\u003Cp\u003EThe HelpMaster suite of service management tools is enterprise-ready, using a SQL Server for data storage and reporting.  Modules include web for both staff and client self-service, escalation tools, reporting and automated email logging. With the latest release of HelpMaster in its 11th generation, it is finely tuned for enterprise power and performance and set to be a competitive product in the helpdesk software market.\nThat was then, what about now?\u003C/p\u003E\n\n\u003Cp\u003EHave you noticed how many helpdesk products are entering the market lately?  Have you also noticed how simple and raw many of them seem to be?  Lacking real features and maturity?  After 16 years in the business of developing and supporting HelpMaster helpdesk software, PRD Software have learnt a thing or two about what it takes to suceed and develop great software.  We\u0026#8217;re constantly innovating and updating our technology, licencing and code to keep up with current trends in the industry and our software is better than ever.  Not only is HelpMaster mature with a great feature set, it\u0026#8217;s still affordable.  That has always been our goal and always will be.\nA Microsoft Certified Partner\u003C/p\u003E\n\n\u003Cp\u003EAs a Microsoft Certified Partner, PRD Software is committed to using and implementing Microsoft solutions and technology. This means that we specialize in products such as SQL Server, the .net framework and development tools, ASP.net, XML and others. Moreover, our products have been certified by independent consultants to be Windows compliant. To the end user, this means speed, power, flexibility and the confidence that each product that PRD Software produces will accommodate the most demanding of application and enterprise needs. If you would like to know more about our coding practices, our quality control or design methodology, please contact one of our development consultants and we\u0026#8217;d be happy to discuss these issues.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       120],
      "assets/images/resized/0021/2346/212346v2-max-150x150.jpg"],
     [[250,
       200],
      "assets/images/resized/0021/2346/212346v2-max-250x250.jpg"],
     [[450,
       360],
      "assets/images/resized/0021/2346/212346v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "Hawker",
    "address2": "",
    "zip_code": "2615",
    "city": "Hawker",
    "state_code": null,
    "country_code": "AUS",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        120],
       "assets/images/resized/0021/1180/211180v2-max-150x150.png"],
      [[250,
        200],
       "assets/images/resized/0021/1180/211180v2-max-250x250.png"],
      [[450,
        361],
       "assets/images/resized/0021/1180/211180v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        100],
       "assets/images/resized/0021/1181/211181v2-max-150x150.png"],
      [[250,
        166],
       "assets/images/resized/0021/1181/211181v2-max-250x250.png"],
      [[450,
        300],
       "assets/images/resized/0021/1181/211181v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}