{"name": "Premier Biomaterials",
 "permalink": "premier-biomaterials",
 "crunchbase_url": "http://www.crunchbase.com/company/premier-biomaterials",
 "homepage_url": "http://www.premierbiomaterials.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": 5,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hydroxyapatite, tcp, manufacturer, biomaterial",
 "alias_list": null,
 "email_address": "steven.oflaherty@premierbiomaterials.com",
 "phone_number": "+353 067 40044",
 "description": "Hydroxyapatite manufacturer",
 "created_at": "Fri Feb 15 11:00:31 UTC 2013",
 "updated_at": "Tue Feb 19 21:16:03 UTC 2013",
 "overview": "\u003Cp\u003EPremierBiomaterials, a subsidiary of HKPB Scientific, is a company that specialises in the synthesis of high purity, calcium hydroxyapatite, Ca10(PO4)6(OH)2 for highly technological applications. Hydroxyapatite is a uniquely biocompatible Calcium Phosphate mineral used extensively in the biomedical device engineering and biotechnology arenas. Applications for hydroxyapatite include bone grafts, osteoconductive coatings, bone cements, drug carriers for hydrogels and scaffolds, dental fillers, cosmetic formulations and chromatographic supports for the separation of proteins and other bio-molecules in the biopharma industry.\nPremierBiomaterials offers a range of hydroxyapatite powders under its brand name Puratite™ which are manufactured using a patented manufacturing process developed by HKPB Scientific. This unique process has been specifically designed and optimised for the production of crystalline, high-purity hydroxyapatite, and enables precise, reproducible control over important physical attributes of hydroxyapatite powder such as particle size and morphology. These properties have different optimum values for different end use applications.\nHKPB Scientific’s advanced patented technology gives PremierBiomaterials the capability to supply hydroxyapatite that is tailored to customer requirements. It is interested in hearing from new customers that are seeking to improve their own products or developing new ones. PremierBiomaterials has its own R\u0026amp;D facilities as well as a team of researchers that have a proven track record in the development of innovative products and processes in partnership with national and international companies and Universities.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "Lisbunny Industrial Estate",
    "address2": "Dublin Rd",
    "zip_code": "na",
    "city": "Nenagh",
    "state_code": null,
    "country_code": "IRL",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}