{"name": "Prem Enterprises",
 "permalink": "prem-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/prem-enterprises",
 "homepage_url": "http://www.indiamart.com/prem-enterprises-bengaluru/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "prem-enterprises-bengaluru@tradepassport.org",
 "phone_number": "9341260876",
 "description": " supplying an energy efficient range of ",
 "created_at": "Fri Apr 05 13:35:23 UTC 2013",
 "updated_at": "Fri Apr 05 13:35:28 UTC 2013",
 "overview": "\u003Cp\u003EPrem Enterprises is a sole proprietorship company, established in the year 2005. Since incorporation, the company is engaged in manufacturing and supplying a comprehensive range of Electrical Control Panels, Distribution Panel Boards and Electrical Boxes.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur company possesses modern infrastructure, which spread across wide landmass and equipped with required technology as well as machines. It is segmented into different units such as production, quality control, warehousing, packaging and others. All these departments are interconnected and handled by specialized team of professionals, who ensure to meet the prescribed targets within given time period. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality is considered as the most important factor of our organization, as it helps us to establish a desirable place in this competitive industry. Our company possesses well-integrated quality control laboratory, where we systematically carry out our testing operations. Here, our experts systematically perform quality testing operations, to ensure error free delivery in the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have hired a team of highly experienced and qualified professionals, who relentlessly perform to accomplish prescribed organizational objectives as well as the requirements of clients. We conduct special training programs to keep our employees aware of prevailing tendency and development of industry. With the help of our team, we have established a desirable position in the industry. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nClients are considered as the biggest asset of our company and we have focused all our efforts to make them satisfy immensely. We provide them solutions as per their specific requirement and have acquired their large support. Furthermore, we offer our clients with the facility of custom made solutions, in which, products are developed according to their predetermined needs. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8701/248701v2-max-150x150.jpg"],
     [[220,
       220],
      "assets/images/resized/0024/8701/248701v2-max-250x250.jpg"],
     [[220,
       220],
      "assets/images/resized/0024/8701/248701v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}