{"name": "Presidential Training",
 "permalink": "presidential-training",
 "crunchbase_url": "http://www.crunchbase.com/company/presidential-training",
 "homepage_url": "https://presidential-training.com/",
 "blog_url": "https://presidential-training.com/blog/",
 "blog_feed_url": "https://presidential-training.com/blog/feed/",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 5,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ccie-training, cisco-training, ccie-labs, ccie-rack-rentals, rack-rentals, ccie-routing-and-switching, ccie-service-provider, ccie-sp",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Cisco CCIE LabTraining",
 "created_at": "Thu Nov 29 19:26:51 UTC 2012",
 "updated_at": "Mon Dec 03 07:31:54 UTC 2012",
 "overview": "\u003Cp\u003EWith many years experience in the Cisco Networking Certification Education industry, Presidential Data Services, Inc delivers competitively priced and up-to-date ccie rack rentals, mock lab exams, and workbook products and services to prospective CCIE\u0026#8217;s throughout the world.\u003C/p\u003E\n\n\u003Cp\u003EThe company delivers a range of CCIE study materials and services that are constantly being updated and tailored specifically to match and complement the actual CISCO CCIE Lab Exams. The products and services offer a more affordable and complete study experience, making them suitable for customers that desire flexibility and comprehensiveness in modes of study, and they are available from the website. \u003C/p\u003E\n\n\u003Cp\u003EPresidential Data Services, Inc has a satisfied client base, situated throughout the world, including server administrators, web developers, software engineers, and overall tech-buffs. \u003C/p\u003E\n\n\u003Cp\u003EDetailed Service Descriptions:\u003C/p\u003E\n\n\u003Chr/\u003E\n\n\u003Cp\u003ECCIE  Rentals\u003C/p\u003E\n\n\u003Cp\u003EThis is a perfect option for prospective CCIE students to practice an assortment of lab scenarios, anytime, anywhere. The racks, offer complete flexibility due to our strict standards in following the EXACT hardware, wiring, and software specifications that the student will encounter in the actual exam. \u003C/p\u003E\n\n\u003Cp\u003ERack rentals can be booked anytime in 4 hour blocks and the company will do its best to assign consecutive sessions contiguously, meaning if possible, the sessions will be placed on the same rack, ensuring maximum convenience. \u003C/p\u003E\n\n\u003Cp\u003EWe offer Rack Rentals for the CCIE Routing and Switching, Security, and Service Provider tracks\u003C/p\u003E\n\n\u003Chr/\u003E\n\n\u003Cp\u003ECCIE Routing and Switching Mock Lab Exams\u003C/p\u003E\n\n\u003Cp\u003EProspective CCIE\u0026#8217;s who are a least a few months into their training should definitely look to hone their test-taking skills by taking one of the 7 virtual mock lab exams being offered. The exams, which were developed with varying difficulty levels simulate the actual exam scenarios that one encounters in the actual 8 hour lab exam. \u003C/p\u003E\n\n\u003Cp\u003EDuring the exam, one deals with a set of troubleshooting and configuration scenarios on equipment modeled after official Cisco CCIE hardware and topologies . All of this is accessed and done virtually via a telnet connection. \u003C/p\u003E\n\n\u003Cp\u003EUpon completion of a virtual mock lab exam, one of our experienced networking engineers will personally grade the exam and have results available for viewing withing 4-5 business days via your account dashboard.\u003C/p\u003E\n\n\u003Cp\u003EClients are given the freedom and flexibility to book and take the mock lab exams anytime anywhere with the ability to reschedule or cancel the arranged time within 24 hours of the schedule date and time. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/3062/223062v2-max-150x150.jpg"],
     [[240,
       240],
      "assets/images/resized/0022/3062/223062v2-max-250x250.jpg"],
     [[240,
       240],
      "assets/images/resized/0022/3062/223062v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        67],
       "assets/images/resized/0022/3061/223061v2-max-150x150.jpg"],
      [[250,
        112],
       "assets/images/resized/0022/3061/223061v2-max-250x250.jpg"],
      [[450,
        202],
       "assets/images/resized/0022/3061/223061v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}