{"name": "Press Release Monkey",
 "permalink": "press-release-monkey",
 "crunchbase_url": "http://www.crunchbase.com/company/press-release-monkey",
 "homepage_url": "http://www.pressreleasemonkey.com",
 "blog_url": "http://www.pressreleasemonkey.com/blog",
 "blog_feed_url": "http://www.pressreleasemonkey.com/feed/rss",
 "twitter_username": "propressrelease",
 "category_code": "advertising",
 "number_of_employees": 15,
 "founded_year": 1996,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "press-release-distribution, press-release-service, press-release, press-release-writing",
 "alias_list": null,
 "email_address": "tyson@pressreleasemonkey.com",
 "phone_number": "(949) 427-0181",
 "description": "Press Release Distribution Services",
 "created_at": "Sun Dec 04 01:17:26 UTC 2011",
 "updated_at": "Sun Apr 07 02:41:05 UTC 2013",
 "overview": "\u003Cp\u003EPress Release Monkey is a major player in the press release distribution industry. Add to that their professional team of writers and you have one powerful tool to boost the amount of exposure your business / website is getting.\u003C/p\u003E\n\n\u003Cp\u003EIt’s not every day that a 14 year old press release distribution website goes up for sale, but that’s what happened in May of 2011 when a savvy group of investors picked up pressreleasemonkey.com; a page rank 5 website that offers their clients a large news syndication network.\u003C/p\u003E\n\n\u003Cp\u003EToday, as press release websites fight for elbow room in an ever increasing market, press release distribution has become a multi-million dollar industry. Internet marketers have seen the results they can get from a well executed press release campaign so effective press release websites are in huge demand.\u003C/p\u003E\n\n\u003Cp\u003EIt’s with this growth that Press Release Monkey’s new owners made their purchase. After a few months of hard work coupled with the sheer age of the website, Press Release Monkey is already showing up on the front pages of Google.\u003C/p\u003E\n\n\u003Cp\u003ETyson Crisp, who participated in the purchase in May 2010, comments: “Because the website was over 14 years old it didn’t take much to bring it back to life again. We immediately went to work redesigning the site, building a strong network and supporting it with high quality backlinks. Today it is climbing through the ranks of Google for the search term “press release distribution” and we hope to get to the first page by the end of the year.”\u003C/p\u003E\n\n\u003Cp\u003ESo far users have seen great results through press Release Monkey’s exclusive distribution network. They offer syndication comparable to some of the biggest names in the industry, and past clients attest that they got huge exposure for a fraction of the price of other networks.\u003C/p\u003E\n\n\u003Cp\u003EMark Bauer, who manages the distribution side of the service, comments: “Here at Press Release Monkey we offer a variety of services. We employ a highly experienced team of professional writers who can write and distribute clients’ press releases for them, or if they already have their own press release, submit it through our easy to use online form. \nThey can choose from several different distribution methods and gain immediate access to our huge syndication network.”\u003C/p\u003E\n\n\u003Cp\u003EAs press release distribution proves to be one of the most effective online marketing tools in 2011, experts predict that Press Release Monkey will be one of the go-to websites to drive exposure in 2012.\u003C/p\u003E\n\n\u003Cp\u003ETo learn more about Press Release Monkey please visit: http://www.pressreleasemonkey.com/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       113],
      "assets/images/resized/0016/5053/165053v4-max-150x150.png"],
     [[250,
       189],
      "assets/images/resized/0016/5053/165053v4-max-250x250.png"],
     [[399,
       303],
      "assets/images/resized/0016/5053/165053v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarter",
    "address1": "3788 W.",
    "address2": "112th Ave Westminster, ",
    "zip_code": " Colorado 80031",
    "city": "",
    "state_code": null,
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        82],
       "assets/images/resized/0019/3212/193212v2-max-150x150.png"],
      [[250,
        137],
       "assets/images/resized/0019/3212/193212v2-max-250x250.png"],
      [[450,
        247],
       "assets/images/resized/0019/3212/193212v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}