{"name": "Prime 8 Consulting",
 "permalink": "prime-8-consulting",
 "crunchbase_url": "http://www.crunchbase.com/company/prime-8-consulting",
 "homepage_url": "http://www.prime8consulting.com",
 "blog_url": "",
 "blog_feed_url": "https://www.facebook.com/Prime8Consulting?fref=ts",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 55,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "vision-and-strategy--marketing-strategy--business-intelligence--change-management--channel-strategy--digital-strategy--customer-intelligence--program-management--consulting",
 "alias_list": null,
 "email_address": "careers@prime8consulting.com",
 "phone_number": "",
 "description": "Management Consulting",
 "created_at": "Mon May 20 17:21:38 UTC 2013",
 "updated_at": "Fri May 24 06:31:36 UTC 2013",
 "overview": "\u003Cp\u003EDriving Success is in Our DNA\u003C/p\u003E\n\n\u003Cp\u003EOur passion for what we do is ingrained in who we are. We pride ourselves in delivering fresh perspectives and innovative ideas. Whether it’s moving a project forward, implementing a program or designing a successful strategy from the ground up, we have just the right consultant to get the job done and deliver outstanding results. \u003C/p\u003E\n\n\u003Cp\u003EPowered by “The Great 8”\nOur 8 value-adding service lines provide solutions for clients of all sizes, from multinational organizations to local small businesses. We partner with our clients to the end, leveraging deep industry experience to provide practical business strategies and technology solutions that deliver results. Our consultants bring years of relevant experience from a range of companies – Microsoft, Boeing, Hitachi, Starbucks, Cap Gemini and T-Mobile to name a few. We firmly believe our clients’ success is our success, pushing us to go the extra mile to deliver stand-out solutions.\u003C/p\u003E\n\n\u003Cp\u003EWe’re only as great as our people\n Prime 8 consultants are truly invested in what they do at work and in the community. As a company, we strive to provide an environment that nurtures people’s talents and career goals so as individuals, and as a team, great things can be accomplished.  Whether it’s turning out innovative marketing solutions or rallying together to serve our community, everything we do is rooted in our 8 core values\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       58],
      "assets/images/resized/0026/4550/264550v2-max-150x150.png"],
     [[248,
       97],
      "assets/images/resized/0026/4550/264550v2-max-250x250.png"],
     [[248,
       97],
      "assets/images/resized/0026/4550/264550v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "A concise vision and strategy document is critical to successful communications and adoption of your strategy. It is the most powerful and galvanizing instrument that enables broad scale evangelism of your strategy up, down and across your organization.",
    "is_past": false,
    "provider":
     {"name": "Vision and Strategy ",
      "permalink": "vision-and-strategy",
      "image": null}},
   {"title": "Whether you’re a small local business or a Fortune 500 company, having a marketing strategy in place that effectively says who you are, what you do, and why consumers should pay attention is vital for standing out in today’s crowded marketplace.",
    "is_past": false,
    "provider":
     {"name": "Marketing Strategy",
      "permalink": "marketing-strategy",
      "image": null}},
   {"title": "Data creation is occurring at a record rate and will likely only increase as the years go by. Organizations that find ways to extract value from their data will have a competitive advantage over those who become overwhelmed by the sheer volume of their in",
    "is_past": false,
    "provider":
     {"name": "Business Intelligence",
      "permalink": "business-intelligence",
      "image": null}},
   {"title": "While most of us can accept change is inevitable, getting fully onboard with a new way of doing things can be a challenge. Today’s industry leaders will share that if businesses are to succeed and remain on the cutting-edge they need to adjust and readjus",
    "is_past": false,
    "provider":
     {"name": "Change Management",
      "permalink": "change-management",
      "image": null}},
   {"title": "Now more than ever, remaining dominant in today’s social media and digitally-driven marketplace requires you engage all players in your value chain. ",
    "is_past": false,
    "provider":
     {"name": "Channel Strategy",
      "permalink": "channel-strategy",
      "image": null}},
   {"title": "In today’s digital and social media landscapehaving a strong digital presence and voice is crucial for reaching your audience and driving scale.",
    "is_past": false,
    "provider":
     {"name": "Digital Strategy",
      "permalink": "digital-strategy",
      "image": null}},
   {"title": "Developing deep insights and empathy about your customers is fundamental to any sales and marketing strategy.  Understanding how to target, reach and differentiate your message to prioritized customer segments will provide the foundation for your entire b",
    "is_past": false,
    "provider":
     {"name": "Customer Intelligence",
      "permalink": "customer-intelligence",
      "image": null}},
   {"title": "Using the best-in-class project management approaches, methodologies and tools, our senior-level consultants help bridge the gap between defining your strategy and successfully executing on your objectives. Effectively managing initiatives and related tas",
    "is_past": false,
    "provider":
     {"name": "Program Management",
      "permalink": "program-management",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Prime 8 Consulting",
    "address1": "5400 Carillon Point",
    "address2": "",
    "zip_code": "98004",
    "city": "Kirkland",
    "state_code": "WA",
    "country_code": "USA",
    "latitude": 47.6547793,
    "longitude": -122.2056055}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}