{"name": "Priquity Inc.",
 "permalink": "priquity-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/priquity-inc",
 "homepage_url": "http://www.hnybpriquity.com",
 "blog_url": "http://blog.hnybpriquity.com",
 "blog_feed_url": "",
 "twitter_username": "thepriquity",
 "category_code": "consulting",
 "number_of_employees": 15,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "venture, capital, finance, bank, investor, entrepreneur, angel, crowdsourcing, micro-financing, platform, upstart, collaboration, buyout, merger, acquisition, priquity, portfolio",
 "alias_list": null,
 "email_address": "info@hnybpriquity.com",
 "phone_number": "",
 "description": "Global Investment facilitator \u0026 Advisor",
 "created_at": "Fri Jan 18 13:37:39 UTC 2013",
 "updated_at": "Sat Jan 19 22:32:54 UTC 2013",
 "overview": "\u003Cp\u003EAs a global investment facilitator and enterprise building advisors, PRIQUITY work with various type of individual and institutional investors, talented management teams and top of the line experienced industry experts to create and develop businesses that have potential for significant growth.\u003C/p\u003E\n\n\u003Cp\u003EPRIQUITY facilitates investments as well as directly or indirectly invest in supporting people who start, grow, change and buy businesses. PRIQUITY has always delivered excellent returns to those investors who had trusted it. PRIQUITY consistently deliver significant power and value to the people it works with by leveraging knowledge, experience and global network of relationships and not to forget innovative treatment it prescribes for every project it undertakes.\u003C/p\u003E\n\n\u003Cp\u003EUltimately, PRIQUITY is driven by a strong sense of values and form close partnerships with the companies it seeks investment from, companies in which it invests and companies which utilize its advisory or facilitation services. PRIQUITY always emphasis on building strong relationships based on mutual respect, value delivery, integrity and trust. Starting with a modest infrastructure PRIQUITY is today international investment facilitator, with $15bn of assets under direct/in-direct management with focus on private equity, venture capital and growth capital.\u003C/p\u003E\n\n\u003Cp\u003EPRIQUITY was created to address a chronic shortage of long-term investment capital for small and medium-sized businesses and has devoted itself particularly to those small and medium sized businesses which have ambition of becoming market leaders. Serving the financial needs of such enterprises is at the center of PRIQUITY’s activity, therefore serving as an intermediary between small and medium sized businesses and capable private investors or financial institutions. PRIQUITY has recently consolidated its role as facilitator by creating a robust Social Business Platform in association with HnyB Inc. to leverage power of Social Technology in effectively connecting Investors, Entrepreneurs and Experts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/0411/230411v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0023/0411/230411v2-max-250x250.jpg"],
     [[254,
       254],
      "assets/images/resized/0023/0411/230411v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Mr.",
    "person":
     {"first_name": "Deepak",
      "last_name": "Pareek",
      "permalink": "deepak-pareek",
      "image":
       {"available_sizes":
         [[[150,
            147],
           "assets/images/resized/0014/6360/146360v2-max-150x150.png"],
          [[250,
            246],
           "assets/images/resized/0014/6360/146360v2-max-250x250.png"],
          [[446,
            439],
           "assets/images/resized/0014/6360/146360v2-max-450x450.png"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Asia Office",
    "address1": "A 604, S G Highway,",
    "address2": "Titanium Square,",
    "zip_code": "380054",
    "city": "Ahmedabad",
    "state_code": null,
    "country_code": "IND",
    "latitude": 23.1972636,
    "longitude": 72.6299261}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}