{"name": "Proactive Futures",
 "permalink": "proactive-futures",
 "crunchbase_url": "http://www.crunchbase.com/company/proactive-futures",
 "homepage_url": "http://www.proactivefutures.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "rich@proactivefutures.com",
 "phone_number": "516-393-5916",
 "description": "futures trading, commodity trading",
 "created_at": "Mon Jul 12 16:49:41 UTC 2010",
 "updated_at": "Thu Jul 15 23:53:09 UTC 2010",
 "overview": "\u003Cp\u003EProactive Futures was started in 2002 to address the needs of the active daytraders migration into the futures markets trading e-mini contracts on the CME.  The focus was to provide to provide direct access trading for active traders who demand low commissions, leading edge technology, and superior customer support.\u003C/p\u003E\n\n\u003Cp\u003EProActive futures specializes in direct access trading for both retail and institutional clients. We offer deep discount flat commission rates on futures and options and a full line of other services including online trading, broker assisted, proprietary, and CTA managed accounts as well as blackbox trading and automated systems trading.\u003C/p\u003E\n\n\u003Cp\u003EProActive believes that their should be no limit on investing in stable charting and execution platforms. As a result, we continue invest $ in leading edge execution platforms that are developed exclusively by traders, for traders that demand the best. ProActive offers multiple trading platforms: X_Trader, Ninjatrader, E-Z Trader , Trade Navigator, ProActive Direct, Strategy Runner, - RAN Order , Fire Tip and ProActive Pro.\u003C/p\u003E\n\n\u003Cp\u003EProActive is committed to providing our traders with a customer service team dedicated to satisfying the professional traders needs and wants. Our staff consists of current and former traders , so we understand what traders need. We provide 24 hour customer support and order desk, and much more.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}