{"name": "ProfitScoop",
 "permalink": "profitscoop",
 "crunchbase_url": "http://www.crunchbase.com/company/profitscoop",
 "homepage_url": "http://www.profitscoop.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "profitscoop",
 "category_code": "education",
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "finance, social, stocks, equities, invest, investing, investor, traders, trading, financial, personal-finance",
 "alias_list": null,
 "email_address": "info@profitscoop.com",
 "phone_number": "",
 "description": "Social Equity Research Site",
 "created_at": "Thu Sep 13 03:14:22 UTC 2012",
 "updated_at": "Wed Sep 19 15:43:00 UTC 2012",
 "overview": "\u003Cp\u003EGet on-demand crowd sourced investment advice through ProifitScoop! \u003C/p\u003E\n\n\u003Cp\u003EProfitScoop allows you to rate, forecast, discuss \u0026amp; follow companies, follow other traders, and become trader of the day!\u003C/p\u003E\n\n\u003Cp\u003ECompany Overview\nProfitScoop was founded by like-minded and opinionated individuals who faced a similar problem; none of them were able to discover any easy-to-use resources for investing. When going to traditional websites, the data available seemed to include rhetoric meant for the seasoned investor. There were no investing websites that focused on the individual and gave them a platform to collaborate together and make informed decisions on their investments.\nDescription\nWhat is ProfitScoop?\nEveryday people ask, “What should I invest in?” For the first time, ProfitScoop aims to answer that age old question without all the complex terms and formulas. It’s simple; we provide a social platform for users to collaborate on trading ideas. Users could write, rate, share and be heard through a community news feed so that they make informed financial decisions. Ball so hard.\u003C/p\u003E\n\n\u003Cp\u003EHow does ProfitScoop work?\nProfitScoop allows its members to follow companies and fellow members to get heard in a noisy world. Once a member has followed a company or person, they will be able to view stock predictions, investment advice and company news on a live newsfeed. Submit reviews, follow top traders and track forecasts with peer to peer trading.\u003C/p\u003E\n\n\u003Cp\u003EHow can I become a ProfitScoop member?\nBecoming a ProfitScoop member is as easy as signing up. To limit the amount of passwords you have to remember, we have created a way for members to join by using their Facebook login info.\u003C/p\u003E\n\n\u003Cp\u003EWhat kind of members should join ProfitScoop?\nIf you have ever wanted to get started with investing and never felt confident in your abilities. This one’s for you. If you are in the Finance industry and run ideas past other colleagues at work but don’t have the ability to share outside your organization. This one’s for you. If you are a college student that wants the experience to take on the real world. This one’s for you. Get the picture? You can do it. ProfitScoop can help.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[131,
       98],
      "assets/images/resized/0021/1099/211099v2-max-150x150.png"],
     [[131,
       98],
      "assets/images/resized/0021/1099/211099v2-max-250x250.png"],
     [[131,
       98],
      "assets/images/resized/0021/1099/211099v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        80],
       "assets/images/resized/0021/1097/211097v2-max-150x150.png"],
      [[250,
        134],
       "assets/images/resized/0021/1097/211097v2-max-250x250.png"],
      [[450,
        242],
       "assets/images/resized/0021/1097/211097v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        80],
       "assets/images/resized/0021/1098/211098v2-max-150x150.png"],
      [[250,
        134],
       "assets/images/resized/0021/1098/211098v2-max-250x250.png"],
      [[450,
        241],
       "assets/images/resized/0021/1098/211098v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}