{"name": "Project Bionic",
 "permalink": "project-bionic",
 "crunchbase_url": "http://www.crunchbase.com/company/project-bionic",
 "homepage_url": "http://www.projectbionic.com",
 "blog_url": "http://www.facebook.com/ProjectBionic",
 "blog_feed_url": "http://gplus.to/ProjectBionic",
 "twitter_username": "ProjectBionic",
 "category_code": "advertising",
 "number_of_employees": 12,
 "founded_year": 2009,
 "founded_month": 10,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-media, social-media-agency, social-media-company, social-media-marketing, marketing-agency, mobile-marketing, social-media-strategy, reputation-monitoring",
 "alias_list": null,
 "email_address": "info@projectbionic.com",
 "phone_number": "(206) 686-8600",
 "description": "Social Media Marketing Agency",
 "created_at": "Fri May 25 20:51:57 UTC 2012",
 "updated_at": "Fri Jun 01 20:09:41 UTC 2012",
 "overview": "\u003Cp\u003EProject Bionic is a Seattle-based creative marketing agency specializing in Social Media. We provide strategy development, content creation and publishing, community management and advertising. Other areas of expertise include consulting and training sessions, reputation monitoring and mobile application development. We believe that no two brands are alike, and each company\u0026#8217;s voice is unique. In Social Media, each piece of the strategy must be aligned with values and objectives of YOUR brand.\u003C/p\u003E\n\n\u003Cp\u003EOur Philosophy (the short version):\nHere at Project Bionic, we believe that social media has gone a long way to level the playing field for businesses and their marketing efforts.  Social media provides the means to showcase your company and to connect to the communities of your customers in new, meaningful, two-way relationships like never before.  However, we firmly believe that no two brands are the same.  Each has its own voice and personality and we work hard to execute a custom strategy designed to enhance your brand\u0026#8217;s online persona.  Project Bionic\u0026#8217;s social media team consists of community managers, creative writers, graphic designers, social platform advertisers, a dedicated account manager for each client, and an analytics department to assess it all.  As we feel that there is no out-of-the-box marketing solution for every brand, we ensure that we employ all the necessary tools to provide your company with social media success.\u003C/p\u003E\n\n\u003Cp\u003EOur Philosophy (the long version):\nThe key to Social Media is that there is no key.  Every day, Social Media welcomes the dawn with new developments and new insights, new threats and new problems.  Your brand is unique, right?  It deserves its own custom-made Social Media strategy and execution.  At Project Bionic, we don\u0026#8217;t view our clients as interchangeable parts in one Grand Social Media Master Plan.  That would be foolish.  We want to show everyone why your brand is your brand.\u003C/p\u003E\n\n\u003Cp\u003EThere\u0026#8217;s always a method to the madness.  We like to try new things, follow unknown creative paths and take chances.  That\u0026#8217;s how you make a name for yourself.  However, there has to be a system in place.  Hence, the scientific method.  Yes, that one!  The one from Middle School!  Who knew that it would be so useful?  Science teachers, that\u0026#8217;s who (sorry, was that rhetorical?).\u003C/p\u003E\n\n\u003Cp\u003EYou can analyze and test and experiment until the cows come home from cow college, but it\u0026#8217;s all meaningless if you don\u0026#8217;t make anything of it.  We cull oceans of data from everything we do, and present it back to you in ways that make sense for everyone.  If we try something, you better believe that we\u0026#8217;re going to measure if it worked, how well it worked and whether it made anything explode (no explosions yet!).  Our reports will clue you in on exactly how well your social networks are performing relative to your objectives.  We also scour the internet like hungry badgers looking for any and all chatter regarding your brand.  It may seem like a monumental task, but we enjoy it.  Or, some of us do.  There are a few of us who aren\u0026#8217;t so good with numbers.\u003C/p\u003E\n\n\u003Cp\u003EThere is nothing static about Social Media. To approach the medium with any sort of concrete mindset is an act of supreme foolishness.  Given the ever-changing nature of the space, we find it best to gather information, hypothesize, experiment and then change our behavior as the uncovered data prescribes. Stubbornness is not a virtue in our world.  You either roll with the punches and change, or you fail.\u003C/p\u003E\n\n\u003Cp\u003EWe make brands come alive in the mind of the consumer.  We give brands personality.  How do we do it?  Years of experimentation and fact-finding, plus lots of just sitting and thinking.\u003C/p\u003E\n\n\u003Cp\u003EThe significance of Social Media and Mobile Marketing is self-evident.  Our goal is to help companies and brands harness and optimize this unique power.  You\u0026#8217;re now expected to be an active participant in people\u0026#8217;s lives. There are rules, guidelines and format nuances that can make or break you in this new world.  We help guide you through this critical process.\u003C/p\u003E\n\n\u003Cp\u003ENo matter how amazing your ideas are for social media, the medium remains a written one.  At Project Bionic, we take pride in creating the best-written, most captivating content around.  Whether it\u0026#8217;s funny, poignant, or informational, we make sure that your messaging is clear.  Your brand will never be in doubt.  Remember, it\u0026#8217;s not just the ideas that are important, it\u0026#8217;s the execution of those ideas that will make or break you.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0019/1837/191837v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0019/1837/191837v2-max-250x250.png"],
     [[250,
       250],
      "assets/images/resized/0019/1837/191837v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Project Bionic Seattle",
    "address1": "117 N 36th Street",
    "address2": "",
    "zip_code": "98103",
    "city": "Seattle",
    "state_code": "WA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}