{"name": "Properbounce Technologies",
 "permalink": "properbounce-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/properbounce-technologies",
 "homepage_url": "http://www.properbounce.com",
 "blog_url": "http://www.properbounce.com/blog",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 32,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design-company, web-development-company, website-design-services, website-development-services, ecommerce-web-development, web-service-company, web-solutions-company",
 "alias_list": null,
 "email_address": "info@properbounce.com",
 "phone_number": "",
 "description": "A Website Development Company",
 "created_at": "Fri Apr 06 07:24:07 UTC 2012",
 "updated_at": "Wed Apr 11 21:21:37 UTC 2012",
 "overview": "\u003Cp\u003EProperbounce Technologies is an India based offshore IT outsource company providing high-end yet affordable website design and development services to clients worldwide. \u003C/p\u003E\n\n\u003Cp\u003EWe offer services like custom web designing, Web 2.0 site development, Rich Internet Application (RIA) development, Graphic \u0026amp; Print Media designing, Flash web site designing, website maintenance and website redesigning. \u003C/p\u003E\n\n\u003Cp\u003EThe enterprise was created by MR. Amit Bhattacharya in the late 2007. He worked at several web design and development outsourcing companies as a web developer. He’s got more than 10 years of relevant industry experience. The company became operational in mid 2008 with 5 employees and with meager amount of international projects. \u003C/p\u003E\n\n\u003Cp\u003EToday Properbounce Technologies employ more than 25 experienced IT professionals and looking forward to expand it further for our ever increasing number of international/domestic website design and development Projects. The technologies used here to deliver custom website development service are Open Source like Joomla, WordPress, PHP MySQL and Jquery. \u003C/p\u003E\n\n\u003Cp\u003EWe are also specialized in Flash and HTML/XHTML web design, Shopping cart design/development for Ecommerce website development, Text/Video Chat application development, Custom Administration (Admin) Panel, OS Commerce Customization and much more. \u003C/p\u003E\n\n\u003Cp\u003EApart from custom website development service, we also offer Professional Graphic Designing Services. We named it Corporate Identity and Branding Service. The services we offer here are Logo/Illustration Design, Email Newsletter design, creative brochure design to clients, Flash/Animated Logo Design, Business card design, E Book design and corporate presentation. \u003C/p\u003E\n\n\u003Cp\u003EWe provide innovative yet cost effective web services and solutions to almost every industry such as Travel and Hospitality, Law, Finance \u0026amp; Insurance, Beauty, Corporate, Media/Television/Advertising, Automotive Sector, Education, Healthcare, Real Estate and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       71],
      "assets/images/resized/0018/2946/182946v2-max-150x150.jpg"],
     [[190,
       90],
      "assets/images/resized/0018/2946/182946v2-max-250x250.jpg"],
     [[190,
       90],
      "assets/images/resized/0018/2946/182946v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Properbounce Technologies",
    "address1": "174B, Regent Colony, Ashoke Nagar",
    "address2": "",
    "zip_code": "700040",
    "city": "Kolkata",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}