{"name": "ProteMac",
 "permalink": "protemac",
 "crunchbase_url": "http://www.crunchbase.com/company/protemac",
 "homepage_url": "http://www.protemac.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "protect, mac, firewall, network, traffic, security, software, data, business, control, keylogger, password, application, computer, monitoring, employee, parental, record, store, save",
 "alias_list": null,
 "email_address": "support@protemac.com",
 "phone_number": "+1 408 228 4945",
 "description": "Protection for Mac",
 "created_at": "Thu Mar 10 18:16:02 UTC 2011",
 "updated_at": "Sat Mar 19 02:30:53 UTC 2011",
 "overview": "\u003Cp\u003EProteMac is a Software Development Company that specializes in the production and distribution of Mac software and technologies. ProteMac was founded in 2006 as Protection Technology Company for Mac OS since that time has become famous for its software development. \u003C/p\u003E\n\n\u003Cp\u003EProteMac has been developing and marketing Mac protecting and monitoring software for business and home users. The company offers applications for recoding keystrokes and passwords, setting control over personal data, the network access and network traffic. All programs released by ProteMac are designed according to the demands of the modern computer users. This allowed the company to gain creditability among our customers. \u003C/p\u003E\n\n\u003Cp\u003EProteMac is glad to present a series of programs designed as reliable surveillance tools for a remote control over different sorts of operations performed on computer. First of all, there is monitoring software for private and corporate users, such as KeyBag and KeyBag PRO. Worked out to record every keystroke typed from the keyboard, these monitoring tools create a digital record of applications opened, chat conversations, web usage, etc. Moreover, we have extended the basic functions of a common keystroke log viewer by including the password recording feature which is presented in the breakthrough application - KeyBag PRO. Irreplaceable for workplace monitoring KeyBag and KeyBag PRO will provide productivity and security of the company. \u003C/p\u003E\n\n\u003Cp\u003ETaking into consideration the necessity to endanger Mac from unwanted attacks in the network, ProteMac has developed a new generation of information security technology. The ability to control network activity of all applications on Mac as well as to monitor network traffic make NetMine and Meter irreplaceable for business sphere. Our programs enable not only to filter ingoing and outgoing traffic but also to make it visible. Thus we have created a reliable security suite for Mac control and protection. \u003C/p\u003E\n\n\u003Cp\u003EApart from the focus on control inside your computer, our applications are also designed to provide safe and fast access to your Mac. Considering the increasing number of sophisticated hacking techniques, ProteMac has developed the applications to exclude unauthorized activities and improve protection of business or private data. LogonKey enables fast and easy way to logon while Logon Sentry is worked out to monitor both succeeded and failed login attempts. The combination of these programs creates invisible protection over the access to private or corporate data. \u003C/p\u003E\n\n\u003Cp\u003EProteMac releases reliable feature-rich programs that meet the requirements of the most demanding users. Our aim is to improve the quality and features of our products, and thus to provide our customers with the high-level applications for everyday life and business environment. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0012/6671/126671v2-max-150x150.png"],
     [[200,
       200],
      "assets/images/resized/0012/6671/126671v2-max-250x250.png"],
     [[200,
       200],
      "assets/images/resized/0012/6671/126671v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "General Chief",
    "person":
     {"first_name": "Michael",
      "last_name": "Kaba",
      "permalink": "michael-kaba",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0021/4374/214374v2-max-150x150.jpg"],
          [[250,
            250],
           "assets/images/resized/0021/4374/214374v2-max-250x250.jpg"],
          [[450,
            450],
           "assets/images/resized/0021/4374/214374v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "PR Manager",
    "person":
     {"first_name": "Valentina",
      "last_name": "Vysotina",
      "permalink": "valentina-vysotina",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}