{"name": "protechfcs",
 "permalink": "protechfcs",
 "crunchbase_url": "http://www.crunchbase.com/company/protechfcs",
 "homepage_url": "http://protechfcs.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "security",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fire-suppression-systems, fire-detection-systems, fire-prevention-systems, data-center-fire-suppression-systems, fire-suppression-systems-for-server-rooms, fire-suppression-systems-for-computer-rooms, fire-prevention-services, fire-detection-and-suppressi",
 "alias_list": null,
 "email_address": "bbi@protechfcs.com",
 "phone_number": "800-840-4026",
 "description": "Fire suppression systems",
 "created_at": "Wed Feb 06 11:28:21 UTC 2013",
 "updated_at": "Fri Feb 08 05:40:33 UTC 2013",
 "overview": "\u003Cp\u003EPro Tech FCS is an outstanding fire suppressions systems company from southern California. Pro Tech FCS has been distributing and installing Stat-X Fire Suppression Systems for over twenty years Stat-X systems are popular choice of people in disaster management and fire protection of modern industry premises that have electronic equipment like servers and computers.\u003C/p\u003E\n\n\u003Cp\u003EWe are recognized names in fire suppression\u003C/p\u003E\n\n\u003Cp\u003EPro Tech is recognized for expertise and efficiency in fire solutions in southern California. We have been in the fire-suppression industry for over two decades. We maintain a team of fully licensed and insured personnel and technicians, and offer a wide choice of fire and service related warranties and guarantees to our clients.\u003C/p\u003E\n\n\u003Cp\u003EPro Tech FCS has its office in Agoura Hills, CA, and is a leading expert in fire suppression systems for computer rooms, data room and server room protection. Pro Tech does not use or install ordinary sprinkler systems but uses systems that guarantee early detection and extinguishing of fires in a fully eco-friendly manner.\u003C/p\u003E\n\n\u003Cp\u003EPro Tech FCS installs and maintains fire suppression systems and solutions for a wide range of industries including wind turbines, mining, power utilities, marine and offshore, CNC and other machines, rolling stock, transportation, telecommunications and transportation.\u003C/p\u003E\n\n\u003Cp\u003EWe are the experts in fire suppression, because we devise solutions for flammable liquid storage, support emergency first responders, and also cover general industry hazards and telecommunication installations. Our fire suppression solutions and disaster management solutions stand out in eco-friendliness, methods of suppression, and cost-efficiency.\u003C/p\u003E\n\n\u003Cp\u003EPro Tech FCS provides fire control, fire suppression, and fire detection systems for modern industries\u003C/p\u003E\n\n\u003Cp\u003EIn today\u0026#8217;s modern work environment, which is highly dependent upon information technology, protection of the hardware with suitable disaster management systems is a problem faced everyday by industry managers. Normal fire-detection systems fail, because a major part of electronic equipment can melt down and start spreading hazards even before the fire and smoke reaches a level to trigger off conventional alarms. Pro Tech FCS uses and installs fire suppression systems that are customized to set off alarms much earlier than conventional sprinkler systems, and are easier to store and use.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       27],
      "assets/images/resized/0023/3946/233946v2-max-150x150.png"],
     [[250,
       45],
      "assets/images/resized/0023/3946/233946v2-max-250x250.png"],
     [[261,
       48],
      "assets/images/resized/0023/3946/233946v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.protechfcs.com/",
    "title": "Fire suppression systems"},
   {"external_url": "http://www.protechfcs.com/",
    "title": "Fire detection systems"},
   {"external_url": "http://www.protechfcs.com/",
    "title": "Fire prevention systems"}]}