{"name": "Protect Your Home",
 "permalink": "protect-your-home",
 "crunchbase_url": "http://www.crunchbase.com/company/protect-your-home",
 "homepage_url": "http://www.protectyourhome.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "security",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "security-system, home-security",
 "alias_list": null,
 "email_address": "",
 "phone_number": "1-800-580-1342",
 "description": "Home Security System",
 "created_at": "Mon Sep 03 12:26:30 UTC 2012",
 "updated_at": "Sat Sep 08 02:17:46 UTC 2012",
 "overview": "\u003Cp\u003EADT Monitoring\u003C/p\u003E\n\n\u003Cp\u003EADT, LLC. - America\u0026#8217;s leading security company, was founded over a century ago. For years, ADT has been the number one trusted source of protection for millions of families, homes and businesses. By signing up for ADT monitoring, you are ensuring that trained professionals with the most sophisticated and innovative security devices – including home security doors – are monitoring your home at all times, 24 hours a day, 7 days a week. ADT monitored security systems allow you and your family to take advantage of technological advances like home security camera systems and other high-tech home security products. Many of ADT\u0026#8217;s products aren\u0026#8217;t even available from competitors. But, fear not, you will receive an alarm manual to look over if you have questions after your system is installed.\u003C/p\u003E\n\n\u003Cp\u003EADT Monitored Security System Installation Locations\u003C/p\u003E\n\n\u003Cp\u003EBecause we have over 150 branches across the nation, most locations can have an ADT monitored security system installed next day. Once your home is equipped with the security system, it is connected to a network of ADT Customer Monitoring Centers nationwide, delivering non-stop security 365 days a year.\u003C/p\u003E\n\n\u003Cp\u003EThis means you can instantly begin taking advantage of the centers\u0026#8217; staff of knowledgeable professionals utilizing cutting-edge equipment. The moment an alarm signal is received from your home, a notice is delivered to you, law enforcement officers, and the fire department by an ADT professional.\u003C/p\u003E\n\n\u003Cp\u003EProtect Your Home\u0026#8217;s ADT Monitored Security Systems Prices\u003C/p\u003E\n\n\u003Cp\u003EAfter signing up for an ADT monitored security system, a Protect Your Home installation Technician will come out and install the home security system, including wireless sensors if purchased, at your home.\nADT Pricing\u003C/p\u003E\n\n\u003Cp\u003EThis is valued at $850, but with Protect Your Home you can have it installed for just $99*. Protect Your Home also offers monthly ADT monitoring plans starting as low as $36.99. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0020/9449/209449v2-max-150x150.png"],
     [[250,
       79],
      "assets/images/resized/0020/9449/209449v2-max-250x250.png"],
     [[253,
       80],
      "assets/images/resized/0020/9449/209449v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}