{"name": "Pruthvi Packs",
 "permalink": "pruthvi-packs",
 "crunchbase_url": "http://www.crunchbase.com/company/pruthvi-packs",
 "homepage_url": "http://www.indiamart.com/pruthvipacks/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "pruthvipacks@tradepassport.org",
 "phone_number": "9611575480",
 "description": "Manufacturer, supplier.",
 "created_at": "Sat Apr 06 03:56:40 UTC 2013",
 "updated_at": "Mon Apr 08 00:08:22 UTC 2013",
 "overview": "\u003Cp\u003EPruthvi Packs was incorporated in 2009 as a sole proprietorship business firm situated in Bengaluru, Karnataka, India.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nLaminated Corrugated Boxes\nPartitioned Boxes\nDouble Cover Boxes\n9 Ply Corrugated Boxes\nCorrugated Rolls\nPunching Boxes\nPrinted Corrugated Boxes\nDuplex Boards\nCorrugated Ply Boards\u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Set-Up:\nOur organization is supported by technically advanced manufacturing facility that is embedded with advanced technologies and methods. We have equipped advanced tools and equipment in our department that assists us to fabricate quality approved range of products to our clients. Our facility is supervised by experienced professionals who have years of experience in their domain. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are able to cater to the diverse requirements of  clients more efficiently by delivering quality approved range of products to our clients. Clients are considered as the top most priority of our firm. Quality approved product range, low maintenance cost, affordable rates and maximum load bearing capacity are the main pillars that assist us to generate strong trust with our discerning clients. The continual orders from our clients reflect in the progress of our organization. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nBeing quality conscious firm, we test the entire product on varied parameters thereby rendering utmost client satisfaction. We strictly practice total quality management system to maintain the quality of the entire product range. Our entire products are stringently tested under the supervision of proficient quality controllers. We are committed and dedicated to achieve maximum client satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are blessed by a panel of adept and proficient professionals who are able to fabricate quality approved range of products to our clients. Our professionals have sound experience in their domain and maintain the entire business operations in a streamline manner. Their dedication and perseverance towards their goal had assisted us to mark remarkable position in the competitive market. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/9003/249003v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/9003/249003v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/9003/249003v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}