{"name": "Puma Tools",
 "permalink": "puma-tools",
 "crunchbase_url": "http://www.crunchbase.com/company/puma-tools",
 "homepage_url": "http://www.indiamart.com/pumatools/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "pumatools@tradepassport.org",
 "phone_number": "8879421776",
 "description": " manufacturing saw blades",
 "created_at": "Fri Apr 05 09:08:02 UTC 2013",
 "updated_at": "Fri Apr 05 09:08:08 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in 1991, Puma Tools Pvt. Ltd. is a leading manufacturer of saw blades for Industrial use. Our state-of-the art facilities produce Tungsten Carbide Tipped saw blades for almost any application and steel centers for stone and concrete cutting and Tungsten Carbide Tipped saw blades.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have state-of-the-art plants at Goa. Which are equipped with tools for manufacturing specialized cutting tools and use sophisticated technologies and superior quality control techniques that assist us in offering a quality-assured range of saw blades to our customers.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team of skilled and experienced professionals is the backbone of our organization. Our workforce ensures that the entire range of saw blades is manufactured by keeping in mind the customer specifications. Our marketing professionals interact with the customers on a regular basis in order to anticipate market requirements.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nAs a part of our commitment to quality and increasing customer satisfaction we have undertaken a rigorous program of quality assurance. Our adherence to quality policy assists us in meeting the high expectations of our customers in an effective manner and helps us to enhance customer satisfaction.\u003C/p\u003E\n\n\u003Cp\u003ECustomer Satisfaction:\nWe ensure that our products not only meet but exceed the requirements of our customers in the terms of quality, life and price. Owing to our customer oriented strategies, strict quality policy and transparent dealings; we have been able to become the most preferred choice of our customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       100],
      "assets/images/resized/0024/8457/248457v2-max-150x150.jpg"],
     [[200,
       134],
      "assets/images/resized/0024/8457/248457v2-max-250x250.jpg"],
     [[200,
       134],
      "assets/images/resized/0024/8457/248457v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}