{"name": "Purple Strategies",
 "permalink": "purple-strategies",
 "crunchbase_url": "http://www.crunchbase.com/company/purple-strategies",
 "homepage_url": "http://www.purplestrategies.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "bipartisan politcal strategists",
 "created_at": "Fri Jun 08 15:49:20 UTC 2012",
 "updated_at": "Sat Jun 09 21:39:42 UTC 2012",
 "overview": "\u003Cp\u003EPurple Strategies brings together strategists and communication specialists from across the political spectrum. And with our experience, we’re equally at home inside or outside the Beltway. We also pride ourselves on understanding our clients’ culture and working collaboratively with their team. From designing a comprehensive message strategy to opinion research, integrated advertising, media relations and grassroots outreach, Purple provides a unique perspective on public affairs and the highest level of service and expertise.\u003C/p\u003E\n\n\u003Cp\u003EWhy Purple? In our fast-moving, high information society, public attitudes are constantly shifting in ways difficult to predict – and even more difficult to influence. For corporations and trade associations, it’s more important than ever to respond strategically and communicate values that are aligned with society’s expectations. Adding to the challenge, economic uncertainty is fueling an intense partisanship that colors perceptions of issues and events. Increasingly, companies are being drawn into the arena – and subjected to scrutiny – in ways never anticipated even a few short years ago.\u003C/p\u003E\n\n\u003Cp\u003EBut for strategists grounded in the dynamics of political campaigns, this kind of conflict and volatility is familiar territory. Recognizing the need for a balanced, bi-partisan approach to corporate communications, reputation management and issue advocacy, Alex Castellanos and Steve McMahon merged two well-established Republican and Democratic firms – National Media and Issue \u0026amp; Image – to create Purple Strategies.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0019/4538/194538v2-max-150x150.jpg"],
     [[207,
       126],
      "assets/images/resized/0019/4538/194538v2-max-250x250.jpg"],
     [[207,
       126],
      "assets/images/resized/0019/4538/194538v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}