{"name": "Quality Copper",
 "permalink": "quality-copper",
 "crunchbase_url": "http://www.crunchbase.com/company/quality-copper",
 "homepage_url": "http://www.indiamart.com/qualitycoppercables/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "qualitycoppercables@tradepassport.org",
 "phone_number": "9312223432",
 "description": "Manufacturer, Exporter and Supplier",
 "created_at": "Thu Apr 04 15:09:23 UTC 2013",
 "updated_at": "Thu Apr 04 15:09:28 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 2007, at Delhi (India), we, “Quality Copper \u0026amp; Cables Private Limited”, an ISO 9001:2008 Certified Company are highly engaged in manufacturing, exporting and supplying an exceptional assortment of ISI and Non-ISI Welding Hoses, Aluminum Welding Cables and Copper Welding Cables.\u003C/p\u003E\n\n\u003Cp\u003EManufacturing Unit:\nOur company possesses an enormous manufacturing facility that consists of various hi-end machines and advanced equipment. Different procedures are conducted efficiently to ensure economies of scale and quick delivery of finished products. Our manufacturing process is competently carried out by our highly skilled professionals. \u003C/p\u003E\n\n\u003Cp\u003EQuality Testing:\nWe are a quality driven firm that strives hard in order to offer a comprehensive range of ISI and Non-ISI Welding Hoses, Aluminum Welding Cables and Copper Welding Cables to our clients as per the international standards of quality. With the help of our high-tech infrastructural unit, we are engaged in fabricating our offered assortment from optimum quality raw material and sophisticated technology.\u003C/p\u003E\n\n\u003Cp\u003ENetwork:\nSupplying the products to the clients based in different parts of the globe is not at all a difficult task with the wide spread distribution network of the company. The distributors provide the assurance of delivering the products to any region of the world without any delay.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe prime objective of our organization is to attain maximum client contentment by providing an exclusive collection of ISI and Non-ISI Welding Hoses, Aluminum Welding Cables and Copper Welding Cables as per their specification. Our quality control team tests these products on specific parameters at every stage of the production process in order to provide a flawless assortment to our esteemed clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us ?:\nWe have emerged as the leading manufacturer, exporter and supplier of a wide gamut of ISI and Non-ISI Welding Hoses, Aluminum Welding Cables and Copper Welding Cables. These are of optimum quality and broadly used in various application areas.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8015/248015v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8015/248015v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8015/248015v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}