{"name": "Quality Polymers",
 "permalink": "quality-polymers",
 "crunchbase_url": "http://www.crunchbase.com/company/quality-polymers",
 "homepage_url": "http://www.indiamart.com/qualitypolymers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "master-batches, pvc-compound, color-compound, tpr-compound, compound-for-cable-and-molding-compounds-",
 "alias_list": null,
 "email_address": "qualitypolymers@tradepassport.org",
 "phone_number": "9820339877",
 "description": "Manufacturing and supplying ,",
 "created_at": "Fri Apr 05 09:52:04 UTC 2013",
 "updated_at": "Fri Apr 05 09:52:08 UTC 2013",
 "overview": "\u003Cp\u003ESince our incorporation is in year 1993, we, “Quality Polymers”, are a trusted firm engaged in manufacturing and supplying a commendable range of Master Batches and Compounds. Under this range, we offer PVC Master Batches, Master Batches, PVC compound, Color Compound, TPR Compound, Compound For Cable and Molding compounds. The master batches and compounds offered by us is widely appreciated in the market for their features like environment friendliness, longer shelf life, color stability and thermal stability. Highly applauded for these features, our offered master batches and compounds are extensively utilized in the areas of general extrusion, cable insulation, electrical cables, packaging film, sheathing, footwear, detonator-fuse, wire coating, tubing, transparent low-toxicity PVC tubing, industrial strip doors, automotive profiles, gaskets, fabric coating, in-tumescent seals, technical articles and medical devices. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nAll our trade and business related activities are handled by our passionate and multi-talented team of professionals. These professionals enable us to manufacture our range of Master Batches and Compounds in a fruitful manner. Concerned about the production, these professionals keep a eagle-eye on the production process from the procuring of raw material to the final dispatch at customers premises. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nBy adopting several quality management systems and TQM policies, we are able to offer our clients an unmatched range of Master Batches and Compounds. These compounds and master batches are manufactured utilizing quality-approved pigments and other basic components that are sourced from the licensed vendors of the industry. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nSupported by a technically advanced infrastructure facility at our premises, we are able to develop a remarkable range of Master Batches and Compounds. Our sophisticated infrastructure is crowned with modern amenities like sound machines, cutting-edge equipment and ultra-modern tools, which are manned by our personnel. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nTo assure complete client satisfaction, we are engaged in providing our clients with an unblemished range of Master Batches and Compounds. The master batches and compounds offered by us are manufactured by marking use of premium quality required basic material and pigments, procured from the accredited vendors of the industry. Available in customized forms, our offered master batches and compounds conforms to the industry set guidelines.\u003C/p\u003E\n\n\u003Cp\u003EProducts:\nPVC Master Batches, Master Batches, PVC compound, Color Compound, TPR Compound, Compound For Cable and Molding compounds. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8504/248504v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8504/248504v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8504/248504v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}