{"name": "Quant  Digital",
 "permalink": "quant-digital",
 "crunchbase_url": "http://www.crunchbase.com/company/quant-digital",
 "homepage_url": "http://www.quantdigital.com",
 "blog_url": "http://quantdigital.com/blog.html",
 "blog_feed_url": "",
 "twitter_username": "Quantdigital",
 "category_code": "advertising",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 12,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "hello@quantdigital.com",
 "phone_number": "",
 "description": "Multilingual International  Agency",
 "created_at": "Sun Dec 30 02:47:02 UTC 2012",
 "updated_at": "Thu Mar 07 08:35:14 UTC 2013",
 "overview": "\u003Cp\u003EQuant Digital is a multilingual international digital agency with a unique ability to spark lively conversion, connection and exchange. Our perspective is honest, helping people and brands connect in more meaningful ways. We do this by uncovering powerful insights helping website brands increase their visibility on web.\u003C/p\u003E\n\n\u003Cp\u003EQuant Digital creates and implements digital strategies to connect you with your audience. We believe in giving your Fans, Followers, Clients an experience that will keep them talking about you. This includes everything from executing a Multilingual SEO,Multilingual PPC Campaign, Display Retargeting and Social Media Advertising strategy.\u003C/p\u003E\n\n\u003Cp\u003ENowadays we have more than billion searches every month across web and social media websites that rival populations of large countries, there’s unlimited opportunity. But to take advantage of this activity, it is essential to rank high in the search engines, ensuring that your website and social media pages convert visitors, fans, followers into leads, sales and new clients. If you really don’t understand how to successfully apply these strategies, then your potential clients will go to your competitors.\u003C/p\u003E\n\n\u003Cp\u003EWe will specifically work closely with you to create and implement tailored digital campaigns that hit the right targets, helping your brand through your website or social media platform to attract and retain customers. Our Expert team has wide-ranging experience in digital marketing technology that we can bring to brand your business.\u003C/p\u003E\n\n\u003Cp\u003EIf you would like find out more about our products and services, and we might be able to help you achieve your marketing goals please get in touch.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/7361/227361v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0022/7361/227361v2-max-250x250.jpg"],
     [[400,
       400],
      "assets/images/resized/0022/7361/227361v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}