{"name": "R. Nagpal Knitwears",
 "permalink": "r-nagpal-knitwears",
 "crunchbase_url": "http://www.crunchbase.com/company/r-nagpal-knitwears",
 "homepage_url": "http://www.indiamart.com/r-nagpal-knitwears/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "r-nagpal-knitwears@tradepassport.org",
 "phone_number": "9356377718",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 07:17:49 UTC 2013",
 "updated_at": "Fri Apr 05 07:17:55 UTC 2013",
 "overview": "\u003Cp\u003ER. Nagpal Knitwears was incorporated with an aim to efficiently cater to the diverse needs of clients efficiently. Thus, we have started our business as a manufacturer and supplier of Ladies Tops, Ladies Coats, Ladies Woolen Suits, Ladies Cardigans, Ladies Kurtis and Ladies Tunics. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur company is strengthened by a highly advanced and sophisticated infrastructural set-up, which sprawls over a large area and equipped with required amenities. Here, we have a spacious warehouse, where we make storage of bulk consignment for long time frame in a safe and sound manner. Latest machines are installed to meet bulk orders of clients within their specific date and time.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality separates us from other companies of the same domain. Since the day one of our establishment, we are giving prime importance to the excellence of products. For this, we have adopted strict quality control measures, which enable us in supplying products that are free from any defect.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client centric firm, we are focused towards offering range according to the appropriate requirements of clients. We provide the facility of tailor made solutions, in which products are designed as well as developed as per the specific needs of client.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur company has received specialization in providing range according to the actual demands of clients. For this reason, we have garnered huge clientele support from all across the country. Rendering maximum satisfaction to clients is another major factor, which make us prominent in this challenging industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8376/248376v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8376/248376v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8376/248376v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}