{"name": "R. R. Enterprises",
 "permalink": "r-r-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/r-r-enterprises",
 "homepage_url": "http://www.indiamart.com/rrenterprises-chennai/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "rrenterprises-chennai@tradepassport.org",
 "phone_number": "9841286554",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 06:43:41 UTC 2013",
 "updated_at": "Fri Apr 05 06:43:44 UTC 2013",
 "overview": "\u003Cp\u003EWe, R.R. Enterprises, are a Tamil Nadu based firm, incorporated in the year 2002. We have started our business as a sole proprietorship company and engaged in manufacturing, service providing and supplying a vast range of Lathe Machines, Jigs \u0026amp; Fixtures, Drive Clutches, Automotive Gears, Screw Rods \u0026amp; Precision Components. In addition to this, we also offer most reliable Precision Job Works and Machining Services.\u003C/p\u003E\n\n\u003Cp\u003EOur Aim:\nOur products are thoroughly checked before the final dispatch and henceforth, assure high efficiency and durability. Bulk orders are completed effectively within the given time slots to bring worth to the clients\u0026#8217; money.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur company has maintained its firm position in the industry as a leading manufacturer and supplier, due to our immaculate quality array of products. Various guidelines, measures and policies that have been suggested by the industry for quality are followed by us, which enable us in offering world class quality range in the market.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are supported by state-of-the-art infrastructure, which spread across a wide area fitted with requisite amenities. As it sprawl over an extensive landmass, we have partitioned the whole set-up into varied other departments lie production, quality control, warehousing and packaging and many more. It is due to our modern infrastructure that we are ably undertaking bulk orders of clients and meet them within specific time period.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur products stand high on excellence, reliability and durability; as a result, we have successfully placed our name in the list of top notch organizations. We are repeatedly getting orders from clients, which show our ability of rendering them maximum satisfaction.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8342/248342v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8342/248342v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8342/248342v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}