{"name": "Radhey Jewelry",
 "permalink": "radhey-jewelry",
 "crunchbase_url": "http://www.crunchbase.com/company/radhey-jewelry",
 "homepage_url": "http://www.indiamart.com/radheyjewelry/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "radheyjewelry@tradepassport.org",
 "phone_number": "",
 "description": "Manufacturing and exporting Necklace,",
 "created_at": "Fri Apr 05 15:46:39 UTC 2013",
 "updated_at": "Fri Apr 05 15:46:42 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, we, “Radhey Jewelry”, are counted among the prominent business organizations engaged in manufacturing and exporting exclusively designed Necklace Sets, Earrings, Bracelets, Rings and Pendant Sets. The offered range is designed in strict accordance with the prevailing trends in the fashion industry by employing premium quality raw material, which is obtained from the certified vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a zealous \u0026amp; dexterous workforce which strives hard to attain the organizational goals in timely manner. Our professionals possess in-depth knowledge \u0026amp; expertise in this domain and hence strive hard to put forth unique designs before the clients. Further, our professionals frequently interact with the clients to know their exact requirements of designs \u0026amp; other specifications, so as to serve them accordingly.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed an ultra-modern infrastructure at Mumbai, Maharashtra, India, which sprawls over a large area. Further, for the ease of management, we have segregated the infrastructure into various units that are managed \u0026amp; controlled by expert professionals.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality-conscious entity, the prime motive of the organization is to provide the customers with astoundingly designed jewelery. Henceforth, we have employed skilled \u0026amp; experienced designers \u0026amp; craftsmen who extend their untiring efforts to bring forth exclusive designs \u0026amp; patterns. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a customer-focused organization, the prime motive of the organization is to provide the patrons with astoundingly designed imitation jewelery. Henceforth, we make use of only quality approved raw material during the designing process. Further, we employ advanced cutting edge technology and modern tools while crafting the gems \u0026amp; stones. Moreover, to suit the variegated demands of the customers, we offer the range in varied designs, patterns, colors \u0026amp; sizes, which can also be customized as per their specific requirements.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8854/248854v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8854/248854v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8854/248854v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}