{"name": "Radial Function",
 "permalink": "radial-function",
 "crunchbase_url": "http://www.crunchbase.com/company/radial-function",
 "homepage_url": "http://www.radialfunction.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "radialfunction",
 "category_code": "games_video",
 "number_of_employees": 4,
 "founded_year": 2009,
 "founded_month": 8,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-games, social-media, gaming, distribution, development",
 "alias_list": null,
 "email_address": "bizdev@radiafunction.com",
 "phone_number": "",
 "description": "",
 "created_at": "Fri Aug 13 00:11:44 UTC 2010",
 "updated_at": "Tue Sep 14 22:34:10 UTC 2010",
 "overview": "\u003Cp\u003ERadial Function is a collection of senior executives from various sections of the media and gaming industries.  We have a collective over 50 years of gaming and media experience, and our partners come from the leading social media, gaming, and television companies both public and private.  Our expertise is in bridging the gap between traditional media properties and the multi-billion dollar gaming space, with particular emphasis on the recent boom in social and casual games and applications.  We have the ability to develop, monetize and distribute on multiple platforms and via multiple distribution fronts such as online, mobile, I-phone, etc.  Our company is currently focused on the 4D\u0026#8217;s: Design, Develop, Distribute, and Deliver as a mantra and our three key avenues of business are as follows:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003ESoftware and Game Development:  We have been engaged and partnered with high profile media and brand properties to develop multi-platform gaming initiatives.  Our proprietary relationships, industry know-how and ability to tap into foreign resources allow us to develop branded games at a fraction of the cost of our competitors.  We are currently out-pacing our competition by over 70% cost savings, and we often take co-development positions putting equity into projects that make sense, and further drive down the cost to our partners.  On key targeted projects we prepare an in depth financial analysis based on aggregate industry data that often leads to development and operations cost resulting in less than 5%-10% of the overall ROI. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ESocial Media, Gaming and Digital Distribution Transaction and Advisory Practice: As industry leading experts in the field we are often approached to advise on strategic development and transactions in the social media, distribution and gaming spaces.  Our team has the ability to handle all aspects of due diligence and strategic planning, as well as provide EIR services (Entrepreneur in Residence Services) to handle and facilitate internal operations and sales functions for key clients.  We are building a digital consulting practice that acts as a revenue generating center for key partners. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EMonetization of Gaming platforms for Advertisers and Brands:  Via extensive game developer relationships we have access to over 35 million monthly active users online, and our proprietary matching software and algorithms enable us to easily integrate brands and advertisers inside of today\u0026#8217;s casual and social games.  We handle all facets of the media buy and planning and offer full service integration and in certain cases monetization (via sales of virtual goods) of marketing and revenue campaigns. \u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E",
 "image":
  {"available_sizes":
    [[[150,
       83],
      "assets/images/resized/0009/7433/97433v2-max-150x150.jpg"],
     [[250,
       138],
      "assets/images/resized/0009/7433/97433v2-max-250x250.jpg"],
     [[444,
       246],
      "assets/images/resized/0009/7433/97433v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Partner",
    "person":
     {"first_name": "Ravi",
      "last_name": "Srivatsav",
      "permalink": "ravi-srivatsav-krishnamurthy",
      "image":
       {"available_sizes":
         [[[100,
            150],
           "assets/images/resized/0005/1693/51693v9-max-150x150.jpg"],
          [[166,
            250],
           "assets/images/resized/0005/1693/51693v9-max-250x250.jpg"],
          [[300,
            450],
           "assets/images/resized/0005/1693/51693v9-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003ERavi Srivatsav Krishnamurthy\u003C/p\u003E"}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "New York Office",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "Los Angeles Office",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Los Angeles",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}