{"name": "Radiance Chemsol",
 "permalink": "radiance-chemsol",
 "crunchbase_url": "http://www.crunchbase.com/company/radiance-chemsol",
 "homepage_url": "http://www.indiamart.com/radiancechemsol/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "caustic-soda-pearl, caustic-soda-flake, hydrochloric-acid, phthalic-anhydride, ferric-chloride-and-stable-bleaching-powder-",
 "alias_list": null,
 "email_address": "radiancechemsol@tradepassport.org",
 "phone_number": "9820137961",
 "description": "supplying and exporting,",
 "created_at": "Fri Apr 05 05:29:06 UTC 2013",
 "updated_at": "Fri Apr 05 05:29:09 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2011, we, “Radiance Chemsol Pvt. Ltd.”, are one of the leading organizations, engaged in trading, supplying and exporting a comprehensive range of Caustic Soda, Colorless Solution and Organic Compound. Under this range, we offer Caustic Soda Pearl, Caustic Soda Flake, Hydrochloric Acid, Phthalic Anhydride, Ferric Chloride and Stable Bleaching Powder. All our products are widely appreciated by the customers for there accurate composition, precise pH value, longer shelf life and environment friendly nature. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a team of expert professionals, who have years of experience and in-depth knowledge in this domain. All our professional work in close coordination with each other for providing our customers with a qualitative range of Caustic Soda, Colorless Solution and Organic Compound. In addition to this, we arrange regular training sessions for our professionals to keep them abreast of market trends and technological advancements.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nBeing a quality-driven organization, we strive for maintaining the highest level of quality in each chemical. For this, we procure our entire range of Caustic Soda, Colorless Solution and Organic Compound from the reliable and certified vendors of the market, who make these using premium quality ingredients. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe have associated with a vast vendor base for meeting the diverse requirements and demands of our esteemed clients. From these vendors, we procure our entire range of Caustic Soda, Colorless Solution and Organic Compound. They make use of superior quality ingredients to develop and process these chemicals. In addition to this, our procuring agents visit at vendors\u0026#8217; sites for stringently checking their production process.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince our inception, all our efforts are directed towards achieving the highest level of customer satisfaction by providing them with a qualitative range of Caustic Soda, Colorless Solution and Organic Compound.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8257/248257v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8257/248257v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8257/248257v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}