{"name": "Raganata Furnico",
 "permalink": "raganata-furnico",
 "crunchbase_url": "http://www.crunchbase.com/company/raganata-furnico",
 "homepage_url": "http://www.indiamart.com/raganatafurnico/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "chairs, sofas, bar-tools-and-tables",
 "alias_list": null,
 "email_address": "raganatafurnico@tradepassport.org",
 "phone_number": "9212767805",
 "description": "We are the Manufacturer and Supplier ",
 "created_at": "Thu Apr 04 09:00:24 UTC 2013",
 "updated_at": "Thu Apr 04 09:00:30 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 2008, at Delhi (India), we, “Raganata Furnico ”, are a prominent manufacturer and supplier of a wide assortment of Office Furniture like Chairs, Sofas, Bar Tools and Tables. Due to its attractive features like attractive design, high strength, smooth edges, strong construction, excellent finish and low cost maintenance, the entire range is widely appreciated by the customers. Our offered range is manufactured by making use of quality raw material and latest tools \u0026amp; equipment at our capacious infrastructure. Customers can avail our entire range according to their choice. Our company has developed an ultra-modern infrastructure, which is spread all across a wide area. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWith a team of adept professionals, who are highly skillful in rendering their jobs, we are able to offer incredible products to the clients. The professionalism that is carried in our team is translated to the spaces of work. Moreover, our team works in close coordination with our clients and has the capability to fulfill their demands \u0026amp; requirements. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur well-established and ultra-modern infrastructure is highly equipped with all kinds of technically advanced tools, equipment and machines. These products are manufactured using high-grade raw-material in order to provide a flawless range of products to our esteem clients. With the help of our proficient engineers and technicians, we have been able to to provide a qualitative range of products to our clients. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nOurs is a quality conscious organization known for stringently following quality control objectives to meet the international norms. All the Office Furniture like Chairs, Sofas, Bar Tools and Tables offered by our organization are manufactured using quality-tested raw material sourced from the most trusted vendors of the market. Our quality experts supervise the entire production process carefully in order to deliver flawless range at our customer’s premises. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nChairs, Sofas, Bar Tools and Tables\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7722/247722v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7722/247722v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7722/247722v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}