{"name": "Raghav Trading",
 "permalink": "raghav-trading",
 "crunchbase_url": "http://www.crunchbase.com/company/raghav-trading",
 "homepage_url": "http://www.indiamart.com/raghavtradingcompany/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "raghavtradingcompany@tradepassport.org",
 "phone_number": "9414788260",
 "description": "trading, exporting and supplying",
 "created_at": "Fri Apr 05 08:34:06 UTC 2013",
 "updated_at": "Fri Apr 05 08:34:09 UTC 2013",
 "overview": "\u003Cp\u003ERaghav Trading Company came into inception in the year 2009 as a partnership firm. We are based in the beautiful pink city of Jaipur which is in the state of Rajasthan, India. We trade, export and supply Natural Coriander, Herbal Turmeric, Fennel Seed, Herbal Carom Seed, Black Pepper, Fenugreek Seed, Indian Coconut and Fresh Sabudana Sago. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have been successful in gaining a good foothold in the market owing to number of advantages that we are blessed with, amongst them our workforce plays a vital role. We have recruited quality people who assist us in all our en devours, our team possesses great teamwork and mutual understanding this benefits us in achieving organizational goals easily.\u003C/p\u003E\n\n\u003Cp\u003EOur Valued Clientele:\nAll our products and services are for our valued clientele. We cater to a number of people which include individuals, hoteliers, restaurants, traders, ayurvedic medicine manufacturers and many more. We meet all their demands in the most efficient manner, we specialize in supplying the products as per the needs of clients and this helps them immensely. We make every possible effort in making our clients happy and satisfied.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are trading and supplying a huge range of products and herbs to our clients. We have been successfully meeting the demands of clients owing to our trustworthy vendors. We have a huge number of vendors who supply us quality products, our vendors are chosen after detailed market survey and meticulous comparative study. In partnering a vendor we also give a fair amount of consideration to their market value and financial stability.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are appreciated by our clients for huge number of reasons. Our quality products make us the most favorable choice in the market. Our products are packed in various packaging as per the suitability of clients. Our distribution network also meets their demand in most appropriate manner. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8436/248436v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8436/248436v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8436/248436v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}