{"name": "RAINE",
 "permalink": "raine",
 "crunchbase_url": "http://www.crunchbase.com/company/raine",
 "homepage_url": "http://www.rainemagazine.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "rainemagazine",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "creative-entrepreneur-magazine, business-women-magazine, entrepreneurial-magazines, young-entrepreneurs, creative-entrepreneur, fashion-entrepreneurs, fashion-blog, art-magazine, best-modern-art-magazines, online-art-magazines, fashion-photographer, young",
 "alias_list": null,
 "email_address": "media@rainemagazine.com",
 "phone_number": "1-866-997-2463",
 "description": "Creative Entrepreneur Magazine",
 "created_at": "Fri Dec 16 11:04:39 UTC 2011",
 "updated_at": "Mon Dec 19 03:41:50 UTC 2011",
 "overview": "\u003Cp\u003ECreative entrepreneurs are fashion entrepreneurs, women business entrepreneurs, fashion bloggers, fashion photographers, young entrepreneurs, technology entrepreneurs, social media entrepreneurs, marketing entrepreneurs, publicists, art and food entrepreneurs, entrepreneurs in travel and entertainment, music, film and television, and other great out of the box thinkers that are willing to take a chance and go after their dreams.\u003C/p\u003E\n\n\u003Cp\u003ERaine Magazine was launched in 2007 exclusively as one of the first digital magazines to serve as a platform for the next big names in fashion, entertainment culture and technology. As a woman entrepreneur and fashion entrepreneur, Founder and CEO, Nova Lorraine, had a goal at the time to create an electronic magazine that would inspire with beautiful fashion photography and stories of the most talented creative entrepreneurs. Nova had no idea that the interest in the magazine would grow as it has. “The demand for more issues and a true glossy print edition became more evident,” stated Nova.\u003C/p\u003E\n\n\u003Cp\u003EWith an eco-friendly mindset still in place, beginning with Volume 7, this past spring, Nova launched Raine into distribution as a quarterly coffee table and digital magazine that features the rising talents in fashion, entertainment, culture and technology. “Being an entrepreneur is such an unique yet lonely path. Raine is meant to empower one to continue discovering their dreams and to introduce to the world the brightest stars behind our favorite brands.”\u003C/p\u003E\n\n\u003Cp\u003EOffered in print and digital, Raine Magazine is the premier print and online entrepreneur magazine featuring the must know names in fashion, entertainment, culture and technology. It is a true resource for industry insiders. It’s distributed nationwide through Barnes and Nobles, Amazon, Zinio.com and www.rainemagazine.com.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0016/6649/166649v2-max-150x150.png"],
     [[250,
       73],
      "assets/images/resized/0016/6649/166649v2-max-250x250.png"],
     [[263,
       77],
      "assets/images/resized/0016/6649/166649v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "CEO \u0026 Founder",
    "person":
     {"first_name": "JP",
      "last_name": "Bewley",
      "permalink": "vinny-olmstead",
      "image":
       {"available_sizes":
         [[[100,
            150],
           "assets/images/resized/0024/0836/240836v2-max-150x150.jpg"],
          [[166,
            250],
           "assets/images/resized/0024/0836/240836v2-max-250x250.jpg"],
          [[267,
            400],
           "assets/images/resized/0024/0836/240836v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}