{"name": "Rajdeep Automation",
 "permalink": "rajdeep-automation",
 "crunchbase_url": "http://www.crunchbase.com/company/rajdeep-automation",
 "homepage_url": "http://www.indiamart.com/rajdeep/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "multiplexed-photoelectric-amplifier, digital-indicator, electronic-timer, hollow-shaft-encoder, industrial-supply-and-many-more-",
 "alias_list": null,
 "email_address": "rajdeep@tradepassport.org",
 "phone_number": "",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Sat Apr 06 06:23:47 UTC 2013",
 "updated_at": "Mon Apr 08 00:16:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1969, we, “Rajdeep Automation Pvt. Ltd.”, are one among the reputed organizations engaged in manufacturing and exporting a wide range of Incremental Encoder Shaft, Amplifier, Digital Indicator and Electronic Timer, under the popular BBTT brand. Our offered range consists of Sensors, Light Sensor, Remote Sensor, Multiplexed Photoelectric Amplifier, Digital Indicator, Electronic Timer, Hollow Shaft Encoder, Industrial Supply and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Team\u0026#8221;\nOur organization has succeed in becoming one of the reputed manufacturer and exporter of Incremental Encoder Shaft, Amplifiers, Digital Indicators, and Electronic Timers, with enormous support of a dedicated team of professionals. All the professionals associated with us are highly dedicated and put hard efforts to serve our clients as par their exact requirements within the promised time-frame. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nTo manufacture a unparalleled and a flawless range of Incremental Encoders, Amplifiers, Digital Indicators, Scientific Instruments and Electronic Timers, we have developed a sophisticated infrastructural facility sprawled over a vast area of land. Our infrastructure supports us to carry out all the business activities in a systematic manner and enable us to achieve great height in the industry. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nBeing a client-centric organization, we believe that to add more satisfied clients with us we must serve them with a flawless range of Incremental Encoder Shaft, Amplifiers, Digital Indicator and Electronic Timers. Our organization has succeeded in becoming a reputed organization of this industry by offering an unparalleled range manufactured in complete adherence with the international quality parameters using of optimum-grade raw-material and sophisticated technologies. \u003C/p\u003E\n\n\u003Cp\u003EDivisions:\nRajdeep Industrial Products Ltd. was established in 1969 in Bombay. Currently we are situated in Pune (Head Quarters) and Bombay (Registered + Sales offices) which are in Maharashtra, on of the most industrialized states in India. Strong infrastructure, Sound financial health, Foresight, Competent and well-trained staff are some the assets which have helped us over the years. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nSensors, Light Sensor, Remote Sensor, Multiplexed Photoelectric Amplifier, Digital Indicator, Electronic Timer, Hollow Shaft Encoder, Industrial Supply and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       123],
      "assets/images/resized/0024/9077/249077v2-max-150x150.jpg"],
     [[250,
       205],
      "assets/images/resized/0024/9077/249077v2-max-250x250.jpg"],
     [[250,
       205],
      "assets/images/resized/0024/9077/249077v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}