{"name": "Ramshyam",
 "permalink": "ramshyam",
 "crunchbase_url": "http://www.crunchbase.com/company/ramshyam",
 "homepage_url": "http://www.ramshyam.com/",
 "blog_url": "http://www.ramshyam.com/Inbound-Call-Center.xml",
 "blog_feed_url": "http://www.ramshyam.com/Inbound-Call-Center.xml",
 "twitter_username": "",
 "category_code": "public_relations",
 "number_of_employees": 100000,
 "founded_year": 1989,
 "founded_month": 2,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "inbound-call-center, call-center-services, call-center-outsourcing-service",
 "alias_list": null,
 "email_address": "info1@ramshyam.com",
 "phone_number": "877-778-7930",
 "description": "Inbound Call Center, Call Center Service",
 "created_at": "Tue Dec 01 11:19:29 UTC 2009",
 "updated_at": "Tue Dec 01 19:16:52 UTC 2009",
 "overview": "\u003Cp\u003ECall Center Outsourcing, Inbound Call Center Services, Order Taking and more Call Center Services\u003C/p\u003E\n\n\u003Cp\u003ERamshyam is the trusted choice for many companies seeking to outsource their call center services to optimize on cost, time \u0026amp; efficiency.\u003C/p\u003E\n\n\u003Cp\u003EWe provide Voice, Live Chat, Email Support \u0026amp; Back Office services (Transaction Processing \u0026amp; Data Entry) which are proven, effective \u0026amp; endorsed by our clients, and partners for quality in customer service. We guarantee visible increase in sales and happy customer faces at affordable cost. All our clients around the globe enjoying world class Call Center Outsourcing Services, which we have been providing to them from the day one.\u003C/p\u003E\n\n\u003Cp\u003ELearn how our Inbound Call Center Outsourcing services will enhance your customer\u0026#8217;s support experience.\u003C/p\u003E\n\n\u003Cp\u003EOur primary service offerings are Customer Support services, Technical Support Services \u0026amp; Business Process \u0026amp; Call Center Outsourcing. We offer 24/7 Inbound Call Center services for Order taking, Customer Support (Technical \u0026amp; non-Technical), Toll-free Answering Services, 24-Hr Help Desk, and Emergency Response over multiple media like Phone, Live Chat \u0026amp; Emails. We also offer data processing services like Transaction processing \u0026amp; Data entry.\u003C/p\u003E\n\n\u003Cp\u003EOur target clients are small to mid-size companies seeking 2-20 agents setup for call center solutions. We specialize in inbound call center services over Phone, Live Chat and Email answering with near-zero error which enhances your customer\u0026#8217;s support experience.\u003C/p\u003E\n\n\u003Cp\u003EThe Secret of delivering 100% satisfaction through our Inbound Call Center Outsourcing Services\u003C/p\u003E\n\n\u003Cp\u003EWith more than 5 million minutes of phone support, 1 million minutes of Chat support and over 5 million emails answered, we deliver the best in class customer satisfaction and increased profits.\u003C/p\u003E\n\n\u003Cp\u003EAll our clients have reported reduced turn-around time, increase in satisfaction levels, increase in profits and business growth within 3-6 months of Inbound Call Center Outsourcing to us.\u003C/p\u003E\n\n\u003Cp\u003EBe it Pre-Sales queries or Post-Sales customer support, we handle them all with the core idea of delivering 100% satisfaction, increase in customer loyalty, increase in repeat purchase, increase in profit \u0026amp; dramatic reduction in number of support requests. We deliver a unique combination of seamless integration with your business and warm association with your customers making customer interaction a happy experience. We offer offshore outsourced Call Center services over various media: Live Phone Answering, Live Chat Support, Email Answering via Trouble-ticket.\u003C/p\u003E\n\n\u003Cp\u003EOur agents always do the hard work, and take accountability for the results for all your Inbound Call Center Outsourcing needs.\u003C/p\u003E\n\n\u003Cp\u003EOur agents are educated and well trained for web based \u0026amp; traditional brick-and-mortar business models. Our support agents understand customers and are experts in converting prospects into buyer and help buyers buy more. All our operators are well groomed to handle irate callers, pacify them and solve their queries patiently. We maintain updated knowledgebase for all our clients, helping us deliver standardized and uniform support.\u003C/p\u003E\n\n\u003Cp\u003EChoose Ramshyam for outsourcing call center services and have high conversion rates, increased sales, and more contented clients. Our award winning inbound call center services will help you push your sales and have most out of your marketing money. For more information on our Call Center Services please review our plans or contact us.\u003C/p\u003E\n\n\u003Cp\u003EWe have the talent pool and capability to deliver to your expectations and more.\nYour search for a reliable and trusted outsourced offshore call center services ends here! \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0006/8159/68159v1-max-150x150.png"],
     [[233,
       61],
      "assets/images/resized/0006/8159/68159v1-max-250x250.png"],
     [[233,
       61],
      "assets/images/resized/0006/8159/68159v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}