{"name": "Randstad Technologies",
 "permalink": "randstad-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/randstad-technologies",
 "homepage_url": "http://technologies.randstadusa.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "RandstadTechUS",
 "category_code": "consulting",
 "number_of_employees": 800,
 "founded_year": 1960,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it, staffing, solutions",
 "alias_list": null,
 "email_address": "rt-marketing@randstadusa.com",
 "phone_number": "7819391715",
 "description": "Randstad Technologies",
 "created_at": "Fri Sep 28 20:10:15 UTC 2012",
 "updated_at": "Thu Oct 11 16:41:50 UTC 2012",
 "overview": "\u003Cp\u003ERandstad Technologies has been connecting top companies around the globe with the expert talent that drives their success since 1984. We work to ensure that the professionals we deliver have the distinct skills clients are looking for to reach their specific goals. Our deep industry expertise and full-service capabilities—IT staff augmentation, permanent placement, technology solutions, and ERP capabilities—enable organizations to be agile, productive, and ahead in the field. With our wide network of specialists and flexible solutions, we’re always ready to help clients achieve their latest objective—and provide them with what they require to reach the next one.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EAbout Randstad\u003C/strong\u003E\nRandstad is a $22.5 billion global provider of HR services and the second largest staffing organization in the world. From temporary staffing to permanent placement to inhouse, professionals, search \u0026amp; selection, and HR Solutions, Randstad holds top positions around the world and has approximately 28,700 corporate employees working from its nearly 4,700 branches and inhouse locations in 40 countries. Founded in 1960 and headquartered in Diemen, the Netherlands, Randstad Holding nv is listed on the NYSE Euronext Amsterdam (RAND.AS).\u003C/p\u003E\n\n\u003Cp\u003ELearn more at \u003Ca href=\"http://www.randstadusa.com/\" title=\"www.randstad.com\" rel=\"nofollow\"\u003Ewww.randstad.com\u003C/a\u003E\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EOur Contractors\u003C/strong\u003E\nRandstad Technologies contractors have the connections to the best IT and engineering jobs at the finest companies. Through our expanding national network of over 40 business units nationwide, our company has helped thousands of contractors find rewarding IT jobs with businesses ranging from high-tech startups to Fortune 100 corporations. Over 2,500 clients rely on Randstad Technologies to strengthen their competitive positions and each year we continue to add to our growing list of loyal customers.\u003C/p\u003E\n\n\u003Cp\u003EWe offer unparalleled flexibility and career advancement opportunities with challenging IT and Research and Development jobs in virtually every industry. Working with Randstad Technologies allows our consultants the freedom to choose the technologies and markets they want to work with.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EOur Clients\u003C/strong\u003E\nLong-standing relationships with the industry\u0026#8217;s best IT talent allows our clients to maximize their IT spend by utilizing highly skilled technology and engineering professionals where and when they need them.\u003C/p\u003E\n\n\u003Cp\u003EWhether a large international corporation or small regional office, Randstad Technologies\u0026#8217; streamlined IT recruitment process is equipped to manage our client\u0026#8217;s volumes, and expectations. By operating on a single database of over 650,000 highly qualified candidates, we can provide our clients with the personnel they require to meet key project deadlines.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EOur Partners\u003C/strong\u003E\nRandstad Technologies is committed to improving the quality of life and enhancing the vitality of the communities in which we operate. As a partner of YearUp, an intensive training program that provides urban young adults 18-24, with a unique combination of technical and professional skills, college credits, an educational stipend and corporate apprenticeship, Randstad Technologies is able to demonstrate our commitment to both on-going education in IT as well as philanthropic endeavors.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EOur Memberships\u003C/strong\u003E\n\u003Cem\u003EAmerican Staffing Association (ASA)\u003C/em\u003E \n\u003Cem\u003EStaffing Industry Analysts\u003C/em\u003E \n\u003Cem\u003ETechServe Alliance\u003C/em\u003E\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0021/3494/213494v2-max-150x150.png"],
     [[223,
       61],
      "assets/images/resized/0021/3494/213494v2-max-250x250.png"],
     [[223,
       61],
      "assets/images/resized/0021/3494/213494v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Executive Vice President of Technologies",
    "person":
     {"first_name": "Bob",
      "last_name": "Dickey",
      "permalink": "bob-dickey",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "CIBER",
      "permalink": "ciber",
      "image":
       {"available_sizes":
         [[[134,
            48],
           "assets/images/resized/0012/3342/123342v1-max-150x150.jpg"],
          [[134,
            48],
           "assets/images/resized/0012/3342/123342v1-max-250x250.jpg"],
          [[134,
            48],
           "assets/images/resized/0012/3342/123342v1-max-450x450.jpg"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Randstad Technologies",
    "address1": "150 Presidential Way",
    "address2": "",
    "zip_code": "01801",
    "city": "Woburn",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.randstadusa.com/workforce360",
    "title": "Workforce360"}]}