{"name": "Ranking By SEO",
 "permalink": "ranking-by-seo",
 "crunchbase_url": "http://www.crunchbase.com/company/ranking-by-seo",
 "homepage_url": "http://www.rankingbyseo.com/",
 "blog_url": "http://blog.rankingbyseo.com/",
 "blog_feed_url": "http://blog.rankingbyseo.com/feed/",
 "twitter_username": "rankingbyseo",
 "category_code": "ecommerce",
 "number_of_employees": 25,
 "founded_year": 2008,
 "founded_month": 7,
 "founded_day": 16,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-india, seo-company-india, seo-services-india, seo-services, seo, ppc, seo-marketing, search-engine-optimization",
 "alias_list": null,
 "email_address": "rankingbyseo@gmail.com",
 "phone_number": "+919953532683",
 "description": "SEO India, SEO Comapny India",
 "created_at": "Sat Jun 19 07:57:56 UTC 2010",
 "updated_at": "Sun Jun 20 01:24:21 UTC 2010",
 "overview": "\u003Cp\u003ERanking By SEO is a centre of excellence which would like to introduce itself as a convergent thinker that helps to solve all the gravels associated with SEO, link building, pay per click, website development, website designing and content writing, in short a perfect bouquet of complete IT solutions. It is as young as 2 years and possesses nebulous ideas in a young mind, which, if nurtured along with the proper elements, has the capability to add a new dimension to the future of the IT industry.\u003C/p\u003E\n\n\u003Cp\u003ERanking By SEO is a convergence point of intelligence and imagination. As the Sun dawn upon billion masses, our young energetic talents take flight towards the highly focused goals of fulfilling global clients\u0026#8217; requirements. Be it SEO, PPC or any other web services, within a short time, Ranking By SEO has successfully created a milestone and a safe cage in the minds of its international clients. With massive pool of talent and skill, Ranking By SEO channelises these energies towards every sphere of web service.\u003C/p\u003E\n\n\u003Cp\u003ERanking By SEO believes in the inherent and stimulus power of ideas. Strategically based in Noida (Delhi/NCR) India, Ranking By SEO encourages the entrepreneurial spirit of India and conceptualizes the path-breaking innovations. With its out-of-the-box strategies, vivid knowledge and extensive expertise, Ranking By SEO serves its global clients in the most vibrant manner. With its extreme hard work and profound determination, Ranking By SEO has been tagged as \u0026#8216;24x7 E-Factory\u0026#8217;, where anytime, any client will be resolved from any type of web baffle.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0009/1104/91104v2-max-150x150.jpg"],
     [[250,
       81],
      "assets/images/resized/0009/1104/91104v2-max-250x250.jpg"],
     [[348,
       114],
      "assets/images/resized/0009/1104/91104v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}