{"name": "Rated Best",
 "permalink": "rated-best",
 "crunchbase_url": "http://www.crunchbase.com/company/rated-best",
 "homepage_url": "http://rated-best.info/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 1,
 "founded_year": 2008,
 "founded_month": 5,
 "founded_day": 30,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "shopping",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Product Comparison Shopping",
 "created_at": "Tue Aug 19 04:38:12 UTC 2008",
 "updated_at": "Mon Sep 21 16:52:48 UTC 2009",
 "overview": "\u003Cp\u003EThe single best product or service in a particular category, based on the editors\u0026#8217; own experiences as well as research across the most reputable ratings and reviews sites on the web.\u003C/p\u003E\n\n\u003Cp\u003EAs an uniformed or under-informed consumer, filtering through all the options out there is hard. A while ago when there were fewer choices, it was easy. If you needed an item, you bought the only one that was available. Now you go to the store and there are 10 or 30 or even 200 choices, whether it\u0026#8217;s a digital camera, cable TV, energy bar, or sleeping bag. So what\u0026#8217;s a consumer to do?\u003C/p\u003E\n\n\u003Cp\u003ESeek help, of course. So you read a buyer\u0026#8217;s guide or product reviews or even read the marketing copy on the packages in the store. But while these help you narrow the field down, they still force you to make the final decision: A vs B (vs. C vs. D\u0026#8230;). My idea is to take the filter to the extreme.\u003C/p\u003E\n\n\u003Cp\u003EFor every product and service category I review, I will give you one recommendation. That\u0026#8217;s right, there\u0026#8217;s no decision to make (other than whether or not you actually need this new product or service); I will have already done the work for you. Granted, you\u0026#8217;re going to have to trust me. And I have to earn that trust. Fair enough. But once I do, this site will save you a ton of time, effort, and stress.\u003C/p\u003E\n\n\u003Cp\u003ESo a single recommendation isn\u0026#8217;t going to work for everyone. That\u0026#8217;s fine. This site isn\u0026#8217;t for everyone. It\u0026#8217;s for the 80% of the population out there who has been overwhelmed by the paradox of choice and just wants the best overall product out there without having to do a ton of (or really any) work. High value, low cost decision making.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       35],
      "assets/images/resized/0002/3814/23814v2-max-150x150.png"],
     [[167,
       40],
      "assets/images/resized/0002/3814/23814v2-max-250x250.png"],
     [[167,
       40],
      "assets/images/resized/0002/3814/23814v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}