{"name": "RAWRG!!!",
 "permalink": "rawrg",
 "crunchbase_url": "http://www.crunchbase.com/company/rawrg",
 "homepage_url": "http://www.rawrg.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": 1,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-network, game, gamers, gaming, play-games, free-games, buy-games, guild-hosting, fan-pages, game-reviews",
 "alias_list": null,
 "email_address": "admin@rawrg.com",
 "phone_number": "",
 "description": "Social network and media site for gamers",
 "created_at": "Fri Oct 07 00:44:32 UTC 2011",
 "updated_at": "Mon Aug 06 19:19:54 UTC 2012",
 "overview": "\u003Cp\u003ERAWRG!!! offers social networking and media for gamers!  Plus check out our massive Gamer\u0026#8217;s Gear store, thousands of free games in our arcade, and game related news!\u003C/p\u003E\n\n\u003Cp\u003ERAWRG!!! is dedicated to bringing you the best quality social experience and, to that end, we have provided you with the best platform for doing so. With our integrated social networking tools, you will be able to create almost any type of game related social networking experience that you desire!\u003C/p\u003E\n\n\u003Cp\u003EBy utilizing the powerful integrated social networking tools that Rawrg puts at your disposal, even the mightiest guild can create a home for their members! We host fully customizable group pages with privacy features, forums, instant chat, wikis, media albums, and many more features!\u003C/p\u003E\n\n\u003Cp\u003EIs there a game that you want to start a fan page for, but don\u0026#8217;t know how to program your own site? Maybe you already know how to program, but just don\u0026#8217;t have a lot of extra time to create a site from scratch. If you want a powerful platform with no programming required, then RAWRG!!! is the right place for you!\u003C/p\u003E\n\n\u003Cp\u003EIf you want to let the world know what you think of the games you\u0026#8217;ve played, then sign up for a free account and start posting your game reviews. Whether you love a game or hate it, we want to hear about it!\u003C/p\u003E\n\n\u003Cp\u003ERAWRG!!! has a large variety of free high quality games that you can play directly on our site. Choose from Action, Puzzle, and Strategy games just to name a few. RAWRG!!! even features social games, so you can invite your friends to play with you!\u003C/p\u003E\n\n\u003Cp\u003ELooking for gaming gear? You\u0026#8217;ve come to the right place! We feature a huge variety of PC games and hardware, PS3 games, Xbox 360 games, Wii games, and strategy guides. Check back often for the latest games and game accessories!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0015/7116/157116v2-max-150x150.png"],
     [[225,
       75],
      "assets/images/resized/0015/7116/157116v2-max-250x250.png"],
     [[225,
       75],
      "assets/images/resized/0015/7116/157116v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}