{"name": "Rayotec",
 "permalink": "rayotec",
 "crunchbase_url": "http://www.crunchbase.com/company/rayotec",
 "homepage_url": "http://rayotec.com",
 "blog_url": "http://rayotec.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": null,
 "founded_year": 1987,
 "founded_month": 1,
 "founded_day": 30,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "underfloor-heating, solar-power",
 "alias_list": null,
 "email_address": "info@rayotec.com",
 "phone_number": "+4401932784848",
 "description": "Underfloor Heating",
 "created_at": "Fri May 25 15:42:25 UTC 2012",
 "updated_at": "Thu May 31 02:34:49 UTC 2012",
 "overview": "\u003Cp\u003ERayotec is one of the UK\u0026#8217;s leading distributors of warm water underfloor heating. The Company promotes the high quality Rayomax system. Rayotec design and sell the systems as a kit, but in addition work close with an independent installation specialist company for those who would prefer a complete peace of mind service.\u003C/p\u003E\n\n\u003Cp\u003ERayotec\u0026#8217;s warm water underfloor heating team distribute throughout the UK and has even got customers in Portugal, Spain and France. The underfloor heating team provide technical back up throughout installations and have an attentive after sales service.\u003C/p\u003E\n\n\u003Cp\u003EThe warm water underfloor heating projects have ranged in size from single room extensions to commercial projects of blocks of homes and communal facilities. Rayotec works close with trade customers such as builders and developers as well as with architects and end users.\u003C/p\u003E\n\n\u003Cp\u003ERayotec is also one of the appointed UK distributors for the innovative electric ribbon heating mats. The Company designs and sells the system throughout UK and has sold systems to European and worldwide customers.\u003C/p\u003E\n\n\u003Cp\u003EThe company has worked on projects from as small as bathrooms to large scale projects to blocks of flats and homes, Jersey care home and schools.\u003C/p\u003E\n\n\u003Cp\u003ERayotec has also now introduced the NEW WEB-TECH electric underfloor cable heating mat. This German design system is ideal for under tiled projects and commercial projects, showing all how easy to install and cost effective electric underfloor heating can really be.\u003C/p\u003E\n\n\u003Cp\u003ERayotec offers a training service for prospective trade customers as well as free full marketing material for any prospective dealers. With such great product and Rayotec\u0026#8217;s extensive technical knowledge and after sales service, the product has been made desirable to all trades including flooring companies, builders, developers and conservatory companies as well as to the end user.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.lowcarboneconomy.com/profile/rayotec_ltd",
    "title": "Rayotec Company Profile"}]}