{"name": "Reactrix",
 "permalink": "reactrix",
 "crunchbase_url": "http://www.crunchbase.com/company/reactrix",
 "homepage_url": "http://www.reactrix.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2002,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "reactrix, technology-driven, scalable, brand-advertising, consumer-control",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Consume Control of Advertising",
 "created_at": "Mon Nov 26 03:27:06 UTC 2012",
 "updated_at": "Mon Nov 26 03:27:44 UTC 2012",
 "overview": "\u003Cp\u003EReactrix is a technology-driven media company. Their technology was created to give consumers more control over their media experience. They launched in 2002 using their gesture-based technology for special events and trade shows.\u003C/p\u003E\n\n\u003Cp\u003EToday they run the Reactrix STEPscape™ Media Network in more than 186 malls and theatres. Reactrix\u0026#8217; \u0026#8220;A-list\u0026#8221; advertisers span a diverse range of leading brands including Coca-Cola, Sony Pictures, Subway, Mars, Hilton Hotels, AT\u0026amp;T, Xbox, RIM, T-Mobile, Wachovia, Universal Studios, Visa, Paramount Pictures, New Line Cinema and eBay among many others. They recently announced a strategic partnership with National CineMedia, the largest digital in-theatre network, expanding the STEPscape Media Network to AMC Entertainment Inc., Cinemark USA Inc. (NYSE: CNK) and Regal Entertainment Group (NYSE: RGC), the three largest theatre operators in the U.S.\u003C/p\u003E\n\n\u003Cp\u003EThey launched theirr newest media technology, WAVEscape™, at the 2008 Consumer Electronics Show (CES) in a strategic alliance with Samsung. WAVEscape features Wii-like functionality in a digital signage solution. The first WAVEscape Media Network will launch in Hilton Hotels in late 2008. Additional WAVEscape Media Networks will be launching in 2009.\u003C/p\u003E\n\n\u003Cp\u003EReactrix\u0026#8217; STEPscape and WAVEscape products feature proprietary, patented interactive display technology and their global patents have priority dates back to 2001.\nReactrix has also created the Reactrix Media Center™ — a digital signage management product that allows outside companies to operate secure out-of-home media networks efficiently and effectively. The Reactrix Media Center is a proven, scalable media and network management platform and offers the same \u0026#8220;unplug and play\u0026#8221; wireless solution that runs the STEPscape Media Network.\u003C/p\u003E\n\n\u003Cp\u003EMost recently, they launched the Reactrix Spectacular division to develop, create and produce one-of-a-kind, larger-than-life installations for clients featuring their projection and gesture-based technology.\u003C/p\u003E\n\n\u003Cp\u003EInnovation and engagement are the keys to Reactrix and the foundation of their effective advertising medium. But most importantly, they pride ourselves on a company culture that ensures an innovative and engaging environment for each and every employee.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0022/2129/222129v1-max-150x150.png"],
     [[250,
       50],
      "assets/images/resized/0022/2129/222129v1-max-250x250.png"],
     [[260,
       52],
      "assets/images/resized/0022/2129/222129v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}