{"name": "Realtime Support Data Recovery Services",
 "permalink": "realtimesupport-com",
 "crunchbase_url": "http://www.crunchbase.com/company/realtimesupport-com",
 "homepage_url": "http://realtimesupport.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 50,
 "founded_year": 1990,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "data-recovery-los-angeles, hard-drive-data-recovery, data-recovery, mac-data-recovery, hard-disk-data-recovery, raid-data-recovery, file-recovery, restore-data, data-loss, data-recovery-services, external-hard-drive-files",
 "alias_list": null,
 "email_address": "info@realtimesupport.com",
 "phone_number": "(562) 506-1469",
 "description": "Mac \u0026 PC Data Recovery Services",
 "created_at": "Sat May 08 21:52:47 UTC 2010",
 "updated_at": "Wed Aug 15 06:38:28 UTC 2012",
 "overview": "\u003Cp\u003EWe specialize in data recovery from a variety of media/devices regardless of the data loss scenario, we recover lost data from all types of physical hard disk malfunction whether it\u0026#8217;s clicking, not spinning, dropped, water damage, fire damage, or just doesn\u0026#8217;t detect. Even formatted, deleted, or simply can no longer be accessed, we quickly recover deleted files and data lost due to virus infections and hackers.\u003C/p\u003E\n\n\u003Cp\u003EWhatever your media; Hard Drive, RAID Server, Digital Camera \u0026amp; Flash Card, iPod, Jump Drive and all other types of media/formats. If you have deleted files, corrupted media, Realtime Support Data Recovery Services is the place for all your solutions.\u003C/p\u003E\n\n\u003Cp\u003EAll work is done by our expert data recovery engineers, one of whom will be assigned to work with you personally every step of the way through the data recovery process. Our fast, friendly service, strict confidentiality policies, If We Can\u0026#8217;t Recover Your Data\u0026#8230; You Don\u0026#8217;t Pay! guarantee, and expert data recovery service have set industry standards. \u003C/p\u003E\n\n\u003Cp\u003EEstablished in 1990 Realtime Support Data Recovery Services has provided data recovery services for thousands of consumers. We take real pride in helping you through this traumatic experience. Our data recovery service technicians will do their best to get your data back. If we can\u0026#8217;t get your data we won\u0026#8217;t charge you a penny!\u003C/p\u003E\n\n\u003Cp\u003EIn most cases (over 97% of them), using correct procedures, data can be recovered from inaccessible or defective storage device. A desperate action to remedy a data loss issue can often compound the problem, with a serious possibility of causing irreversible data loss.\u003C/p\u003E\n\n\u003Cp\u003EAll data recovery jobs are treated on an urgent basis. Data recovery in most cases takes less than 24 hours to complete. High Success Rate - We average over a 90% success rate. We restore data where other IT professionals or leading data recovery companies have failed or turned down the job. \u003C/p\u003E\n\n\u003Cp\u003EMember of IPDRA - International Professional Data Recovery Association\u003C/p\u003E\n\n\u003Cp\u003EVisit our site:  http://realtimsupport.com\u003C/p\u003E\n\n\u003Cp\u003ETelephone: (310) 954-2212 or (562) 506-1469\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       141],
      "assets/images/resized/0008/6481/86481v2-max-150x150.jpg"],
     [[250,
       236],
      "assets/images/resized/0008/6481/86481v2-max-250x250.jpg"],
     [[262,
       248],
      "assets/images/resized/0008/6481/86481v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}