{"name": "Rebate Firm",
 "permalink": "rebate-firm",
 "crunchbase_url": "http://www.crunchbase.com/company/rebate-firm",
 "homepage_url": "http://www.rebatefirm.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 5,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "fletch@webmasterchecks.com",
 "phone_number": "1-866-686-6382",
 "description": "Rebates ",
 "created_at": "Thu Mar 15 17:42:01 UTC 2012",
 "updated_at": "Sat Mar 24 00:03:03 UTC 2012",
 "overview": "\u003Cp\u003EAt Rebate Firm, our scalable infrastructure, constant investment in advanced technologies, experience in incentive and rebate program management and people competencies enable us to serve as a single source as your rebate, incentives, rewards, and loyalty program processor.\u003C/p\u003E\n\n\u003Cp\u003EWe have gained significant experience working with rebate, loyalty, reward, incentive programs and market research survey companies and our expertise in database management, data processing, and custom software programming allow Rebate Firm to customize and administer incentive and rebate programs for corporations across the US as well as internationally.\u003C/p\u003E\n\n\u003Cp\u003EOut of the other rebate fulfillment companies in the market, Rebate Firm\u0026#8217;s online promotional fulfillment and loyalty solutions are among the most state-of-the-art and we can custom tailor a solution to fit your specific online rebate processing needs.\u003C/p\u003E\n\n\u003Cp\u003ERebate Firm handles the rebate processing industry\u0026#8217;s most inventive and ambitious rebate and loyalty programs cost-effectively, with uncompromising accuracy, while saving our clients a considerable amount of time and money.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}