{"name": "Receipteze",
 "permalink": "receipteze",
 "crunchbase_url": "http://www.crunchbase.com/company/receipteze",
 "homepage_url": "http://receipteze.com",
 "blog_url": "http://receipteze.com/blog",
 "blog_feed_url": "",
 "twitter_username": "receipteze",
 "category_code": "software",
 "number_of_employees": 2,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "receipts, service, saas, software-as-a-service, receipt, e-receipts, paperless-receipts, digital-receipts, electronic-receipts, product, platform, framework, finance, financial, personal-finance, social, social-media, internet, mobile, retail, software",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Receipts made easy!",
 "created_at": "Thu May 12 04:23:36 UTC 2011",
 "updated_at": "Fri Jun 17 19:44:30 UTC 2011",
 "overview": "\u003Cp\u003EReceipteze makes sending and managing receipts easy.\u003C/p\u003E\n\n\u003Cp\u003EReceipteze is an online service allowing the sending and receiving of receipts, and the management thereof. It allows introducing receipts into an account by way of having a person or business send a receipt, inputting them manually, forwarding receipt emails, or by allowing Receipteze to automatically pick receipts out from an email inbox. In the future lots of more features and functionality will be added making Receipteze more dynamic and more flexible, including a developer interface.\u003C/p\u003E\n\n\u003Cp\u003EIndividuals can send a receipt to another individual for any transaction or payment received. They can also manage and keep track of online receipts, any receipts in an electronic format and brought into an account, and any physical receipts that are introduced. In addition purchases can easily be shared with others online. Basically, Receipteze allows anything one could possibly want to do with receipts.\u003C/p\u003E\n\n\u003Cp\u003EBusinesses can send a receipt acknowledging a monetary transaction, or confirm something like the return of a borrowed item.  They can offer customers the electronic receipt option, manage and keep track of all the receipts they\u0026#8217;ve distributed, handle item returns, cut back on using receipt paper, and cut back on receipt chemicals being exposed to their customers and employees.  Also they can help savvy customers not worry about losing receipts, unclutter customers\u0026#8217; email inboxes and/or homes of receipts, and in the future, get a developer to easily automate it all in a short amount of time with Receipteze\u0026#8217;s interface.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0013/4256/134256v2-max-150x150.png"],
     [[192,
       64],
      "assets/images/resized/0013/4256/134256v2-max-250x250.png"],
     [[192,
       64],
      "assets/images/resized/0013/4256/134256v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0013/4255/134255v2-max-150x150.png"],
      [[250,
        156],
       "assets/images/resized/0013/4255/134255v2-max-250x250.png"],
      [[450,
        281],
       "assets/images/resized/0013/4255/134255v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}