{"name": "Records Base",
 "permalink": "records-base",
 "crunchbase_url": "http://www.crunchbase.com/company/records-base",
 "homepage_url": "http://www.recordsbase.com/",
 "blog_url": "http://www.recordsbase.com/blog",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "public-records, military-records, genealogy-records, death-records, marriage-records, divorce-records, vital-records",
 "alias_list": null,
 "email_address": "webmaster@recordsbase.com",
 "phone_number": "1-888-884-9998",
 "description": "Public Records Search Engine \u0026 Online Ge",
 "created_at": "Wed May 22 10:44:44 UTC 2013",
 "updated_at": "Wed May 22 18:24:48 UTC 2013",
 "overview": "\u003Cp\u003ERecordsbase.com is a public records and genealogy search service available online. The company offers access to public records, court records, publications and archives. Recordsbase.com offers free trial memberships to those interested in the service, but membership is required to access all of the databases available through this service.\u003C/p\u003E\n\n\u003Cp\u003EAbout Recordsbase.com:\nRecordsBase provides a central location to search for all types of public records. Public records are records that are available to the general population, such as marriage licenses, birth and death certificates and obituaries. Although a document may be considered a public record, access to the document may be restricted for a period of time. Access is usually granted to the person on the document, immediate family members or legal representatives of those individuals. \u003C/p\u003E\n\n\u003Cp\u003ERecords Base is a resource for genealogy searches for both professionals and hobbyists interested in tracing their own family trees. Genealogy is the study of a family’s history. Timelines may be reconstructed using information from family members, photos and public records and documents. Results of a genealogy search may be displayed as a chart, such as a family tree. Results may also be placed into photo records or produced as written narratives. Genealogy may be pursued as a professional occupation or a hobby. \u003C/p\u003E\n\n\u003Cp\u003ERecordsbase.com Products and Services:\nRecordsbase.com offers online access to searches and public records of various kinds. An online search is a way for genealogists and those in search of public records for personal reasons to find the documents they need without having to visit a government office or archive in person. Documents can be searched through the Recordsbase.com website. Once documents are found, they can be ordered through the website or by contacting the office holding the original document directly. Many government offices now offer online ordering services as well, so the research process can be completely handled through an Internet connection. \u003C/p\u003E\n\n\u003Cp\u003EBirth Records:\nBirth records are kept for all individuals born in the United States. However, the time frame for such records varies from state to state, depending on when each state began tracking births through official documentation. Official birth certificates feature an official raised seal from the government office that issued the document. Access to these documents is often restricted to the individual and immediate family members. Birth indexes offer similar information, but are more readily available to members of the general public and can often be accessed online.\u003C/p\u003E\n\n\u003Cp\u003EDeath Records:\nLike birth records, death records may encompass both death certificates and death indexes. Official death certificates include comprehensive information about the deceased, including the cause of death. This document can be used for legal purposes, such as executing an estate for the deceased. Death indexes are a matter of public record, and they contain only the basic information about the death, without inclusion of medical records or other sensitive information. \u003C/p\u003E\n\n\u003Cp\u003EMarriage Records:\nInformation included on marriage records varies by state, although most documents include the full name of the bride and groom, the date of the marriage, and the location where the marriage was recorded. Public records containing basic information are a matter of public record available to the general population. Private marriage records usually include similar information, as well as an official state seal. It is the latter record that is usually required for legal business. \u003C/p\u003E\n\n\u003Cp\u003EDivorce Records:\nA divorce record may also be referred to as a divorce decree, and it is issued at the dissolution of a marriage. This document may be filled with sensitive information, such as the names of children involved in the divorce, financial records and property division. Divorce records may be modified in court, at the request of one or both parties, in order to change custody arrangements or alimony payments. \u003C/p\u003E\n\n\u003Cp\u003ECourt and Criminal Records:\nCourt records can be challenging to locate, since they may be stored at the local, state or federal level. Court records are typically issued for divorce, adoption or naturalization, where completion of the event requires authorization from a judge. Criminal records may also be stored through courts, and it may include misdemeanors, felonies, traffic violations and sex offender listings. Some of these documents are restricted to authorized individuals, while others, like sex offender listings, are a matter of public record. \u003C/p\u003E\n\n\u003Cp\u003EMilitary Records:\nMilitary records are often used in researching family trees. These records might include enlistment rosters, war and service records and veterans’ records. Military cemetery records and draft records may also be available. Some military records are held at the branch of the military where the individual served. Others may be found at the National Archives in Washington D.C.  or through the Department of Veterans’ Affairs.\u003C/p\u003E\n\n\u003Cp\u003ECemetery and Obituary Records\nCemetery records are a way to find family members and others who have died when death records are not available. Cemetery records encompass headstone records, burial records and church records, if the cemetery was kept by the church. Obituary records offer additional information about the death of an individual, sometimes listing the cause of death and survivors. Obituary records may be found through the newspaper that originally published the notice. \u003C/p\u003E\n\n\u003Cp\u003EIn addition to providing access to these various records, Recordsbase.com offers information to educate those just beginning a genealogy search. Basic facts are provided about each type of record, including information a researcher can expect to find and the location of the original document. A blog on the website offers additional information about specific topics related to genealogy, with information about the various types of records available and potential resources for genealogy facts and figures. \u003C/p\u003E\n\n\u003Cp\u003ESite Users and Traffic:\nRecordsbase.com is frequented by professional archivists and genealogy hobbyists interested in tracing their family trees. It is also used by those in search of vital records for personal or legal reasons. The website offers more than two billion public records currently, with additional records added periodically. Recordsbase.com has seen millions of users since its creation, and it continues to provide updated information and tips about the records search process. The search service offers access to a wide variety of genealogy searches and tools to help users with all types of research projects. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[134,
       130],
      "assets/images/resized/0026/5411/265411v2-max-150x150.png"],
     [[134,
       130],
      "assets/images/resized/0026/5411/265411v2-max-250x250.png"],
     [[134,
       130],
      "assets/images/resized/0026/5411/265411v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        133],
       "assets/images/resized/0026/5410/265410v2-max-150x150.jpg"],
      [[250,
        221],
       "assets/images/resized/0026/5410/265410v2-max-250x250.jpg"],
      [[450,
        399],
       "assets/images/resized/0026/5410/265410v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.prweb.com/releases/2012/10/prweb9979399.htm",
    "title": "New Public Records Research Guides Now Available at RecordsBase.com"},
   {"external_url": "http://www.prleap.com/pr/192397/",
    "title": "New Public Records Collections Launched for RecordsBase.com"},
   {"external_url": "http://www.24-7pressrelease.com/preview_press_release.php?rID=337750",
    "title": "RecordsBase.com New Military Records Collection Boon for Members"}]}