{"name": "Red Monkey Foods",
 "permalink": "red-monkey-foods",
 "crunchbase_url": "http://www.crunchbase.com/company/red-monkey-foods",
 "homepage_url": "http://www.redmonkeyfoods.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "RedMonkeyFoods",
 "category_code": "other",
 "number_of_employees": 100,
 "founded_year": 2002,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "private-label, spices, seasonings, organic, all-natural",
 "alias_list": null,
 "email_address": "marketing@redmonkeyfoods.com",
 "phone_number": "417-466-9109",
 "description": "Feisty with Flavor",
 "created_at": "Fri Feb 15 19:37:29 UTC 2013",
 "updated_at": "Tue Feb 19 21:31:34 UTC 2013",
 "overview": "\u003Cp\u003EAt Red Monkey Foods, we take the quality of our products very seriously. It is a top priority to provide you with the best organic spices and all natural seasonings available. Through our organic spices and all natural seasonings, we aim to help consumers overcome flavor fatigue.\u003C/p\u003E\n\n\u003Cp\u003EFrom a small 900 square foot milk barn in Golden City, MO in 2002 to a 40,000 square foot production and warehouse facility in Mt. Vernon, MO, Red Monkey Foods is growing exponentially.  Retailers and consumers are recognizing the value in eating healthy via  Organic and All Natural products, and the B\u0026amp;M focus was founded on Organic and All Natural principles.\u003C/p\u003E\n\n\u003Cp\u003ERed Monkey Foods started in the mind of a young entrepreneur, Jeff Brinkhoff, as a way to foster healthy, flavorful eating habits.  The challenge was that throughout history, organic and all natural products did not have the flavor punch conventional products did, so the consumer did not even consider these products.  The other issue was, the organic and all natural products were not readily available throughout the mainstream grocery chains.  However, Jeff was diligent in his plan.  He was researching the grocery industry and recognized consumers were moving toward healthy alternatives and away from hormonal, preservative driven products.\u003C/p\u003E\n\n\u003Cp\u003EHis vision included several facets - healthy, the highest quality ingredients, flavorful, and educating the consumer for a fun time in the kitchen (Jeff loves to  cook!).  The first products developed  were healthy, high quality organic herbs and spices.  He took these products to mainstream grocers and they were excited due to the consumer demand.  The next product line developed was the All  Natural Rub line, great on all types of meat, poultry, and vegetables to enhance flavor.  These products fit the healthy, high quality, flavorful standard.  The last product line that was developed was the Organic Grinder line.  This line fits Jeff’s entire  philosophy: healthy, high quality, flavorful, and fun!  The vision was becoming reality.\u003C/p\u003E\n\n\u003Cp\u003EToday, Red Monkey Foods has branched out to provide retailers a private label line of Organic, All Natural herbs, spices, blends, grinders and extracts.  We continue to focus on the founding  principles of healthy, high quality ingredients, and flavor in these lines as well.  It is our intention to maintain these principles throughout our business. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       70],
      "assets/images/resized/0023/6256/236256v2-max-150x150.jpg"],
     [[250,
       116],
      "assets/images/resized/0023/6256/236256v2-max-250x250.jpg"],
     [[300,
       140],
      "assets/images/resized/0023/6256/236256v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "President",
    "person":
     {"first_name": "Jeff",
      "last_name": "Brinkhoff",
      "permalink": "jeff-brinkhoff",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "World Headquarters",
    "address1": "1206 Industrial Park Drive",
    "address2": "",
    "zip_code": "65712",
    "city": "Mount Vernon",
    "state_code": "MO",
    "country_code": "USA",
    "latitude": 37.0986328,
    "longitude": -93.8029409}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}