{"name": "RED Method",
 "permalink": "red-method-2",
 "crunchbase_url": "http://www.crunchbase.com/company/red-method-2",
 "homepage_url": "http://www.redmethod.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "redmethodstudio",
 "category_code": "mobile",
 "number_of_employees": 10,
 "founded_year": 2004,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@redmethod.com",
 "phone_number": "512-697-8714",
 "description": "Mobile enterprise solutions",
 "created_at": "Fri Dec 02 21:35:42 UTC 2011",
 "updated_at": "Thu Dec 15 08:54:32 UTC 2011",
 "overview": "\u003Cp\u003EWhat we do:\nWe create mobile systems that address the needs of an untethered enterprise workforce.\u003C/p\u003E\n\n\u003Cp\u003EWho we are:\nRED Method, Inc. is an Austin-based software development and user interface design agency founded in 2004 by President \u0026amp; CEO Matt Walton.  RED specializes in creating and implementing technology innovations across multiple digital platforms, with an emphasis in enterprise mobility.  \u003C/p\u003E\n\n\u003Cp\u003ERED delivers rapid design, development, and software services for cutting-edge technology projects. The team’s creative and technical backgrounds cover broad experience across multiple industries, and disciplines. Projects and endeavors include, design and development of Enterprise Software solutions, Training Software, Virtual Reality SImulation, Mission Planning, and Rehearsal software, Entertainment and Game Software, Children’s Interactive Software. \u003C/p\u003E\n\n\u003Cp\u003ERED implements a rapid design and multi-iterative approach process, which incorporates feedback throughout the projects, as well as a process that continually re-aligns to flexible project goals. This includes, comprehensive information flow, visual Interaction and functioning paper and digital mock ups enabling early and clear demonstration, review, assessment and critical feedback and usability testing. Each iteration includes review, identifying and a factoring in of key findings executing a new round of rapid design and development. This translates into transparency and demonstrable progress throughout the project development.\u003C/p\u003E\n\n\u003Cp\u003EWith experience creating more than 300 digital experiences, RED continues to provide unique product innovation and related creative services to a broad range of industries including: Government, Automotive, Health Care, Consumer Technologies, IT, Entertainment, Financial Services, Retail and Telecom. RED builds unique ideation processes to help companies create and enhance mobile brand, e-commerce, b2b or consumer applications.\u003C/p\u003E\n\n\u003Cp\u003ERED’s approach is pragmatic, reliable, and proven. With uncompromising focus and quality, we deliver real-world solutions, efficiently, on time, on budget, in a constantly evolving technology world.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       145],
      "assets/images/resized/0016/4947/164947v2-max-150x150.png"],
     [[246,
       239],
      "assets/images/resized/0016/4947/164947v2-max-250x250.png"],
     [[246,
       239],
      "assets/images/resized/0016/4947/164947v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}