{"name": "redBus.in",
 "permalink": "redbus-in",
 "crunchbase_url": "http://www.crunchbase.com/company/redbus-in",
 "homepage_url": "http://www.redbus.in",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "redBus_in",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bus-tickets-online, book-bus-tickets-online, online-bus-tickets, online-bus-booking, online-bus-tickets-mumbai, bus-tickets-online-mumbai, online-bus-tickets-shirdi, bus-tickets-online-hyderabad, bus-tickets-online-pune",
 "alias_list": "",
 "email_address": "support@redbus.in",
 "phone_number": "",
 "description": "Online bus ticket booking portal.",
 "created_at": "Mon Jan 10 12:41:51 UTC 2011",
 "updated_at": "Mon Mar 25 04:38:29 UTC 2013",
 "overview": "\u003Cp\u003ERedBus.in provides an online service to purchase bus tickets in India. \u003C/p\u003E\n\n\u003Cp\u003ELike all innovations, redBus too has a very interesting story. \u003C/p\u003E\n\n\u003Cp\u003EAll the founders used to work in Bangalore at the time (sometime in 2005) - all with top IT MNCs - IBM, Texas Instruments and Honeywell. They were friends from BITS Pilani, one of India\u0026#8217;s finest engineering colleges. \u003C/p\u003E\n\n\u003Cp\u003EDuring Diwali that year, one of them wanted to spend the festival in his home town. Since he didn\u0026#8217;t know his schedule till the end, taking a bus was the only choice.\u003C/p\u003E\n\n\u003Cp\u003EHe ran around town hunting for a ticket, but they were all sold out minutes before he reached the travel agents. Bangalore traffic is notorious and can grip you at the wrong time. That\u0026#8217;s exactly what happened that day. \u003C/p\u003E\n\n\u003Cp\u003EThat\u0026#8217;s when he thought of the possibility of providing consumers the convenience of booking a bus ticket over the internet. The objective was two-fold - to ensure that they don\u0026#8217;t have to leave the confines of their comfort to book a ticket, and to help them get a ticket when they need it the most.\u003C/p\u003E\n\n\u003Cp\u003EThe idea was compelling. And why not? The internet was being voted as a medium people couldn\u0026#8217;t do without. PC and net penetration was increasing not only in urban areas, but also in rural India with innovative concepts like Shakti and e-Choupal. Also, people were getting used to booking tickets for travel using IRCTC and private airline websites. So, why not buses? \u003C/p\u003E\n\n\u003Cp\u003EHowever, the most compelling reason was that no body in India had done this!\u003C/p\u003E\n\n\u003Cp\u003ESo, with these thoughts running through his mind, he bounced initial thoughts off his friends from college. They were excited about the concept too. \u003C/p\u003E\n\n\u003Cp\u003EHowever, they didn\u0026#8217;t want to take the plunge without understanding the feasibility of such an undertaking. They met with various people - bus operators, consumers and venture capitalists - to gauge how well the concept could do.\u003C/p\u003E\n\n\u003Cp\u003EAs expected, they got a favorable response. They started writing the code for the software that would be required to run the operations. Once this was ready, they put together a business plan and presented it to TiE, Bangalore Chapter.\u003C/p\u003E\n\n\u003Cp\u003ETiE - The Indus Entrepreneurs - are mentors, to say the very least. They breathe lives and hope in to young entrepreneurs who have a working concept. The idea didn\u0026#8217;t need much selling to TiE members either. That was the beginning of a seemingly long journey. All the founders quit their well-paying, secure jobs and started redBus.\u003C/p\u003E\n\n\u003Cp\u003ESince those days there have been many ups and downs. It wasn\u0026#8217;t simple to change the mindset of bus operators who are used to dealing with their traditional brick-and-mortar travel agents. It wasn\u0026#8217;t easy to market the concept. It needed time and money. It took a few months for things to fall in place.\u003C/p\u003E\n\n\u003Cp\u003EAll that was needed were a few people who used the website. Once that would happen, the user interface was bound to generate word-of-mouth. That\u0026#8217;s exactly what happened. Those who used it liked it, told others and the dominos started to fall in place.\u003C/p\u003E\n\n\u003Cp\u003ETo cut a long story short, redBus has come a very long way from days of struggle to days of growth. It has the largest number of tie-ups (and growing) with bus operators and a large and satisfied customer base.\u003C/p\u003E\n\n\u003Cp\u003EBeing run by a team of young people, the culture is informal and everyone is ambitious and charged to make it larger than imagined. What started as a team of three grew into a team of 50 within 9 months.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       73],
      "assets/images/resized/0023/7662/237662v1-max-150x150.png"],
     [[153,
       75],
      "assets/images/resized/0023/7662/237662v1-max-250x250.png"],
     [[153,
       75],
      "assets/images/resized/0023/7662/237662v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Chief Product Officer",
    "person":
     {"first_name": "Alok",
      "last_name": "Goel",
      "permalink": "alok-goel",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "bus tickets online Mumbai",
    "address1": "Shop# 4, Krishna Niwas,",
    "address2": "Rokadia Lane, Pai Nagar, Borivelli West,",
    "zip_code": "400092",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null},
   {"description": "Bus tickets Bangalore",
    "address1": "#311, 7th Cross,  ",
    "address2": "Domlur,",
    "zip_code": " 560071",
    "city": "Bangalore",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null},
   {"description": "Bus tickets Chennai",
    "address1": "F-6, Sriji Majestic Commercial Complex ,",
    "address2": "E-Road, Omni Bus Terminus, Koyambedu,",
    "zip_code": "600107",
    "city": "Chennai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}