{"name": "ReddyInternational",
 "permalink": "reddyinternational",
 "crunchbase_url": "http://www.crunchbase.com/company/reddyinternational",
 "homepage_url": "http://www.indiamart.com/reddy-international/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fresh-fruits, dry-fruits, fresh-maize, masala-papads, indian-pickles-and-areca-products-",
 "alias_list": null,
 "email_address": "reddy-international@tradepassport.org",
 "phone_number": "9963422138",
 "description": "We are amongst the prominent firms",
 "created_at": "Thu Apr 04 16:06:33 UTC 2013",
 "updated_at": "Thu Apr 04 16:06:39 UTC 2013",
 "overview": "\u003Cp\u003Esupplying and exporting of Indian Spices, Fresh Vegetables, Fresh Fruits, Dry Fruits, Fresh Maize, Masala Papads, Indian Pickles and Areca Products. All these products are provided as per the client requirements and recommendations. To aid our distribution operations, our company has backed itself with an efficient team and global infrastructural set-up. Furthermore, we incorporate cutting-edge distribution technology, performance centric quality checking techniques as well as progressive ideas, which make our range widely appreciated across the nation and elsewhere. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe are totally focused on maintaining higher quality standard in our range of products and for this, a comprehensive policy has been developed by us. Quality checks are undertaken by professionals who have mastered the technique of attaining to the defaults. We have a set of skilled labourers who contribute to the well being of the overall production keeping in mind the needs of our clients. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are a client-centric organization and hence, attaining their complete satisfaction is our main objective. Catering to the needs of our clients is what we aim at, hence allowing full proof and round the clock dedication. We adhere to all the norms set by our clients, and believe in perfection. Our priority is to give immediate attention to the queries posed by our clientele. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are able to efficiently address the diverse demands and requirements of our valued clients, owing to the long lasting relationship with our vendors. Our vendors cater to all our needs at nominal rates. We have selected our vendors with utmost care after a detailed market study. The vendors we associate with have been in this field for many years together, thereby they carry the tag name of being experienced and special.\u003C/p\u003E\n\n\u003Cp\u003Eur Product Range:\n Indian Spices, Fresh Vegetables, Fresh Fruits, Dry Fruits, Fresh Maize, Masala Papads, Indian Pickles and Areca Products.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8062/248062v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8062/248062v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8062/248062v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}