{"name": "Redroom.com",
 "permalink": "redroom-com",
 "crunchbase_url": "http://www.crunchbase.com/company/redroom-com",
 "homepage_url": "http://redroom.com/",
 "blog_url": "http://redroom.com/blogs",
 "blog_feed_url": "http://redroom.com/member-blog/%251/feed",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 2002,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "editors@redroom.com",
 "phone_number": "",
 "description": "writers society",
 "created_at": "Wed Nov 12 22:23:05 UTC 2008",
 "updated_at": "Mon Aug 16 11:21:24 UTC 2010",
 "overview": "\u003Cp\u003ERed Room builds on a successful, trusted brand: The Red Room Writers Society. For years, writers have joined the Red Room Writers Society to get their writing done in a supportive environment. Most people don\u0026#8217;t need more instruction; they need to write. The Red Room Writers Society is the only writers society or school focused on writing rather than focused on reading and talking.\nFounded in June 2002 by Ivory Madison, the Red Room Writers Society began providing its innovative, signature Writers Studios to procrastinating professional and aspiring writers in the San Francisco Bay Area.\nIt was an immediate success. Founded on just $150, and a lot of volunteer support, it provided numerous scholarships for writers who could not otherwise afford the program, as well as numerous donations to silent auctions and community programs. At the same time, it made writers feel special, giving them an inspiring and luxurious environment in the formal dining room of a 1904 mansion.\nThe Red Room Writers Society was recognized by San Francisco magazine in its Best of the Bay 2005.The company has been profiled in the media as a major feature story in statewide publications such as California Lawyer magazine,and in national book industry magazines such as Pages.The company and its founder are deeply entrenched in the San Francisco literary scene. Madison has served on the board of and been a featured writer at Litquake, the city\u0026#8217;s premiere annual literary festival. The Red Room Writers Society is featured in the citywide Literary Map of San Francisco.\nWhile the Red Room Writers Society began with just four members, it now has served more than four hundred talented writers in San Francisco, and appeared in the acknowledgements of published books, by authors who mention that they never would have finished their manuscripts without the Red Room Writers Society.\nThe \u0026#8220;brick and mortar\u0026#8221; Red Room worked with as many writers as possible through its Writers Studios, workshops, and coaching and editing services, until going on hiatus in August 2008, so that Madison could focus on reaching an even wider community, worldwide. \nThe internet is the perfect vehicle to connect writers, rich or poor, published or unpublished, to the support and resources they need to make their dreams come true, and so Madison founded redroom.com, which launched to the public in January 2008.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[118,
       72],
      "assets/images/resized/0009/7838/97838v1-max-150x150.png"],
     [[118,
       72],
      "assets/images/resized/0009/7838/97838v1-max-250x250.png"],
     [[118,
       72],
      "assets/images/resized/0009/7838/97838v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "PR",
    "is_past": false,
    "provider":
     {"name": "Big Noise PR",
      "permalink": "big-noise-pr",
      "image":
       {"available_sizes":
         [[[150,
            78],
           "assets/images/resized/0002/8401/28401v2-max-150x150.jpg"],
          [[250,
            131],
           "assets/images/resized/0002/8401/28401v2-max-250x250.jpg"],
          [[450,
            236],
           "assets/images/resized/0002/8401/28401v2-max-450x450.jpg"]],
        "attribution": null}}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        103],
       "assets/images/resized/0009/7839/97839v1-max-150x150.jpg"],
      [[250,
        172],
       "assets/images/resized/0009/7839/97839v1-max-250x250.jpg"],
      [[450,
        310],
       "assets/images/resized/0009/7839/97839v1-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}