{"name": "RefrigeratorArtist.com",
 "permalink": "refrigeratorartist-com",
 "crunchbase_url": "http://www.crunchbase.com/company/refrigeratorartist-com",
 "homepage_url": "http://www.refrigeratorartist.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "FridgeArtist",
 "category_code": "web",
 "number_of_employees": 3,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "childrens-artwork, parents, art-sharing",
 "alias_list": null,
 "email_address": "staff@refrigeratorartist.com",
 "phone_number": "202-556-0737",
 "description": "Children's Artwork Sharing Website",
 "created_at": "Tue Nov 24 17:55:29 UTC 2009",
 "updated_at": "Tue Nov 24 22:45:47 UTC 2009",
 "overview": "\u003Cp\u003ERefrigeratorArtist.com provides a place for parents to save and share their children\u0026#8217;s artwork digitally. Parents can order customized products such as prints and t-shirts featuring the art, and enter one piece of their child\u0026#8217;s artwork in a monthly drawing for $400 in U.S. savings bonds. A portion of the profits goes toward art programs and education for children.\u003C/p\u003E\n\n\u003Cp\u003EThe website, launched in October 2009, helps parents preserve and enjoy their children\u0026#8217;s art by storing and sharing it online. Pieces of art that would typically have been displayed on the family\u0026#8217;s fridge and eventually relegated to closets or a box in the attic can now be archived and shared with others for free. The site gives parents the option to share artwork via email or with their entire social network through Facebook integration. Parents can also invite their close friends and relatives to become their \u0026#8220;friends\u0026#8221; on RefrigeratorArtist.com. Whenever they add new art to their child\u0026#8217;s gallery, anyone they have \u0026#8220;friended\u0026#8221; will also be able to see the artwork when they visit the site.\u003C/p\u003E\n\n\u003Cp\u003EThe site\u0026#8217;s mission, in addition to providing a modern web-based archival and sharing option for parents, is to celebrate and increase the role art plays in children\u0026#8217;s lives. A portion of all profits generated through product sales and site advertising will be donated to organizations dedicated to art programs and education for children. The founders feel strongly about the importance of such programs to children\u0026#8217;s development. Art participation has been proven to foster brain development and improve social skills, problem-solving skills, and test scores.\u003C/p\u003E\n\n\u003Cp\u003EParents and relatives have the opportunity to create unique mementos and gifts from their children\u0026#8217;s art on the site as well. Customizable products such as mugs, posters, t-shirts, and magnets enable personalized gift-giving and keepsake creation.\u003C/p\u003E\n\n\u003Cp\u003EAnother feature of the site is a monthly drawing with a prize of $400 in U.S. savings bonds for the winning artist. Each month parents may enter one piece of artwork per artist, and every vote the artwork receives from other site users will be another entry in the drawing, increasing the artist\u0026#8217;s chances of winning the savings bonds.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0006/7461/67461v2-max-150x150.png"],
     [[250,
       44],
      "assets/images/resized/0006/7461/67461v2-max-250x250.png"],
     [[450,
       80],
      "assets/images/resized/0006/7461/67461v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "2250 Cedar Cove Court",
    "address2": "",
    "zip_code": "20191",
    "city": "Reston",
    "state_code": "VA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}