{"name": "Renovation Experts",
 "permalink": "renovation-experts",
 "crunchbase_url": "http://www.crunchbase.com/company/renovation-experts",
 "homepage_url": "http://www.renovationexperts.com/",
 "blog_url": "http://blog.renovationexperts.com/",
 "blog_feed_url": "http://blog.renovationexperts.com/feed/",
 "twitter_username": "renovationexpts",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 1999,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "",
 "phone_number": "(866) 273-8260",
 "description": "",
 "created_at": "Wed Aug 12 23:14:53 UTC 2009",
 "updated_at": "Mon Aug 16 20:15:26 UTC 2010",
 "overview": "\u003Cp\u003ERenovation Experts a premium homeowner service featuring a nationwide network of remodeling contractors in dozens of different home services ready to give you remodeling quotes for whatever home projects a homeowner wants completed. This includes everything from kitchen remodeling quotes to renovation quotes for decks, patios, roofs, landscaping and bathrooms. No job is too small and the the projects range from changing a door lock to building a multi-million dollar home.\u003C/p\u003E\n\n\u003Cp\u003ESince 1999 Renovation Experts.com has helped hundreds of thousands of homeowners first locate pertinent contractors, then get contractor quotes and, finally, hire a remodeling contractor in their respective area. This means that they have chosen their contractor through the service and the respective projects were completed by competent, licensed contractors to satisfaction.\u003C/p\u003E\n\n\u003Cp\u003EWith respect to the contractors Renovation Experts provides them with a more solid alternative to traditional lead generating marketing avenues such as yellow page and print advertising. This they do by allowing them access to a growing number of homeowners who are using the Internet to hire and purchase home improvement goods and services. The old days of chasing down prospects is not only inefficient it wastes both time and precious fuel, two of the scarcest commodities in business. The convenience of having the homeowners\u0026#8217; information emailed to computers, personal digital assistants (PDA\u0026#8217;s) and cell phones streamlines the system for the contractor who can concentrate on the job instead of chasing work.\u003C/p\u003E\n\n\u003Cp\u003EEvery project that is submitted to Renovation Experts is checked over by our competent team of verifiers who call each and every homeowner who has submitted a job. In addition to checking that the homeowner wants to go ahead with the renovation they gain additional information such as the square footage of the project, timeline, alternative contact numbers and emails, financing information, plans and other details which transform a lead into a viable project worthy of contacting. This system provides a steady stream of available work which can be used as the main provider of income for the contractor or to fill in gaps between other jobs.\u003C/p\u003E\n\n\u003Cp\u003EFor the homeowners, Renovation Experts provides a more efficient and streamlined alternative to programs home store installation programs allowing homeowners to received free, competitive remodeling quotes from qualified remodeling contractors. By employing a selective process for affiliating with each contractor Renovation Experts makes it possible to for the homeowner to feel confident that he or she can chose the proper renovation quote from a possible four, free contractor quote forms. This takes the guesswork out of choosing the right contractor for the job.\u003C/p\u003E\n\n\u003Cp\u003EWith hundreds of thousands of satisfied homeowners why would anyone want to try any other way of completing a building or renovating project than through Renovation Experts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[146,
       46],
      "assets/images/resized/0009/7928/97928v1-max-150x150.png"],
     [[146,
       46],
      "assets/images/resized/0009/7928/97928v1-max-250x250.png"],
     [[146,
       46],
      "assets/images/resized/0009/7928/97928v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "73 Tacoma Dr",
    "address2": "Suite 400",
    "zip_code": "B2W 3Y6",
    "city": "Dartmouth",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        102],
       "assets/images/resized/0009/7929/97929v1-max-150x150.png"],
      [[250,
        171],
       "assets/images/resized/0009/7929/97929v1-max-250x250.png"],
      [[450,
        308],
       "assets/images/resized/0009/7929/97929v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}