{"name": "Rentallect",
 "permalink": "rentallect",
 "crunchbase_url": "http://www.crunchbase.com/company/rentallect",
 "homepage_url": "http://www.rentallect.com",
 "blog_url": "http://www.rentallect.com/blog",
 "blog_feed_url": "http://www.rentallect.com/blog/feed",
 "twitter_username": "rentallect",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "vacation, rental, software, web-based, email, marketing, analytics",
 "alias_list": null,
 "email_address": "info@rentallect.com",
 "phone_number": "919-338-1891",
 "description": "Vacation Rental Software",
 "created_at": "Fri Mar 11 04:02:55 UTC 2011",
 "updated_at": "Mon Mar 21 00:54:08 UTC 2011",
 "overview": "\u003Cp\u003ESoftware for vacation rental home owners.\u003C/p\u003E\n\n\u003Cp\u003EWith today\u0026#8217;s myriad of vacation rental listing sites, even the most experienced vacation rental property owner struggles to decide which advertising channels will give their property the best exposure to travelers, and yield the most leads.  We can help determine where the best ROI is.\u003C/p\u003E\n\n\u003Cp\u003EOnce one or more advertising channels have been chosen, the next problem surfaces\u0026#8230; efficiently managing all the details and ongoing communications associated with a stream of incoming inquiries. This process can become tedious and error-prone, resulting in some leads falling through the cracks without proper follow-through.  We can help efficiently manage inquiry process flow.\u003C/p\u003E\n\n\u003Cp\u003EFew owners realize the true potential of the information that can be obtained by examining historical inquiries in aggregate.  Nor do they have easy access to visualizations of this information that could facilitate better decision making.  We provide analytics that provide actionable information for your business decision making process.\u003C/p\u003E\n\n\u003Cp\u003EAttempting to manage inquiries via an email-client inbox strategy is awkward at best. The unfortunate truth however, is that this is how most are attempting to manage their process.  Throw in lack of true business intelligence surrounding guest screening, no way to properly perform follow-up lead-nurturing, and the complexities of rate setting and yield management and an owner\u0026#8217;s doubt and frustration multiplies.\u003C/p\u003E\n\n\u003Cp\u003EWe\u0026#8217;re here to help\u0026#8230; \u003C/p\u003E\n\n\u003Cp\u003ERentallect transforms volumes of inquiry data into customizable work flows and reports that assist vacation rental property owners like you to easily:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Increase the exposure of your property \u0026amp;amp;#8211; via state-of-the-art social networking, inbound marketing, and email marketing platforms\n* Measure your return on investment (ROI) of every advertising channel you use\n* Streamline your management of all incoming inquiries in one central online console \u0026amp;amp;#8211; even if your inquiries originated from multiple different vacation rental listing sites\n* Establish custom rules-based automation to improve responsiveness to your guest\u0026amp;amp;#8217;s questions \u0026amp;amp;#8211; even while you sleep\n* Obtain a greater level of transparency concerning who your potential guests are so you can screen more thoroughly and make more informed decisions \u0026amp;amp;#8211; we greatly expand on information actually provided in the guest\u0026amp;amp;#8217;s inquiry\n* Leverage your historical inquiry data into actionable business decisions \u0026amp;amp;#8211; we expose information you didn\u0026amp;amp;#8217;t even know you had\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EWhy did we create Rentallect?\u003C/p\u003E\n\n\u003Cp\u003EWe are vacation property owners, and renters, who have worked in both the vacation rental and software technology industries for a long time.\u003C/p\u003E\n\n\u003Cp\u003EAs renters, we know firsthand that using the Internet to find a suitable vacation rental can be a difficult, painful and time consuming process.\u003C/p\u003E\n\n\u003Cp\u003EAs owners, we realize that competition is fierce and the problem is getting worse as more people choose to make their own vacation homes available. As online vacation rental marketing and advertising options continue to proliferate, it can be difficult to determine which alternative brings the best return on investment. Once hard-earned inquiries arrive, making sure they are properly processed to conclusion, can be a clumsy process.\u003C/p\u003E\n\n\u003Cp\u003EAs good Silicon Valley alumni, we believe that technology should make life easier, not harder. In 2009, we founded Rentallect and have made it our mission to simplify the Internet vacation rental experience and remove some of the pain. We won\u0026#8217;t bore you with the \u0026#8220;gee whiz\u0026#8221; technical details of how we do this, but we hope you\u0026#8217;ll love the results.\u003C/p\u003E\n\n\u003Cp\u003EWe like hearing from you. Contact us anytime at feedback@rentallect.comThis e-mail address is being protected from spambots. You need JavaScript enabled to view it .\u003C/p\u003E\n\n\u003Cp\u003ERentallect is based in Chapel Hill, NC, in the heart of the Research Triangle.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       81],
      "assets/images/resized/0012/5901/125901v2-max-150x150.png"],
     [[250,
       136],
      "assets/images/resized/0012/5901/125901v2-max-250x250.png"],
     [[450,
       245],
      "assets/images/resized/0012/5901/125901v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder, CEO",
    "person":
     {"first_name": "Curt",
      "last_name": "Tudor",
      "permalink": "curt-tudor",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "20104 Scott",
    "address2": "",
    "zip_code": "27517",
    "city": "Chapel Hill",
    "state_code": "NC",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[148,
        150],
       "assets/images/resized/0012/6919/126919v2-max-150x150.png"],
      [[247,
        250],
       "assets/images/resized/0012/6919/126919v2-max-250x250.png"],
      [[446,
        450],
       "assets/images/resized/0012/6919/126919v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}