{"name": "Reporter India Online news",
 "permalink": "reporter-india-online-news",
 "crunchbase_url": "http://www.crunchbase.com/company/reporter-india-online-news",
 "homepage_url": "http://www.reporterindia.com",
 "blog_url": "",
 "blog_feed_url": "http://www.reporterindia.com/feed/rss",
 "twitter_username": "rreporterindia",
 "category_code": "public_relations",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "news, online-news, online-news-paper, business",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Reporter",
 "created_at": "Wed Jun 27 10:55:59 UTC 2012",
 "updated_at": "Wed Jun 27 16:34:10 UTC 2012",
 "overview": "\u003Cp\u003EAbout Us\nwww.Reporterindia.com is a Not-for-profit organization. Our goal is to bring important society Problems and information to the Concern Deportment, that they can  solve that particular problem . We provide an innovative, secure and anonymous way for sources to leak information \u0026amp; society Problems to our journals (our Website, Associated News Paper \u0026amp; Magazines). One of our most important activities is to publish original source material and send it to concern Deportment. We are a young organization that has grown very quickly, relying on a network of dedicated volunteers around the nation. Since 2012, when the organization was officially launched, www.Reporterindia.com has worked to report on and publish important information. We also develop and adapt technologies to support these activities.\nwww.Reporterindia.com is a web based NEWS PORTAL in English. Set up with an aim to provide news in its purest form to the judicious readers.The news published on the News Portal (www.Reporterindia.com) ranges from the ones which move the Nation to the ones which entertain an entire generation. Based out of the World, the News Portal  cover developments in India and rest of the world through its well established news network \u0026amp; sources. The highly competent editorial staff of www.Reporterindia.com works meticulously to ensure that the information being delivered to the readers is complete in all respects and presents the true picture of the various events and happenings. The sections that the News Portal carries are namely; National, World, Business, Politics, Entertainment, Sports and Science \u0026amp; Technology; are substantial enough to contain all the daily developments in various spheres of the society.\u003C/p\u003E\n\n\u003Cp\u003Ewww.Reporterindia.com  is thus an attempt in building a better India with the indispensable co-operation of the people- our readers.\nREAD THIS\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[123,
       150],
      "assets/images/resized/0019/7637/197637v2-max-150x150.jpg"],
     [[138,
       168],
      "assets/images/resized/0019/7637/197637v2-max-250x250.jpg"],
     [[138,
       168],
      "assets/images/resized/0019/7637/197637v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}