{"name": "Reputation Recovery Management",
 "permalink": "reputation-recovery-management",
 "crunchbase_url": "http://www.crunchbase.com/company/reputation-recovery-management",
 "homepage_url": "http://www.reputationrecoverymanagement.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "SeanIenco",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo, sem, reputation-management, toronto-seo, toronto-reputation-management, toronto-sem",
 "alias_list": null,
 "email_address": "support@reputationrecoverymanagement.com",
 "phone_number": "18007066190",
 "description": "SEO SEM Reputation Management",
 "created_at": "Sun Jul 31 23:23:31 UTC 2011",
 "updated_at": "Mon Aug 29 03:24:09 UTC 2011",
 "overview": "\u003Cp\u003EA good reputation is everything in the world of business. A lot of business owners focus too much on price, turnover and profit in the short term, not realizing that in the background, their reputation is becoming a huge problem. The key to being successful in business on a long term basis is businesses reputation. Focus on ensuring your reputation is something that entices people to use your products and services and does not make them shy away!\u003C/p\u003E\n\n\u003Cp\u003EThis might seem like something that is extremely difficult to achieve and the honest answer is; it really is! The great thing is, we are experts in repairing, maintaining and improving an online presence. More importantly, improving the reputation of your business, which makes consumers consistently want to come back for more.\u003C/p\u003E\n\n\u003Cp\u003EWe do not guess, we work based on our experience. Our company and its employees have years of experience in the field and have consistently produced results for a whole array of different companies. We do not take lucky dips when we boost a business profile, we work based on techniques that have brought in positive results for our clients time and time again!\u003C/p\u003E\n\n\u003Cp\u003EThis might seem like a massive hurdle to overcome, but as online reputation repair experts, we are here to help. We produce monthly reports to ensure you are up to date with our progress. We can tell you exactly how successful the work has been to date!\u003C/p\u003E\n\n\u003Cp\u003EWhat we manage to achieve with all of our clients is a high profile on the web. For businesses that already have negative listings connected to their business, we can help. We focus on producing extremely positive listings and manage to get them ranking higher than the original negative listings. This means that the negative listings will be suppressed and what the consumer will see is completely positive.\u003C/p\u003E\n\n\u003Cp\u003EWe do focus on high profile keywords for large businesses, but we can create a package to suit any business owner. We can work on keywords with a low keyword competition and achieve the same goal. Incorporating strategies that have worked in the past, we will continue to get results in the future!\u003C/p\u003E\n\n\u003Cp\u003EOur work consists of lots of different things. Expect to see extremely positive and high quality blogs, contribution on social networks and even press releases in an effort to get your business back on track!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[138,
       150],
      "assets/images/resized/0015/1296/151296v2-max-150x150.jpg"],
     [[230,
       250],
      "assets/images/resized/0015/1296/151296v2-max-250x250.jpg"],
     [[415,
       450],
      "assets/images/resized/0015/1296/151296v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}