{"name": "RepuChecks.com",
 "permalink": "repuchecks-com",
 "crunchbase_url": "http://www.crunchbase.com/company/repuchecks-com",
 "homepage_url": "http://www.repuchecks.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 45,
 "founded_year": 2013,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "roofing-software, customer-surveys, customer-satisfaction, customer-service",
 "alias_list": null,
 "email_address": "info@repuchecks.com",
 "phone_number": "407-363-9228",
 "description": "Customer Satisfaction Survey Software",
 "created_at": "Mon Feb 25 18:44:51 UTC 2013",
 "updated_at": "Tue Feb 26 08:01:27 UTC 2013",
 "overview": "\u003Cp\u003ERepuChecks can provide valuable insight on performance and customer attitude toward your business.\nOur core belief is that customers become more satisfied when their suggestions are solicited and implemented. One of the most effective ways to accomplish this is through targeted surveys about specific experiences a customer had with a business. Through this relationship building process your customers will understand that you truly do care about their opinions and criticisms. After all an unsatisfied customer will still do business with a company who acknowledges concerns of its customers.\u003C/p\u003E\n\n\u003Cp\u003EThe RepuChecks survey platform will email the survey opportunity several times on selected intervals until the results are returned.\u003C/p\u003E\n\n\u003Cp\u003EAfter a customer files out a survey form we send a customer confirmation email so the customer has an opportunity to review their completed survey response and contact us if they\u0026#8217;d like to make any changes. This exchange also allows RepuChecks Members an opportunity share more information about their company and services with the consumer. Just one way RepuChecks can assist in relationship building with your customers.\u003C/p\u003E\n\n\u003Cp\u003EepuChecks has added the ability for our members to publish client comments that they receivein their\ncustomer surveys directly to their RepuChecks Member Company Profile Pages. customer surveys\nto their RepuChecks Member Company Profile Pages.\u003C/p\u003E\n\n\u003Cp\u003EWe have a click to publish into Facebook and Twitter to help expand your company’s social media presence and\nto help improve the opportunities for your company page to be Liked on Facebook an Followed on Twitter.\u003C/p\u003E\n\n\u003Cp\u003EAll of our Members receive a profile page on our site that will outline your business and display approved client feedback.\nMember profile page addresses look like:\u003C/p\u003E\n\n\u003Cp\u003Ewww.RepuChecks.com/companyname\u003C/p\u003E\n\n\u003Cp\u003EIncorporated into our website we have a live feed for Facebook and Twitter that keeps all current customer survey comments available for new prospects to read.\u003C/p\u003E\n\n\u003Cp\u003EAs prospective client research those company they wish do business with our SEO ranking helps us to be highlighted in most keyword searches. Prospective clients that come to our site read reviews about businesses that service their area and have a good understanding on how our members perform.\u003C/p\u003E\n\n\u003Cp\u003EWe encourage prospective clients to fill out a lead form to have one of our member companies contact them about available product and services. Our members can chose to be a part of the referral service we provide to the public. We offer shared leads which will go out to three member companies or our exclusive lead program.\u003C/p\u003E\n\n\u003Cp\u003EEach member of RepuChecks has a member profile page to show case their company\u0026#8217;s performance stats to potential clients. The membership profile page includes company logo, contact information, company story, company stats, reviews from past clients and a Bing Maps area highlighting were surveyed clients are located. Geographically tracked surveys are a great tool for potential clients to read about our member company’s performance as submitted by their neighbors.\u003C/p\u003E\n\n\u003Cp\u003EAnother added feature is our SEO optimization. When a member company publishes a new customers review it goes on their member profile page and is indexed by all major search engines. This helps increase incoming traffic to our member company’s web site and increases there SEO performance on the web.\u003C/p\u003E\n\n\u003Cp\u003EOur goal is to show case our member companies and channel new and repeat clients to our members.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Joe",
      "last_name": "Radcliff",
      "permalink": "joe-radcliff",
      "image": null}},
   {"is_past": false,
    "title": "COO",
    "person":
     {"first_name": "Jason",
      "last_name": "Archambo",
      "permalink": "jason-archambo",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "World Headquarters",
    "address1": "8100 Chancellor Drive",
    "address2": "",
    "zip_code": "32809",
    "city": "Orlando",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.repuchecks.com/GetATrial.aspx",
    "title": "Get a Free Trial"}]}