{"name": "Responsible City",
 "permalink": "responsible-city",
 "crunchbase_url": "http://www.crunchbase.com/company/responsible-city",
 "homepage_url": "http://www.responsiblecity.com",
 "blog_url": "http://responsiblecity.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "ResponsibleCT",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cause-marketing, social-media, social-responsibility, loyalty",
 "alias_list": null,
 "email_address": "info@responsiblecity.com",
 "phone_number": "",
 "description": "Social Media Cause Marketing",
 "created_at": "Sun Feb 26 08:33:25 UTC 2012",
 "updated_at": "Tue Feb 28 21:27:39 UTC 2012",
 "overview": "\u003Cp\u003EWe believe that sustainable businesses are ones that connect with their community and build relationships with their customers based on their shared values. Based on that we have built a platform that enable businesses to better attract and keep their customers not through discounts and special deals but through their level of commitment to their customers\u0026#8217; community. Instead of giving away heavy discounts and frequent special deals, we enable businesses to channel some of that money towards the whole community by pledging donations and allowing their customers to vote on what non-profits should receive that money in exchange of their support.\u003C/p\u003E\n\n\u003Cp\u003EThe idea is simple, you accumulate points from your local business (by buying products, checking in, answering surveys, etc..) and in return that business would convert those points to donation money to the causes that you choose. Businesses would be able to track the donations and learn about their customers social interests. Businesses can also connect with their customers through surveys and special offers that are tailored around their level of social commitment so when customers get that 15% discount it will be in recognition of their support for a good cause.\u003C/p\u003E\n\n\u003Cp\u003EThe platform can also transform into a true social game the impact of which can be seen and felt in real life and on real communities. Consumers get to finally see and feel what impact they are having on their local community by tracking how many points they have donated to the causes they want to support and by having visibility over what businesses are being socially engaged. We also believe that no good deed should go unnoticed and that is why our users who donate the most number of points will be highlighted on our Top Donors so they get to compete to be the top donor in the city and bring awareness and support to their causes.\u003C/p\u003E\n\n\u003Cp\u003EThere\u0026#8217;s more, non-Profits are businesses with customers (donors) of their own so we enable them to recognize those customers (donors) for their support and to connect with the community at large to gain exposure and garner needed support from community members. If you support a non-profit organization then you can \u0026#8220;Endorse\u0026#8221; it to show your friends what causes you are passionate and you can actually \u0026#8220;Salute\u0026#8221; your favorite non-profit organization to give them moral support and to encourage your friends to follow suit.\u003C/p\u003E\n\n\u003Cp\u003EBusinesses would grow by engaging their customers on social responsibility, consumers would have an easy and fun way to be engaged in and support their local communities, and charities would get the exposure and the funds they need to support their efforts.\u003C/p\u003E\n\n\u003Cp\u003EResponsible City is where you can shop for a good cause and where social responsibility turns into social status. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       106],
      "assets/images/resized/0017/5824/175824v2-max-150x150.jpg"],
     [[250,
       176],
      "assets/images/resized/0017/5824/175824v2-max-250x250.jpg"],
     [[450,
       318],
      "assets/images/resized/0017/5824/175824v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [{"round_code": "angel",
    "source_url": "",
    "source_description": "",
    "raised_amount": null,
    "raised_currency_code": null,
    "funded_year": 2011,
    "funded_month": 11,
    "funded_day": 9,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarter",
    "address1": "245 First Street",
    "address2": "Suite 1800 - 18010911",
    "zip_code": "02142",
    "city": "Cambridge",
    "state_code": "MA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        111],
       "assets/images/resized/0017/5823/175823v2-max-150x150.png"],
      [[250,
        185],
       "assets/images/resized/0017/5823/175823v2-max-250x250.png"],
      [[450,
        334],
       "assets/images/resized/0017/5823/175823v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}