{"name": "Revanth Technologies",
 "permalink": "revanth-technologies-2",
 "crunchbase_url": "http://www.crunchbase.com/company/revanth-technologies-2",
 "homepage_url": "http://www.revanthtechnologies.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 20,
 "founded_year": 1976,
 "founded_month": 9,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-training, online-training-in-india, online-training-from-india, online-training-in-software-courses-",
 "alias_list": null,
 "email_address": "revanth1122@gmail.com",
 "phone_number": "9290971883",
 "description": "Online Training from India",
 "created_at": "Fri Dec 09 13:10:07 UTC 2011",
 "updated_at": "Fri Dec 16 00:00:09 UTC 2011",
 "overview": "\u003Cp\u003ERevanth Technologies provides the best specialized Computer Training \u0026amp; Software training for various Computer IT courses. We are providing online software training based on specific needs of the students especially we give innovative one to one training in all the softwares which are having great opportunities in the present trend. We provides Class room training and as well as online training to contend with today’s competitive software world. Students can grasp the subject from our experienced and certified trainers which helps the students to work in real time environment. Students can choose either normal track or fast track course or weekends classes.\u003C/p\u003E\n\n\u003Cp\u003EOur online courses are designed with the help of real time industry experts with the goal of training what companies expect from their future employees. We can train the students from all over the world. Our trainers will train the students in a very descriptive manner with the help of latest technologies. Any one can learn online computer courses at your own convenience and pace. These Computer courses will lead you step by step through all the tasks you are most likely to perform in these computer software applications.\u003C/p\u003E\n\n\u003Cp\u003ERevanth Technologies offer online training for all the software courses to those who want to achieve a rich level of professional knowledge IT field. Students can attend at their Convenient and flexible timing or schedule is one of the main unique feature in our list. We carve IT students into model of IT professionals by equipping strategic technology modules.\u003C/p\u003E\n\n\u003Cp\u003ERevanth Technologies trainings happens within a live environment, where the instructor and student interact using web conferencing tools like Gotomeeting and Webex which facilitates interactive learning sessions through both desktop sharing \u0026amp; audio sharing.\u003C/p\u003E\n\n\u003Cp\u003EFollowing are the software courses offered in our institute\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cp\u003ESEO\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EPHP\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EJAVA\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EJ2ee\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EInformatica\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ETesting Tools\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EWeb Designing\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EIBM WebSphere\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EOracle Weblogic Server\u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EFor more details about online training programs please visit: http://www.revanthtechnologies.com\u003C/p\u003E\n\n\u003Cp\u003Eor Contact: 9290971883 / 040-64559566.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0016/5883/165883v3-max-150x150.png"],
     [[250,
       40],
      "assets/images/resized/0016/5883/165883v3-max-250x250.png"],
     [[398,
       64],
      "assets/images/resized/0016/5883/165883v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}