{"name": "Revathi Enterprises",
 "permalink": "revathi-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/revathi-enterprises",
 "homepage_url": "http://www.indiamart.com/revathienterprises/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "exhaust-roof-ventilators, air-roof-ventilators, louver-frame-ventilators, powder-coated-air-ventilators",
 "alias_list": null,
 "email_address": "revathienterprises@tradepassport.org",
 "phone_number": "9841909073",
 "description": "Manufacturers and suppliers",
 "created_at": "Fri Apr 05 04:46:57 UTC 2013",
 "updated_at": "Fri Apr 05 04:47:01 UTC 2013",
 "overview": "\u003Cp\u003ERevathi enterprises a sole proprietorship firm was established in the year 2010. We are the fastest growing manufacturer and supplier of Roof Ventilators, Industrial Ventilators and Roofing Sheets. Our products range includes are Exhaust Roof Ventilators, Air Roof Ventilators, Louver Frame Ventilators, Powder Coated Air Ventilators, Ridge Ventilators, Wind Ventilators, Metal Roofing Sheets, Polycarbonate Sheets and more. Our products are quality tested and are made with the premium quality raw material. We have always kept client satisfaction and quality of products as our top priorities. Under the expert guidance of Mr. H.Shankar (Proprietor) we have always been the fastest growing manufacturer and supplier of our product range in the market. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have built a strong infrastructure for our efficient working which spreads over a wide area of land. Our infrastructure is beautifully designed and is equipped with the latest machinery and technologies. Safety measures are kept on a priority in our infrastructure as these are equipped with fire alarms, fire extinguishers and other safety machines which are tested and serviced on a regular basis. \u003C/p\u003E\n\n\u003Cp\u003ETeam \u0026amp; Manpower:\nWe have recruited a highly efficient team of professionals for our working. We recruit these professionals on the basis of their education and experience in our domain. We provide handsome salary for deserving candidates. Our team of professionals works efficiently for the growth of organization to match the targets and goals of the organization. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client centric organization we have always kept client satisfaction as our top priority, we are committed with our clients to provide them the best quality of products in the market on very competitive prices. Our products are assured to bear a longer working life with a high durability. A special attention is paid on packaging and delivery of products to ensure defect free and timely delivery of our products at our clients’ doorstep.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nExhaust Roof Ventilators, Air Roof Ventilators, Louver Frame Ventilators, Powder Coated Air Ventilators, Ridge Ventilators, Wind Ventilators, Metal Roofing Sheets, Polycarbonate Sheets and more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/8212/248212v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/8212/248212v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/8212/248212v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}