{"name": "Rexal Tubes, Mumbai",
 "permalink": "rexal-tubes-mumbai",
 "crunchbase_url": "http://www.crunchbase.com/company/rexal-tubes-mumbai",
 "homepage_url": "http://www.indiamart.com/rexaltubes/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "rexaltubes@tradepassport.org",
 "phone_number": "+(91)-(22)-66518638",
 "description": "manufacturing, supplying and exporting",
 "created_at": "Fri Apr 05 12:01:53 UTC 2013",
 "updated_at": "Fri Apr 05 12:01:57 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1995, we, “Rexal Tubes”, are counted among the prominent business entities engaged in manufacturing, supplying and exporting a comprehensive assortment of Industrial Pipes, Sheets, Bars, Tubes, Flanges, Valves \u0026amp; Fasteners. Our assortment encompasses Carbon Steel Seamless Pipes, Alloy Steel Tubes, Nickel Alloy Butt Weld Fittings, Copper Alloy \u0026amp; Duplex Steel Forged Pipe Fittings, Stainless Steel Round \u0026amp; Square Bar and Stainless Steel Fasteners, to name a few.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nWe are a reputed exporters and suppliers of ferrous and non-ferrous industrial raw material and pipes \u0026amp; fittings. These include butt-weld pipe fittings, steel plates and sheets, steel fasteners, steel flanges, valves, forged pipe fittings, pipes, tubes and round and square bar. Our range is procured from reliable vendors who are renowned for offering quality products.\u003C/p\u003E\n\n\u003Cp\u003EProducts Description:\nStainless steel is essentially a low carbon steel which contains chromium at 10% or more by weight. It is this addition of chromium that gives the steel its unique stainless, corrosion resisting properties. The chromium content of the steel allows the formation of a \u0026#8230; corrosion-resisting chromium oxide film on the steel surface.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality is the main pillar supporting the growth of our organization in the highly competitive market. To maintain this, we manufacture the complete range of products strictly in compliance with the global quality standards by employing superior-grade raw material, which is sourced from the reputed vendors of the market. Further, to assure ourselves as well as the customers of quality-approved range, we conduct stringent tests at our testing laboratory so as to deliver flawless products.\u003C/p\u003E\n\n\u003Cp\u003EApplication Area:\nSince our very inception, we have been offering quality range of ferrous and non-ferrous industrial raw material and pipes \u0026amp; fittings. \nAutomobiles\nFarm equipment\nRailway \u0026amp; Tramway\nDefense\nAerospace\nPiping related industry\nOil exploration\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8617/248617v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8617/248617v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8617/248617v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}