{"name": "Rexal Tubes",
 "permalink": "rexal-tubes",
 "crunchbase_url": "http://www.crunchbase.com/company/rexal-tubes",
 "homepage_url": "http://www.indiamart.com/rexaltubes/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "carbon-steel-seamless-pipes, alloy-steel-tubes, nickel-alloy-butt-weld-fittings, copper-alloy--duplex-steel-forged-pipe-fittings",
 "alias_list": null,
 "email_address": "rexaltubes@tradepassport.org",
 "phone_number": "9820077885",
 "description": "Manufacturing, supplying ,",
 "created_at": "Fri Apr 05 05:01:20 UTC 2013",
 "updated_at": "Fri Apr 05 05:01:24 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1995, we, “Rexal Tubes”, are counted among the prominent business entities engaged in manufacturing, supplying and exporting a comprehensive assortment of Industrial Pipes, Sheets, Bars, Tubes, Flanges, Valves \u0026amp; Fasteners. Our assortment encompasses Carbon Steel Seamless Pipes, Alloy Steel Tubes, Nickel Alloy Butt Weld Fittings, Copper Alloy \u0026amp; Duplex Steel Forged Pipe Fittings, Stainless Steel Round \u0026amp; Square Bar and Stainless Steel Fasteners, to name a few. \u003C/p\u003E\n\n\u003Cp\u003ECertification \u0026amp; Membership:\nCertification Name: International Organization for Standardization\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nWe are a reputed exporters and suppliers of ferrous and non-ferrous industrial raw material and pipes \u0026amp; fittings. These include butt-weld pipe fittings, steel plates and sheets, steel fasteners, steel flanges, valves, forged pipe fittings, pipes, tubes and round and square bar. Our range is procured from reliable vendors who are renowned for offering quality products.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality is the main pillar supporting the growth of our organization in the highly competitive market. To maintain this, we manufacture the complete range of products strictly in compliance with the global quality standards by employing superior-grade raw material, which is sourced from the reputed vendors of the market. Further, to assure ourselves as well as the customers of quality-approved range, we conduct stringent tests at our testing laboratory so as to deliver flawless products.\u003C/p\u003E\n\n\u003Cp\u003EWarehouse and Packaging Facility:\nWe own a spacious warehousing unit that is capable of storing ferrous and non-ferrous industrial raw material and pipes \u0026amp; fittings in an appropriate manner. Our warehouse is designed in such way that keeps the product systematically in different sessions to protect it from water, moisture and other harmful elements. Further, we have inventory personnel who maintain a record of incoming and outgoing material.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8228/248228v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8228/248228v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8228/248228v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}