{"name": "Richmark Holdings",
 "permalink": "richmark-holdings",
 "crunchbase_url": "http://www.crunchbase.com/company/richmark-holdings",
 "homepage_url": "http://www.richmark.co.za",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "richmark-holdings, gavin-varejes, south-africa, investment-funds, richmark",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Investment funds",
 "created_at": "Wed May 01 11:19:25 UTC 2013",
 "updated_at": "Tue May 07 00:03:29 UTC 2013",
 "overview": "\u003Cp\u003EEstablishment and mission:\u003C/p\u003E\n\n\u003Cp\u003EIn 2000, successful businessman and philanthropist, Mr. Gavin Varejes established Richmark Holdings, currently ranked among South Africa’s most prominent investment funds and a strong proponent of creating economic and social change in the region. Mr. Varejes’ fund began as a venture capital firm committed to assisting innovative and promising start-up companies within the telecommunications sector. Among Richmark’s first investments were: Vo-Call Cellular (Pty) Ltd, which provides mobile phones, recharge vouchers, starter plans and data services across Southern Africa; and Cellfind (Pty) Ltd, a communications venture that Richmark has since exited. \u003C/p\u003E\n\n\u003Cp\u003ETransition:\u003C/p\u003E\n\n\u003Cp\u003EIn the years following its establishment, Richmark Holdings transitioned away from private equity and from investing in start-up companies, instead offering support to businesses with at least two years of proven operational success. It is currently through such later-stage investments that Richmark Holdings works to nourish and sustain the South African economy and to better South African society through the promotion of jobs. \u003C/p\u003E\n\n\u003Cp\u003ESince its establishment in 2000, Richmark has also undergone significant transformation in terms of its investment interests; although once focused solely on the telecommunications industry, Richmark Holdings has branched out to include four additional investment areas, which are detailed below. This diversification of investment and involvement in the South African economy enables Richmark Holdings unprecedented access to expansive resources and capabilities across various industries, granting it a significant edge over competing investment companies.  \u003C/p\u003E\n\n\u003Cp\u003ECurrent investments:\u003C/p\u003E\n\n\u003Cp\u003ETelecommunications: \nRichmark Holdings telecommunications investments include: iBurst, One Communications and Vo-Call Cellular. It chooses to support telecommunications companies that are dedicated to providing expansive cellular or Internet-based communications solutions, and is especially focused on making cell phones more accessible in rural South Africa. \u003C/p\u003E\n\n\u003Cp\u003EDigital advertisement and branding: \nRichmark has invested in the following digital advertisement, media and branding companies: SA Point of Purchase (Pty) Ltd, Bright Blue Studios and Bluchip Media.\u003C/p\u003E\n\n\u003Cp\u003EProperty:\nRichmark’s property investment activity is currently restricted to Capital Hill, 6 Benmore, a commercial office space of more than eight thousand square metres, which is located in Johannesburg’s coveted Sandton business district.\u003C/p\u003E\n\n\u003Cp\u003ECommerce:\nRichmark’s has invested in the following companies: iPulse Systems, Knox Titanium Vault Co., LiveLife Loyalty Programs, PCMA, Planet Beach, Specialised Services Group (SSG) and World Wide Advisory Services. These companies offer a variety of extremely diverse services such as security, cleaning, software design and even spa and therapy services. \u003C/p\u003E\n\n\u003Cp\u003ECorporate social responsibility:\nWith a stated mission of helping South Africa’s economy by helping its people, Richmark’s investments have always been guided by a strong social conscience. Richmark is proud to support the following eight charities and projects: Barney’s Army, Bobbi Bear Foundation, J9 Foundation, Joint Aid Management, Kirsty Watts Foundation, Smile Foundation, South African Rugby Legends Association (SARLA) and Wachizungu. Significantly, SARLA, which uses sports as a means of connecting to and assisting low-income individuals and communities, was co-founded by Mr. Varejes, Richmark Holding’s CEO. \u003C/p\u003E\n\n\u003Cp\u003EExited Investments:\nRichmark exited its early investment in Cellfind (Pty) Ltd in 2007.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Gavin",
      "last_name": "Varejes",
      "permalink": "gavin-varejes",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://issuu.com/tnt-multimedia/docs/richmark_individual_feature",
    "title": "Richmark Holdings Business Feature"},
   {"external_url": "http://www.africaoutlookmag.com/content/qa-richmark-holdings",
    "title": "Q\u0026A: Richmark Holdings on Africa Outlook"},
   {"external_url": "http://www.gavinvarejes.com/richmark-holdings.html",
    "title": "Gavin Varejes wiki page"}]}