{"name": "RiddhiSiddhi Creations",
 "permalink": "riddhisiddhi-creations",
 "crunchbase_url": "http://www.crunchbase.com/company/riddhisiddhi-creations",
 "homepage_url": "http://www.indiamart.com/riddhisiddhicreations/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "full-dull-x-cotton, cotton-x-cotton, full-dull-x-pc, plain-shirting, filafil, piece-dyed, yarn-dyed-stripes-and-checks-",
 "alias_list": null,
 "email_address": "riddhisiddhicreations@tradepassport.org",
 "phone_number": "9821765551",
 "description": "Manufacturing and supplying Cotton ,",
 "created_at": "Thu Apr 04 11:57:17 UTC 2013",
 "updated_at": "Thu Apr 04 11:57:20 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in year 2006, “Riddhi Siddhi Creations” (RSC), is amongst prominent organizations engaged in manufacturing and supplying Shirting Fabrics. The range of fabric offered comprises of Full Dull X Cotton, Cotton X Cotton, Full Dull X PC, Plain Shirting, Filafil, Piece Dyed, Yarn Dyed Stripes and Checks. Made in accordance with international standards by using optimum quality yarns. These fabrics are available in various specifications to meet the exact needs of the patrons. Offered fabrics are highly appreciated and demanded owing to their features like shrink resistance, soft texture, high tear resistance, colour-fastness and skin-friendliness.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a team of experienced and diligent team of professionals in all our business related activities. All our professionals are masters of their respective area of work, which helps in developing superior quality and economical product line. Our professionals work in sync among themselves, in order to attain the assigned tasks in an effective manner. Moreover, we regularly organize various workshops and seminars to hone the skills of our professionals.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWith firm commitment to quality, we ensure to manufacture all our products in accordance with industry laid norms and standards. In addition to this, our professionals employ advanced machines and utilize optimum quality material to manufacture the range of products offered by us. Also, a team of experts keeps vigil on every stage of production, so as to manufacture high quality products and eliminate defects, if any. \u003C/p\u003E\n\n\u003Cp\u003Elient Satisfaction:\nWe understand the value of satisfied customers and so for the reason ensure to offer them premium quality products at market leading prices. The products offered by us are manufactured in compliance with international standards and delivered to the customers destination within the promised time period.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n The range of fabric offered comprises of Full Dull X Cotton, Cotton X Cotton, Full Dull X PC, Plain Shirting, Filafil, Piece Dyed, Yarn Dyed Stripes and Checks.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7877/247877v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7877/247877v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7877/247877v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}