{"name": "RiskIQ",
 "permalink": "riskiq",
 "crunchbase_url": "http://www.crunchbase.com/company/riskiq",
 "homepage_url": "http://www.riskiq.com/",
 "blog_url": "http://riskiq.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "security",
 "number_of_employees": 9,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "security, blog-search, reputation",
 "alias_list": null,
 "email_address": "sales@riskiq.net",
 "phone_number": "(888) 415-4447",
 "description": "Identify Online Security Risks",
 "created_at": "Thu Apr 21 17:45:43 UTC 2011",
 "updated_at": "Wed Feb 20 06:54:24 UTC 2013",
 "overview": "\u003Cp\u003ERiskIQ provides visibility to organizational risk discovered and monitored outside the internal Information Systems.  This unique technology analyzes information from the Web across the blogosphere, news publications, social network sites and targeted, high-visibility web pages\u0026#8211; to build a comprehensive view of the changing web landscape and the risks it poses to your organization.   Some clients have also chosen to have RiskIQ analysis correlated with internal risk data to refine awareness of specific risk   \u003C/p\u003E\n\n\u003Cp\u003EDiscovery and monitoring of Mobile risk has been a hot topic where RiskIQ is providing \u0026#8220;best in class\u0026#8221; enterprise intelligence to identify mobile based risk of malware from mobile apps and the web.  \u003C/p\u003E\n\n\u003Cp\u003EThreat Landscape\u003C/p\u003E\n\n\u003Cp\u003EEvery organization’s risk profile is constantly changing —new threats emerge, existing threats become more or less prevalent, changes in organizational assets and focus emphasize certain risks instead of others. Keeping track of this dynamic landscape is increasingly difficult, as the sheer quantity of information available increases essentially without bound.\u003C/p\u003E\n\n\u003Cp\u003EMalware Prevention\u003C/p\u003E\n\n\u003Cp\u003EOn any given day, up to 30% of the zero-day malware distribution URLs that RiskIQ™ discovers are unknown to traditional URL-monitoring technology (such as Google Safe Browsing, Dasient, Armorize, Adometry, and The Media Trust). Without blocking these URLs, your company and customers risk immediate infection from zero-day malware.\u003C/p\u003E\n\n\u003Cp\u003EBrand \u0026amp; Trademark\u003C/p\u003E\n\n\u003Cp\u003EThreats to brand integrity, and methods of trademark abuse, are evolving as the web matures. User-generated content and search engine marketing present important, dynamic new vehicles for brand misuse and abuse. RiskIQ\u0026#8217;s logo, content, and clickstream detection technologies offer clients and end to end solution, from discovery to take downs.\u003C/p\u003E\n\n\u003Cp\u003EApp Store Monitoring\u003C/p\u003E\n\n\u003Cp\u003ERiskIQ downloads and runs every app that hits 30+ stores in real time. We test applications for malicious behavior, detect if your branded terms or logos are used and click on mobile advertisements to ensure network content is not modifying the function of the App. By constantly running every app, we uncover emerging threats and detect mobile scams before they have time to be installed, grow and do damage.\u003C/p\u003E\n\n\u003Cp\u003ESite Scanning\u003C/p\u003E\n\n\u003Cp\u003ERiskIQ site scanning discovers all URLS that your company owns. Once discovered, these URLS are scanned on a minute-to-minute basis. Our unique, patent-pending technology uncovers zero-day malware hosts first by focusing on distribution tactics and transmission methodology rather than payloads. Similarly, our policy analyzers monitor user-generated content as it is published; this approach ensures that we find, assess, and neutralize business-sensitive security leaks before they are republished across the web. \u003C/p\u003E\n\n\u003Cp\u003EAffiliate Fraud\u003C/p\u003E\n\n\u003Cp\u003ERiskIQ specializes in the proactive discovery of affiliate strategies used to commit fraud and falsify earnings. Our patent-pending technology finds real-world affiliate link strategies on the web-at-large, and documents each occurrence. This provides affiliate managers with a unique understanding of how and where affiliates actually generate traffic, and helps them quickly identify those committing affiliate fraud.\u003C/p\u003E\n\n\u003Cp\u003ETraffic Quality\u003C/p\u003E\n\n\u003Cp\u003EYour traffic partners purposely mask referrers or provide you with the same obfuscated referrers they received from their source. RiskIQ unravels the mess, allowing you to discover the true source of your paid traffic, beyond the referrer. In addition, our policy analyzers flag malicious incidents like click fraud, forced impressions, hidden frames, and other \u0026#8220;low quality\u0026#8221; events. \u003C/p\u003E\n\n\u003Cp\u003EContact Us\u003C/p\u003E\n\n\u003Cp\u003ERiskIQ offers a hosted, software-as-a-service (SAAS) product delivering risk intelligence and automated enforcement. We offer turnkey solutions as well as customized programs. Schedule a demo with us to see how our crawler, detection logic, and solutions are configurable to meet your business objectives.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0013/1531/131531v2-max-150x150.png"],
     [[250,
       66],
      "assets/images/resized/0013/1531/131531v2-max-250x250.png"],
     [[250,
       66],
      "assets/images/resized/0013/1531/131531v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder, Security Strategy",
    "person":
     {"first_name": "Elias",
      "last_name": "Manousos",
      "permalink": "elias-manousos",
      "image": null}},
   {"is_past": false,
    "title": "Founder, Technology Strategy",
    "person":
     {"first_name": "Chris",
      "last_name": "Kiernan",
      "permalink": "chris-kiernan",
      "image": null}},
   {"is_past": true,
    "title": "Founder, Marketing Strategy",
    "person":
     {"first_name": "Brad",
      "last_name": "Byrd",
      "permalink": "brad-byrd",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "123 10th St",
    "address2": "",
    "zip_code": "94103",
    "city": "San Francisco",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}