{"name": "Riverside Appraisal Company",
 "permalink": "riverside-appraisal-company",
 "crunchbase_url": "http://www.crunchbase.com/company/riverside-appraisal-company",
 "homepage_url": "http://riverside-appraisal.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "KimDenton",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 1992,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "appraiser-appraisal, realestateappraisal, realestateappraiser",
 "alias_list": null,
 "email_address": "kimriversideappraisal@gmail.com",
 "phone_number": "714-441-8443",
 "description": "We are an established Appraisal company ",
 "created_at": "Mon Dec 27 18:22:39 UTC 2010",
 "updated_at": "Thu Dec 30 17:58:52 UTC 2010",
 "overview": "\u003Cp\u003EOur specialty is in the area of the following type of Appraisals: Estate, Probate, Date of Death, Loss Mitigation, Divorce, Bankruptcy, Property Tax Appeals, Insurance Disputes, IRS Disputes, Retrospective Valuations, Proof of Net Worth, Bail Bonds Appraisals, and many others. Our company was established in 1992 and have been responsible for providing outstanding Appraisal Services ever since. \u003C/p\u003E\n\n\u003Cp\u003EOf course, we also do Appraisals for Mortgage Loans for Home Purchases, Refinances, or Home Equity Lines of Credit.  Our Pre-Listing Appraisals (For the Home Sellers) and our Purchase Evaluation Appraisals (For Buyers) have also become extremely popular due to the REO Sales, Short Sales, and Standard Sales huge price differences.  These Appraisals have been saving our customers thousands of dollars.\u003C/p\u003E\n\n\u003Cp\u003EWe are a Southern California Real Estate Appraisal Firm serving ALL of Southern California which includes:  Los Angeles County, Orange County, Riverside County, San Diego County, and San Bernardino County.  We are Licensed and Certified to do ALL types of Real Estate Appraisals including Residential Real Estate and Commercial Real Estate for any amount (value) that it is worth.  \u003C/p\u003E\n\n\u003Cp\u003EThis is important because there are many restrictions on Appraisers Licenses and what type of property they can and can\u0026#8217;t appraise, and with a cap on the value they are allowed to do an Appraisal for.  So, make sure when you hire a Real Estate Appraiser, they have the proper licensing to do the type of appraisal that you need.  To be safe hire a Certified General Appraiser.\u003C/p\u003E\n\n\u003Cp\u003EA Certified General Appraisal License is the highest Real Estate Appraisal License one can obtain.  With this License an Appraiser can value any type of property, for any amount that it is worth.  Some of the other Appraisal Licenses may need a Certified General Appraiser to sign off on their appraisal in order for the Appraisal to be valid.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       84],
      "assets/images/resized/0011/5533/115533v2-max-150x150.jpg"],
     [[250,
       140],
      "assets/images/resized/0011/5533/115533v2-max-250x250.jpg"],
     [[450,
       253],
      "assets/images/resized/0011/5533/115533v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}