{"name": "RJS Leather Kraft",
 "permalink": "rjs-leather-kraft",
 "crunchbase_url": "http://www.crunchbase.com/company/rjs-leather-kraft",
 "homepage_url": "http://www.indiamart.com/rjsleatherkraft/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "belts, card-case, passport-holder",
 "alias_list": null,
 "email_address": "rjsleatherkraft@tradepassport.org",
 "phone_number": "9810122507",
 "description": "Manufacturer and Supplier of a wide asso",
 "created_at": "Sat Apr 06 04:13:29 UTC 2013",
 "updated_at": "Mon Apr 08 00:09:03 UTC 2013",
 "overview": "\u003Cp\u003EFounded in the year 2010, at Delhi (India) we, “RJS Leather Kraft”, are the leading names engaged in manufacturing and supplying of a comprehensive assortment of Ladies Wallets, Ladies Purse, Ladies Bags, Wallets, Bags, Belts, Card Case, Passport Holder, Key Ring, Bar Sets, Wine Case and Mobile Covers, etc. Entire range is precisely manufactured using optimum quality raw material and sophisticated technology; these are designed with great accuracy in order to meet the set international quality norms.\u003C/p\u003E\n\n\u003Cp\u003EOur offered products:\nLadies Purse\nLadies Bags\nGents Wallets\nTravel Bags\nGents Belts\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nIt is quality product range and precise, effective services, which make us a reputed Organization. We procure our products from a trusted vendor base, who use only quality raw material to manufacture the products. These manufacturers adopt modernised machinery and technology to fabricate their products, which account for the dimensional accuracy and superior service.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince the established by our firm, we believe in building mutual relationship with our valuable clients. Our good dealing system and transparent policies are highly appreciated by our esteemed clients. Further, we have a specialized professional team who sincerely works in the field of maintaining good relationship with clients and also look after to provide client’s assignment within stipulated time frame.\u003C/p\u003E\n\n\u003Cp\u003EResearch And Development:\nOur company is also outfitted with advanced research and development unit that help us to conduct in-depth research and development activities related with our quality products. With the help of our Research And Development unit that is equipped with all the latest machines, tools and equipment, we are able to undertake all the research related work of our range.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/9008/249008v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/9008/249008v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/9008/249008v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}