{"name": "RKEOT Cranes",
 "permalink": "rkeot-cranes",
 "crunchbase_url": "http://www.crunchbase.com/company/rkeot-cranes",
 "homepage_url": "http://www.rkeotcranes.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmaster@rkeotcranes.com",
 "phone_number": "8549998153",
 "description": "Manufacturer and Supplier",
 "created_at": "Thu May 02 10:54:06 UTC 2013",
 "updated_at": "Mon May 06 05:36:04 UTC 2013",
 "overview": "\u003Cp\u003ERK EOT Cranes was incorporated in 2010 as a Sole Proprietorship firm. The company is engaged in manufacturing and supplying a comprehensive range of Double Girder Cranes.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nDouble Girder Cranes, EOT Cranes, Goliath Cranes, JIB Cranes, Monorail Hoists, Electric Hoists, HOT Cranes, Crane Spares and many more.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have built a quality centric infrastructure, which is equipped with modern machinery and is maintained on a regular basis. All the activities of our company is segregated into various departments to execute all the business activities in a streamlined manner, we have segmented our premises in different segments. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have ensured that only those professionals are hired who have high end experience in this industrial domain. The knowledge that our employees have on the technical specifications, knows how the complete production operation is guided as per global standard norms. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe set a goal of achieving high levels of success in delivering high levels of quality. The aim of the company is to understand the needs of our clients and design products that meet the various expectations of the clients. To ascertain optimum quality standards of our products range, we have recruited a highly qualified and experienced team of quality controllers.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are a one stop destination to procure these products at industry leading rates which is widely appreciated. The company offers easy payment modes which is widely appreciated by our clients located around the globe. These products are also made available as per the customized specifications of our clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0025/7499/257499v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0025/7499/257499v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0025/7499/257499v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}