{"name": "RM e-Services",
 "permalink": "rm-e-services",
 "crunchbase_url": "http://www.crunchbase.com/company/rm-e-services",
 "homepage_url": "http://goweb99.com/",
 "blog_url": "http://goweb99.com/blog",
 "blog_feed_url": "http://www.goweb99.com/blog/feed/",
 "twitter_username": "goweb99",
 "category_code": "ecommerce",
 "number_of_employees": 40,
 "founded_year": 2009,
 "founded_month": 5,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "website, design, development, maintenance, hosting, redesigning",
 "alias_list": null,
 "email_address": "info@goweb99.com",
 "phone_number": "2103880099",
 "description": "Website Designing Development \u0026 Hosting ",
 "created_at": "Sun Nov 01 22:00:10 UTC 2009",
 "updated_at": "Mon Nov 02 04:30:34 UTC 2009",
 "overview": "\u003Cp\u003EGoWeb99.com designs the website at your own convenience with special add-ons and extra mile to your clients. We design professionally for small business and corporates with more than a user friendly environment. \u003C/p\u003E\n\n\u003Cp\u003EGoWeb99 appeals and functions with an affordable web page design. When you are thinking of an innovative design, get the best from GoWeb99. Be ready to collaborate with a company that gives solutions for the internet strategy and website development. Customer Satisfaction plans and runs the business strategy. Get more customers with the Best Solution we provide. \u003C/p\u003E\n\n\u003Cp\u003EMany existing website owners email/call us up and ask us to redesign OR make minor updates to their website. They tell us that their current web company is charging as much as $150 for a minor change and has not been responsive to their requests. They tell us they have important and critical change that need to be made. In short, the website owner is being held hostage by their web design company. The solution is www.GoWeb99.com. With our flexible timings you can simply write/call us anytime and we will do our best efforts to do the required changes almost immediately at the lowest cost possible. \u003C/p\u003E\n\n\u003Cp\u003ESo, whether your website is new or old, whether we developed it, or someone else, whether we\u0026#8217;re hosting it, or it is being hosted by another company, GoWeb99 will give you the peace of mind, and if you want to make the changes yourself we can develop a Self Content Management for your website, you can update your website yourself. Moreover, if your website is hosted on our dedicated servers located in US, we provide these minor changes support at no cost or very low cost. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       122],
      "assets/images/resized/0006/4414/64414v2-max-150x150.jpg"],
     [[250,
       204],
      "assets/images/resized/0006/4414/64414v2-max-250x250.jpg"],
     [[330,
       270],
      "assets/images/resized/0006/4414/64414v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}