{"name": "RMPacking Store",
 "permalink": "rmpacking-store",
 "crunchbase_url": "http://www.crunchbase.com/company/rmpacking-store",
 "homepage_url": "http://www.indiamart.com/rmpackingstore/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "rmpackingstore@tradepassport.org",
 "phone_number": "9316839967",
 "description": "Manufacturer, Trader and Supplier ,",
 "created_at": "Fri Apr 05 06:48:51 UTC 2013",
 "updated_at": "Fri Apr 05 06:48:54 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 1986, at Ludhiana (Punjab, India), We, “R. M. Packing Store”, are known as the affluent manufacturer, trader and supplier of a large assortment of Wooden Boxes, Wooden Plywood Pallets, Wholesale Firewood and Wooden Packing Patti. The offered range includes Heavy Wooden Boxes, Nautical Wooden Boxes, Plain Wooden Boxes, Rectangular Wooden Boxes, Wooden Packing Boxes, Two Way Wooden Pallets, Wooden Plywoods, Firewood Logs, Wooden Bellies, Wooden Packing Patti, etc. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are highly blessed to have a team of experts, highly experienced and knowledgeable about the industry. Their close coordination helps us to set our goals and achieve it. As we are customer friendly organization, our team of professionals, works closely with our customer to provide them maximum satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructural Facilities:\nWe have an extremely solid and highly sophisticated infrastructure and as a result of that we are fully equipped with advanced technology, latest machinery, modern tools and latest designing methodologies. Also, we provide different training and workshops to our workforce, to avoid wastage and increased production at the same time. \u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nWe are a customer centric organization and are committed towards offering unmatched range of packaging material with credible services. Leveraging on our rich industrial experience, we have been successful in achieving the reliance of our esteemed clients all across the globe. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are working extremely hard to provide our customer the maximum level of satisfaction by offering supreme quality products. Client contentment is the most important factor for us. Keeping this in mind, we are immensely thankful to our highly experienced team of professionals, who are responsible to match the level of satisfaction of our valuable customers. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8347/248347v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8347/248347v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8347/248347v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}