{"name": "Rockwell Medical",
 "permalink": "rockwell-medical",
 "crunchbase_url": "http://www.crunchbase.com/company/rockwell-medical",
 "homepage_url": "http://rockwellmed.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "questions@rockwellmed.com",
 "phone_number": "248 960-9009 ",
 "description": "",
 "created_at": "Tue May 21 05:47:48 UTC 2013",
 "updated_at": "Tue May 21 05:50:05 UTC 2013",
 "overview": "\u003Cp\u003ERockwell Medical is a fully-integrated biopharmaceutical company targeting end-stage renal disease (ESRD) and chronic kidney disease (CKD) with innovative products and services for the treatment of iron deficiency, secondary hyperparathyroidism and hemodialysis.\u003C/p\u003E\n\n\u003Cp\u003ERockwell\u0026#8217;s lead drug candidate in late-stage clinical development is for the treatment of iron deficiency in dialysis patients and is called Soluble Ferric Pyrophosphate (SFP). SFP delivers iron to the bone marrow of dialysis patients in a non-invasive, physiologic manner via dialysate during their regular dialysis treatment. In completed clinical trials to date, SFP has demonstrated that it can safely deliver sufficient iron to the bone marrow. SFP is nearing completion of its Phase 3 clinical studies (CRUISE-1 and CRUISE-2) and is expected to address an estimated $600M U.S. market.\u003C/p\u003E\n\n\u003Cp\u003ERockwell is preparing to launch its FDA approved generic drug called Calcitriol to treat secondary hyperparathyroidism in dialysis patients. Calcitriol active vitamin D injection is indicated in the management of hypocalcemia in patients undergoing chronic renal dialysis. It has been shown to significantly reduce elevated parathyroid hormone levels. Reduction of PTH has been shown to result in an improvement in renal osteodystrophy. Rockwell intends to launch Calcitriol as soon as it receives FDA manufacturing approval, addressing an estimated $350M U.S. market.\u003C/p\u003E\n\n\u003Cp\u003ERockwell is also an established manufacturer and leader in delivering high-quality hemodialysis concentrates/dialysates to dialysis providers and distributors in the U.S. and abroad. As one of the two major suppliers in the U.S., Rockwell\u0026#8217;s products are used to maintain human life by removing toxins and replacing critical nutrients in the dialysis patient\u0026#8217;s bloodstream. Rockwell has three manufacturing and distribution facilities located in the U.S. and its operating infrastructure is a ready-made sales and distribution channel that is able to provide seamless integration into the commercial market for its drug products, Calcitriol and SFP upon FDA market approval.\u003C/p\u003E\n\n\u003Cp\u003ERockwell\u0026#8217;s exclusive renal drug therapies support disease management initiatives to improve the quality of life and care of dialysis patients and are intended to deliver safe and effective therapy, while decreasing drug administration costs and improving patient convenience. Rockwell Medical is developing a pipeline of drug therapies, including extensions of SFP for indications outside of hemodialysis. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0026/4801/264801v1-max-150x150.png"],
     [[250,
       44],
      "assets/images/resized/0026/4801/264801v1-max-250x250.png"],
     [[282,
       50],
      "assets/images/resized/0026/4801/264801v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder, Chairman, CEO \u0026 President",
    "person":
     {"first_name": "Robert",
      "last_name": "L. Chioini",
      "permalink": "robert-l-chioini",
      "image": null}},
   {"is_past": false,
    "title": "VP \u0026 CFO",
    "person":
     {"first_name": "Thomas",
      "last_name": "E. Klema",
      "permalink": "thomas-e-klema",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "30142 Wixom Road ",
    "address2": "",
    "zip_code": "48393 ",
    "city": "Wixom",
    "state_code": "MI",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo":
  {"valuation_amount": null,
   "valuation_currency_code": "USD",
   "pub_year": 2013,
   "pub_month": 5,
   "pub_day": 20,
   "stock_symbol": "NASDAQ:RMTI"},
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}