{"name": "Roofing Buddy South Florida",
 "permalink": "roofing-buddy-south-florida",
 "crunchbase_url": "http://www.crunchbase.com/company/roofing-buddy-south-florida",
 "homepage_url": "http://www.roofingbuddysf.com",
 "blog_url": "http://www.roofingcontractorsouthflorida.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "roof-repair, roof-replacement, tile-roof, metal-roof, roofing-companies, roofing-contractors, commercial-roof",
 "alias_list": null,
 "email_address": "info@roofingbuddysf.com",
 "phone_number": "888-238-6008",
 "description": "Roofing referral service",
 "created_at": "Sun Sep 30 15:53:19 UTC 2012",
 "updated_at": "Mon Oct 15 18:19:35 UTC 2012",
 "overview": "\u003Cp\u003ERoofing Buddy began when a need was recognized for both homeowners and business owners to connect easily with a professional roofing contractor that was reliable and experienced for their specific needs. We realized, at the time, that roofers were the number one source of complaints filed with the Better Business Bureau. This site is designed to help everyone who needs roofing services of any kind to avoid navigating the stressful and sometimes risky contractor screening process.\u003C/p\u003E\n\n\u003Cp\u003ERoofing Buddy has prequalified all of the best roofing specialists in south Florida by their experience, training, establishment in their community, record of customer satisfaction and meeting all licensing and certification requirements in areas the where they perform their work.\u003C/p\u003E\n\n\u003Cp\u003ETo be connected with a reliable pre-screened professional all you need to do is go to the link that opens the request form. It will ask for your name, address, phone and a brief description of your roofing situation. You need only to say something basic like “missing shingles” or “soggy ceiling tiles.” That will give us enough information as to the best match for your need. All the information you provide will be deleted and never shared so you do not have to worry about future solicitations.\u003C/p\u003E\n\n\u003Cp\u003EAll of our contractors are local members of your community who care about their neighbors and will be there to stand behind there quality work for years to come.\u003C/p\u003E\n\n\u003Cp\u003EWe provide prequalified local professional roofers for Miami, Fort Lauderdale, West Palm Beach, Boca Raton, Naples and the entire surrounding area. Thank you for choosing Roofing Buddy South Florida\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}