{"name": "Room 961",
 "permalink": "room-961",
 "crunchbase_url": "http://www.crunchbase.com/company/room-961",
 "homepage_url": "http://www.room961.com",
 "blog_url": "http://www.linkedin.com/groups/Room-961-Global-Lebanese-Network-5011483/about",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 5,
 "founded_year": 2013,
 "founded_month": 5,
 "founded_day": 14,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "lebanon, networking, jobs",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "The Global Lebanese Network",
 "created_at": "Fri Jun 07 23:27:31 UTC 2013",
 "updated_at": "Mon Jun 10 18:57:11 UTC 2013",
 "overview": "\u003Cp\u003EWHAT IS ROOM 961?\u003C/p\u003E\n\n\u003Cp\u003ERoom 961 ® is a High Caliber Lebanese Networking Group and Private Lebanese Ecosystem that caters to the Global Lebanese Community. It emphasizes the creation of solid personal bonds between group members. Room 961 is overtly exclusive, apolitical, non-sectarian and shows a strong inclination to favor its own and the ecosystem’s interests as a whole.\u003C/p\u003E\n\n\u003Cp\u003EWHY IS ROOM 961 DIFFERENT?\u003C/p\u003E\n\n\u003Cp\u003EBecause Room 961 relies on an astute selection committee that carefully studies the profiles of submitters in order to create a cohesive and coherent group of influential individuals. Research has clearly shown that private ecosystems such as Room 961 are far more effective at fostering positive results than open groups prone to self-promotion (individual/corporate) rather than consistent and sustained member interaction. By carefully curating the content submitted and constantly monitoring any digressions, Room 961 focuses on creating solid personal bonds between its members, bonds that in time generate highly potent results.\u003C/p\u003E\n\n\u003Cp\u003EMORE ABOUT ROOM 961\u003C/p\u003E\n\n\u003Cp\u003EMore sophisticated features will soon be available to Room 961 members through the Room 961 Secure Intranet at www.room961.com. The website is still under construction so please be patient: it will be worth it! We will offer an enhanced high caliber jobs section as well as high caliber… dating and much more: the true Global Lebanese Network. We have great plans for Room 961 and this LinkedIn group is just the beginning. So stay tuned…\u003C/p\u003E\n\n\u003Cp\u003ESPREAD THE WORD\u003C/p\u003E\n\n\u003Cp\u003EThis is your group! You are all part of its mission to be a positive force within the Global Lebanese Community. And together, we can be just that and even more! Hence please go ahead and invite as many Lebanese contacts as you can to join Room 961 by referring them to the following link:\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.linkedin.com/groups/Room-961-Global-Lebanese-Network-5011483/about\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       148],
      "assets/images/resized/0027/2971/272971v2-max-150x150.jpg"],
     [[250,
       247],
      "assets/images/resized/0027/2971/272971v2-max-250x250.jpg"],
     [[363,
       360],
      "assets/images/resized/0027/2971/272971v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}