{"name": "Rose Digital Marketing",
 "permalink": "rose-digital-marketing",
 "crunchbase_url": "http://www.crunchbase.com/company/rose-digital-marketing",
 "homepage_url": "http://www.RoseDigitalMarketing.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "RoseDigital",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": 5,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ppc, seo, digital-marketing, advertising, online-advertising, search-engine-optimisation, adwords, social-media, facebook, twitter, email-marketing, affiliate-marketing, reputation-management",
 "alias_list": null,
 "email_address": "hello@rosedigitalmarketing.com",
 "phone_number": "",
 "description": "Digital Marketing, PPC, SEO",
 "created_at": "Mon Oct 11 12:05:58 UTC 2010",
 "updated_at": "Thu May 17 03:59:53 UTC 2012",
 "overview": "\u003Cp\u003EWelcome to Rose Digital Marketing, a UK based global provider of Search Engine Marketing, Search Engine Optimization, Email Marketing and Social Media Marketing services to small and medium sized businesses.\u003C/p\u003E\n\n\u003Cp\u003ERunning a small business ourselves, we understand the dynamics and challenges of getting the highest possible online profile for any business and making sure of getting the biggest bang possible for every promotional pound, dollar or euro spent.\u003C/p\u003E\n\n\u003Cp\u003EAs such, if you and your business have not yet got to grips with the sometimes confusing, always changing, world of digital marketing or have had some experience of it but been disappointed or puzzled by the results, feel free to contact Rose Digital Marketing for a completely no obligation and entirely confidential exploratory chat.\u003C/p\u003E\n\n\u003Cp\u003ENeither your business nor your customers live in either just the physical world or the digital world but a mixture of both. We at Rose Digital understand that and have over 20 years experience of marketing and business development experience, both online and offline, to draw on to help you get - and retain - more customers.\u003C/p\u003E\n\n\u003Cp\u003EYour company needs a customized, coordinated attack on your market. Simply cobbling together a website and buying some Adwords ads are not going to make a profitable marketing campaign.\u003C/p\u003E\n\n\u003Cp\u003EWe take the time to completely understand your business, your customers, your competitors, what you\u0026#8217;ve done in the past, and what your goals are for the future. We work together to build a strategy and a customized implementation plan to get your message to potential buyers; no matter where they \u0026#8220;live\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003EWe make sure there is total transparency into what we\u0026#8217;re going to do for your company, why we\u0026#8217;re doing it, and exactly what our fees are. We can give you a comprehensive schedule of deliverables and milestones so that we can all stay on schedule.\u003C/p\u003E\n\n\u003Cp\u003EFinally, we hold ourselves accountable with detailed progress and status reports on all the metrics you need to ensure that your return on investment is where it needs to be.\u003C/p\u003E\n\n\u003Cp\u003EOur process is generally broken up into 4 key phases:-\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EResearch and Discovery: We assess the relevant marketing spaces and research your business, your customers, your competition and the most relevant keyword phrases etc.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EPlanning: We put together a comprehensive plan to dominate your market through the applicable marketing channels. We agree on business goals and a targeted marketing budget.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EExecution: We apply the appropriate resources in the right way with the right experience to implement the plan.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EMeasurement and Reporting: We regularly report on our progress and examine the key metrics of our campaigns to ensure that we\u0026#8217;re meeting your goals.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EPlease follow the most relevant links through our site to learn more about what we do, how we do it and, most importantly, how we can develop an online marketing solution for your business and start letting the world know about you today!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0018/9340/189340v2-max-150x150.jpg"],
     [[250,
       50],
      "assets/images/resized/0018/9340/189340v2-max-250x250.jpg"],
     [[450,
       90],
      "assets/images/resized/0018/9340/189340v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Christopher",
      "last_name": "Rose",
      "permalink": "christopher-rose",
      "image": null}},
   {"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Ursula",
      "last_name": "Rose",
      "permalink": "ursula-rose",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        121],
       "assets/images/resized/0010/5305/105305v2-max-150x150.jpg"],
      [[250,
        202],
       "assets/images/resized/0010/5305/105305v2-max-250x250.jpg"],
      [[450,
        365],
       "assets/images/resized/0010/5305/105305v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}