{"name": "routeRANK",
 "permalink": "routerank",
 "crunchbase_url": "http://www.crunchbase.com/company/routerank",
 "homepage_url": "http://www.routerank.com",
 "blog_url": "http://www.routerank.com/blog",
 "blog_feed_url": "",
 "twitter_username": "routerank",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software, travel, transport, multi-modal, rail, road, air, cheap, fast, green, search, find, book, offset, facebook, twitter",
 "alias_list": null,
 "email_address": "info@routerank.com",
 "phone_number": "",
 "description": "Finding your way",
 "created_at": "Wed Oct 14 17:11:04 UTC 2009",
 "updated_at": "Thu Nov 04 22:07:13 UTC 2010",
 "overview": "\u003Cp\u003ErouteRANK provides a software solution for travel planning. Unlike other solutions that consider only one means of transport at a time, routeRANK addresses the entire travel route by integrating rail, road and air connections. In a single search, routeRANK\u0026#8217;s patent-pending technology finds and ranks the best possible travel routes, allowing users to sort them according to their priorities such as price, travel time and CO2 emissions.\u003C/p\u003E\n\n\u003Cp\u003ECustom developed versions of the proprietary software are offered to corporate customers and organizations, for their internal use or use on their own website, in both travel and logistics. For example, the Travel Helper developed for the World Wide Fund for Nature (WWF), the integration with Nokia\u0026#8217;s Green Explorer and the internal version for the Swiss government.\nhttp://www.routerank.com/business/\u003C/p\u003E\n\n\u003Cp\u003EAnother version illustrating the software is also publicly available on routeRANK\u0026#8217;s website. For an example, click here to for the website of search results for the trip from Lausanne to Cambridge:\nhttp://www.routerank.com/en/search/lausanne\u003Cem\u003Eswitzerland/cambridge\u003C/em\u003Eunited+kingdom/\nhttp://www.routerank.com\u003C/p\u003E\n\n\u003Cp\u003EHaving won the Swiss National Venture Leaders and Venture Kick competitions, in September 2008 routeRANK was selected as one of the four finalists in the PICNIC Green Challenge, and in November, it was the laureate of the 2008 KPMG Tomorrow\u0026#8217;s Market Award. It has since been nominated as a Red Herring 100 Europe, for the Green IT Innovation Award and the TechCrunch Europas Awards 2009. More recently, It won bronze in the Best of Swiss Web Awards and was named a TR35 by MIT\u0026#8217;s Technology Review Magazine.\u003C/p\u003E\n\n\u003Cp\u003EThe WWF has approved routeRANK\u0026#8217;s CO2 methodology, and Dr Klaus Toepfer, former Executive Director of the United Nations Environment Programme (UNEP), endorses routeRANK as \u0026#8216;a system [that] will make informed travel choices possible which are not only cost- and time-efficient but also benefit the environment\u0026#8217;.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0006/2706/62706v2-max-150x150.png"],
     [[202,
       36],
      "assets/images/resized/0006/2706/62706v2-max-250x250.png"],
     [[202,
       36],
      "assets/images/resized/0006/2706/62706v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}