{"name": "Royal Composites",
 "permalink": "royal-composites",
 "crunchbase_url": "http://www.crunchbase.com/company/royal-composites",
 "homepage_url": "http://www.indiamart.com/royalseals/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "royalseals@tradepassport.org",
 "phone_number": "9674737342",
 "description": "Manufacturer, Supplier and Exporter",
 "created_at": "Fri Apr 05 05:52:06 UTC 2013",
 "updated_at": "Fri Apr 05 05:52:10 UTC 2013",
 "overview": "\u003Cp\u003ERoyal is a leading group of India pioneer in designing, developing, manufacturing and marketing  Hydraulic \u0026amp; Pneumatic seals with a reliability of performance. With over 120 employees, ROYAL’S headquarters is located in Kolkata, India. Besides its wide range of standardized profiles, ROYAL also manufactures customized sealing solutions as per design requirement and other high-tech machinery parts made of various synthetic polymeric materials like Polyurethane, PTFE, NBR, FPM, Polyamide, Polyester Resin and various other engineering plastics, their blends, alloys and composites.\u003C/p\u003E\n\n\u003Cp\u003EResearch \u0026amp; Development:\nModern business demands innovation, which is key to ensure the demand of products in the market. In order to give clients the best range we have devoted department which does huge amount of market research and makes the use of same in providing vital feedback to manufacturing and allied departments for future line of manufacturing.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur organization is supported with complete state-of-the-art infrastructure and possesses all the requisite amenities essential for quality and bulk manufacturing. Owing to the excellent support, we have been successful in meeting client’s demands within promised time limit. In order to achieve consistency in all our business activities we have segregated our business into different sub divisions as production unit, sales and marketing, quality monitoring, warehousing transportation and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing an ISO 9001:2008 certified company, we take great care in ensuring to provide flawless quality of products to our clients. Our pursuit for quality can be judged from our procurement of raw material from reputed vendors.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur client centric approach has helped us to achieve a stable position in the market. We have been able to consistently provide excellent quality of products, which have proven track record for their performance. Our entire range is also appreciated for their economical price range.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8288/248288v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8288/248288v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8288/248288v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}