{"name": "RSTimber Traders",
 "permalink": "rstimber-traders",
 "crunchbase_url": "http://www.crunchbase.com/company/rstimber-traders",
 "homepage_url": "http://www.indiamart.com/rstimbertraders/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "construction-machinery, scaffolding-product, prop-jack, metal-coupler, scaffolding-material, wooden-ply, construction-channel, slotted-angle-plate-and-steel-construction-plate-",
 "alias_list": null,
 "email_address": "rstimbertraders@tradepassport.org",
 "phone_number": "9810007570",
 "description": "Trader, Supplier and Exporter",
 "created_at": "Fri Apr 05 13:22:56 UTC 2013",
 "updated_at": "Fri Apr 05 13:23:02 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1989, at Delhi (India), we, “RS Timber Traders”, are one of the leading names, engaged in Manufacturing, Trading, Supplying and Exporting comprehensive assortment of Construction Machinery, Scaffolding Product, Prop Jack, Metal Coupler, Scaffolding Material, Wooden Ply, Construction Channel, Slotted Angle Plate and Steel Construction Plate. The products we are offering to our prestigious customers are procured from the certified and trusted vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nThe company has constructed a well furnished infrastructure that is furnished with state of the art machinery. We have all kinds of advanced technological tools to meet the production requirements. With the same, we properly ensure the perfect polishing and finishing of the goods available with us as such as Teak Round logs, Gmelina Wood logs, etc.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWith rich vendor base, we are engaged in exporting and supplying high quality products. Our vendors enable us to carry out hassle-free orders delivery. We are associated with the reputed vendors on the basis of their trust and credibility, as they play a crucial role in the success of our organization. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nSupported by an adroit team of professionals, our organization has been able to establish a remarkable position in the industry. We have a well integrated team of administrators and workers, which is well versed with all the aspect of production and distribution of Logs and woods. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nConstruction Machinery, Scaffolding Product, Prop Jack, Metal Coupler, Scaffolding Material, Wooden Ply, Construction Channel, Slotted Angle Plate and Steel Construction Plate. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/8687/248687v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8687/248687v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/8687/248687v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}