{"name": "RTS Website Design",
 "permalink": "rts-website-design",
 "crunchbase_url": "http://www.crunchbase.com/company/rts-website-design",
 "homepage_url": "http://rtswebsitedesign.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 40,
 "founded_year": 1990,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "engine-optimization, google-seo, internet-advertising, internet-marketing, optimization, search, search-engine, search-engine-marketing, search-engine-optimisation, search-engine-optimization, search-engine-optimization-seo, search-engine-submission, sear",
 "alias_list": null,
 "email_address": "info@rtswebsitedesign.com",
 "phone_number": "(888) 507-5268",
 "description": "Website Design, SEO \u0026 Hosting",
 "created_at": "Sat May 08 21:38:41 UTC 2010",
 "updated_at": "Tue Apr 03 20:35:05 UTC 2012",
 "overview": "\u003Cp\u003ERTS Website Design, Creative Design, SEO \u0026amp; Marketing\u003C/p\u003E\n\n\u003Cp\u003EWe are a leading Web Services firm that supplies professional services in e-commerce Website Design, Graphics Design, Logo Design, Flash Website Design, Website Maintenance, Website Hosting, Internet Marketing, Search Engine Optimization,  Online Store Management, Online Inventory Management, Content Management Systems, Multimedia Services, Database Applications and much more.\u003C/p\u003E\n\n\u003Cp\u003EOur website developers provide dynamic website development using PHP Programming, MySQL Database, Oracle, SQL, JavaScript, Perl, CGI, CSS, HTML and (X)HTML and Cold Fusion, just some of the tools we use to make sure you have a solid online web presence.\u003C/p\u003E\n\n\u003Cp\u003EAffordable Website Services\nOur talented team of dedicated professionals will bring together your vision and ideas into reality with creativity, technology, and marketing. Clients nationwide use our professional web design skills, web maintenance, web hosting and support services because of our extraordinary customer service, and affordable website designs.\u003C/p\u003E\n\n\u003Cp\u003EProfessional Website Design, SEO \u0026amp; Hosting Services\nWe specialize in website design, search engine optimization (SEO), eCommerce and advanced web development. Our creative designers and development team, will provide a comprehensive web solution to your online presence. With regularly scheduled maintenance and backups our hosting solutions will give you the peace of mind knowing your website or internet applications are live and secure.\u003C/p\u003E\n\n\u003Cp\u003ESearch Engine Optimization\nTo draw desired traffic, your website must rank high among major search engines such as Yahoo, Google and MSN. RTS Website Design specializes in Search Engine Optimization (SEO) techniques that boost your rankings by attracting the engines\u0026#8217; information \u0026#8220;crawlers.\u0026#8221; We can also provide you with custom website-performance statistics.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[147,
       150],
      "assets/images/resized/0008/6479/86479v2-max-150x150.jpg"],
     [[208,
       211],
      "assets/images/resized/0008/6479/86479v2-max-250x250.jpg"],
     [[208,
       211],
      "assets/images/resized/0008/6479/86479v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}