{"name": "RTS Data Recovery",
 "permalink": "rts-data-recovery",
 "crunchbase_url": "http://www.crunchbase.com/company/rts-data-recovery",
 "homepage_url": "http://rtsdatarecovery.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 39,
 "founded_year": 1990,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "data-recovery-los-angeles, hard-drive-data-recovery, data-recovery, mac-data-recovery, hard-disk-data-recovery, raid-data-recovery, file-recovery, restore-data, data-loss, data-recovery-services, external-hard-drive-files",
 "alias_list": null,
 "email_address": "info@rtsdatarecovery.com",
 "phone_number": "(877) 247-6777",
 "description": "Data Recovery Services",
 "created_at": "Sat May 08 21:43:31 UTC 2010",
 "updated_at": "Mon May 10 15:55:05 UTC 2010",
 "overview": "\u003Cp\u003ERTS Data Recovery has over 18 years experience of recovering data from hard drives and other types of media. RTS has worked with individuals and small businesses, as well as Fortune 500 companies.\u003C/p\u003E\n\n\u003Cp\u003ENo matter what the cause, if you can\u0026#8217;t access your files, RTS Data Recovery is here to help with our professional hard disk data recovery or RAID data recovery services.\u003C/p\u003E\n\n\u003Cp\u003EWe specialize in data recovery from a variety of media/devices regardless of the data loss scenario, we recover lost or otherwise corrupted data from all types of physical hard disk malfunction whether it\u0026#8217;s clicking, not spinning, dropped, water damage, fire damage, or just doesn\u0026#8217;t detect. We also recover missing data from hard drives that have been formatted, deleted, or simply can no longer be accessed, and quickly recover deleted files and data lost due to virus infections and hackers.\u003C/p\u003E\n\n\u003Cp\u003EWhatever your media; Hard Drive, RAID Server, CD-Rom, Digital Camera \u0026amp; Flash Card, iPod, Jump Drive, Optical Disk, Iomega Zip or Jaz, and all other types of media/formats. If you have deleted files, corrupted media, RTS is the place for all your solutions.\u003C/p\u003E\n\n\u003Cp\u003EAll work is done by our expert data recovery engineers, one of whom will be assigned to work with you personally every step of the way through the data recovery process. Our fast, friendly service, strict confidentiality policies, If We Can\u0026#8217;t Recover Your Data\u0026#8230; You Don\u0026#8217;t Pay! guarantee, and expert data recovery service have set industry standards.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       120],
      "assets/images/resized/0008/6480/86480v2-max-150x150.jpg"],
     [[120,
       120],
      "assets/images/resized/0008/6480/86480v2-max-250x250.jpg"],
     [[120,
       120],
      "assets/images/resized/0008/6480/86480v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}