{"name": "Ruchi Traders",
 "permalink": "ruchi-traders",
 "crunchbase_url": "http://www.crunchbase.com/company/ruchi-traders",
 "homepage_url": "http://www.indiamart.com/ruchitraders/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "vehicle-cover, fumigation-cover, outdoor-tent-and-swimming-pool-cover--the-range-varies-from-70-gsm-to-400-gsm-",
 "alias_list": null,
 "email_address": "ruchitraders@tradepassport.org",
 "phone_number": "9326374757",
 "description": "Ruchi Traders is a Manufacturer ",
 "created_at": "Thu Apr 04 11:21:59 UTC 2013",
 "updated_at": "Thu Apr 04 11:22:03 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2000, we, “Ruchi Traders, Nagpur”, are one of the leading organizations that are engaged in manufacturing, supplying, trading and exporting a wide range of superior-grade of HDPE Laminated Fabric, HDPE Laminated Tarpaulin, Vehicle Cover, Fumigation Cover, Outdoor Tent and Swimming Pool Cover. The range varies from 70 GSM to 400 GSM. We have been catering to diversified sectors like Transportation, Metal Industries, Sugar Industries, Ginning factories, Paper Mills, Dal Mills, FMCG, Construction, Sub- vendors and Wholesalers. We have a huge clientele who are highly satisfied with our timely delivery and quality products. We have channelized ourselves in Maharashtra, Chhatisgarh, Andhra Pradesh \u0026amp; Tamil Nadu.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nDue to the enormous support of our deft professionals, we have been able to bring forth a qualitative range of HDPE Laminated Fabric, HDPE Laminated Tarpaulin, Vehicle Cover, Fumigation Cover, Outdoor Tent and Swimming Pool Cover.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nFirmly backed up by a safe \u0026amp; sound infrastructure facility, we have been able to execute all the business activities smoothly. Our state-of-the-art infrastructure aids us in designing and manufacturing a qualitative range of HDPE Laminated Fabric, HDPE Laminated Tarpaulin, Vehicle Cover, Fumigation Cover, Outdoor Tent and Swimming Pool Cover. Further, we have divided our sprawling infrastructure into various units to ensure the execution of business processes promptly. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nOwing to the superb quality of offered laminated fabrics \u0026amp; covers, our organization have gained a distinguish status in the market. We make use of high grade HDPE granules, to manufacture the offered range of excellent quality HDPE Laminated Fabric, HDPE Laminated Tarpaulin, Vehicle Cover, Fumigation Cover, Outdoor Tent and Swimming Pool Cover. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOurs is a client-centric organization, which puts its dedicated efforts to acquire the utmost satisfaction of respected clients. For the same, we are offering a qualitative range of HDPE Laminated Fabric, HDPE Laminated Tarpaulin, Vehicle Cover, Fumigation Cover, Outdoor Tent and Swimming Pool Cover.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7849/247849v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7849/247849v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7849/247849v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}