{"name": "rudra hosting",
 "permalink": "rudra-hosting",
 "crunchbase_url": "http://www.crunchbase.com/company/rudra-hosting",
 "homepage_url": "http://www.rudrahosting.com",
 "blog_url": "http://rudrawebshosting.blogspot.in/2013/01/best-cheap-web-hosting-plans-for-linux.html#!/2013/01/best-cheap-web-hosting-plans-for-linux.html",
 "blog_feed_url": "http://rudrawebshosting.blogspot.in/",
 "twitter_username": "rudrahosting",
 "category_code": "network_hosting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-hosting-india--cheap-web-hosting, bulk-sms, linux-hosting",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Rudra Hosting a web hosting company.",
 "created_at": "Mon Jan 07 11:38:46 UTC 2013",
 "updated_at": "Thu Jan 10 19:31:26 UTC 2013",
 "overview": "\u003Cp\u003ERudra Hosting has been developed and set up to offer high-quality web hosting with affordable prices and guaranteed uptime to businesses as well as other organizations. With our top-of-the-line servers and quality support, we offer a Cheap Reseller Hosting experience never seen before for these prices. Rudra Hosting provide Bulk SMS Solution for Corporate, Small Business Owners and Individuals at an affordable price with fast delivery. You can send sms alerts, bulk sms India with your own sender id or display name for an unlimited period of time, you are also able to schedule your sms according to your requirement and choose the time and date of delivery of your messages.\nReseller Hosting is very famous among the people in the IT world. If a person wants Cheap Reseller Hosting, then it needs to get a shared server space with other company. There are so many websites and companies are available in the present time who can provide this service but their prices depend upon the service, security and the plan.\nChoosing the right host for Linux hosting can be a time consuming, and a confusing process as there hundreds of companies in this field. However, one has to select the right host as it makes a lot of difference to your prospects. It is important to select a cheap web hosting plan as you don’t want to spend a great deal of money on simply obtaining web space but cheap does not mean that you comprise on quality and features. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.rudrahosting.com/",
    "title": "Linux Hosting"}]}