{"name": "Rush Essay",
 "permalink": "rush-essay",
 "crunchbase_url": "http://www.crunchbase.com/company/rush-essay",
 "homepage_url": "http://www.rushessay.com/",
 "blog_url": "http://rush-essay.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "rushessay",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 1997,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "rushessay, rush-essay, rushessay-review, essay-writing, essay-writing-service",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Essay writing service based in US",
 "created_at": "Fri Aug 26 13:34:07 UTC 2011",
 "updated_at": "Thu Jan 05 05:57:24 UTC 2012",
 "overview": "\u003Cp\u003ELife is a rush.  If you are struggling to find time to hit an essay deadline it can really cause a lot of stress.  Other assignments, classes and trying to hold down a part-time job can make it really hard to dedicate the time needed to complete a well-written essay.  However, help is at hand!  \u003C/p\u003E\n\n\u003Cp\u003EWe understand how busy you are and how important your studies are to you.  We also understand that sometimes, no matter how hard we try, life can stop us doing what we need to do.  That\u0026#8217;s where our essay-writing services come in!  \u003C/p\u003E\n\n\u003Cp\u003EWe are based in the USA and have been established since 1997 offering top quality essay writing services to a huge number of people over the years.  We give you access to the best writers available and 24/7 client support.  \u003C/p\u003E\n\n\u003Cp\u003EThe way it works is really, really simple.  Just tell us the topic of your essay and we will get to work. Our team of writers is made up of professionals from all industries with Masters and PhD degrees and years of experience in writing great quality essays.  We give you a high quality paper and most importantly, you get it before your deadline!  Once we have sourced the most suitable writer and written your paper you will get total peace of mind that you have a first class paper to submit.  \u003C/p\u003E\n\n\u003Cp\u003EWe have invested highly in ensuring we give you the best service and that means developing the most diverse team of writers with the highest level of expert knowledge anywhere online.  We only hire professional writers with years of experience and many are professionals in intellectual fields such as medicine or law.  \u003C/p\u003E\n\n\u003Cp\u003EYou can trust us to understand your needs and deliver a term paper or essay on time, every time!  Ordering has never been easier.  Stop worrying and start enjoying life - let us do the hard work for you!  \u003C/p\u003E\n\n\u003Cp\u003EThere is no shame in ordering a pre-written essay and we have the resources available to ensure you get ahead of your studies and are free of the stress of worrying about a looming deadline.  With our top quality custom written essays you will get the essay you need when you need it and in plenty of time to beat the deadline.  \u003C/p\u003E\n\n\u003Cp\u003EYou won\u0026#8217;t find a better essay writing service anywhere else!  We are constantly updating our team\u0026#8217; expertise to ensure we can easily cover a diverse range of topics brilliantly.  Don\u0026#8217;t stay up all night trying to hit a deadline - the quality of your work and your health will suffer! Let us help you hand in the best paper possible and get a great pass mark.  \u003C/p\u003E\n\n\u003Cp\u003EWhen life gets in the way of meeting important essay deadlines, let rushessay.com help you!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[64,
       64],
      "assets/images/resized/0015/1270/151270v2-max-150x150.jpg"],
     [[64,
       64],
      "assets/images/resized/0015/1270/151270v2-max-250x250.jpg"],
     [[64,
       64],
      "assets/images/resized/0015/1270/151270v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        137],
       "assets/images/resized/0015/1269/151269v2-max-150x150.jpg"],
      [[250,
        229],
       "assets/images/resized/0015/1269/151269v2-max-250x250.jpg"],
      [[450,
        413],
       "assets/images/resized/0015/1269/151269v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}