{"name": "Rutu Constructions",
 "permalink": "rutu-constructions",
 "crunchbase_url": "http://www.crunchbase.com/company/rutu-constructions",
 "homepage_url": "http://www.rutuconstruction.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "interior-solution, saurabh-stuti-bath-room-interior-service-",
 "alias_list": null,
 "email_address": "webmaster@rutuconstruction.com",
 "phone_number": "9737370000",
 "description": "Manufacturer, supplier.",
 "created_at": "Sat Apr 06 03:03:27 UTC 2013",
 "updated_at": "Mon Apr 08 00:06:21 UTC 2013",
 "overview": "\u003Cp\u003EOur organization, Rutu Constructions, incepted in the year, 1992, as a Construction Company and Property Developers. We are also renowned for inspirational interior works that add value to life standard of life and work. Our projects have been critically assessed for their solid structure, outstanding amenities and timely delivery. For our earnestness and high quality parameters, we have been accorded with ISO 9001-2008 certification from the Gujarat Government. Use of most genuine construction materials and advanced technology have been the main reasons of our astounding success.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision:\nProvide quality construction \u0026amp; maximum possible facilities by converting dreams in to reality. Wish to become best construction company in Gujarat state.\u003C/p\u003E\n\n\u003Cp\u003EService Portfolio:\nAs an ISO 9001-2008 certified construction company, we have been offering our clients with our strongly constructed Residential, Engineering and Commercial units. Our team of committed professionals spare no efforts to offer clients living and working spaces that addresses all their requirements . Our services are known for innovativeness, quality construction and timely delivery. The interior services that we undertake stands apart in exclusiveness, variety, functionality and eye for details. Clients approach us for they are assured of quality and exclusivity of designs.\u003C/p\u003E\n\n\u003Cp\u003EDomain Expertise:\nOur outstanding project delivery in the construction domain has brought us recognition and appreciation from clients in private and government organizations. Over a period of two decades in the domain we have consolidated our position as a trustworthy property developed and interior designers on the merit of our total involvement in offering our growing clients base high value Property Development and Interior services projects. Our construction activities comprises residential, commercial and engineering projects. Our interior projects offers a fine blend of practical amenities, eye for detail and aesthetic environment. We believe a beautiful interior is more conducive to living and working.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team provides us with the support that sustains us at every stage of property development and interior designing operations. The sustained and hands on s committed support of our team leverages our efforts at offering our clients with superbly constructed projects right on time. Our team members are handpicked for their industry experience, expertise and ability to come out of a logjam in most effective manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nAll our business operations hinges on quality of highest parameters. Our business philosophy is offer our clients products and services without any loopholes. We source our raw materials from most trusted sources. The cement we use, the woods, steels, sealers and other materials that we use gives the buildings a solid foundation. We have introduced innovative solutions in architectural, construction, and structural planning by applying hi end technology and construction procedures. Amenities offered by us is appreciated for eyes for minutest details.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOver the years we have steadily built our reputation as a most reliable and transparent business operators in the construction and interiors domain. Our high quality parameters have earned for us the ISO 9001-2008 certifications from Government of Gujarat. With every project, we endeavor in scaling up quality and offering amenities to to suit client\u0026#8217;s specifications. The constant feed back that we get from our clients help us to modify and add features to add to their convenience.\u003C/p\u003E\n\n\u003Cp\u003EOur Services:\nInterior solution\nInterior Design Service\nSaurabh Srushti\nSaurabh Stuti\nRunning Project Saurabh Shyamal Appartment-Nadiad\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8979/248979v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8979/248979v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8979/248979v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}