{"name": "S\u0026L Dezigners Inc",
 "permalink": "s-l-dezigners-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/s-l-dezigners-inc",
 "homepage_url": "http://sldezigners.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sldezigners",
 "category_code": "enterprise",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design, logo-design, web-hosting, domain-registration, e-learning, photoblog",
 "alias_list": null,
 "email_address": "sldezigners@gmail.com",
 "phone_number": "919619851465",
 "description": "Low Cost High Efficiency",
 "created_at": "Tue Mar 19 12:43:37 UTC 2013",
 "updated_at": "Tue Mar 19 12:43:44 UTC 2013",
 "overview": "\u003Cp\u003E‘Samanta and Lad Designers’ aka. ‘S\u0026amp;L Dezigners’ is a Mumbai based web development company which is well known for its low cost high efficiency web designs. The company was founded in June 2012 and is co-owned by Mr. Sudeep G. Samanta, its current CEO and Mr. Shailesh B. Lad, the current COO of the company. He duo is a firm believer in providing web solutions to the masses at extremely cheap prices, \nThe company ever since its inception has created various websites which are technically advanced yet simple and elegant in appearance. \nTwo of its best projects are as follows:\nProducts:\u003C/p\u003E\n\n\u003Cp\u003ES2Chem.com\u003C/p\u003E\n\n\u003Cp\u003EAim:\nS2chem.com is India’s 1st Chemistry e-learning portal. It was launched on June 1, 2012. It provides free knowledge of chemistry and related sciences (Mainly Physics) on the web.  s2chem is an open source website which allows a use to easily share their views, reviews and thereby knowledge.\nThe website features a great deal of information about various branches of chemistry (Analytical, Organic and Inorganic Chemistry along with modern and more advanced branches like Neurochemistry, Argochemistry, Environmental Chemistry, Chemical Engineering, etc.,) and their applications. \nApart from the knowledge of chemistry the website also stores a detailed biography of some of the most elite scientists from all around the world. The achievements of a few great experimentalists in the form of their pioneering theories in the world of chemistry can be found on the website. \nThe latest addition to the website is the information about various entrance exams/ scholarships that are conducted/ provided by Indian as well as foreign universities for students aspiring to make a career in chemistry based fields (Eligibility criteria, fee structure and the necessary websites/contacts have been included).\nLast but not the least the portal is of the open source type which means we provide our readers to post their views, reviews, articles, presentations, etc., on our website for free.\nAchievements:\nWithin just 6 months of its inception www.s2chem.com become one of the top 5 lakh websites in the world (with an all-time highest rank of 390000 in January 2013) among the existing 644 million websites. The website also has a dedicated science forum www.psychochemist.s2chem.com which discusses current scientific issues. \ns2chem.com has acclaimed a great deal of appreciation and recognitions of visitors from more than 106 countries including India, United States, Turkey, Philippines, United Kingdom, Algeria, Mexico, Germany, Italy, Brazil, Canada, Malaysia, Iran, Australia and many more…\u003C/p\u003E\n\n\u003Cp\u003ES2chem.com is soon coming up with its half-yearly science magazine which would contain exclusive articles, interviews with scientists and major scientific discoveries of the year.\u003C/p\u003E\n\n\u003Cp\u003EPhotodilse.com\u003C/p\u003E\n\n\u003Cp\u003EAim:\n“Photodilse” refers to a picture straight from the heart…!!!\nPhotodilse is a Mumbai based photography website that provides access to the photoart of numerous world-class free-lancer photographers from all around the globe. Photodilse aims at free, easy and secure sharing of photoart over the web.\nThe images on this website cover diverse genres such as:\nWildlife\nMacro\nNature\nMonochrome\nPeople and Places\nCandid\nSports\nWedding and Tradition\nFashion\nIndian Cities\nLandscape\nKids\nAbstract\nHigh Dynamic Range (HDR)\u003C/p\u003E\n\n\u003Cp\u003EPhotodilse is an interactive website allowing its users to interact direct professional photoartists.\nIt also allows secure buying and selling of printed canvas for cheap prices\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       144],
      "assets/images/resized/0024/3566/243566v2-max-150x150.png"],
     [[219,
       211],
      "assets/images/resized/0024/3566/243566v2-max-250x250.png"],
     [[219,
       211],
      "assets/images/resized/0024/3566/243566v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Sudeep",
      "last_name": "Samanta",
      "permalink": "sudeep-samanta",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}