{"name": "Saanchi Designss",
 "permalink": "saanchi-designss",
 "crunchbase_url": "http://www.crunchbase.com/company/saanchi-designss",
 "homepage_url": "http://www.indiamart.com/saanchidesignss/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 24,
 "founded_year": 2003,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "designer-long-suit, net-suit, anarkali-designer-suit",
 "alias_list": null,
 "email_address": "saanchidesignss@tradepassport.org",
 "phone_number": "9914499499",
 "description": "Supplier of qualitative gamut of Ladies ",
 "created_at": "Thu Apr 04 06:56:43 UTC 2013",
 "updated_at": "Thu Apr 04 06:56:45 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nEstablished in the year 2003, at Ludhiana (Punjab, India), we, “Saanchi Designss”, are well-reckoned as the leading manufacturer, exporter and supplier of a comprehensive gamut of Ladies Suits and Ladies Sarees. Our provided range comprises Designer Long Suit, Net Suit, Anarkali Designer Suit, Designer Sleeveless Suit, Sleeveless Suit, Designer Wedding Suit etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Team\u003C/p\u003E\n\n\u003Cp\u003EOur company is blessed with a team of adroit professionals, which constantly works hard to achieve defined goals in best possible manner. This team work in close coordination with our clients in order to under their exact requirement and fabricate the products exactly as per the specifications laid by them. We have selected these professionals based on their skills and qualification in the respective domain. It is due to the efficient team of our company that enables us in proper execution of our entire business process.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure\u003C/p\u003E\n\n\u003Cp\u003ETo fabricate the finest quality range of our offered Ladies Suits and Ladies Sarees , our company has constructed an ultra modern infrastructure. This infrastructure is outfitted with latest production facilities that aid in developing our products in speedy manner and delivering the ordered consignments within the time frame specified by our clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\u003C/p\u003E\n\n\u003Cp\u003EWe are the remarkable entity engaged in manufacturing, exporting and supplying a qualitative array of Ladies Suits and Ladies Sarees. Owing to our ethical business practices, on time delivery and client centric approach, we have been able to attain the commendable position in the market.\u003C/p\u003E\n\n\u003Cp\u003EOur Clients\nCustomer satisfaction is our foremost aim and we are diligently striving to achieve this without compromising on the products quality. We assure our clients that we will render them the best ever textile solutions at the lowest prices through our distinguished range of garments and fabrics. Our uncompromising attitude towards offering quality range of garments and fabrics and patterns has enabled us to carve a niche for ourselves in the apparel industry.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction\u003C/p\u003E\n\n\u003Cp\u003EAchieving maximum client satisfaction is the foremost aim of our company and in order to achieve this we offer turnkey solutions as well as after sales service facilities to them. Owing to the use of contemporary stitching techniques and high grade fabric in the fabrication process, our offered products are highly cherished among our clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       135],
      "assets/images/resized/0024/7601/247601v2-max-150x150.jpg"],
     [[200,
       180],
      "assets/images/resized/0024/7601/247601v2-max-250x250.jpg"],
     [[200,
       180],
      "assets/images/resized/0024/7601/247601v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}