{"name": "Saarthi Software Technologies  PV.Ltd",
 "permalink": "saarthi-software-technologies-pv-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/saarthi-software-technologies-pv-ltd",
 "homepage_url": "http://www.sarthi.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Sarthi",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-hosting, linux-vps-hosting, windows-vps-hosting, linux-hosting, windows-hosting, webdesign-mumbai, ecommerce-website, erp-hosted-solution, crm-software, website-development, hosting-india, web-hosting-mumbai-web-hosting-india",
 "alias_list": null,
 "email_address": "amrapali.sarthi@gmail.com",
 "phone_number": "22 2232 333",
 "description": "web hosting India",
 "created_at": "Fri Jul 13 05:42:29 UTC 2012",
 "updated_at": "Fri Jul 13 09:20:37 UTC 2012",
 "overview": "\u003Cp\u003EOur Services includes Web Hosting India, Web Hosting, Website Designing, Web Hosting \u0026amp; Domain Registration and Cheap and Affordable Services With Low Cost Seo Packages\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EClick here to view web hosting \u0026amp;amp; domain registration India\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003EDOMAIN NAME REGISTRATION PROGRAM\nFeatures of Domain Registration with Saarthi:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003ERegister a domain name and get complete control over your domain.\nTransfer your domain to any name servers online from our web-based Control Panel.\nFree Domain Parking.\nChange all the domain contacts like registrant, technical, billing and administrative any time.\nFree DNS Management.\nPrivate Domain Registration.\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ESarthi is an affordable end to end web solutions company offering services like web hosting india, domain name registration, web designing and web development in Mumbai, India . We provide 24 x 7 dedicated in-house webhosting support with 99.9% uptime. All the Windows Hosting plans comes with ASP.Net and MSSQL Databases and all the Linux Hosting Plans comes with PHP and MYSQL Databases, Linux and Windows Web Hosting plans includes Scripts like Wordpress, Joomla, Drupal, DotNet Nuke and many more\u0026#8230; \nSarthi offers Web Hosting in all regions of india, Web Hosting in Mumbai and Web Hosting in India.\u003C/p\u003E\n\n\u003Cp\u003ESHARED WEB HOSTING PROGRAM\u003C/p\u003E\n\n\u003Cp\u003EShared Web Hosting Services at Sarthi provides a way to make your website available and accessible 24x7 round the clock. We have multiple plans starting from Basic Web Hosting Plan at cheaper prices to Platinum plan Web Hosting at affordable prices. Our Web hosting plans are designed to match the present online demands of both individuals looking for hosting a blog and small to medium-sized businesses. The plan\u0026#8217;s configuration allows hosting and managing multiple domains in a single account. You can upgrade to any of our Web hosting plans any time you wish as you need more resources to grow online.\u003C/p\u003E\n\n\u003Cp\u003ESEO SERVICES PROGRAM\u003C/p\u003E\n\n\u003Cp\u003EA dedicated Cheap SEO Services and Web Development Company in Mumbai, India offering affordable seo services serving local, national and international clients outside the India, we undertake all range of Search Engine Optimization services, PPC Services, Internet Marketing Services, Link Building, Content writing services and PHP Mysql Web Development. We are very much in developing the seo friendly websites for all type of businesses low cost seo packages.\u003C/p\u003E\n\n\u003Cp\u003EDEDICATED SERVER PROGRAM\u003C/p\u003E\n\n\u003Cp\u003EWe are offering cheapest and best dedicated servers in India. All our servers are built so that you can get power in low budget.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}