{"name": "SaaS Venture Partners, LLC",
 "permalink": "saas-venture-partners-llc",
 "crunchbase_url": "http://www.crunchbase.com/company/saas-venture-partners-llc",
 "homepage_url": "http://www.saasventurepartners.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 6,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "venture-partners, sales-acceleration, sales-consulting, start-up-partner",
 "alias_list": null,
 "email_address": "Strategy@SaaSVenturePartners.com",
 "phone_number": "925.247.5459",
 "description": "Sales Acceleration",
 "created_at": "Tue Sep 11 06:43:18 UTC 2012",
 "updated_at": "Mon Sep 17 23:13:54 UTC 2012",
 "overview": "\u003Cp\u003ESaaS Venture Partners is reshaping how SaaS Marketing Platforms build their monthly recurring revenue and annual bookings.\u003C/p\u003E\n\n\u003Cp\u003ESaaS Platforms redefined the delivery of software to the market by delivering it as a hosted or managed service. This achieved a lower cost of ownership for companies, and enabled them to benefit of larger teams, resources and feedback to drive the best solution possible on a monthly license basis.\u003C/p\u003E\n\n\u003Cp\u003ENew entrants in the marketing vertical are typically changing the paradigm in some way. The evolution of SaaS Marketing Platforms starts from a core team of seasoned sales professionals who can sell though an evangelical pitch, and help marketers understand how they can unleash this new approach on their business.\u003C/p\u003E\n\n\u003Cp\u003EAs a SaaS business, the team you need in place for the first six or twelve months is very different from your VC’s vision. There is a tremendous amount of groundwork and effort that needs to be done before the days of web forms and inbound calls is all that is needed to close premium accounts for enterprise licenses.\u003C/p\u003E\n\n\u003Cp\u003EYou need to get an established, yet diversified client base of recurring revenue. These are a mixture of what the VCs call “Cornerstone” or “Lighthouse” clients, as well as medium clients. \u003C/p\u003E\n\n\u003Cp\u003EWhen this is achieved, then you are prepared to move forward scaling your business. This needs to happen sooner than later. To win the market you need to mobilize an entire team consisting of experienced marketing technology professionals who have a “zero learning curve”, have connections, and can easily work through red tape to get the right deals signed. \u003C/p\u003E\n\n\u003Cp\u003ECEOs and Founders of Marketing Technology Platforms believe in the SaaS model. No need for your customers to buy their own hardware and hire their own DBAs and network engineers, and build out expensive server farms. Instead, license your solution to their challenge.  \u003C/p\u003E\n\n\u003Cp\u003EHere at SaaS Venture Partners, we deliver Sales as a Service. No need to try and staff that large team today, simply pick up the phone and call us. We will flip the switch, understand your business, tailor a sales approach and begin driving revenue before you can get one job description agreed on.  \u003C/p\u003E\n\n\u003Cp\u003ELet’s get to work,\u003C/p\u003E\n\n\u003Cp\u003EThe SaaSVP Team\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       86],
      "assets/images/resized/0021/0815/210815v2-max-150x150.jpg"],
     [[250,
       144],
      "assets/images/resized/0021/0815/210815v2-max-250x250.jpg"],
     [[450,
       260],
      "assets/images/resized/0021/0815/210815v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "SaaS Venture Partners HQ",
    "address1": "370 Park Street",
    "address2": "Suite 3",
    "zip_code": "94556",
    "city": "Moraga",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}