{"name": "Sacramento Limo",
 "permalink": "sacramento-limo",
 "crunchbase_url": "http://www.crunchbase.com/company/sacramento-limo",
 "homepage_url": "http://www.sacramentocalimo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "limo, airport-limo, airport-limousine, airport-transportation, limousine, limos, limo-service, towncar-service",
 "alias_list": null,
 "email_address": "stanlsl004@yahoo.com",
 "phone_number": "9168897092",
 "description": "Limousine Services",
 "created_at": "Fri Dec 09 12:05:44 UTC 2011",
 "updated_at": "Tue Dec 13 23:42:24 UTC 2011",
 "overview": "\u003Cp\u003ESacramento Limo is a luxury transportation limousine service. We offer hourly services, airport services, wedding transfer, prom service and any other limousine transportation needs for individual and corporate associations. Basically Sacramento Limos serves all of Sacramento and surrounding areas. We render limo services with our luxury town cars, stretch limousines, SUVs, Vans and party buses. Contact us today and let us show you just how and why we are the leading luxury limousine service provider in Sacramento.\u003C/p\u003E\n\n\u003Cp\u003EOur goal is to always provide unsurpassed luxury limousine transportation service by seeing our satisfied customers. High quality limousine service is what Sacramento Limo consistently delivers. The unsurpassed service that we provide our clients has earned us their loyalty and trust. Our cause is transportation and our passion is service. We are here to make your travel luxurious and hassle free. Our limo rates are affordable and we are proud to offer you luxury limousine services for any occasion.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}