{"name": "Safe Usage and Handling of Jumbo Bags",
 "permalink": "safe-usage-and-handling-of-jumbo-bags",
 "crunchbase_url": "http://www.crunchbase.com/company/safe-usage-and-handling-of-jumbo-bags",
 "homepage_url": "http://plastic-bags.made-from-india.com/jumbo-bags.php",
 "blog_url": "http://plastic-bags.made-from-india.com/jumbo-bags.php",
 "blog_feed_url": "http://plastic-bags.made-from-india.com/jumbo-bags.php",
 "twitter_username": "mayurdicostagm",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "jumbo-bags, plastic-jumbo-bag, jumbo-bags-india, jumbo-bags-manufacturers, jumbo-bags-suppliers, jumbo-bags-exporters, jumbo-bags-providers, jumbo-bags-wholesalers, made-in-india-jumbo-bags",
 "alias_list": "",
 "email_address": "mayurdicosta@gmail.com",
 "phone_number": "",
 "description": "Jumbo Bags Manufacturers and Suppliers f",
 "created_at": "Tue Nov 22 11:19:12 UTC 2011",
 "updated_at": "Wed Apr 17 19:41:56 UTC 2013",
 "overview": "\u003Cp\u003EJumbo bags are infinitely more robust than their flimsy appearance might at first sight suggest and their inherent qualities of flexibility and elasticity render them more able to absorb dynamic forces and shock loadings. The accepted norms now a days is that bags from reputable manufacturers should have an independently certified minimum safety factor of 5:1 for single trip usage for limited reuse and 8:1 or more for heavy duty repeat use.\u003C/p\u003E\n\n\u003Cp\u003EIt I wisely considered that in the absence of hard and fast internationally enforceable regulations governing the safe use of jumbo bags these generous margins of safely should provide sufficient latitude to absorb a fair degree of rough and incorrect treatment by users.\u003C/p\u003E\n\n\u003Cp\u003ENow going on to the jumbo bags safety and common handling malpractices, fork lift trucks were considered to be major cause of damage mainly because the lift truck operator is performing a monotonous task which does not involve him in any direct danger and he may be remunerated more on the basis of speed rather than care of handling. As a result sloppy handling practices tend to prevail: these include failing to lift a bag clear of the ground before moving it forwards of backwards: failing to bring the lift truck to a complete standstill before lowering the jumbo bags: pushing jumbo bags against sharp edges in truck and puncturing bags.\u003C/p\u003E\n\n\u003Cp\u003EAlthough jumbo bags are available with pop up loops enabling a skilled lift truck operator to discharge bags from a stack single handed, it is still common practice for an assistant to climb on to the stack to help thread the bag lifting loops on to the lift truck tines: this person is at risk of falling or being crushed by a collapsing stack, although thankfully this type of accident is extremely rare.\u003C/p\u003E\n\n\u003Cp\u003EThe other main instance where there is risk of serious injury is when a worker stands beneath the jumbo bags, a practice not to be recommended but which is virtually unavoidable in certain cases as, for example when bags are craned into the hold of a ship. Systems for releasing the contents of jumbo bags which avoid the necessity for a person to be positioned beneath the bag are becoming more widely used. \u003C/p\u003E\n\n\u003Cp\u003EMore information at: http://plastic-bags.made-from-india.com/jumbo-bags.php\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       84],
      "assets/images/resized/0016/3469/163469v3-max-150x150.png"],
     [[228,
       128],
      "assets/images/resized/0016/3469/163469v3-max-250x250.png"],
     [[228,
       128],
      "assets/images/resized/0016/3469/163469v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "214 Advait Complex, B/s Sandesh Press",
    "address2": "Vastrapur",
    "zip_code": "380015",
    "city": "Ahmedabad",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        90],
       "assets/images/resized/0016/3635/163635v1-max-150x150.png"],
      [[250,
        150],
       "assets/images/resized/0016/3635/163635v1-max-250x250.png"],
      [[450,
        270],
       "assets/images/resized/0016/3635/163635v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}