{"name": "Saini Engg Works",
 "permalink": "saini-engg-works",
 "crunchbase_url": "http://www.crunchbase.com/company/saini-engg-works",
 "homepage_url": "http://www.indiamart.com/sainiengg-works/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sainiengg-works@tradepassport.org",
 "phone_number": "9216143034",
 "description": "supplier and manufacturer of Papad Makin",
 "created_at": "Fri Apr 05 13:57:11 UTC 2013",
 "updated_at": "Fri Apr 05 13:57:15 UTC 2013",
 "overview": "\u003Cp\u003ESaini Engineering Works came into existence in the year 2005 as a sole proprietorship based organization at Dera Bassi, Punjab. We are one of the renowned manufacturer and supplier of the market engaged in offering an extensive range of Puri \u0026amp; Chapatti Making Machine, Cooker, Chapati \u0026amp; Food Warmer, Vegetable Cutting Machine, Potato Peeler Machine, Papad \u0026amp; Appalam Making Machine, Tandoor, Kneading Machine and Steam Cooking System. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe are a quality-oriented company focusing to deliver only defect free range of products to the clients that meet their diverse needs and demands in every aspect. Our product range is manufactured using quality tested materials, which are sourced from the trusted market vendors. We use advanced production techniques to develop a range of durable products for the clients. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur state-of-the-art infrastructural building is sprawled over a huge area of land at Dera Bassi, Punjab. The facility has been segregated into several departments by the management to ensure smooth workflow and supply chain in the market. Our modernized manufacturing plant is functional with technologically advanced machines and equipment, which ensure high production capacity.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have selected some of the talented brains of the industry as our team members, who strive to provide high reliable and cost-effective products to the clients. These professionals possess intense experience of their fields, which help them in accomplishing assigned tasks without any errors. Our professionals work in tandem with one another to achieve common goals of the company.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe follow client-centric approaches in our business operations to render maximum satisfaction to our esteemed clients. Our company offers highly reliable and durable range of products to the clients at industry leading prices. We also ensure the all the dispatched orders are delivered to the clients within the stipulated time frame. Moreover, with the help of our transparent business dealings, we are able to muster a large client base across the nation.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8731/248731v2-max-150x150.jpg"],
     [[220,
       220],
      "assets/images/resized/0024/8731/248731v2-max-250x250.jpg"],
     [[220,
       220],
      "assets/images/resized/0024/8731/248731v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}