{"name": "Sain Art Printers",
 "permalink": "sain-art-printers",
 "crunchbase_url": "http://www.crunchbase.com/company/sain-art-printers",
 "homepage_url": "http://www.indiamart.com/sainartprinters/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 1973,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mono-cartons, labels, laminated-carton-boxes",
 "alias_list": null,
 "email_address": "sainartprinters@tradepassport.org",
 "phone_number": "9891253303",
 "description": "Manufacturer  of labels, cartons",
 "created_at": "Thu Apr 04 06:53:13 UTC 2013",
 "updated_at": "Thu Apr 04 06:54:39 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1973, at Delhi, India, we, “Sain Art Printers”, are recognized among the affluent manufacturers and suppliers of an assorted gamut of C high class mono cartons, labels, stickers, brochures etc. You will receive the best prices and printing service for quality colour printing, as well as the printing expertise to help guide you through the sometimes-complex world of commercial colour offset printing, graphic design mono carton boxes. Our qualified and skilled professionals fabricate these products using cutting-edge tools, advanced technology and optimum grade factor inputs. At our production facility, these products are manufactured in compliance with the international standards to ensure their flawlessness in all aspects.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nMono Cartons\nLabels\nBrochures\nLaminated Carton Boxes\nPacking Boxes\nPrinted Packaging Boxes\nPrinted Corrugated Boxes \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a quality-oriented organization, we are committed to providing an excellent quality product range to our esteemed clients. These manufacturers adopt modernized machinery and technology to fabricate their products, which account for the dimensional accuracy and superior service.\u003C/p\u003E\n\n\u003Cp\u003EResearch And Development:\nWe have a separate research and development wing, which is well equipped with the modern facilities that ensures the overall development of the product and as per the emerging market trends. Due to this, these products are appreciated by customers for quality, high tensile strength as well as tear resistance.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe aim to achieve maximum level of customer satisfaction. All our products are manufactured using superior quality basic material and tested rigorously on the basis of international standards. Our presence in the industry for these many years has made it possible for us to understand the requirements of clients. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       120],
      "assets/images/resized/0024/7600/247600v2-max-150x150.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7600/247600v2-max-250x250.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7600/247600v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}