{"name": "Salasar Techno",
 "permalink": "salasar-techno",
 "crunchbase_url": "http://www.crunchbase.com/company/salasar-techno",
 "homepage_url": "http://www.indiamart.com/salasartechnoengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "salasartechnoengineering@tradepassport.org",
 "phone_number": "9871115441",
 "description": "manufacturer and supplier",
 "created_at": "Fri Apr 05 13:50:02 UTC 2013",
 "updated_at": "Fri Apr 05 13:50:07 UTC 2013",
 "overview": "\u003Cp\u003ESalasar Techno Engineering Pvt. Ltd. is an ISO 9001:2008, ISO 14001:2004 \u0026amp; ISO 18001:2007 accredited company and are in manufacturing and supplying of Cable Tray,Cable Tray Accessories, Raceway Floor Trunking, Perforated Sheet Electrical Tower, Industrial Storage System, Pallet Rack, Solar Power Plant \u0026amp; Industrial Steel Product, etc. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nThe company has in house QAP (Quality Assurance Plan) and adhere to the same strictly so as provide quality products both in manufacturing and services. In house CHEMICAL LAB \u0026amp; UTM machine is installed to check the quality of raw material. The organization is ISO 9001:2008, ISO 14001:2004 \u0026amp; ISO 18001:2007 accredited.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nThe company has an industrial land measuring 12500 Sq. yards. at Khasra No. 283, Vill. Parsaun-Dasna, P.O. Jindal Nagar, Distt. Ghaziabad. Covered area of 2400 sq. Meters includes 2 sheds for  fabrication (Approx. Area 1600 sq. Meters) and 1 shed for Galvanizing (Approx. 800 sq. Meter) apart from 200 sq. meter office space and approx. 500 sq. Meter for stores \u0026amp; other utilities.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have recruited highly skilled and semi–skilled team of professionals in order to maintain the top most position in the industry with high quality standards of our product range. Our professionals give their best in order to meet the diversified requirements of clients within the specified time schedule.\u003C/p\u003E\n\n\u003Cp\u003ESafety Plan:\nThe company has given lot of emphasis on the safety of workmen and has specially created new positions for safety managers who make sure that all safety norms are followed during manufacturing and erectioning. All the workmen are provided with safety helmets, safety belts, hand gloves, boots etc. as per their jobs.\u003C/p\u003E\n\n\u003Cp\u003EEnvironment:\nAt the manufacturing unit all equipments like ETP (Effluent Treatment Plant), smoke scrubbers are functioning so as to safeguard the surroundings. A lot of green area has also been developed by the company. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       101],
      "assets/images/resized/0024/8722/248722v2-max-150x150.jpg"],
     [[125,
       101],
      "assets/images/resized/0024/8722/248722v2-max-250x250.jpg"],
     [[125,
       101],
      "assets/images/resized/0024/8722/248722v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}