{"name": "SalesforceCAD",
 "permalink": "salesforcecad",
 "crunchbase_url": "http://www.crunchbase.com/company/salesforcecad",
 "homepage_url": "http://salesforcecad.com",
 "blog_url": "http://salesforcecad.sustainfund.net/?q=tracker",
 "blog_feed_url": "http://salesforcecad.sustainfund.net/?q=rss.xml",
 "twitter_username": "SalesforceCAD",
 "category_code": "network_hosting",
 "number_of_employees": 2,
 "founded_year": 2010,
 "founded_month": 8,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "crm, cad, plm, pdm, cae, cam, cai, erp, collaboration, dfss, systems, engineering, critical-parameter-management, parametric-design, tolerance-engineering, customer-relationship-management, partner-relationship-management, supply-chain-management, product",
 "alias_list": null,
 "email_address": "bruns@salesforcecad.com",
 "phone_number": "507-458-2641",
 "description": "product launch engineering collaboration",
 "created_at": "Mon Aug 02 19:26:15 UTC 2010",
 "updated_at": "Mon Aug 02 20:07:28 UTC 2010",
 "overview": "\u003Cp\u003EThe Salesforce CAD project is about mobilizing a faster, more reliable,  borderless CAD network infrastructure for a more synergistic workflow between different CRM, CAD and PDM tools.   \u003C/p\u003E\n\n\u003Cp\u003EOur mission is more effective, efficient collaboration on data-driven complex engineering design and product launch projects.  Eliminating the barriers and optimizing constraints in rapid, efficient collaboration between ALL holders of critical engineering, manufacturing and marketing information for product launch and distribution will be the key to the success of this project.   \u003C/p\u003E\n\n\u003Cp\u003EWe believe we can achieve our mission by leveraging existing CAD and cloud-based CRM technology with new developments from multi-player gaming technology and other data-intensive social networks.   Of course, there will also be other tools and methods that we exploit to boost the productivity of project engineering teams with affordable, real-time 3D collaboration and simulation, quantitative critical parameter management and data visualization.  \u003C/p\u003E\n\n\u003Cp\u003EOur approach is rooted in our belief that successful product launch is a matter of plugging in the power of all project engineering team interactions with customers representatives, R\u0026amp;D and lab partners, supply chain partners, manufacturing partners, marketing and distribution chain personnel and other launch-critical players involved in product development and launch.   If we can more effectively master the virtual CAD realm by understanding the criticality of customer requirements and supplier capabilities, fewer resources will be wasted on failed product launches.  The size and predictability of customer demand will improve by engaging key customer representatives much earlier in the development cycle.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[59,
       57],
      "assets/images/resized/0009/5727/95727v2-max-150x150.png"],
     [[59,
       57],
      "assets/images/resized/0009/5727/95727v2-max-250x250.png"],
     [[59,
       57],
      "assets/images/resized/0009/5727/95727v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "founder",
    "person":
     {"first_name": "Mark",
      "last_name": "Bruns",
      "permalink": "mark-bruns-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "3823 160th Street",
    "address2": "",
    "zip_code": "51237",
    "city": "George",
    "state_code": "IA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}