{"name": "Saletrix",
 "permalink": "saletrix",
 "crunchbase_url": "http://www.crunchbase.com/company/saletrix",
 "homepage_url": "http://www.saletrix.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "saletrix",
 "category_code": "consulting",
 "number_of_employees": 2,
 "founded_year": 2003,
 "founded_month": 1,
 "founded_day": 29,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sale, sales, crunchfish, develop, access",
 "alias_list": null,
 "email_address": "info@saletrix.com",
 "phone_number": "+46708173322",
 "description": "Sale company in sweden",
 "created_at": "Wed Apr 06 08:10:51 UTC 2011",
 "updated_at": "Wed Apr 13 15:18:15 UTC 2011",
 "overview": "\u003Cp\u003ESaletrix.com When you want to talk about sales\nGetting the job done is no excuse for note Follo wing the rules\nOur idea is to help companies improve efficiency and\nwith the right partners to deliver the best results \u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EWe streamline, communicates and develops B2B B2C with a 360 control\u003C/p\u003E\n\n\u003Cp\u003EOur communications\nWe are asking questions! You get the answers!\nSale Trix is Sweden\u0026#8217;s most international B2B B2C consultant.\nOur customers and partners across Europe. We work across the marketing field with analysis, planning, Sales, Implementation, Change, Review and Results.\ncompetence in the company\u003C/p\u003E\n\n\u003Cp\u003ESale Trix in Sweden is an aggressive and dynamic company that grew rapidly. We have offices in Malmo, the Center in a trendy and fresh local. We are in contact with some of the highest quality companies in Sweden. \nWe have for years worked as key account manager, booker, Sales Managers, Sales, Business Developer, Manager, Team Leader over Sweden in order to enhance the effectiveness of various Swedish and international companies. \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EWe care about our customers. It can be seen in our results \nWe are always looking for a challenging job in a growing company? \nWe want to continue to develop the selected mission portfolio in the new company? \nOnce we have decided and we will start a collaboration, here we go? \nWhat is the next step in your company development! \nYou send us an email and we will contact via phone sale@saletrix.com \u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EOur mission is to contact the selected individuals or companies in Sweden to offer your products or services! \nWe can also look forward samarbetpartners to you! We offer different optimal solutions for you as our customer, we help you to always stay one step ahead! \nIn addition to a confidential co-operation as well as a great opportunity to develop your company with our expertise, offers Sale Tricks you: \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EBest performance \u003C/li\u003E\n\u003Cli\u003EGreat opportunities to develop new products. \u003C/li\u003E\n\u003Cli\u003EThe ability to create new contacts in the industry and build a network for the future \nWe have a positive attitude and have easy access to new contacts with people, and companies \u003C/li\u003E\n\u003C/ul\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}