{"name": "Salius Pharma",
 "permalink": "salius-pharma",
 "crunchbase_url": "http://www.crunchbase.com/company/salius-pharma",
 "homepage_url": "http://www.saliuspharma.com",
 "blog_url": "http://pharmasalius.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "SaliusPharma",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": 2011,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "generic-medicines, pharmaceuticals, surgicals, medical-devices",
 "alias_list": null,
 "email_address": "info@saliuspharma.com",
 "phone_number": "912241237868",
 "description": "Leading Pharmaceutical company",
 "created_at": "Thu May 02 10:02:34 UTC 2013",
 "updated_at": "Thu May 16 03:31:26 UTC 2013",
 "overview": "\u003Cp\u003EWe at Salius Pharma  believe that every individual deserves access to high quality, safe, efficacious  and affordable medications which is the defining principle of universal health care. \nSalius Pharma is an  integrated Pharmaceutical company involved in developing, trading ,marketing and export of wide range of pharmaceutical Formulations, APIs, Nutraceuticals, Surgical and natural Products to many countries across the globe.\u003C/p\u003E\n\n\u003Cp\u003ESalius Pharma’s products are coming straight from the heart of most modern \u0026amp; sophisticated state of the art manufacturing facilities in India \u0026amp; Canada. Our manufacturing facilities across India and Canada have been certified to follow GMP as lay down by WHO, UK MHRA \u0026amp; USFDA. We have basic principles of providing Quality products, on time deliveries, reasonable Prices and Transparency in Dealings. This made us one of the most preferable partners amongst our customers in India \u0026amp; internationally.\u003C/p\u003E\n\n\u003Cp\u003EWe are a reputed Export House with a strong team of Regulatory Affairs, Pharmacists and technocrats which allows us to work in tandem with the needs of our customers across the globe. As an integrated pharmaceutical company we share long term, harmonious \u0026amp; symbiotic relationships with our customers all of which reflect our business ethics, trust \u0026amp; transparency and quality standards.\u003C/p\u003E\n\n\u003Cp\u003EFORMULATIONS:\u003C/p\u003E\n\n\u003Cp\u003ESalius Pharma dealing with wide range of  products basket comprises of Sterile Injectables, small and large volume Parenterals(FFS), Lyophilized Injections, Tablets , Capsules, Soft Gelatin Capsules, Dry Syrups, Liquid Orals, Ear / Eye / Nasal Drops, powder for suspensions in sachets and pet bottles, Topical gels and creams and many more…. in various categories like Betalactum \u0026amp; non Betalactum\u003C/p\u003E\n\n\u003Cp\u003EA rapidly growing pharmaceutical company ,Salius Pharma has a diversified product portfolio  spread over major therapeutic areas particularly Cardiovascular Drugs, Neuropsychiatry, Anti-Biotics, AntiDiabetics, Antiulcerants, Anticancer, Anti-Malarial, Erectile Dysfunction, Hormone Replacement Therapy, Anti-Obesity, Anti-Retroviral, Anti Tubercular Medication, Analgesics \u0026amp; Antipyretics \u0026amp; Lozenges etc.\u003C/p\u003E\n\n\u003Cp\u003ENUTRACEUTICALS \u0026amp; LIFE STYLE PRODUCTS:\u003C/p\u003E\n\n\u003Cp\u003EAll our Nutraceutical products are get manufactured by our approved facilities in India that comply with strict GMP requirements. These nutraceuticals are usually supplied in various medicinal formats like soft gels, capsules, tablets, injectables and powder.\u003C/p\u003E\n\n\u003Cp\u003EWe are leading manufacturers of brands of vitamin, mineral, and dietary supplements catering to the segments of Antioxidants, Multivitamins and Minerals, Essential Minerals, Vitamins A, B, C, D \u0026amp; E, Proteins, Fatty Acids and Lipids, Amino Acids, Co-Q-10, Probiotics, Bone and Joint Health, Brain and Mood, Eye Care, Immune Support, Liver Support, Cardiovasculard, Stress Control, Neurological, General Health, Skin Care, Pain Relief and Enzymes.\u003C/p\u003E\n\n\u003Cp\u003EAPIs (Active Pharmaceutical Ingredients)\u003C/p\u003E\n\n\u003Cp\u003ESalius Pharma takes pride in fulfilling your requirements of Pharmaceutical, Nutraceutical and Specialty Chemicals from ISO Certified, GMP, CGMP \u0026amp; USFDA approved units with supportive regulatory documentations like DMF, EDMF, COS, USDMF etc. Our specialisation ranges from API and intermediates to custom synthesis and process chemistry.\u003C/p\u003E\n\n\u003Cp\u003EThe growing demand for Herbal (Ayurvedic/Natural) alternatives for modern ailments and incurable diseases is increasingly changing healthcare values and preferences. We in SALIUS HERBAL believe that, human beings are products of Nature and Nature has the remedy for its ailments.\u003C/p\u003E\n\n\u003Cp\u003ESALIUS HERBAL is a division of Salius Pharma Pvt. Ltd. has tied up with the most modern research facilities and with qualified team of scientists from diverse fields like ayurvedic doctors, Chemists, phyto-chemists, botanists, clinical pharmacologists and microbiologists.\nSALIUS HERBAL was established with a vision to introduce new-age herbal medicines that are ayurvedic, herbal, probiotics, Natural Products and phytonutrients etc.\u003C/p\u003E\n\n\u003Cp\u003ESALIUS HERBAL has successfully made the transition from ancient Ayurvedic/Herbal remedies to Modern Standardized Ayurveda wherein monitored through strict quality controls and the efficacy and safety of the products proven by clinical trials. Through combining extensive R \u0026amp; D with modern techniques, SALIUS HERBAL introducing numerous Herbal remedies for common ailments facing mankind.\u003C/p\u003E\n\n\u003Cp\u003EWe provide a large collection of safe and natural remedies for many diseases through our herbal products.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       66],
      "assets/images/resized/0026/1848/261848v2-max-150x150.jpg"],
     [[250,
       111],
      "assets/images/resized/0026/1848/261848v2-max-250x250.jpg"],
     [[450,
       200],
      "assets/images/resized/0026/1848/261848v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Salius Pharma Pvt. Ltd.",
    "address1": "A-209,Shiv Chamber,Sector-11",
    "address2": "CBD Belapur",
    "zip_code": "400614",
    "city": "Navi Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": 19.0163267,
    "longitude": 73.0397898},
   {"description": "Salius Pharma Inc.",
    "address1": "8386 120 Street, Surrey BC",
    "address2": "V3W 3N4, ",
    "zip_code": "V3W 3N4",
    "city": "SURREY",
    "state_code": null,
    "country_code": "CAN",
    "latitude": 49.1556841,
    "longitude": -122.8902808}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        51],
       "assets/images/resized/0026/1850/261850v2-max-150x150.jpg"],
      [[250,
        86],
       "assets/images/resized/0026/1850/261850v2-max-250x250.jpg"],
      [[450,
        155],
       "assets/images/resized/0026/1850/261850v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}