{"name": "Salooja Brothers Private Limited",
 "permalink": "salooja-brothers-private-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/salooja-brothers-private-limited",
 "homepage_url": "http://www.parcoinstrument.in/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Specific Gravity Equipments",
 "created_at": "Sun Apr 15 17:20:37 UTC 2012",
 "updated_at": "Thu Apr 19 01:26:24 UTC 2012",
 "overview": "\u003Cp\u003EManufacturer and exporter of scientific instruments and laboratory equipments greatly demanded by various Physics, Chemistry and Biology laboratories of educational institutions and research centres.\u003C/p\u003E\n\n\u003Cp\u003ESalooja Brothers Pvt. Ltd. is a leading manufacturer and exporter of Scientific Instruments and Laboratory Equipments greatly demanded by various Physics, Chemistry and Biology laboratories of educational institutions and research centres. The company was established in 1965 and with the working experience our market has been expanded to overseas countries like USA, UK, New Zealand, Australia, Malaysia, Africa and Middle East Countries. We work with the vision to supply only quality products to the market that yield best result when used. With our highly efficient products, we have achieved an enviable position in the market and our name is synonymous with unmatched quality. We use finest quality raw material procured from reliable sources to grant durability and longevity the range we offer. Our manufacturing plant has the most advanced machineries of reputed brands, which are handled by skilled work force. Driven by a desire to achieve perfection, we are focused on delivering absolute satisfaction to our clients at all levels.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8221; Quality is of paramount importance to us \u0026amp; our products conform to international standards. Our trade mark \u0026#8220;PARCO\u0026#8221; has created a niche both in the domestic as well as world market . This we have achieved through constant monitoring of customer feedback.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}