{"name": "saltlux",
 "permalink": "saltlux",
 "crunchbase_url": "http://www.crunchbase.com/company/saltlux",
 "homepage_url": "http://www.saltlux.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 1979,
 "founded_month": 6,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "text minning, sementic",
 "created_at": "Mon Dec 03 04:53:14 UTC 2012",
 "updated_at": "Wed Dec 05 08:15:01 UTC 2012",
 "overview": "\u003Cp\u003EDear Valued Customers!\nThe past three decades have been a challenging yet rewarding journey of struggles and accomplishments for Saltlux Inc. This was made possible by your unwavering love and support. Now, for the next three decades ahead of us, we Luxians at Saltlux renew our dedication to passion and innovation that will lead you to success. \u003C/p\u003E\n\n\u003Cp\u003ESaltlux has made efforts to fulfill its mission of helping people communicate knowledge, about developing and marketing innovative information search and mining solutions to providing language services, including multilingual translations, to help your business globalize. As a result, Saltlux is now a globally-recognized specialist in Semantic Web, a knowledge structuring and sharing tool, as well as a specialist in information and lingual communication. \u003C/p\u003E\n\n\u003Cp\u003EWe at Saltlux maintain our work integrity at all times. We contribute to our customers and society through innovation. We value our own personal growth and pursuit of happiness. These core Luxian values form the most important mental model and the guiding principle that lead our customers to success. They are also the source of Saltlux’ sustainable management. \u003C/p\u003E\n\n\u003Cp\u003ESaltlux believes that great dreams give rise to great people and valued companies. Now, Saltlux would like to announce “Vision 2015”. “Vision 2015” is about implementing a global service platform that helps structure and shares human knowledge by adding more value to the knowledge assets of global customers. We at Saltlux will devote ourselves to realizing “Vision 2015” in the path to becoming a global company.\u003C/p\u003E\n\n\u003Cp\u003EWith passion, enthusiasm, and commitment to innovation and your success, we at Saltlux count on you for full support and encourage-\nment. Thank you\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Kyung-il",
      "last_name": "Lee",
      "permalink": "kyung-il-lee",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}