{"name": "Sam Mustafa",
 "permalink": "sam-mustafa",
 "crunchbase_url": "http://www.crunchbase.com/company/sam-mustafa",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "SamMustafa3",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sammustafa282@yahoo.in",
 "phone_number": "",
 "description": "Charleston, South Carolina ",
 "created_at": "Fri Aug 24 13:15:47 UTC 2012",
 "updated_at": "Thu Aug 30 10:50:38 UTC 2012",
 "overview": "\u003Cp\u003ECharleston, South Carolina is home to a highly successful entrepreneur by the name of Sam Mustafa. His efforts have revived the downtown area. He opened a number of award-winning restaurants. These replaced the old and unused buildings lining the streets. Now residents and visitors enjoy a livelier and more attractive area. His business efforts have breathed new life into the community.\u003C/p\u003E\n\n\u003Cp\u003EBut long before he dressed the town in fresh destinations, he grew up with his five brothers in Kuwait. His pursuit of education is what brought him to America. Sam Mustafa enrolled at the University of Illinois to earn a degree in engineering. At first he found himself doing poorly in his classes. He was at a loss as to why his grades were suffering. So he decided he would pick up some part time work, to make him more responsible. He filled positions at Pizza Hut, McDonald’s, and Domino’s Pizza. All of these taught him a valuable lesson. He loved working in the food industry, but hated working for people.\u003C/p\u003E\n\n\u003Cp\u003ESam Mustafa then earned enough money to rent a commercial space on campus. With Sam’s Café open for business, he finally found focus and drive. He very quickly earned his degree and a handsome sum of money. He had enough to increase his savings, buy more business space, and even send some home to Kuwait. After this he decided to take a vacation. He landed in Charleston, and realized this would be his new home.\u003C/p\u003E\n\n\u003Cp\u003ESam Mustafa became the CEO of the Charleston Hospitality Group. Along with this and his entrepreneurial efforts in the Charleston area, the community was really coming together. He single-handedly turned many of the vacant, depressing buildings, and made them into attractive night spots. Sam Mustafa is now a dedicated Charlestonian, who gives back to the area every way he can. The downtown area wouldn’t be what it is today without him.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0020/7973/207973v2-max-150x150.png"],
     [[250,
       153],
      "assets/images/resized/0020/7973/207973v2-max-250x250.png"],
     [[260,
       160],
      "assets/images/resized/0020/7973/207973v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}