{"name": "Sanity Solutions",
 "permalink": "sanity-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/sanity-solutions",
 "homepage_url": "http://www.sanitysolutions.com",
 "blog_url": "http://www.sanitysolutions.com/BlogRetrieve.aspx?BlogID=9035",
 "blog_feed_url": "",
 "twitter_username": "sanitysolutions",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2004,
 "founded_month": 1,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "data-management, data-storage, data-protection, data-security, virtualization, cloud, infrastructure-",
 "alias_list": null,
 "email_address": "contact@sanitysolutions.com",
 "phone_number": "720-570-1668 x620",
 "description": "Data Storage Cloud Virtualization",
 "created_at": "Fri Jul 06 22:54:03 UTC 2012",
 "updated_at": "Fri Jul 06 23:21:45 UTC 2012",
 "overview": "\u003Cp\u003ESanity Solutions is a data management solutions provider that customizes and integrates intelligent solutions across Storage, Data Protection, Cyber Security, Cloud Computing, \u0026amp; Data Center Infrastructure- creating distinctive value for every customer.\u003C/p\u003E\n\n\u003Cp\u003EWe provide solutions that eliminate data loss, increase data availability, and lower overall costs. As a market leader, Sanity Solutions partners with the industry’s foremost data management companies to offer customers the most advanced products as part of a comprehensive IT solution. \u003C/p\u003E\n\n\u003Cp\u003EIn the recent past, companies were concerned about managing gigabytes of data, however, with the explosion of data being generated, tera- peta- and exa-bytes of data to manage are routinely accepted as normal. But managing a new normal amount of data puts an enormous strain on resources.\nIn addition, consider the unprecedented challenges and complexities brought on by these changes inside the data center. Information Technology departments are charged with reducing costs and operating more efficiently, and delivering more value back to the business.\u003C/p\u003E\n\n\u003Cp\u003ELastly, IT consolidation, government regulations, legal compliance and adoption of cloud and virtualization technology have enterprises worldwide scrambling to discover new solutions to provide optimal data management.\u003C/p\u003E\n\n\u003Cp\u003ESanity Solutions is a specialist in comprehensive equipment and services for your data management needs. We take a personalized approach, as no two situations are identical. We identify your business needs and create strategic goals and technical solutions that maximize your investments and results.\u003C/p\u003E\n\n\u003Cp\u003EOur employees are trained on the latest products, services, and industry standards to provide you with storage and technology solutions that surpass your objectives, including eliminating data loss, increasing data availability, and lowering overall costs, with continual technical and account support. \u003C/p\u003E\n\n\u003Cp\u003ESanity\u0026#8217;s mission is to develop the best solution for data management problems that create distinctive value for our clients by providing a legendary customer experience, working with our clients to create solutions that best serve their unique environments while conducting corporate activities to the highest ethical and professional standards.\nWe create a mutually rewarding environment for all of our stakeholders.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       41],
      "assets/images/resized/0019/9330/199330v2-max-150x150.jpg"],
     [[250,
       69],
      "assets/images/resized/0019/9330/199330v2-max-250x250.jpg"],
     [[450,
       125],
      "assets/images/resized/0019/9330/199330v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Marketing Manager",
    "person":
     {"first_name": "Chris",
      "last_name": "George",
      "permalink": "chris-george-3",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "World Headquarters",
    "address1": "1720 S. Bellaire St. ",
    "address2": "Suite 550 ",
    "zip_code": "80222",
    "city": "Denvere",
    "state_code": "CO",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://sanitysolutions.com",
    "title": "Homepage"}]}