{"name": "Sanjeev Publications",
 "permalink": "sanjeev-publications",
 "crunchbase_url": "http://www.crunchbase.com/company/sanjeev-publications",
 "homepage_url": "http://www.indiamart.com/sanjeev-publications/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hindi-writing-books, english-grammar-books",
 "alias_list": null,
 "email_address": "sanjeev-publications@tradepassport.org",
 "phone_number": "9414048563",
 "description": "We are into manufacturing and supplying ",
 "created_at": "Thu Apr 04 13:11:38 UTC 2013",
 "updated_at": "Thu Apr 04 13:11:40 UTC 2013",
 "overview": "\u003Cp\u003ESanjeev Publications started its business operations in the year 1987 at pink city Jaipur Rajasthan, India. Since our establishment, we have emerged as one of the prominent names involved in manufacturing and supplying widespread array of Children Books, Board Books, Kids General Books, Activity books and many more. Not only this, we have involved ourselves in trading comprehensive range of best selling books life Liberty, Sincere Child Crocodile, Spark , Perfect Vision Super Kids and JPH. Under the guidance and support of Mr. Sanjeev Jain, our Proprietor, we are able to offer Books as per the existing guidelines of Ministry of Education and in line with the changing learning techniques.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nStrong team forms the backbone of all our work processes. Our team comprises high proficient and experienced men and women who carry immense expertise and thorough knowledge in their domain. Besides, they are fully aware about the preferences and likings of the customers and children. Owing to their support, we are cohesively able to meet the demands of or nationwide customers.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nSince inception, quality has remained the prime concern of our organization. We have developed an integrated quality monitoring department that ensures book manufacturing as per the preferences and of our clients. Skilled and experienced editors, designers and proof readers have been recruited to ensure that the write-up is free from flaw and grammatically correct. Besides, we have made proper arrangements of packaging and safe dispatch.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nRobust infrastructure is the key to our success and growth. Our state-of-the-art infrastructure spreads across large area and is installed with latest tools and modernized machines. Owing to the utilization of modernized printing machines and tools, we are able to manufacture products in large volumes. Our infrastructure is sectioned into varied departments to ensure that varied business processes are carried in a smooth and efficient manner.\u003C/p\u003E\n\n\u003Cp\u003EProduct Range:\nNumber Writing Books\nSanskrit Textbooks\nGeneral Knowledge Books\nHindi Medium Social Science Books\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       78],
      "assets/images/resized/0024/7918/247918v2-max-150x150.jpg"],
     [[250,
       131],
      "assets/images/resized/0024/7918/247918v2-max-250x250.jpg"],
     [[450,
       236],
      "assets/images/resized/0024/7918/247918v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}