{"name": "Sansar Technology Solutions",
 "permalink": "sansar-technology-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/sansar-technology-solutions",
 "homepage_url": "http://www.sansartech.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sansartech",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sansar, minneapolis-consulting-company, minneapolis-staffing-company, minneapolis-web-design, minneapolis-cms",
 "alias_list": null,
 "email_address": "andrew@sansartech.com",
 "phone_number": "6123090719",
 "description": "Software Consulting Company",
 "created_at": "Fri May 24 15:19:23 UTC 2013",
 "updated_at": "Mon May 27 15:26:21 UTC 2013",
 "overview": "\u003Cp\u003ESansar Technology Solutions is a leading consulting, business solution and systems integration firm with a unique blend of services. We would like to deliver solutions that benefit our clients by applying our Knowledge and experience and create a curriculum that fits industry standards. Our most strong area are designing, developing \u0026amp; Hosting web sites. We are professional consulting firm specializing in creative web solutions for clients. \u003C/p\u003E\n\n\u003Cp\u003ETop 4 reasons why customers choose us as their software company\nExpert in Small and Medium Business\nThe best brains work for you\nShorter project time and cost optimization\nProject Rescue Service\nSansar Technology Solutions offers a broad range of professional consulting, systems analysis \u0026amp; development, systems integration and support services. With solid, broad based experience, we are confident in our ability to help our customers grow and improve their businesses. More than likely, regardless of the nature and scope of the problem, our dedicated team of professionals can help you achieve a cost effective business solution. \u003C/p\u003E\n\n\u003Cp\u003EWe provides solutions to various industries including Insurance, Manufacturing, Professional Services, Public Sector, Retail, Banking, Energy, Financial Services, Healthcare \u0026amp; Pharmaceutical, Telecom, media \u0026amp; Technology, Travel \u0026amp; Utilitiese. Our industry experience and domain knowledge has enabled us to provide innovative solutions to our customers. \u003C/p\u003E\n\n\u003Cp\u003ESansar Technology Solutions is promoted by entrepreneurs and Technocrats with proven track record in IT industry. Our expertise extends across a range of technologies encompassing cutting edge technologies like E-commerce, ERP, CRM, Data Warehousing, Web and MS technologies. We always recruit outstanding consultants with a strong technical and functional knowledge in their respective areas of expertise. \u003C/p\u003E\n\n\u003Cp\u003EOur Technical teams at Sansar Technology Solutions obtain interesting jobs dealing with top-notch tools and up-to-date technologies, competitive salary and benefits, much room for personal and career advancement. \u003C/p\u003E\n\n\u003Cp\u003EValue through focus\nAll we do is help clients realize value from their software. We work with clients to address every type of software issue, including planning, sourcing, collaboration, execution, analytics and data management. \u003C/p\u003E\n\n\u003Cp\u003EFirst-hand, real-world experience\nOur staff isn\u0026#8217;t made up of just computer programmers or career consultants. Many of us came to Sansar Technology Solutions with years of experience in healthcare, manufacturing, supply chain management and procurement management. We have first-hand experience in dealing with the issues our clients face. \u003C/p\u003E\n\n\u003Cp\u003EFocus on business results\nWith a full range of services across the spectrum – strategy and process consulting, systems implementation, systems management and outsourced business services – we know that your success doesn\u0026#8217;t come just from technical implementations, no matter how sophisticated. Count on Sansar Technology Solutions to focus on your business goals. \u003C/p\u003E\n\n\u003Cp\u003ERapid time to value\nSoftware services is all we do, and as such our engagement delivery models are tuned to software development processes and systems. We also bring strong project and program management, combined with proprietary software frameworks and service solutions. When you engage Sansar Technology Solutions, you can be confident of realizing business value far faster. \u003C/p\u003E\n\n\u003Cp\u003EFull accountability\nWe believe in putting our money where our mouth is. We don’t bill by the hour, so you don’t have to worry about the clock ticking away. Our engagements are structured on a fixed fee/fixed time basis or when appropriate, are tied to generating business results. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0026/6556/266556v2-max-150x150.png"],
     [[250,
       55],
      "assets/images/resized/0026/6556/266556v2-max-250x250.png"],
     [[300,
       67],
      "assets/images/resized/0026/6556/266556v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}