{"name": "SAPDrill.com",
 "permalink": "sapdrill-com",
 "crunchbase_url": "http://www.crunchbase.com/company/sapdrill-com",
 "homepage_url": "http://sapdrill.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sapdrill",
 "category_code": "enterprise",
 "number_of_employees": 42,
 "founded_year": 2004,
 "founded_month": 3,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sap-training, sap-certification, sap-ides-servers, sap-consultant-training, sap-fico, sap-hr, sap-hcm, sap-education",
 "alias_list": null,
 "email_address": "info@sapdrill.com",
 "phone_number": "9052660661",
 "description": "SAP Training and Certification",
 "created_at": "Fri Jun 04 23:53:55 UTC 2010",
 "updated_at": "Tue Jun 08 20:40:40 UTC 2010",
 "overview": "\u003Cp\u003EWelcome to SAPDrill Inc. SAPDrill is an online company which sets the standard for providing high quality I.D.E.S Servers and technical content to aspiring SAP Consultants empowering them with the answers and tools that are needed to enhance and grow in their careers. We exist for the simple reason, that is to help you learn SAP the way it was meant to be learnt.\u003C/p\u003E\n\n\u003Cp\u003ESAPDrill has evolved to become a collaboration between like minded consultants who see the need for skilled SAP Consultants.\u003C/p\u003E\n\n\u003Cp\u003EMany aspiring consultants have been victims to very poor training at useless, unregulated 3rd party training schools. These schools are everywhere, some get shut-down, most don\u0026#8217;t. Quick certification training will not get you a SAP job, and having such expectation will impede your career in SAP.\u003C/p\u003E\n\n\u003Cp\u003ETo get ahead, you need a willingness to learn and practice by yourself. Its as they say, formal training in a classroom environment will make you a living, however, self-learning will make you a fortune.\u003C/p\u003E\n\n\u003Cp\u003EWhat separates a Platinum consultant from a beginner consultant?\u003C/p\u003E\n\n\u003Cp\u003EMost of you will be inclined to say experience, but the right answer is KNOWLEDGE. Platinum level consultants have trained for hours finding solutions to problems even SAP AG themselves have given up on. Most platinum level consultants open firms or freelance in order to maximize opportunities. To get there takes time and patience, above all a willingness to learn.\u003C/p\u003E\n\n\u003Cp\u003EOur site is home to many of the industry\u0026#8217;s leading consultants that share our commitment to helping many worldwide meet the challenges of an ever-changing environment. With an eye on all the latest technologies, our aim is to consistently offer exclusive tools of the highest quality to a community that requires and expects nothing less. Think of us as consultants helping other consultants.\u003C/p\u003E\n\n\u003Cp\u003EAs a distinguished authority within our respective fields, we request new-comers to SAP to ask us for our recommendations on your buying decisions. We can help you with any questions you have. We are open 24 hours by email and phone lines are open during business hours.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "CEO",
    "person":
     {"first_name": "Araki",
      "last_name": "Klaushik",
      "permalink": "araki-klaushik",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "115 Woodstream Blvd",
    "address2": "",
    "zip_code": "L4l 8K5",
    "city": "Mississauga",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null},
   {"description": "Training Center",
    "address1": "357 St Nicholas Ave",
    "address2": "",
    "zip_code": "10027",
    "city": "NY",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}