{"name": "Planex",
 "permalink": "sapido",
 "crunchbase_url": "http://www.crunchbase.com/company/sapido",
 "homepage_url": "http://planexusa.com/",
 "blog_url": "http://itouchstylus.wordpress.com/",
 "blog_feed_url": "http://biz.prlog.org/biz.html?bp=PLANEX",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": 10,
 "founded_year": 2004,
 "founded_month": 9,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "3g4g, wireless-n-router, 802-11n, wi-fi-mobile-hotspot, wi-fi-ap, wireless-network-adapters",
 "alias_list": null,
 "email_address": "pr@planexusa.com",
 "phone_number": "(201) 706-7171 ",
 "description": "3g 4g Wireless Mobile Networking Product",
 "created_at": "Tue May 03 04:12:10 UTC 2011",
 "updated_at": "Thu Jan 26 22:40:58 UTC 2012",
 "overview": "\u003Cp\u003EPlanex USA is a leading manufacturer and distributor of networking products ranging from home applications to office solutions. Our intension is to bring new technology to public with confidence in quick installation, reliable network, and flexible connectivity. To achieve such a goal, we formulate small teams specializing in both hardware and software that would best fulfill the needs of demand.\nThe company was founded in July of 1995 when networking was neglected for its quality in stability. With dedication to carry out good products, it is no surprise that Planex earned its recognition in the market which accelerated the enter of JASDOQ(Japanese Stock Market) in July of 2001. As a fast growing company, we realize the need of home devices which direct us to allocate majority of resources into this particular sector of business. Nevertheless, continue of making good product encourage us to bring our experience to high-end enterprise solutions.\u003C/p\u003E\n\n\u003Cp\u003ERecently, networking is not just log onto internet anymore, it requires more of quality bandwidth that deliver data, image, and voice. Planex is aware of voice from the trend which gives us a reason to shift our horizon from pure networking to network entertainment. Similar to the spirit of Planex team inspired by car races, nothing is more important than a team work. When a car pulls into pit stop, crew members carefully evaluate the condition of car while making an assessment on tires that would carry out best performance on track. Our passion in business is not making products that satisfy our curiosity but to precisely serve the need of public.\nSpeed Information Technology for the home users, delivers maximum performance, reliable and easy to use home wireless networking, NAS and Media network products for high speed Wireless Internet and devices. For small businesses, Speed Information Technology products provide best value networking, storage and security solutions with low cost and easy to set up functions.\nSpeed Information Technology delivers technologically advanced, Speed Information Technology branded Wireless networking products that targets Home and small business. The Speed Information Technology Company network product offerings let users to share Internet access, data files, and multimedia applications between devices. Speed Information Technology network products categories are: Wireless Networking Products, Wi-Fi Broadband Products and 3G Wireless Products, Ethernet adapters, hubs, switches and computer network accessories. Wi-Fi AP Long range wireless antennas and bridges.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://ezinearticles.com/?Setting-Up-a-Wireless-Router-Sapido-3G/4G-Wireless-N-Mobile-Broadband-Hotspot-Router\u0026id=5662641",
    "title": "Setting Up a Wireless Router-Sapido 3G/4G Wireless N Mobile Broadband Hotspot Router  Article Source: http://EzineArticles.com/5662641"},
   {"external_url": "http://www.articlesbase.com/networks-articles/wireless-green-router-review-for-sapido-4108379.html",
    "title": "Wireless Green Router Review for Sapido"},
   {"external_url": "http://www.helium.com/items/2097908-how-to-set-up-a-sapido-wireless-n-router-rb-1232",
    "title": "How to set up a Sapido wireless router"},
   {"external_url": "http://www.squidoo.com/3g-4g-wireless-networking-products",
    "title": "3G 4G Wireless Networking Products"}]}