{"name": "Saroj Enterprises",
 "permalink": "saroj-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/saroj-enterprises",
 "homepage_url": "http://www.indiamart.com/sarojenterprises-chennai/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "plastic-tool-boxes, plastic-packing-boxes-and-plastic-caps-",
 "alias_list": null,
 "email_address": "sarojenterprises-chennai@tradepassport.org",
 "phone_number": "9841005464",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Thu Apr 04 15:13:50 UTC 2013",
 "updated_at": "Thu Apr 04 15:13:54 UTC 2013",
 "overview": "\u003Cp\u003EOur firm Saroj Enterprises was established in the year 1989 at Kolathur in Chennai, Tamil Nadu, India. The proprietor of the firm, Mr. E. V. Chandrasekar has excellent entrepreneur skills and has been able to bring the business to such higher levels of appeal and acceptance that clients prefer to buy their products from us. We are engaged in the manufacturing, supplying and exporting of a large range of Plastic Tool Boxes, Plastic Packing Boxes and Plastic Caps. All the products are made with extreme care and accuracy.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nThe firm has installed very sophisticated machinery and equipments and high precision tools of the latest technology to enable workmen to skilfully perform the activity of manufacturing, assembling and finishing the products. Large spaces have been provided in each of the sections so as facilitate smooth working without any hindrance of handling or its movements. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe firm is a client centric organization while taking care of finer detail that the client may desire to be incorporated in the products ordered by them. Utmost caution is exercised to ensure the product being supplied meets the specifications as per the purchase order and that the client is fully satisfied with the workmanship.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe firm has employed engineers, technologists and extremely talented and skilled professionals for taking up activities of manufacture, quality control, assembling and finishing under their vigilant surveillance. The skilled personnel are a competent lot to undertake all the assignments entrusted to them. A time bound program is strictly adhered to by all. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nPlastic Tool Boxes, Plastic Packing Boxes and Plastic Caps. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8018/248018v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8018/248018v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8018/248018v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}