{"name": "Sastha Leather Crafts",
 "permalink": "sastha-leather-crafts",
 "crunchbase_url": "http://www.crunchbase.com/company/sastha-leather-crafts",
 "homepage_url": "http://www.indiamart.com/sastha-leather-crafts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 24,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "leather-handbags-and-leather-purses",
 "alias_list": null,
 "email_address": "sastha-leather-crafts@tradepassport.org",
 "phone_number": "9884267125",
 "description": "exporter of Leather Products",
 "created_at": "Thu Apr 04 07:08:08 UTC 2013",
 "updated_at": "Thu Apr 04 07:08:13 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nSastha Leather Crafts was incorporated in the year 2010 as a sole partnership entity at Chennai, Tamil Nadu, India. Widely acclaimed as a leading and prominent manufacturer, supplier and exporter of quality approved range of Leather Products, Leather Bags, Leather Handbags and Leather Purses.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nComplete and fully functional infrastructure of the firm sprawls over a large area. Sophisticated machinery, equipment and high precision tools are installed to enable workmen to skilfully perform the activity of manufacturing, assembling and finishing of the products.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality of our products is the essential element looked after very vigilantly to keep us ahead of our competitors. Extremely talented professionals and skilled personnel employed with the firm are a competent lot to manage and incorporate all the desired quality parameters such as elegant looks, intricate patterns and attractive designs, smooth texture, perfect stitching and others.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team of professionals comprises of qualified, skilled and dedicated craftsmen and designers who are the genuine masters of creativity and also possess built- in imaginable innovations. All the professionals engaged are best in industry. The entire team remains closely coordinated to work in accordance to the customer’s choices, demands and aspirations.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nWhile every care is taken to maintain high quality standards of the vast range of leather products offered by the firm yet it remains open for any or all suggestions from the clients to make changes and improvements from time to time. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7610/247610v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7610/247610v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7610/247610v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}