{"name": "satisnet technology",
 "permalink": "satisnet-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/satisnet-technology",
 "homepage_url": "http://www.satisnet.com",
 "blog_url": "http://www.satisnet.com/hire-developer.html",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "iphone, iphone-apps, android, wordpress, ipad-apps, mobile-application-development",
 "alias_list": null,
 "email_address": "ks@satisnet.org",
 "phone_number": "",
 "description": "software development company",
 "created_at": "Wed Mar 20 11:12:58 UTC 2013",
 "updated_at": "Wed Mar 20 11:13:05 UTC 2013",
 "overview": "\u003Cp\u003EHi\nI run a small consultancy firm in one of the western countries\u0026#8230;sorry can’t disclose our identity and invite\nspammers\u0026#8230;One of the major challenges faced as an emerging consultancy firms is to STAY FOCUSED on our\ncore business expertise and GROW before we become a HISTORY.\nAs an IT consultant, I have burnt my fingers so many times that I have lost the count. I tried infinite resources like\nonline marketplaces, bidding sites, online popular directories and short listed Web and Mobile programming\nservice providers at competitive rates from South Asia Pacific countries.\nMost had two attributes in common - COMMIT and FAIL ;-)\nAs a consultancy firm, we help businesses in our region in meeting their IT needs using open source\nprogramming in corePHP # Mysql and Mobile Application Development and programming needs in iOS, Android\nand Blackberry mainly. We also help local travel agents with their online reservation system needs in B2B and\nB2C, enhancements or plugins modifications in Joomla, Wordpress, Magento, Drupal and other content\nmanagement systems.\nConsistent failure in each of the above segments from our Service Providers in South Asia Pacific countries led\nto negative impact on my emerging consultancy firm, its productivity and our commitments. Ultimately, it was our\nbrand on stake. Clients in our part of the world are very conscious about QUALITY, TURNAROUND time and\nVALUE-ADDITIONS which can’t be sacrificed.\nIt is important to say that we follow FAIR PRICING POLICY for a WIN-WIN model but were still on the LOSING\nside until we learnt about THE HOUR BANK (THB) MODEL. THB is an amazing, unique and new\nconcept which allows IT Consultants, Individual Business Owners (IBO), Emerging Small \u0026amp; Medium\nBusinesses, Large Enterprises and IT Companies to PICK, SWITCH and CONFIGURE skills any time\nduring their project tenure, NO QUESTIONS asked and NO EXTRA PAYMENTS.\nIt is an open, scalable, independent Business Platform synchronized to Resource Pool of Satisnet Technologies.\nMain features of THB are:\n4.5 years+ experienced resources and 55 hours per week working capacity for quick delivery\nUnconditional \u0026amp; Unrestricted Access to skills pool\nSelect, Switch \u0026amp; Configure skills (or resources from resource pool) anytime during the project\nM2M (month to month payments), No Contracts\nFocus on your Core expertise, build NEW engagements and Get +ve reviews\nTotal Control through our Task Management System\nComplete Control on your costs\nFixed hourly rate for any skill, no questions asked\nPersonally for us being still an emerging firm, THB model is beneficial because my Business Analyst is free from:\nEndless hours spent on Skype in explaining end client expectations\nEndless hours spent on Quality Audit of the work being delivered\nEndless hours spent in preparing Business Requirement Documents (BRDs) , Technical\nAnalysis Document, Quality Audit report\nNegotiate pricing, payment terms and conditions\nPush for deadlines, remind commitments and emphasize on milestones\nStatistically, we discovered that with an extra investment of 30% in The Hour Bank Model (THB) we SAVE 80%\non our Project Monitoring and Execution processes which is now invested in growing business, gain positive\nfeedback and has increased referral business for us.\nVisit http://satisnet.com/hire-developer.html and click on the link to get more info on The Hour Bank (THB) or\nWrite to their Relationship Manager at ks@satisnet.org\nGood Luck!!! I am sure THB will work for you if it has for US.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}