{"name": "Saurabh Engineering",
 "permalink": "saurabh-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/saurabh-engineering",
 "homepage_url": "http://www.indiamart.com/saurabhengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "saurabhengineering@tradepassport.org",
 "phone_number": "9850236023",
 "description": "Manufacturer and Supplier of a wide gamu",
 "created_at": "Sat Apr 06 05:29:25 UTC 2013",
 "updated_at": "Mon Apr 08 00:13:27 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 2006, at Pune (Maharashtra, India), we, “Saurabh Engineering”, are the renowned name involved in manufacturing, Exporter and supplying a broad array of Automobile Parts, Precision Components, CNC Turned Components, Valves, Body Adapters, VMC Job Works etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have recruited highly experienced and skilled team of professionals that help us to carve a niche for ourselves by offering the best quality product range. Our professionals work round the clock with full dedication and devotion to develop high quality assortment. We also conduct regular training sessions and seminars for our professionals to improve their skills and knowledge.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOwing to our sincere efforts and ethical business policies, we have been able to develop a strong client base in all parts of the country. Our clients depend on us for a wide range of press tools and CNC machine components. These products are known for their durability, corrosion resistance, temperature resistance, and cost-effectiveness. We have also maintained our goodwill by timely delivery of the consignments.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have established a state-of-the-art infrastructural base that is equipped with all the requisite machinery and equipment that help us operate and manage the production system in an efficient \u0026amp; hassle free manner. This infrastructural unit is divided into various divisions like production, quality control, after sales service department, etc.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe have constructed a separate quality testing unit where extensive tests are organized in order to manufacture the finest quality Automobile Parts, Precision Components, CNC Turned Components, Valves, Body Adapters, VMC Job Works etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       88],
      "assets/images/resized/0024/9051/249051v2-max-150x150.jpg"],
     [[125,
       88],
      "assets/images/resized/0024/9051/249051v2-max-250x250.jpg"],
     [[125,
       88],
      "assets/images/resized/0024/9051/249051v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}