{"name": "savi trading",
 "permalink": "savi-trading",
 "crunchbase_url": "http://www.crunchbase.com/company/savi-trading",
 "homepage_url": "http://www.savitrading.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 90,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "trading, trading-course, forex-trading-course, fx-trading-course",
 "alias_list": null,
 "email_address": "sanket.brahmbhatt@savitrading.com",
 "phone_number": "0207 618 0982",
 "description": "Savi Trading is a proprietary trading co",
 "created_at": "Wed Oct 03 08:47:09 UTC 2012",
 "updated_at": "Mon Oct 15 21:55:06 UTC 2012",
 "overview": "\u003Cp\u003ESavi Trading is a proprietary trading company that was founded by Investment Bank and Hedge Fund traders with combined experiences of over 30 years in the industry.  Within their previous trading roles, they were responsible for training and developing new members of their teams.  With this experience, coupled with their trading skills and knowledge, Savi Trading was formed to provide unparalleled training and support to individuals looking to develop a career in the trading industry.\nSince inception, the company has grown significantly by continually adapting over time to the requirements of the traders and the markets.  From initially only focusing on recruiting trainee traders, the company changed emphasis by placing greater importance on having a balance of experienced and entry level candidates creating an environment in which traders can develop their skillset and generate new ideas and strategies.\nSavi Trading have successfully attracted talented and exceptional traders from across the world who share the same idea of success as the company - strong and consistent returns.  We underline this approach by the resources and the backing we provide our traders who demonstrate and fulfill their potential.\nThe partners and the experienced traders all have extensive backgrounds within the industry and have excellent contacts with the main players that ultimately move the markets.  We provide vast amounts of information similar to that available to the investment bank and hedge fund communities.  These range from detailed economic analysis, market analysis and the ability to speak to other traders to share ideas and information.\nThe world markets are ever changing on a daily basis with breaking news and economic data only ever a few minutes away.  In times of such volatility, Savi Trading appreciate that it is vitally important to support its traders with fast paced news, information and an understanding of the markets when it matters.  It places high priority to the speed of the information flow to each trader to ensure they are able to react and make the best possible decisions.\nThe founders thoroughly believe that investment in their traders will transform into prosperity for the business as the company is only as good as its traders and they always aim to provide them with the platform to excel.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Savi Trading",
    "address1": "1st Floor",
    "address2": "70 St Mary's Axe",
    "zip_code": "EC3A 8BE ",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}