{"name": "Saviour Technologies",
 "permalink": "saviour-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/saviour-technologies",
 "homepage_url": "http://www.cctvsurveillancesystem.org/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmaster@cctvsurveillancesystem.com",
 "phone_number": "9871604403",
 "description": "Manufacture, export \u0026 supply ,",
 "created_at": "Fri Apr 05 07:39:12 UTC 2013",
 "updated_at": "Fri Apr 05 07:39:15 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2008, we, \u0026#8216;Saviour Technologies System (P) Ltd.\u0026#8217;, engaged in the manufacturing, exporting, importing \u0026amp; supplying Access Control Systems. In our large assortment of products, we offer Syris Single Door Access Control system, Multidoor Access Control System, Syris 4 Door Access Control system, Locks and Brackets. In addition to this, we also offer Box Camera, Vari-Focal Dome Camera With OSD, Dome Camera, IR Dome Camera - 20 Mtrs, IR Bullet Camera - 20 Mtrs, IR Bullet Camera - 50 Mtrs and Vari-Focal IR Bullet Camera - 40 Mtrs. \u003C/p\u003E\n\n\u003Cp\u003EOur Mission:\nTo provide you highest quality software, we also provide our valued client with full spectrum of systems and services in the field of software that reflect the most effective protection and loss prevention methods available. At Saviour Technologies Systems Pvt. Ltd., we are not satisfied with second best, we constantly strive to improve every aspect of our organization. \u003C/p\u003E\n\n\u003Cp\u003EOur Security Solutions:\nSpecializing in the industry of security and safety products, we have been satisfying the needs of a large number of clients in various industries. The Security products that are manufactured by us are: Time \u0026amp; Attendance Systems, Finger Print Identification Systems, Biometric Time Attendance systems, CCTV \u0026amp; Surveillance System, Access Control System, Metal Detector and Doors \u0026amp; Gates Automation System.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are an ISO 9001:2008 certified organization and owing to this, we strive hard to offer a defect-free rang of Access Control Systems to our esteemed customers. Our organization is backed by a separate quality assurance unit which is equipped with latest machinery and tools. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are backed by a world class infrastructure which is updated with latest tools and machinery to carry out all our business process in a flawless manner. There are various departments including production, quality assurance, warehousing \u0026amp; packaging, administrative, logistic and research \u0026amp; development inside the whole unit. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are customer centric organization and owing to this, we follow a client friendly policy in every sphere of our business operation. Our array of Access Control Systems are very cost-effective and widely available in the market. We only procure quality-approved raw material from the renowned vendors of the industry. Furthermore, usage of cutting edge technology in the production process make our array upgraded as per set industrial norms and standard.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nAccess Control Systems. In our large assortment of products, we offer Syris Single Door Access Control system, Multidoor Access Control System, Syris 4 Door Access Control system, Locks and Brackets. In addition to this, we also offer Box Camera, Vari-Focal Dome Camera With OSD, Dome Camera, IR Dome Camera - 20 Mtrs, IR Bullet Camera - 20 Mtrs, IR Bullet Camera - 50 Mtrs and Vari-Focal IR Bullet Camera - 40 Mtrs. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8396/248396v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8396/248396v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8396/248396v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}