{"name": "Savorfull",
 "permalink": "savorfull",
 "crunchbase_url": "http://www.crunchbase.com/company/savorfull",
 "homepage_url": "http://www.savorfull.com",
 "blog_url": "http://www.stacygoldberg.com",
 "blog_feed_url": "",
 "twitter_username": "savorfull",
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 2,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "allergy-free-foods, gluten-free, peanut-free, gluten-allergy, celiac-disease, dairy-free, dairy-allergy, milk-free, gluten-free-recipes, dairy-free-gluten-free-recipe, food-allergies, food-allergy",
 "alias_list": null,
 "email_address": "stacy@savorfull.com",
 "phone_number": "3137442276",
 "description": "allergy free foods delivered",
 "created_at": "Thu Mar 29 14:06:52 UTC 2012",
 "updated_at": "Fri Mar 30 16:15:02 UTC 2012",
 "overview": "\u003Cp\u003EOur Savorfull team of nutrition experts, clean eating fanatics and foodies search the globe to bring you allergy free foods delivered to your doorstep to Discover. Taste. Share\u003C/p\u003E\n\n\u003Cp\u003ESavorfull gives new meaning to living your best life with with a food allergy. We are super busy searching out fabulous allergy free foods to include in our debut tasting box, which will be available before you know it. \u003C/p\u003E\n\n\u003Cp\u003EIf you would love to receive an invitation once Savorfull officially launches, please enter your email address below. You will be added to our exclusive invitation list and will have the very first opportunity to be a Savorfull taste tester for gluten, peanut, milk \u0026amp; dairy free foods. We are launching to meet the needs of anyone with a gluten allergy, peanut allergy, milk allergy or dairy allergy with a goal of expanding to work with allergens including eggs, tree nuts, shellfish, soy and more down the road. \u003C/p\u003E\n\n\u003Cp\u003EEach month, you\u0026#8217;ll receive a tasting box filled with 4-5 deluxe allergy free food samples from food producers around the globe. Each month will include a yummy assortment of food products that are dairy free, milk free, gluten free \u0026amp; peanut free, that contain nothing artificial. \u003C/p\u003E\n\n\u003Cp\u003EIn addition, you will love our info about the food producers that cater to your food allergy, healthy gluten, dairy \u0026amp; peanut free recipes, our savvy nutrition tricks, and other goodies, to help you figure out if it is the right allergy free food for you and your family. \u003C/p\u003E\n\n\u003Cp\u003EWe are building a Savorfull allergy free community for you to Discover, Taste \u0026amp; Share with your friends, family, co-workers, neighbors, and even your worst enemies. \u003C/p\u003E\n\n\u003Cp\u003EBased on the expert nutrition advice from Savorfull CEO \u0026amp; Founder Stacy Goldberg, MPH, RN, BSN, her clean eating philosophy will help you to make informed choices to live your best allergy free lifestyle. Stacy can\u0026#8217;t wait to bring you the ultimate resource for expert interviews, allergy free nationwide events \u0026amp; programs helpful tutorials, fun videos from celebrity chefs, foodies, health professionals, fitness gurus and more. \u003C/p\u003E\n\n\u003Cp\u003EJoin Now To Discover. Taste. Share.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "CEO",
    "person":
     {"first_name": "Stacy",
      "last_name": "Goldberg",
      "permalink": "stacy-goldberg",
      "image": null}},
   {"is_past": true,
    "title": "CFO",
    "person":
     {"first_name": "Phyllis",
      "last_name": "Canvasser",
      "permalink": "phyllis-canvasser",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Corporate",
    "address1": "1555 Broadway",
    "address2": "3rd Floor",
    "zip_code": "48226",
    "city": "Detroit",
    "state_code": "MI",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}