{"name": "SB Cables",
 "permalink": "sb-cables",
 "crunchbase_url": "http://www.crunchbase.com/company/sb-cables",
 "homepage_url": "http://www.indiamart.com/sbcables/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cables, electrical-wires, cords-and-electronic-wires",
 "alias_list": null,
 "email_address": "sbcables@tradepassport.org",
 "phone_number": "9849243156",
 "description": "We manufacture and supply an extensive ,",
 "created_at": "Thu Apr 04 08:02:07 UTC 2013",
 "updated_at": "Thu Apr 04 08:02:10 UTC 2013",
 "overview": "\u003Cp\u003ES B Cables is a sole proprietorship based business concern, which was established in the year 2009 at Hyderabad, Andhra Pradesh. We are among the prominent manufacturers and suppliers of the industry engaged in offering a vast assortment of Cables, Electrical Wires, Cords and Electronic Wires. Our range is extensively demanded and admired by millions of people based across the country for their exceptional features and premium quality standards. We incorporate modern production techniques and high-grade materials in our manufacturing process to produce highly reliable and cost-effective products for the clients. Our company is able to become the foremost choice of clients due to its competitive pricing policy, transparent business dealings, prompt delivery schedules and ethical business practices.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Facilities:\nWe are backed by a robustly designed infrastructural building, which sprawls over a vast area of land. It is segregated into different departments by the management to ensure smooth workflow and hassle free environment inside company premises. Our high capacity manufacturing plant is functional with hi-tech machinery. This plant helps us achieve our target of bulk order consignments within the predetermined time frame.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nSince incorporation, we give utmost priority to the quality standards of our products. Our experts test each product on well defined parameters prior to the final packaging of finalized products. These experts also ensure that entire product range is developed in compliance with set industrial guidelines. We practice stringent quality control management system in our business operations to ensure maximum benefits to the clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric organization, we focus to render maximum level of satisfaction to our esteemed clients. We manufacture our product range in compliance with prescribed industrial guidelines using quality tested materials and modern techniques. Our experts give special consideration to clients’ demands and accordingly manufacture the products. We also offer easy payment options facility to our clients to make our business dealings crystal clear for them.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have recruited best pool of professionals in our company to efficiently address the demands and requirements of our valued clients. Our vast experienced professionals help us develop a world-class range of products for the clients. We have selected our team members after a rigorous screening process, which is based on testing their skills and experience.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nMulticore Cables, Copper Cables, Submersible Cables, Flexible Cables, Molded Cords, Industrial Wires, PVC Insulated Wires, Domestic Wires, Copper Wires and Electronic Wires.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7657/247657v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7657/247657v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7657/247657v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}