{"name": "SBSGlobalServices",
 "permalink": "sbsglobalservices",
 "crunchbase_url": "http://www.crunchbase.com/company/sbsglobalservices",
 "homepage_url": "http://www.sbsglobalservices.com",
 "blog_url": "http://sbsglobalservices.wordpress.com/",
 "blog_feed_url": "http://sbsglobalservices.wordpress.com/",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 200,
 "founded_year": 2006,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "accounting-outsourcing, payroll-outsourcing-bangalore, outsourced-payroll-services-india, top-payroll-providers-in-bangalore, finance-and-accounting-services, financial-services-companies, bookkeeping-services-in-india, outsourcing-accounting-services, ou",
 "alias_list": null,
 "email_address": "inquiry@sbsglobalservices.com",
 "phone_number": "9886725187",
 "description": "accounting outsourcing",
 "created_at": "Mon Oct 15 07:19:13 UTC 2012",
 "updated_at": "Tue Oct 23 21:03:49 UTC 2012",
 "overview": "\u003Cp\u003Eaccounting outsourcing, payroll outsourcing bangalore, accountancy services\nSBS Global Services is a fast growing Financial Services company, having an impeccable track record of serving over one hundred delighted Clients across geographies, since the year 2006. Our history and pedigree lie in the successful practice of our sister concern Chartered Accountancy firm over the past fifteen years. We offer a wide range of Financial KPO (Knowledge Process Outsourcing) services with Accounting BPO / Finance BPO being our core offering for international Clients. We render customized and cost-efficient services and allied services in the areas of Off-shored Accounting \u0026amp; Bookkeeping, Off-shored Payroll Processing and Off-shored Back Office Transactions Processing to our Clients. Our expertise and capabilities extend to Financial Statements \u0026amp; Consolidation, XBRL Reporting, Contract Review \u0026amp; Reconciliation, Taxation, India Entry Services and Overseas Entity Formation \u0026amp; Support Services as well.\u003C/p\u003E\n\n\u003Cp\u003ESBS Global Services offers tailor made Financial Accounting Services, including expert Accounting Services to our clients. Our Accounting \u0026amp; Bookkeeping Services and Payroll Processing Services are ideal for sustainable growth of business organizations as the impact of our services include substantial cost savings and increased process efficiency among others. Our Financial KPO Services are designed to provide hassle free and live information to our Clients to meet their business challenges, while ensuring total data safety and security.\u003C/p\u003E\n\n\u003Cp\u003ELarge corporations, particularly from the Banking, Financial Services and Insurance industries, can avail our Back Office Transactions Processing Services in order to improve efficiency and to remain cost effective and competitive. Our Taxation wing provides comprehensive Tax Solutions and Tax Return Processing to individual and corporate clients belonging to various industries and size brackets.\u003C/p\u003E\n\n\u003Cp\u003EOur proven KPO model has immensely benefited our clients from different geographies within India and International markets including USA, Europe, GCC and South East Asia. Our Clients belong to a wide spectrum of industries including Information Technology, Banking \u0026amp; Finance, Energy Management, Logistics, Education, Retail, Telecom, Insurance, Hospitality, Health \u0026amp; Wellness, Trading, Construction, Manufacturing and Apparel among others. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       83],
      "assets/images/resized/0021/5525/215525v2-max-150x150.jpg"],
     [[194,
       108],
      "assets/images/resized/0021/5525/215525v2-max-250x250.jpg"],
     [[194,
       108],
      "assets/images/resized/0021/5525/215525v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "Hari Dasan",
      "permalink": "hari-dasan",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}