{"name": "Scarves.com",
 "permalink": "scarves-com",
 "crunchbase_url": "http://www.crunchbase.com/company/scarves-com",
 "homepage_url": "http://www.Scarves.com",
 "blog_url": "http://www.blog.scarves.com",
 "blog_feed_url": "",
 "twitter_username": "scarvesdotcom",
 "category_code": "ecommerce",
 "number_of_employees": 32,
 "founded_year": 2010,
 "founded_month": 11,
 "founded_day": 24,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "scarves, scarf, pashminas, silk, ecommerce, ties-com, omar-sayyed",
 "alias_list": null,
 "email_address": "marketing@scarves.com",
 "phone_number": "800 953-4996",
 "description": "The \"neck's\" best thing. We are Scarves.",
 "created_at": "Wed Dec 01 21:40:27 UTC 2010",
 "updated_at": "Wed Dec 01 22:58:59 UTC 2010",
 "overview": "\u003Cp\u003EWe offer the entire spectrum of scarves for women (don\u0026#8217;t worry, for men too) including silk scarves, wool scarves, linen scarves, cotton scarves, cold weather scarves, summer scarves, neckerchiefs, squares, shawls, pashminas, infinity loops, and much, much more. \u003C/p\u003E\n\n\u003Cp\u003EWhat\u0026#8217;s unique about us: The complete shopping experience from start to finish!! We want to invite you to visit our site the same way we would invite you into our homes. Experiences such as effortless site navigation to ease of contacting customer service to speedy delivery of your beautiful scarf are virtues we hold near and dear to our hearts. \u003C/p\u003E\n\n\u003Cp\u003EWe pride ourselves on: Customer Service!! Since we have been in the online bazaar, we know what you want. We understand that ordering online can sometimes seem impersonal, we know because we shop online ourselves. We want you to feel the warm and fuzzies, and therefore we have someone always available via phone or live chat (so you can secretly shop at work). \u003C/p\u003E\n\n\u003Cp\u003EA little about our family: Our CEO loves industry buzz words, our COO is \u0026#8220;antsy\u0026#8221; and believes in 18-hour work days, our CTO incites riots, our Director of Purchasing and Inventory Control is \u0026#8220;persnickety\u0026#8221;, our Director of Customer Service should really be \u0026#8220;the Coordinator of all things\u0026#8221;, our accountant, if she speaks, is in numbers, our Human Resources Manager is a chattie Cathy, our junior developer wears cowboy hats in rap videos, our Head Creative Agent can be best described by three words, \u0026#8220;bed\u0026#8221;, \u0026#8220;bath\u0026#8221; and \u0026#8220;beyond\u0026#8221;, our content developer is very feng shui, our logistics manager refuses to report problems, our newest hire is always tardy for the party. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[114,
        150],
       "assets/images/resized/0011/2511/112511v2-max-150x150.jpg"],
      [[190,
        250],
       "assets/images/resized/0011/2511/112511v2-max-250x250.jpg"],
      [[342,
        450],
       "assets/images/resized/0011/2511/112511v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}