{"name": "ScheduleGenius",
 "permalink": "schedulegenius",
 "crunchbase_url": "http://www.crunchbase.com/company/schedulegenius",
 "homepage_url": "http://www.schedulegenius.com",
 "blog_url": "http://schedulegenius.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "schedulegnenius",
 "category_code": "software",
 "number_of_employees": 8,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "beauty-directory, schedule, booking-application, spas-wellness, hair-salons, sport-center, trainers",
 "alias_list": null,
 "email_address": "dimitri@schedulegenius.com",
 "phone_number": "917 9820494",
 "description": "Beauty directory online scheduling",
 "created_at": "Thu Feb 14 20:30:15 UTC 2013",
 "updated_at": "Fri Feb 15 02:52:12 UTC 2013",
 "overview": "\u003Cp\u003EScheduleGenius, the new website designed by beauty industry professionals, is a combination of beauty directory, appointment management solution, social media and email marketing tool for the business owner as well as a search directory and online booking tool for the customer.\nWith ScheduleGenius, salons create a customized profile with a unique URL. Business information is listed including working hours, policies, facilities, contact info, promotions, services, stylists, and customer reviews. Next, the scheduling application provides a color coded daily and weekly calendar for managing recurring, double or split appointments.\u003C/p\u003E\n\n\u003Cp\u003EConvenient for the hair salon, spa, sports center or barber shop, ScheduleGenius allows staff to create a detailed customer database that stores a client\u0026#8217;s appointment history, spending habits, birthdays, notes, formulas, and allergies. Automatic email reminders, convenient for both parties, are sent instead of easily lost appointment cards or time-consuming confirmation calls. With social media and email marketing integration, businesses will build interaction, customer awareness, and sales.\u003C/p\u003E\n\n\u003Cp\u003EWashington, New York, Miami, San Francisco and Chicago are among the current available cities where clients can search for the downtown health club, the top-level hair salon or the yoga retreat. Users will find, choose, and book appointments with ScheduleGenius’ simple search tool.\u003C/p\u003E\n\n\u003Cp\u003EAbout ScheduleGenius \nScheduleGenius is a solution for many different service professionals. If your business provides services, classes or events, ScheduleGenius will definitely bring your business to a new level. Our team invites you to try a new application which improves the ways in which individuals schedule their time and connect with their customers. We know business can be complex, so we created ScheduleGenius to help simplify it.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       97],
      "assets/images/resized/0023/5976/235976v2-max-150x150.png"],
     [[184,
       119],
      "assets/images/resized/0023/5976/235976v2-max-250x250.png"],
     [[184,
       119],
      "assets/images/resized/0023/5976/235976v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}