{"name": "ScopiaRx",
 "permalink": "scopiarx",
 "crunchbase_url": "http://www.crunchbase.com/company/scopiarx",
 "homepage_url": "http://scopiarx.com",
 "blog_url": "http://polypharmacy.scopiarx.com",
 "blog_feed_url": "rss://polypharmacy.scopiarx.com",
 "twitter_username": "scopiarx",
 "category_code": "software",
 "number_of_employees": 6,
 "founded_year": 2008,
 "founded_month": 2,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "healthcare, medication-safety, saas, cloud",
 "alias_list": null,
 "email_address": "info@scopiarx.com",
 "phone_number": "513-247-6119",
 "description": "Personalized Medication Safety Software",
 "created_at": "Wed May 01 17:55:01 UTC 2013",
 "updated_at": "Mon May 06 06:31:23 UTC 2013",
 "overview": "\u003Cp\u003EAt ScopiaRx we make complex medication safety simple. Whether you take 5, 10, or 20 medications ScopiaRx helps you, your caregivers, and your providers make sure those treatments are safe for you.\u003C/p\u003E\n\n\u003Cp\u003EThe idea for ScopiaRx came to Dr. Jeffrey Huth while helping a family member manage her 12 different prescriptions. Like millions of patients, the number of her prescriptions kept creeping up to address new chronic conditions and symptoms. One day, a tipping point was reached, and she just did not feel well. \u003C/p\u003E\n\n\u003Cp\u003EJeff has a deep background in both the science and clinical considerations of medication safety. Despite this, it literally took him hours of work to look up all of the information for 12 medications and compare that to the specific traits of one patient. What he also discovered was that there are millions of case reports about side effects from people just like his family member, but that none of this information was at the finger tips of the doctors who were prescribing her medications. \u003C/p\u003E\n\n\u003Cp\u003EThe message was clear. Patients are routinely being prescribed 10, 15, and even 20 medications without a thorough evaluation of drug safety. Why is this happening? It is because physicians and pharmacists do not have the tools that would allow them to do this complicated risk evaluation in the short amount of time that they have with a patient. \u003C/p\u003E\n\n\u003Cp\u003EFor the next five years, Jeff developed a method to put all of this safety and clinical information together in such a way that a computer program could do what takes a trained clinician hours to accomplish. During his work in hospitals and clinics, he talked to fellow physicians and pharmacists about their struggles with drug safety management for complex cases. They discussed numerous product ideas and came up with the core features of ScopiaRx\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Jeffrey",
      "last_name": "Huth",
      "permalink": "jeffrey-huth",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "300 E Business Way",
    "address2": "Suite 200",
    "zip_code": "45241",
    "city": "Cincinnati",
    "state_code": "OH",
    "country_code": "USA",
    "latitude": 39.284707,
    "longitude": -84.367318}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}