{"name": "Scott Robarge Another 8",
 "permalink": "scott-robarge-another-8",
 "crunchbase_url": "http://www.crunchbase.com/company/scott-robarge-another-8",
 "homepage_url": "http://www.another8.com/",
 "blog_url": "http://www.scottrobarge.com/",
 "blog_feed_url": "http://www.scottrobarge.com/feed",
 "twitter_username": "scottrobarge",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 6,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "scott-robarge-merced, scott-robarge-louisville, scott-robarge-linkedin, scott-robarge-another8",
 "alias_list": null,
 "email_address": "scott.robarge1@gmail.com",
 "phone_number": "",
 "description": "Another8 Recruiting Consultancy",
 "created_at": "Sat Jul 28 17:50:53 UTC 2012",
 "updated_at": "Tue Jul 31 04:30:55 UTC 2012",
 "overview": "\u003Cp\u003EAnother8 is a Recruiting consultancy which partners with a variety of early to mid-stage technology companies helping them scale their organizations to meet current and long term talent acquisition goals.\u003C/p\u003E\n\n\u003Cp\u003EScott Robarge brings over 15 yrs of recruitment expertise from both an in-house and agency perspective, with over 12 years specifically focused on recruiting and building teams. Most recently Scott Robarge has been consulting with a variety of early to mid-stage technology companies, helping them scale their organizations through recruitment, establishing recruiting process and programs, as well as implementing recruiting technology. Previously, he was the Recruiting Operations and Technology Manager at salesforce.com where he defined, developed and deployed all recruiting process globally while product managing, configuring and administrating in-house recruiting solutions built on the Force.com platform. Additionally he was responsible for all global recruiter training on process and techniques, as it related to recruiting and sourcing technology and tools. Prior to the Operations role, Scott recruited and built a variety of key teams across the organization during a time of extreme growth for the company. Before joining salesforce.com, Scott co-founded Alpine Recruiting, a full-service boutique recruiting firm specializing in providing Technology, Sales and Marketing professionals for Fortune 500 and pre-IPO clients. In this role he was responsible for business development, recruiting, recruiting processes, employee development and training, system administration and operations. He received a degree in Industrial and Operations Engineering from the University of Michigan.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       71],
      "assets/images/resized/0020/3327/203327v2-max-150x150.jpg"],
     [[250,
       119],
      "assets/images/resized/0020/3327/203327v2-max-250x250.jpg"],
     [[256,
       122],
      "assets/images/resized/0020/3327/203327v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}