{"name": "ScrapMonster",
 "permalink": "scrapmonster",
 "crunchbase_url": "http://www.crunchbase.com/company/scrapmonster",
 "homepage_url": "http://www.scrapmonster.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 8,
 "founded_year": 2009,
 "founded_month": 7,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "scrap-metal, scrap-metal-prices, plastic-scrap, aluminum-scrap, scrap-steel-prices, scrap-copper, scrap-tire, scrap-metal-dealer, scrap-metal-buy-and-sell-offers, scrap-dealers",
 "alias_list": null,
 "email_address": "jasondell@hotmail.com",
 "phone_number": "",
 "description": "Global Scrap Marketplace",
 "created_at": "Wed Jan 20 03:09:55 UTC 2010",
 "updated_at": "Wed Jan 20 22:25:39 UTC 2010",
 "overview": "\u003Cp\u003EScrapMonster.com has been developed by Recycling professionals, with years of Research and experience.\u003C/p\u003E\n\n\u003Cp\u003ETheir mission is to provide accurate and updated recycling news, prices, and information to the industry, along with connecting Buyers and Sellers of local, national and Global markets. \u003C/p\u003E\n\n\u003Cp\u003ERecycling is a multi-billion dollar Industry, which depends on global supply and demand. Proving information for international Buyers and Sellers facilitates the communication, and creates new, more profitable business relationships for our members.\u003C/p\u003E\n\n\u003Cp\u003ETheir members provide business information, along with product listings, which are shared with thousands of other members and global visitors to our site. This is a powerful tool which is used by recycling companies to increase their presence in the local, national, and international markets. \u003C/p\u003E\n\n\u003Cp\u003EThe website features Daily Scrap News, Industry Articles, Real-Time commodity prices, listings from buyers and sellers of Scrap. \u003C/p\u003E\n\n\u003Cp\u003EFor a limited time, you can go to our website and register as a free member, add your company to their directory, and your product listings. Your free account will be upgraded to a Gold Membership (normally 100$ per year), at no cost to you. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       27],
      "assets/images/resized/0007/4015/74015v2-max-150x150.jpg"],
     [[250,
       45],
      "assets/images/resized/0007/4015/74015v2-max-250x250.jpg"],
     [[438,
       79],
      "assets/images/resized/0007/4015/74015v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}