{"name": "SCRUMstudy.com (A leading brand from VMEdu, Inc.)",
 "permalink": "scrumstudy-com-a-leading-brand-from-vmedu-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/scrumstudy-com-a-leading-brand-from-vmedu-inc",
 "homepage_url": "http://www.SCRUMstudy.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "SCRUMstudy_",
 "category_code": "education",
 "number_of_employees": 200,
 "founded_year": 2004,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "scrum-class, scrummaster, scrum-training, scrum-certification, agile-class, agile-training, agile-certification, pmi-acp",
 "alias_list": null,
 "email_address": "marketing@scrumstudy.com",
 "phone_number": "+1-855-677-2786",
 "description": "Scrum and Agile Training provider ",
 "created_at": "Tue Oct 16 07:22:55 UTC 2012",
 "updated_at": "Wed Dec 12 07:09:44 UTC 2012",
 "overview": "\u003Cp\u003E“SCRUMstudy, a brand of VMEdu, Inc., is well known for providing quality and effective training for Scrum and Agile. Like other training programs of VMEdu, Inc., Scrum and Agile training programs have become instantly popular amongst professionals desiring to make a career in product, project management and software development. SCRUM is the most widely adopted AGILE method for managing software projects and product or application development. Over the years Scrum and other Agile methods have become extremely popular as it promotes adaptive planning as opposed to traditional planning, evolutionary development and delivery, and encourages rapid and flexible response to change. Today, companies are using Scrum and other Agile frameworks not only in software production but also to produce financial products, internet products, medical products, and in almost all kinds of product development.” – says Tanya Ball, the company spokesperson.\nThe 2-day CSM and 3-day CAE programs are focused on providing hands on product development experience to the attendees.  The quality of study materials, the highly interactive and focused training methodology, and the unique proprietary course delivery model distinguish SCRUMstudy.com from other training providers.\nSCRUMstudy.com combines modern technology with innovative methods of course delivery to simplify Scrum/Agile concepts. Prepared and reviewed by Scrum/Agile Experts, SCRUMstudy.com provides the best course to make students Scrum/Agile experts.\n# # #\nBio\nSCRUMstudy.com is a leading global training provider specialises in conducting quality classroom training programmes for Agile and Scrum. SCRUMstudy is a brand of VMEdu, Inc. which also owns popular project management training brands like PMstudy , ITILstudy, PROJstudy. SCRUMstudy is located at VMEDU, Inc, 40 North Central Avenue, Suite 1400, Phoenix, AZ 85004 \nTo know more about in-person Scrum and Agile classroom courses visit www.SCRUMstudy.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "VMEdu, Inc",
    "address1": "40 North Central Avenue",
    "address2": "Suite 1400",
    "zip_code": "85004 ",
    "city": "Phoenix",
    "state_code": "AZ",
    "country_code": "USA",
    "latitude": 33.448935,
    "longitude": -112.074859}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.twitter.com",
    "title": "SCRUMstudy_"}]}