{"name": "Seat Hound",
 "permalink": "seat-hound",
 "crunchbase_url": "http://www.crunchbase.com/company/seat-hound",
 "homepage_url": "http://www.seathound.com/",
 "blog_url": "http://www.seathound.com/news/",
 "blog_feed_url": "http://www.seathound.com/news/feed/",
 "twitter_username": "seathound",
 "category_code": "search",
 "number_of_employees": 2,
 "founded_year": 2008,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "tickets, cheap-tickets, ticket-search, nfl-tickets, mlb-tickets, nba-tickets, nhl-tickets, concert-tickets",
 "alias_list": null,
 "email_address": "support@seathound.com",
 "phone_number": "",
 "description": "Searches web for the cheapest ticket",
 "created_at": "Wed Dec 31 21:13:57 UTC 2008",
 "updated_at": "Thu Sep 24 01:44:06 UTC 2009",
 "overview": "\u003Cp\u003ESeathound is not a ticket broker, rather Seathound exists to provide fans superlative ticket prices on all tickets for NFL, NHL, MLB, NBA, and NCAAF events, as well as tickets for concerts.\u003C/p\u003E\n\n\u003Cp\u003ESeathound gives registered members the ability to setup defaults so that they can get personalized ticket listings to the events they want to attend. Instead of having to search the Internet and to visit various ticket selling destinations consumers will find that Seathound is happy to present its members with an exclusive listing of all NFL, NHL, MLB, NBA, and NCAAF tickets and concert tickets at a single website for ease of discovery. Through Seathound, our registered members are empowered with the ability to shop comparatively for their favorite NFL tickets, NHL tickets, MLB tickets, NBA tickets, NCAAF tickets, and concert tickets without being concerned about inflated or exorbitant prices.\u003C/p\u003E\n\n\u003Cp\u003EThrough highly advanced AJAX technologies, Seathound makes it possible to find event tickets in one location, from a single website. We supply ticket buying consumers with comparative listings of all tickets so that the least expensive options can be pursued. While Seathound\u0026#8217;s primary focus in terms of ticket offerings are concentrated on NFL, NHL, MLB, NBA, and NCAAF tickets, as well as concert listings, in the future, we will be supplying our registered members with NASCAR ticket information, MMA ticket information, and Boxing tickets too. Our main aim is to become the single and only resource one will ever need to get great tickets at great prices to any and all events!\u003C/p\u003E\n\n\u003Cp\u003ESeatHound wants to help fans get the tickets they want for a reasonable price and we enable the ticket buying consumer by putting the consumer in control of the ticket buying process. At Seathound, our goal is to supply every member with outstanding, up-to-the-minute ticket offers so that our members never miss out on an extraordinary event. Seathound is a ticket search engine which is absolutely free to access and is super simplistic to use. Our superlative navigation system relies on advanced AJAX technologies so that our ticket directory is supremely simplistic to search for tickets with, no matter what types of tickets one is searching for. Through Seathound it is easy to find tickets for NFL, NHL, MLB, NBA, and NCAAF events as well as tickets for concerts, and users of Seathound can find fantastic prices for the tickets they seek!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0003/2953/32953v1-max-150x150.png"],
     [[250,
       51],
      "assets/images/resized/0003/2953/32953v1-max-250x250.png"],
     [[450,
       92],
      "assets/images/resized/0003/2953/32953v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "PAC 10 Football Tickets",
    "permalink": "pac-10-football-tickets",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Robert",
      "last_name": "Velton",
      "permalink": "robert-velton",
      "image": null}},
   {"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Daniel",
      "last_name": "Taylor",
      "permalink": "daniel-taylor",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Tickets",
    "is_past": false,
    "provider":
     {"name": "Razor Gator",
      "permalink": "razor-gator",
      "image": null}},
   {"title": "Tickets",
    "is_past": false,
    "provider":
     {"name": "Empire",
      "permalink": "empire",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "",
    "address2": "",
    "zip_code": "92805",
    "city": "Anaheim",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 33.8276052,
    "longitude": -117.9073244}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0003/6728/36728v2-max-150x150.png"],
      [[250,
        156],
       "assets/images/resized/0003/6728/36728v2-max-250x250.png"],
      [[250,
        156],
       "assets/images/resized/0003/6728/36728v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}