{"name": "Second May",
 "permalink": "second-may",
 "crunchbase_url": "http://www.crunchbase.com/company/second-may",
 "homepage_url": "http://www.secondmay.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Fashion Bags, Packaging Bags and General",
 "created_at": "Wed Apr 03 15:10:25 UTC 2013",
 "updated_at": "Wed Apr 03 19:02:03 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1998, we, \u0026#8216;Second May International\u0026#8217;, are a prominent manufacturer, supplier, wholesaler and exporter of Fashion Bags, Packaging Bags and General Bags. These are designed and developed by a skilled team of experts following guidelines and norms set up by the industry. Before the final delivery, all our products are stringently checked by quality inspecting team on several parameters to make sure their flawlessness.\u003C/p\u003E\n\n\u003Cp\u003EVision \u0026amp; Mission:\nOur mission is to become one of the largest exporters of textile and jute based bag and hammocks with a motto to provide total customer satisfaction.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have assisted by a team of proficient professionals for carrying out all the necessary tasks related to business process. The experts working with us hold vast experience and knowledge of this domain and they also utilize the same while for successful accomplishment of their assigned tasks.\u003C/p\u003E\n\n\u003Cp\u003ETrade Organizations:\nSince our inception, we have been engaged in offering the best-in-class products to our prestigious clients. Because of salient features such as durability, reliability and high performance, our products are very popular in the industry and are acclaimed by the clients on a large scale.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed a sprawling and well equipped infrastructure facility at our premise. Our infrastructure is divided into various sections to carry out all the entire operations in a proper manner. We have also hired highly qualified and experienced technical staff who are experts in supervision and offer products that adhere to strict standards of quality.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nBeing a client centric organization, our first priority is to provide our customers superior quality and best-in-class products. Our organization assures that our products matches the best quality standards. We value our expertise for designing and producing the premium quality products and are developed as per the customers specifications. \u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nDue to our quality oriented products, we have developed a large network of clientèle, that varies from large industrial groups to small dealers all across the globe. We have also participated in various reputed international fairs like Hong Kong Fair, Spoga, Frankfurt and Brimington Fair in order to express our credentials.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7392/247392v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7392/247392v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7392/247392v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}