{"name": "SecureLive",
 "permalink": "securelive",
 "crunchbase_url": "http://www.crunchbase.com/company/securelive",
 "homepage_url": "http://www.securelive.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "securelivellc",
 "category_code": "security",
 "number_of_employees": 16,
 "founded_year": 2008,
 "founded_month": 2,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "php, joomla, security, hack, antihack, hacker, realtime, real, time, prevention, dehack",
 "alias_list": null,
 "email_address": "sales@securelive.net",
 "phone_number": "(855) 759-3220",
 "description": "Patented Live Website Security",
 "created_at": "Sat Feb 05 12:15:10 UTC 2011",
 "updated_at": "Sat Feb 11 20:32:54 UTC 2012",
 "overview": "\u003Cp\u003ESecureLiveâ„¢ is a patented LIVE website hack protection service for your PHP server which monitors your websites 24/7 using the patented CSTâ„¢ (Continuous Scanning Technology), a Real-Time hacking detection system that stops criminals at the time/point of entry BEFORE any crime can be committed.\u003C/p\u003E\n\n\u003Cp\u003ESecureLive Server Edition PHP is designed for web hosting providers, web developers, or anyone with a custom built website.  Our Server Edition (SE) products are the choice of hosting companies and resellers because of how easily SecureLive can protect all the websites on a server.  Web developers love how customizable the security system is, and how it automatically attaches itself into any custom PHP website.  A single SE account can run on up to 4 servers, and keeps individual settings for each domain. \u003C/p\u003E\n\n\u003Cp\u003EThe truth is, when it comes to PHP server protection, no other security application or system can match the superiority and aggressive crime fighting abilities of SecureLiveâ„¢. SecureLiveâ„¢ is the world\u0026#8217;s first intelligent hacker-crime fighting machine. \u003C/p\u003E\n\n\u003Cp\u003EThe internet is still a wild frontier and protection is vital for the reputation and longevity of your business. Without tight security you are at risk. But trying to find tight security for your Joomla site can be daunting. Even though there are scores of security products out there, they simply do not work well enough to protect you from hundreds of thousands of different attack types that exist. With new threat types being born everyday, most of these products become ineffective overnight leaving you vulnerable and exposed. Weak or inadequate protection may lead to a false sense of security which will ultimately damage your REPUTATION, cause you loss of TIME and MONEY. What you need is a system that updates itself in Real-Time, is EFFECTIVE against all hack types, INEXPENSIVE to maintain and EASY TO USE, a company you can trust, a product that works and service you can depend on. That\u0026#8217;s why you need SecureLiveâ„¢!\u003C/p\u003E\n\n\u003Cp\u003EFor one low monthly price, SecureLiveâ„¢ will plug every security hole on your website or server. Never worry about keeping up on the latest hacks again. Say goodbye to never ending security patches and frequent updates because SecureLive updates itself dynamically. Stay current on the latest security threats without lifting a finger. Set it and forget it. Save TIME and MONEY and get on with your business.\u003C/p\u003E\n\n\u003Cp\u003EFor continued life online you need SecureLiveâ„¢\u0026#8230; your only lifeline! SecureLiveâ„¢ is EFFECTIVE, INEXPENSIVE AND EASY TO USE\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[90,
       98],
      "assets/images/resized/0014/6627/146627v2-max-150x150.jpg"],
     [[90,
       98],
      "assets/images/resized/0014/6627/146627v2-max-250x250.jpg"],
     [[90,
       98],
      "assets/images/resized/0014/6627/146627v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Jeff",
      "last_name": "Brown",
      "permalink": "jeff-brown-5",
      "image": null}},
   {"is_past": false,
    "title": "Managing Partner",
    "person":
     {"first_name": "Fred",
      "last_name": "Sarhadi",
      "permalink": "fred-sarhadi",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Ohio",
    "address1": "604 Tiffin Ave",
    "address2": "",
    "zip_code": "45840",
    "city": "Findlay",
    "state_code": "OH",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "New York",
    "address1": "Secured Location",
    "address2": "",
    "zip_code": "12533",
    "city": "Fishkill",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}