{"name": "Senscraft",
 "permalink": "senscraft",
 "crunchbase_url": "http://www.crunchbase.com/company/senscraft",
 "homepage_url": "http://www.senscraft.com",
 "blog_url": "http://www.senscraft.com/news",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": 6,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-retail, mobile-commerce, social-local-mobile, mobile-platform, local-search-advertising, local-search, solomo, so-lo-mo",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+447545453406",
 "description": "Mature mobile commerce platforms",
 "created_at": "Sun Dec 23 13:38:52 UTC 2012",
 "updated_at": "Sun Dec 30 04:38:49 UTC 2012",
 "overview": "\u003Cp\u003ESenscraft’s customers are local search advertising companies, for example, yellow pages and verticals; high volume online retail catalog businesses and department stores; and multi-national companies depending on bookings, such as hotels. \u003C/p\u003E\n\n\u003Cp\u003ESuccessful internet marketing is about attracting high volumes of traffic, fine-tuning calls-to-action, and optimising conversions. This naturally will require numerous, ongoing modifications to websites and apps, and will include editing of content, redesign of page layouts, introduction of new features, and more. If not carefully architected, software development costs needed to support these activities can skyrocket, limiting marketing’s ability to iterate, hampering speed to market, and affecting profitability.\u003C/p\u003E\n\n\u003Cp\u003EThis problem is exacerbated for the mobile internet because so many more devices and operating systems need to be supported. Today’s mobile landscape includes apps for iPhones, iPads, Android phones, Windows phones, and a broad array of tablets. It also includes a complex collection of mobile web browser environments, running the gamut from xHTML to HTML5. Scaling and optimising over all these presentational environments is challenging, and can become daunting when supporting multiple countries.\u003C/p\u003E\n\n\u003Cp\u003ETo date, mobile development companies have focused on apps and browse services on a piecewise basis, but as companies such as Amazon, eBay, and Google have now demonstrated, this is not enough to be competitive. These internet commerce companies have highly scalable and maintainable mobile platforms, and thanks to these, they have been successful at generating multi-billion dollar annual revenues through their mobile channels. Most companies, however, do not have the development resources of an Amazon or eBay.\u003C/p\u003E\n\n\u003Cp\u003EThis is where the Senscraft mature mobile platform can help.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to assist companies in search-advertising and internet retail to springboard into mobile by providing a fully mature mobile marketing platform. Senscraft provides a complete set of tools to cost effectively undertake the day-to-day needs of marketing in this channel. This includes fine-grain analytics so the marketer can measure and understand traffic. It includes A/B testing infrastructure needed to optimize conversions. It has a modular architecture supporting rapid development and speed to market, and an app framework accelerating deployment over the full portfolio of mobile apps and services.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to its scalability, the Senscraft platform incorporates essential internet marketing capabilities: it is optimised for SEO, offers rich features for the collection of user-generated content, and seamlessly integrates with social media networks.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       107],
      "assets/images/resized/0022/6740/226740v2-max-150x150.png"],
     [[214,
       153],
      "assets/images/resized/0022/6740/226740v2-max-250x250.png"],
     [[214,
       153],
      "assets/images/resized/0022/6740/226740v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO and Founder",
    "person":
     {"first_name": "Carey",
      "last_name": "Bunks",
      "permalink": "carey-bunks-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [{"description": "Senscraft is named Mobile Business of the Year",
    "stoned_year": 2012,
    "stoned_month": 12,
    "stoned_day": 7,
    "source_url": "http://www.senscraft.com/senscraft-wins-mobile-business-year-award/",
    "source_text": null,
    "source_description": "Senscraft Wins Mobile Business of the Year Award ",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Senscraft",
      "permalink": "senscraft"}},
   {"description": "De Telefoongids in the Netherlands was recognised by the European Association of Directory Publishers (EASDP) for the excellence of their Mobile Directory Publishing Platform, built by Senscraft.  The EASDP is the pre-eminent industry organisation represe",
    "stoned_year": 2012,
    "stoned_month": 9,
    "stoned_day": 21,
    "source_url": "http://www.senscraft.com/european-awards-2012/",
    "source_text": null,
    "source_description": "EASDP Recognises Mobile Marketing Platform Built by Senscraft",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Senscraft",
      "permalink": "senscraft"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        98],
       "assets/images/resized/0022/7348/227348v2-max-150x150.png"],
      [[250,
        164],
       "assets/images/resized/0022/7348/227348v2-max-250x250.png"],
      [[450,
        295],
       "assets/images/resized/0022/7348/227348v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}