{"name": "Sentinel Infotech",
 "permalink": "sentinel-infotech",
 "crunchbase_url": "http://www.crunchbase.com/company/sentinel-infotech",
 "homepage_url": "http://www.sentinelinfotech.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sentinelinfotec",
 "category_code": "software",
 "number_of_employees": 20,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design-company, web-development-company, affordable-seo-services, top-website-development-company, seo-company, it-outsourcing-services",
 "alias_list": null,
 "email_address": "info@sentinelinfotech.com",
 "phone_number": "0281 2360 254",
 "description": "Professional Website Development Company",
 "created_at": "Tue Apr 02 05:11:51 UTC 2013",
 "updated_at": "Wed Apr 03 17:16:39 UTC 2013",
 "overview": "\u003Cp\u003ESentinel Infotech is a web development company based in India, which delivers reliable, good quality, result-oriented, cost effective web designing, web development and SEO solutions on time for a clientele, which is spread all across the globe. Expertise, skill, and professionalism are the various tools that we make use of to ensure that the web really works for your business, which helps to bring in maximum profit on your investment in the smallest time possible.\u003C/p\u003E\n\n\u003Cp\u003Ewe have an extremely talented and capable team consisting of programmers, web consultants, content writers, and creative designers who know the way to deliver top quality results. While we have the skills and competency, which is at par with the best in the whole world\u003C/p\u003E\n\n\u003Cp\u003EReasons To Select Us?\u003C/p\u003E\n\n\u003Cp\u003ELow Cost\nWe endeavor to provide you with top quality work at low cost. With the help of modern communication technologies and highly skilled and experienced professionals, we deliver you only the best web design, web development, and SEO work. It is a sure cost benefit for you to outsource all kinds of your web development work to us. \u003C/p\u003E\n\n\u003Cp\u003EHigh Quality\nOur tools include knowledge, competence, and talent, which convert into delivering high quality work at each step for any project that we undertake. Each team member at Sentinel Infotech. makes effort to give better than the best, which means when you hire us, good quality work is assured.\u003C/p\u003E\n\n\u003Cp\u003EExcellent Communication\nBusiness analysts and project managers working in Sentinel Infotech place great importance for building with you an excellent communication link, since they believe it is the vital factor for the success of a project. Not only are these members IT professionals but also have good communication skills, which are much required for the successful completion of your project. Whatever you converse during the course of constructing your project, they are acknowledged for taking into consideration every detail by taking it on board, deliberating, and replying within the specified time. \u003C/p\u003E\n\n\u003Cp\u003EFocus\nWe specialize in web design, web development, and SEO services. We remain focused and devoted to these capabilities and at the same time, continuously endeavor to build and improve skills of each member of our team. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7088/247088v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7088/247088v2-max-250x250.jpg"],
     [[300,
       300],
      "assets/images/resized/0024/7088/247088v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Chief Software Architect",
    "person":
     {"first_name": "Andrew",
      "last_name": "Wharton",
      "permalink": "andrew-wharton",
      "image":
       {"available_sizes":
         [[[100,
            150],
           "assets/images/resized/0026/7142/267142v1-max-150x150.jpg"],
          [[120,
            180],
           "assets/images/resized/0026/7142/267142v1-max-250x250.jpg"],
          [[120,
            180],
           "assets/images/resized/0026/7142/267142v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}