{"name": "SEO Marketing Directory",
 "permalink": "seo-marketing-directory",
 "crunchbase_url": "http://www.crunchbase.com/company/seo-marketing-directory",
 "homepage_url": "http://www.seobul.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "SeoBul_com",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 1969,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo, seo-company, seo-companies, seo-tools, internet-marketing, social-media-marketing, sem",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Online Marketing Seo Companies \u0026 Tools",
 "created_at": "Fri Oct 26 00:00:37 UTC 2012",
 "updated_at": "Wed Dec 12 02:16:23 UTC 2012",
 "overview": "\u003Cp\u003ESince its introduction in 2013, seobul.com has been identified as an independent authority on vendors who supply internet marketing products and services   Our mission is to offer comprehensive and independent advice to assist buyers in making purchasing decisions from internet marketing vendors.\u003C/p\u003E\n\n\u003Cp\u003EWe pride ourselves on a disciplined research process that has us regularly engaged with the companies we evaluate. Our proprietary analysis tools and methodology, developed over multiple years, includes an extensive rigorous evaluation rating system that is applied to each company that is identified and researched.  We gather information about products and services, about consumer demand in the marketplace, monitor industry-wide trends, exhibit and meet countless firms at industry tradeshows, and often times even visit firms that are evaluated.\u003C/p\u003E\n\n\u003Cp\u003ETime is spent gathering information from a number of clients of internet marketing services to supplement our direct testing of information provided by and of internet marketing providers and professionals. We gather the experiences of users of internet marketing tools and of the services provided to clients through our extensive referral questionnaire as well as talking directly to clients to receive their informed opinion. Using scientifically valid research methods, the research team then scrutinizes that material during our evaluation process.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       34],
      "assets/images/resized/0021/7291/217291v2-max-150x150.jpg"],
     [[194,
       45],
      "assets/images/resized/0021/7291/217291v2-max-250x250.jpg"],
     [[194,
       45],
      "assets/images/resized/0021/7291/217291v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.homesolution.com",
    "title": "furniture"}]}