{"name": "SEO Hawk",
 "permalink": "seo-hawk",
 "crunchbase_url": "http://www.crunchbase.com/company/seo-hawk",
 "homepage_url": "http://www.seohawk.com",
 "blog_url": "http://www.seohawk.com/blog",
 "blog_feed_url": "http://www.seohawk.com/blog/feed/",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": 60,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-marketing, website-marketing, seo-promotion, seo-company, seo-services",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "A Search Engine Optimization Company",
 "created_at": "Mon Sep 21 19:35:03 UTC 2009",
 "updated_at": "Mon Sep 21 21:31:36 UTC 2009",
 "overview": "\u003Cp\u003EWebsite optimization is the latest internet marketing tool that can help your website to generate more clicks and visitors. You might be having a a very helpful website, but if you are not reaching out to the search engine users then you are missing out something crucial.  \u003C/p\u003E\n\n\u003Cp\u003EUsing various SEO strategies you can provide your website a  horizon by reaching out to a wider audience over the internet. You can choose to promote your website on natural search results , paid search or both. Gaining Top ranking on natural rankings will prove more beneficial since you don\u0026#8217;t have to pay anything to search engines to market your website on top pages of search results. Website internet marketing is a continuous process and you need to make SEO optimization as part of your internet marketing strategy.\u003C/p\u003E\n\n\u003Cp\u003EThere are various kinds of SEO services companies that offer complete website design,,development and Search Engine Optimization at a very economical rates from US, UK, Canada and Australia. You can avail services of any such SEO companies that have has expertize in SEO promotion and Marketing. These SEO firms will help you promote your business website online on various search engines. \u003C/p\u003E\n\n\u003Cp\u003ESEO Hawk provides offshore website marketing and SEO services to our clients in US, UK, Canada and Australia. We use a wide variety of website marketing and SEO promotion techniques to deliver Top SEO Rankings for our clients. Our economical and affordable SEO services have been availed by various clients. Search engine optimization and SEO marketing are two basic techniques used in web promotion.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0006/0358/60358v2-max-150x150.jpg"],
     [[150,
       50],
      "assets/images/resized/0006/0358/60358v2-max-250x250.jpg"],
     [[150,
       50],
      "assets/images/resized/0006/0358/60358v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.seohawk.com/seo_services",
    "title": "SEO SErvices"}]}