{"name": "SEO Corporation PVT LTD",
 "permalink": "seo-corporation-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/seo-corporation-pvt-ltd",
 "homepage_url": "http://www.seocorporation.net/",
 "blog_url": "http://www.seocorporation.net/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 100,
 "founded_year": 2009,
 "founded_month": 2,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-corporation",
 "alias_list": null,
 "email_address": "info@seocorporation.net",
 "phone_number": "+91 - 750 3341 387",
 "description": "You can get your website to the top or g",
 "created_at": "Fri Apr 05 09:13:09 UTC 2013",
 "updated_at": "Fri Apr 05 09:13:26 UTC 2013",
 "overview": "\u003Cp\u003ENew Delhi, Mar 5, 2013:  SEO Corporation, one of the leading digital marketing companies in the country announced that it now offers attractive and cost friendly link building packages to clients.  These packages are priced according to the activities being provided and give clients the freedom to choose a package that meets their requirements in the most economical way possible.  The link building packages are priced at $250 for 18 links, $500 for 37 links, $750 for 55 links and $1000 for 74 links. \nExplaining the benefits of these packages, Mr. Vishal Vivek, CBO, SEO Corporations, says, “Being one of the top SEO Company we try our best to give our clients complete flexibility to choose our services in a manner that fits their budget and at the same time meet all their business requirements. The fixed link building packages that we offer are designed with the purpose of giving clients a clear set of deliverables expediting the order process at the same time giving them a complete idea of what they are paying for.\nSEO Corporation is amongst the most popular SEO Company India and offers a complete range of services in the realm of internet marketing.  The company provides search engine optimization services, social media marketing service, pay per click services, link building services, web design and development services, video SEO services and banner and email campaigns.  Apart from the flexible link building packages they also offer packages for SEO, Social Media Optimization and PPC.\nMr. Vivek further says, “We work hard to give our clients a service experience that is not just economical but also very convenient.  We know that time is money for our clients and our fixed plans make choice of services very timely for them. Customer satisfaction is our motto and we always work hard to work on it. \nTo know more about visit http://www.seocorporation.net/\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}