{"name": "Serbags",
 "permalink": "serbags",
 "crunchbase_url": "http://www.crunchbase.com/company/serbags",
 "homepage_url": "http://www.serbags.com",
 "blog_url": "http://blog.serbags.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "messenger-bags, canvas-messenger-bags",
 "alias_list": null,
 "email_address": "support@serbags.com",
 "phone_number": "(714) 941-0616",
 "description": "Canvas Messenger Bags",
 "created_at": "Mon Nov 12 05:55:18 UTC 2012",
 "updated_at": "Wed Dec 12 07:40:21 UTC 2012",
 "overview": "\u003Cp\u003EThere are a number of people all over the world, searching for the right canvas messenger bag. At Serbags.com, you can find the best selection of canvas messenger bags at very affordable prices. They have an extensive collection of bags for both men and women.\u003C/p\u003E\n\n\u003Cp\u003ENo one wants to spend hours viewing different sites or drive all over time, just to find the perfect canvas messenger bag. To take the frustration out of the search, now they can go to Serbags.com. They have the latest trends in stock at their online store. They even carry vintage styles, so visit their store online and you will find the right canvas messenger bag right now.\u003C/p\u003E\n\n\u003Cp\u003ESerbags.com has a variety of colors and styles to select from. If it is a formal or casual canvas messenger bag that you are in the market for; you will find it at their online store. They have bags in a range of sizes that are very durable. The bags are great for carrying books, laptops, everyday personal items and so much more. You can choose from a large assortment of designs, with different patterns and even solid colors.\u003C/p\u003E\n\n\u003Cp\u003EIn 2012, Serbags.com launched an E-commerce website online. Since their inception, they have made their mark in the canvas messenger bag industry. There has been a steady increase in their customer base, chiefly do to their exceptional products and advanced level of service. With fashion changing rapidly, affordability is important. You can rely on their products to stand out among the rest. Visit Serbags.com today for the best canvas messenger bags and take advantage of the current specials.\u003C/p\u003E\n\n\u003Cp\u003EYou can shop conveniently online at Serbags.com from the comfort of your home. Your canvas messenger bag is ready to be shipped locally in Southern California. They also ship to Canada, Puerto Rico, and anywhere in the U.S. After receiving the order, the product is shipped in two business days. Serbags.com has several canvas messenger bags online; browse their inventory today for your new canvas messenger bag. They guarantee you that you will find a quality product and excellent service.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "eBags.com",
      "permalink": "ebags-com",
      "image":
       {"available_sizes":
         [[[120,
            33],
           "assets/images/resized/0015/8988/158988v2-max-150x150.png"],
          [[120,
            33],
           "assets/images/resized/0015/8988/158988v2-max-250x250.png"],
          [[120,
            33],
           "assets/images/resized/0015/8988/158988v2-max-450x450.png"]],
        "attribution": null}}},
   {"competitor":
     {"name": "timbuk2.com",
      "permalink": "timbuk2-com",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Southern California",
    "address1": "13112 SIRIUS AVE",
    "address2": "",
    "zip_code": "92868",
    "city": "Orange",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 33.790829,
    "longitude": -117.90418}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.serbags.com/pages/about-us",
    "title": "Serbags"}]}