{"name": "SetOption",
 "permalink": "setoption",
 "crunchbase_url": "http://www.crunchbase.com/company/setoption",
 "homepage_url": "http://www.setoption.com",
 "blog_url": "http://www.setoptions.com",
 "blog_feed_url": "http://www.setoptions.com/feed/",
 "twitter_username": "setoption",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "binary-options, binar-options-trading, forex, forex-trading, binary-options-trading-platform",
 "alias_list": null,
 "email_address": "support@setoption.com",
 "phone_number": "+41225180482",
 "description": "Binary Options Trading Platform",
 "created_at": "Sun Mar 17 13:57:04 UTC 2013",
 "updated_at": "Sun Mar 17 13:57:13 UTC 2013",
 "overview": "\u003Cp\u003ESetOption is one of the most innovate global binary options trading platforms. We conduct our business in numerous global regions with a team of financial experts. You can trade all your favorite assets such as currency pairs, stocks, commodities and indices for you to choose from. We also offer the fastest profits withdrawal system with minimum hassle along with risk management. \u003C/p\u003E\n\n\u003Cp\u003EWith SetOption Corporation you can sell back your options any time you want.  You have the unique opportunity to profit irrespective of whether the market goes up or down. Moreover, we provide 24 hour live professional support. Our vision is to offer all traders around the world with the most profitable binary options platform. We have gained the necessary expertise to know what makes a platform profitable. SetOption Corporation is determined to be the leader of the industry. \u003C/p\u003E\n\n\u003Cp\u003EMost professional and objective platform\u003C/p\u003E\n\n\u003Cp\u003EThe technology used in SetOption is efficient, innovative, user-friendly one, all of which goes to make it to the most professional and objective platform. We constantly provide our clients with fresh new and exciting features. Consequently, we have become the trend setters with features that make the traders come back again for more. No other binary options trading platform can equal SetOption Corporation in its professionalism. On our platform a trader can get access to all the markets easily. \u003C/p\u003E\n\n\u003Cp\u003ESetOption give you a high return on your investment at low risk as we take all the precaution to make our trading platform as secure as possible, so that your finances and privacy are fully protected. We use the internationally accepted security system SSL (known as Secure Sockets Layer) that encrypts all credit card payments over the internet.\u003C/p\u003E\n\n\u003Cp\u003EWide array of assets to choose from\u003C/p\u003E\n\n\u003Cp\u003ESetOption Corporation offers an unparalleled range of trading options on international financial assets. Our wide array of assets of different trading markets includes stocks, indices, commodities, and currencies, which goes to makes it an exceptional online trading platform.\u003C/p\u003E\n\n\u003Cp\u003EUnique features and tools\u003C/p\u003E\n\n\u003Cp\u003EThe SetOption Corporation platform has been developed for providing the finest trading interface for binary options, offering the largest range of financial instruments and assets. We have also developed a chain of advanced pricing algorithms for providing the technology to power an unparalleled range of financial instruments. With SetOption combined with its user friendly interface, binary options trading becomes simple and enjoyable.\u003C/p\u003E\n\n\u003Cp\u003ESetOption offers unique features and tools, which are Boundary/No Boundary, One touch/No touch, and High/Low option which will help you to gain the maximum profits from your investment. \u003C/p\u003E\n\n\u003Cp\u003EUser-friendly, simple to understand\u003C/p\u003E\n\n\u003Cp\u003ESetOption is a user-friendly and simple to understand binary options trading website. It has many features and tools which make trading on this website easy and smooth. \u003C/p\u003E\n\n\u003Cp\u003EWeb-based, no download necessary\u003C/p\u003E\n\n\u003Cp\u003EAll the trading is 100% web-based and no download of any software is necessary for conducting trading from our website.\nDedicated account managers, live help SetOption Corporation has a team of dedicated account managers who are available round the clock to assist you, for any help related to trading and your account. We offer live help to our clients through telephone or the chat button available on our website. We also have expert analysts who provide daily and weekly reviews of the market, to help you make the most educated trades. \u003C/p\u003E\n\n\u003Cp\u003EEasy profit withdrawal\u003C/p\u003E\n\n\u003Cp\u003ESetOption has an easy profit withdrawal method as per its terms and conditions. All you have to do is to log in into your account and make a withdrawal request.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       60],
      "assets/images/resized/0024/3018/243018v2-max-150x150.jpg"],
     [[250,
       100],
      "assets/images/resized/0024/3018/243018v2-max-250x250.jpg"],
     [[337,
       135],
      "assets/images/resized/0024/3018/243018v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.setoption.com",
    "title": "Binary Options Trading"}]}