{"name": "SETPLEX",
 "permalink": "setplex",
 "crunchbase_url": "http://www.crunchbase.com/company/setplex",
 "homepage_url": "http://www.setplex.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "iptv, iptv-solutions-providers, iptv-encoder, iptv-streamer, iptv-middleware, iptv-stb, iptv-video-on-demand, iptv-time-shift",
 "alias_list": null,
 "email_address": "sales@setplex.com",
 "phone_number": "718 514 2174",
 "description": "IPTV Solutions Providers",
 "created_at": "Sat Dec 22 20:12:11 UTC 2012",
 "updated_at": "Sun Dec 23 06:24:48 UTC 2012",
 "overview": "\u003Cp\u003ESetPlex offers you the chance to become a world leader in broadcasting with the best content, unlimited audience and the most high-tech systems available. Provide streaming media and VOD solutions through top-of-the-range equipment and infrastructure. Stand out with your specially branded player with your own company colours and design – deliver your message to the global market. \u003C/p\u003E\n\n\u003Cp\u003ESetplex offers you IPTV Solutions for TV, Mobile \u0026amp; Web.\u003C/p\u003E\n\n\u003Cp\u003EThe Best Content \u003C/p\u003E\n\n\u003Cp\u003EInternet TV is more than just connecting a PC and television together. SetPlex has incorporated the whole television experience with the modern day platform, combining state-of-the-art technology with the traditional TV feel. We keep the subscribers on familiar ground in terms of channel lists, program guides and menu formats; giving them an amplified version of the TV they are used to, rather than a more complicated one. Through a simple interface the end user can broaden their horizons with thousands of hours of extra content. This certainly comes in handy when you can flick through the normal available channels at any given time and find there is literally nothing to watch, or at least nothing that suits your particular taste.\u003C/p\u003E\n\n\u003Cp\u003ESetPlex provides greater viewing pleasure for subscribers, allowing them to watch programs they would normally miss out on, such as sporting events that would normally be shown either too early in the morning or too late at night for the user to watch (eg title fight boxing, F1 Championship Racing). Even satellite and cable customers will find some programs are “off-limits”, being shown on certain channels to which they don’t have access. SetPlex removes that aspect of limitation from the television experience whilst opening the doors to a whole series of channels the user never even knew existed.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       40],
      "assets/images/resized/0022/6711/226711v2-max-150x150.jpg"],
     [[217,
       59],
      "assets/images/resized/0022/6711/226711v2-max-250x250.jpg"],
     [[217,
       59],
      "assets/images/resized/0022/6711/226711v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}