{"name": "Sgrouples",
 "permalink": "sgrouples",
 "crunchbase_url": "http://www.crunchbase.com/company/sgrouples",
 "homepage_url": "https://sgrouples.com/",
 "blog_url": "http://blog.sgrouples.com/",
 "blog_feed_url": "http://blog.sgrouples.com/feed/",
 "twitter_username": "sgrouples",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 6,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-privacy, social-media, privacy, intranet, sgrouples, sgrouples-com, mark-weinstein, future-of-social-networks, tracking-cookies, tracking-information, data-scraping, facebook-privacy-issues, digital-trail, privacy-bill-of-rights, social-networking-",
 "alias_list": null,
 "email_address": "mark@sgrouples.com",
 "phone_number": "408-530-9092",
 "description": "Privacy-Centric Social Platform",
 "created_at": "Mon Jul 16 23:56:24 UTC 2012",
 "updated_at": "Wed Apr 24 11:01:40 UTC 2013",
 "overview": "\u003Cp\u003EPRACTICE SAFE SHARING\u003C/p\u003E\n\n\u003Cp\u003ESgrouples is the privacy-centric, all-in-one social network of the future that lets individuals connect and share with the people and communities they know in real life. Our premise is simple: We provide our users with the world’s most powerful social experience and the peace-of-mind of our Privacy Bill of Rights. \u003C/p\u003E\n\n\u003Cp\u003ESgrouples is Different Because It:\u003C/p\u003E\n\n\u003Cp\u003E• Lets each user decide exactly what they want to share and with whom.  Users can post directly to their feed, or share with specific groups, and even DM individuals or groups.\u003C/p\u003E\n\n\u003Cp\u003E• Never sells or track user information or web habits.\u003C/p\u003E\n\n\u003Cp\u003E• Offers safe cloud storage (similar to Dropbox) for user’s pictures, videos and files.\u003C/p\u003E\n\n\u003Cp\u003E• Offers user-created groups that can be around anything, common interests, sports teams, parent groups, and each group creator has powerful admin tools so they can control exactly who has access to view and edit information.\u003C/p\u003E\n\n\u003Cp\u003E• Offers users a private event calendar and the option of creating group calendars.\u003C/p\u003E\n\n\u003Cp\u003E• Gives users the option of connecting to their existing social networks to connect with their friends who have not yet discovered Sgrouples.\u003C/p\u003E\n\n\u003Cp\u003EHow will Sgrouples make money?\u003C/p\u003E\n\n\u003Cp\u003ESgrouples does not believe in spying, scraping and selling customer data, instead it plans on making money the same way offline companies have always made money; by offering services that people actually want.\u003C/p\u003E\n\n\u003Cp\u003EHere are some of the paid services Sgrouples plans to offer:\n• Data Storage\n• Photo Finishing\n• No Ads\n• App Store (with specific group apps)\n• White Label “Intranet” Groups for Enterprise\u003C/p\u003E\n\n\u003Cp\u003ESgrouples keeps it simple, revolutionary, and intuitive. Create private groups to share selectively with the different people in your life.  Or, with one click, share one-to-one or one-to-many with your Contacts through private messages. Share simultaneously with your other social networks through our central hub. You can even store, share and print photos or create and collaborate on documents. Store everything in your free, private cloud! Plan events. Have great discussions.  It is natural, integrated, easy. Sgrouples is the Web 3.0 of social media.\u003C/p\u003E\n\n\u003Cp\u003EAt Sgrouples, you own your content. Your personal information is private and is yours; it’s not our business. There is absolutely no spying, no tracking cookies, and no stalking in our site. Permissions and privacy are your rights, we make it easy for you to allow or deny access to any content you post. Advertising is non-invasive and optional.\nPractice Safe Sharing! It’s simple. Your Real Life. Online.\u003C/p\u003E\n\n\u003Cp\u003ESgrouples is about keeping it real. In real life you don’t have a thousand friends, and you don’t talk in 140 characters. You don’t interact with your family the same way you do with your friends, and you don’t share the same things with your fraternity or sorority that you do with your co-workers.\nWe connect you to your real relationships in the real world. You really may have a thousand or more contacts, and you want to control who sees what and how you interact with those different people. \u003C/p\u003E\n\n\u003Cp\u003EAt Sgrouples, invite your friends, family, and everyone in your life to become your Contacts and then share what you want with exactly who you want, just like in real life. It’s social media for the real world.\u003C/p\u003E\n\n\u003Cp\u003EEnjoy. Be real. Welcome home.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[128,
       128],
      "assets/images/resized/0020/1311/201311v2-max-150x150.jpg"],
     [[128,
       128],
      "assets/images/resized/0020/1311/201311v2-max-250x250.jpg"],
     [[128,
       128],
      "assets/images/resized/0020/1311/201311v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Company Headquarters",
    "address1": "85 Paul Avenue",
    "address2": "",
    "zip_code": "94041",
    "city": "Mountain View",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe src=\"http://player.vimeo.com/video/46041594?title=0\u0026amp;byline=0\" width=\"430\" height=\"242\" frameborder=\"0\" webkitAllowFullScreen mozallowfullscreen allowFullScreen\u003E\u003C/iframe\u003E \u003Cp\u003E\u003Ca href=\"http://vimeo.com/46041594\"\u003EJoin The Online Privacy Revolution\u003C/a\u003E from \u003Ca href=\"http://vimeo.com/sgrouples\"\u003Esgrouples\u003C/a\u003E on \u003Ca href=\"http://vimeo.com\"\u003EVimeo\u003C/a\u003E.\u003C/p\u003E",
    "description": "\u003Cp\u003EThe Privacy Revolution\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/Sgrouples",
    "title": "Sgrouples on Facebook"},
   {"external_url": "http://www.linkedin.com/company/sgrouples",
    "title": "Visit us on LinkedIn"},
   {"external_url": "http://sgrouples.tumblr.com/",
    "title": "Sgrouples | Tumblr"}]}