{"name": "ShaadiMagic.com",
 "permalink": "shaadimagic-com",
 "crunchbase_url": "http://www.crunchbase.com/company/shaadimagic-com",
 "homepage_url": "http://shaadimagic.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "shaadimagic",
 "category_code": "web",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "wedding-planning, shaadi, shaadi-vendors, wedding-planning-market-place",
 "alias_list": null,
 "email_address": "info@shaadimagic.com",
 "phone_number": "9820259942",
 "description": "Shaadimagic.com is a portal which aims t",
 "created_at": "Thu Nov 15 09:47:51 UTC 2012",
 "updated_at": "Wed Nov 21 08:44:27 UTC 2012",
 "overview": "\u003Cp\u003EWedding planning is always a fun and dream for all since childhood (especially girls). Though wedding being such an elaborate task, it becomes very difficult without a guiding hand. There were times when all the relatives (Mamas, Chachas and cousins) share the responsibility to organize a wedding and make sure that all the guests remain happy with the arrangements.\u003C/p\u003E\n\n\u003Cp\u003EBut in today\u0026#8217;s world of nuclear family and busy corporate life, people look for value for money services on a single click without much of an effort. Here comes a role of one of its kind wedding planning portal shaadimagic.com, which rescues families from the woes of wedding planning by providing all the information such as ideas and suggestions, wedding trends, beauty tips, honeymoon guide, nearby rated and reviewed vendors, planning tools, online shopping facility etc at same place. \u003C/p\u003E\n\n\u003Cp\u003EShaadimagic.com is a portal which aims to be a complete one-stop shop for all wedding needs\u003C/p\u003E\n\n\u003Cp\u003EOnline Wedding Planning magazine\u003C/p\u003E\n\n\u003Cp\u003ESearch Engine for the rated and reviewed wedding vendors\u003C/p\u003E\n\n\u003Cp\u003EBridges the gap between buyers and sellers\u003C/p\u003E\n\n\u003Cp\u003EAlso going to offer more services in due course of time.\u003C/p\u003E\n\n\u003Cp\u003EIt is a boon for interstate marriages for instance if a Jaipur girl is marrying a Delhi boy, her family need not to ask boy’s family or friends to get the best value for money deals, they can simply click at shaadimagic.com for all the information. It has more than 25 categories listed under wedding vendors that includes Jewellery, Wedding Wear, home decor and even a Ghoriwalla. Now, there is no need to run around for all the vendors from markets to markets, they can simply check the trends at shaadimagic.com and contact that perfect vendors list at any hour of the day and plan their wedding by their own way. Shaadimagic is building its wedding vendors base and it would serve all the metropolitan cities soon.\u003C/p\u003E\n\n\u003Cp\u003EIt would not only help the 10 million plus users of matrimonial sites but also their family members who play a crucial part in wedding planning. And with the average age of Indian projected to be 29 years in 2020 and 400 million marriages would happen in India in next 15 years, shaadimagic.com  will rescue even more number of families from the woes of wedding planning in coming years.\u003C/p\u003E\n\n\u003Cp\u003EIn brief, Shaadi Magic will make wedding planning a smooth experience and offer our services to help you create magic at your wedding so that you proudly say its \u0026#8220;My Shaadi My Way\u0026#8221;\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/0486/220486v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0022/0486/220486v2-max-250x250.jpg"],
     [[300,
       300],
      "assets/images/resized/0022/0486/220486v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}