{"name": "Shanti International",
 "permalink": "shanti-international",
 "crunchbase_url": "http://www.crunchbase.com/company/shanti-international",
 "homepage_url": "http://www.indiamart.com/shantiinternational/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shantiinternational@tradepassport.org",
 "phone_number": "09953358984",
 "description": "manufacture, supply and trade",
 "created_at": "Thu Apr 04 15:50:44 UTC 2013",
 "updated_at": "Thu Apr 04 15:50:47 UTC 2013",
 "overview": "\u003Cp\u003EShanti International was incorporated in 2008 as Sole Proprietorship firm, that is engaged in manufacturing, trading and supplying an extensive range of Industrial Screws, Industrial Bolts, Machine Nuts, Studs \u0026amp; Threaded Rods, Industrial Washers, Grub Screws, Anchor Bolts, Top Link Pins and Copper Washers. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur organization is supported by well-segmented manufacturing facility that assists us to manufacture the entire product range as per quality standards. Our facility is supervised by experienced professionals who keep a vigil eye on the entire production process and deliver flawless range of products to our clients. From the initial designing stage to the final delivery stage entire operations are done on single facility.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur organization is supported by experienced and assiduous professionals who manufacture the entire product range using best available resources in the industry. Our teammates work in close proximity with each other to deliver flawless range of products to our discerning clients. Our team includes experienced technical experts, quality controllers, procurement agents, production engineers, R\u0026amp;D personnel, sales \u0026amp; marketing and other personnel. Their commitment and dedication had assisted us to serve the clients in best possible manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Valued Clientele:\nWith the assistance of quality assured product range, we are able cater diverse requirements of the clients in the national market. Owing to our strong logistics department, we are able to deliver entire product range in well-defined time frame. Our clients are considers as the assets of our company therefore we put our meticulous efforts to render the utmost client satisfaction.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe manufacture and supply functionally efficient range of washer, studs \u0026amp; threaded rod, screws, machine nuts, bolts and different others. Owing to the quality approved products and customized solutions; we are able to maintain remarkable position in the industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8047/248047v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8047/248047v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8047/248047v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}