{"name": "Shanghai Iswear Information Technology Company",
 "permalink": "shanghai-iswear-information-technology-company",
 "crunchbase_url": "http://www.crunchbase.com/company/shanghai-iswear-information-technology-company",
 "homepage_url": "http://www.tradeiswear.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "b2b, b2b-website, b2b-marketplace, b2b-trade-portal",
 "alias_list": null,
 "email_address": "service@tradeiswear.com",
 "phone_number": "",
 "description": "B2B Marketplace",
 "created_at": "Tue May 15 09:32:51 UTC 2012",
 "updated_at": "Wed May 23 15:54:07 UTC 2012",
 "overview": "\u003Cp\u003ETradeiswear.com is a largest e-commerce marketplace powered by Shanghai Iswear Information Technology Co., Ltd, focusing on B2B and B2C contributing to global manufacturers, suppliers, exporters, importers, wholesalers and buyers.\nWith more than two million databases covering about 200 countries in the site, members of tradeiswear.com can use combination of online and offline resources to show productivity of enterprises, implement information management, create international brand image, share databases, connect with global market fast, efficiently do global marketing. Tradeiswear.com is the best bridge for enterprises entering international markets with international trade marketing function. Large aggregation of Tradeiswear.com can make co-enterprises become the focus area of global information center, transaction center, logistic center, operation center, internet talent center.\nNowadays, online B2B marketplace is becoming more and more important trade tool for business to business transaction and marketing because it speeds up marketing process and saves overall transaction cost. Join the great B2B portal, Tradeiswear.com and boost your business, we will always be with you! To use internationalized marketing website (www.tradeiswear.com) is the best solution for enterprise to entry into globalized market.\nDevelopment Goals\nTo be the most ideal partner of SMEs in worldwide.\nTo be a guider of SMEs with internationalization and be the first brand of international trade.\nMissions of tradeiswear.com continuously meet and service global SMEs with open and harmonious attitude to be the partner of global enterprises, and inclusiveness for gaining more rapid development of international trade. We work hard and strive to do everything.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "tradeiswear.com",
    "address1": "",
    "address2": "",
    "zip_code": "201203",
    "city": "Shanghai",
    "state_code": null,
    "country_code": "CHN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}