{"name": "Shatkone Structures",
 "permalink": "shatkone-structures",
 "crunchbase_url": "http://www.crunchbase.com/company/shatkone-structures",
 "homepage_url": "http://www.indiamart.com/shatkone/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "pre-engineering-building, metal-roofing, polycarbonate-multiwall-roofing",
 "alias_list": null,
 "email_address": "shatkone@tradepassport.org",
 "phone_number": "9818482875",
 "description": "Turnkey solutions for erecting,",
 "created_at": "Thu Apr 04 06:23:27 UTC 2013",
 "updated_at": "Thu Apr 04 06:23:32 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, at Delhi (India), we, “Shatkone Structures”, are recognized as the prominent manufacturer, trader and supplier of a comprehensive assortment of Pre-Engineering Building, Metal Roofing, Polycarbonate Multiwall Roofing \u0026amp;  Polycarbonate Sheet, we also provide the services like Industrial Fabrication Service \u0026amp; Warehouse Design Service . These products are procured from some of the reliable and certified vendors of industry. The offered range is manufactured by our vendors in compliance with the international quality standards. Also, we are engaged in manufacturing an extensive quality assortment of Pre-Engineering Buildings and Polycarbonate Multi-Wall Roofing. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nAs a quality-oriented organization, we \u0026#8220;Shatkone Structures\u0026#8221;, aim to provide our clients premium quality products as per their specific needs. These products are manufactured using world class raw material and latest technology as per the international standards.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe have strong association with some of the renowned and well-established vendors, who are capable of manufacturing world-class products in their advance labs. Our entire product range is procured from these reliable vendors, who develop these products using quality tested material. Furthermore, this procured range is inspected on various international parameters by our team of quality controllers. Moreover, we have well-informed and competent experts who meticulously choose our vendors.\u003C/p\u003E\n\n\u003Cp\u003EResearch And Development:\nWe have a separate research and development wing, which is well equipped with the modern facilities that ensures overall development of the product and as per the emerging market trends. This unit also assist us to add new features to the existing products for enhancing the functionality of our range at client\u0026#8217;s end. \u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nPre-Engineering Building, Metal Roofing, Polycarbonate Multiwall Roofing \u0026amp;  Polycarbonate Sheet\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/7578/247578v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7578/247578v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7578/247578v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}