{"name": "Shenzhen HGD Industry Co., Ltd.",
 "permalink": "shenzhen-hgd-industry-co-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/shenzhen-hgd-industry-co-ltd",
 "homepage_url": "http://www.eva-product.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2000,
 "founded_month": 4,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "HGD is an industrial corporation",
 "created_at": "Fri May 17 03:17:51 UTC 2013",
 "updated_at": "Fri May 17 14:12:59 UTC 2013",
 "overview": "\u003Cp\u003EFounded in the year of 2003, Shenzhen HGD Industry Co., Ltd. (HGD) is an industrial corporation that integrates the R\u0026amp;D, manufacture and sale of mobile phones \u0026amp; Tablet accessories. Located in beautiful Shenzhen, China, we cover an area of more than 16,000 square meters and employ more than 300 skilled workers and technicians.\u003C/p\u003E\n\n\u003Cp\u003EHGD is a comprehensive mobile phone and Tablet protective case factory with EVA foam case injection machines, leather case lines,plastic injection molding machines, CNC processing centers and other large processing and producing equipment. With over twenty automatic production lines and a number of outstanding R\u0026amp;D talents, we can provide customers with all kinds of customized boutique samples and conduct mass production any time.\u003C/p\u003E\n\n\u003Cp\u003EHGD is outstanding in EVA foam case production. We are the first manufacturer in China to research and develop EVA foam iPad cases for kids, and boast many patents of EVA foam protective case styles. Our products are mainly exported to American and European markets, and also sell well in American online malls: Amazon and eBay. Our sales volume of year 2012 alone has been over ten million dollars.\u003C/p\u003E\n\n\u003Cp\u003EHGD is always ready to accept OEM or ODM orders. Our skilled workers and experienced technicians will make products which would satisfy our customers.\u003C/p\u003E\n\n\u003Cp\u003EAdhering to the business philosophy of \u0026#8220;accurate, honest, realistic and innovative\u0026#8221;, our company sincerely hopes to establish long-term cooperation relationships with customers all over the world. We warmly welcome OEM and ODM orders, and are dedicated to providing our clients with the best services. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[60,
       60],
      "assets/images/resized/0026/3310/263310v2-max-150x150.jpg"],
     [[60,
       60],
      "assets/images/resized/0026/3310/263310v2-max-250x250.jpg"],
     [[60,
       60],
      "assets/images/resized/0026/3310/263310v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}