{"name": "Shenzhen Fortuna Technology Co.,Ltd",
 "permalink": "shenzhen-fortuna-technology-co-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/shenzhen-fortuna-technology-co-ltd",
 "homepage_url": "http://www.aliexpress.com/store/414174",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": 300,
 "founded_year": 2005,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "fortuna866@yahoo.cn",
 "phone_number": "8613418495183",
 "description": "manufacture mobile phone case ",
 "created_at": "Fri Sep 14 01:55:49 UTC 2012",
 "updated_at": "Wed Sep 19 16:20:39 UTC 2012",
 "overview": "\u003Cp\u003EAbout us\nShenzhen Fortuna Technology Co.,Ltd one of the leading manufacturer and merchant on  TPU, silicone \u0026amp; plastic field products in Shenzhen ,called factory of world ,the southern city of China . Our company was founded in 2005, as a main manufacturer and exporter Specialized in TPU, silicone \u0026amp; plastic products,Mobile phone cases,Tablet covers products manufacturing and developing, We make every effort to provide you with high-quality and up-to-date products, backed by our excellent services, competitive prices and prompt deliverywhit our principle: honest business, best quality and the cheapest price, focusing on the research of different cell phone designs. . Our cell phone protective case products are mainly for the famous brands like Iphone , Nokia, SONYERICSSON, Samsung, BLACKBERRY, HTC, iPod and so on. And a lot of our products were exported to Europe, North America, South America, South Africa, Australia and other countries and regions.\n With an area of 3000 square meters and over 200 workers and the ability to make more than 20 million cases every year., Our factory provides complete solution for products from mould design, mold making to final production. Now over 70% of our molds and products are exported to America and Europe. We are equipped with an advanced CAD/CAM R\u0026amp;D system and CNC processing center as well as a EDM center. We factory passed Certificate of ISO2001-2008 in 2009, whole process from mass production to inspection were executed strictly according to the standards. \u0026#8220;FORTUNA\u0026#8221; is a new brand held and launched by us.We are committed to produce all kinds of products in silicone,PC \u0026amp; PTU. We  can also provide professional OEM / ODM services, willing to work with our partners all around the world .\nWe have 3 entity wholesale sotre in Shenzhen ,Guangzhou for our product made in our factoriy, We have 2 sales departments ,internatioanal sales team with more than 10 young vibrant employees will give you the best service for all customers. With concept of excellent products for market, reasonable price for companions, honest services for customer,  We challenge ourselves every day in the past years try  to build the industry aircraft carrier.We offer global wholesale business, and warmly welcome all kinds of orders with different amounts.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": null,
    "raised_currency_code": null,
    "funded_year": 2005,
    "funded_month": 9,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}