{"name": "ShipAlmostAnything",
 "permalink": "shipalmostanything",
 "crunchbase_url": "http://www.crunchbase.com/company/shipalmostanything",
 "homepage_url": "http://www.shipalmostanything.com/",
 "blog_url": "http://blog.shipalmostanything.com/",
 "blog_feed_url": "",
 "twitter_username": "shipanything",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "shipping, transport, services, auction",
 "alias_list": "shipalmostanything.com",
 "email_address": "cs@shipalmostanything.com",
 "phone_number": "1-888-509-1SAA",
 "description": "Easy Shipping",
 "created_at": "Fri Oct 22 19:46:41 UTC 2010",
 "updated_at": "Fri Oct 22 19:47:04 UTC 2010",
 "overview": "\u003Cp\u003EShipAlmostAnything.com is an online auction website platform that brings individuals and companies together with an unlimited number of Shipping Service Providers (SSP\u0026#8217;s). These SSP\u0026#8217;s specialize in moving unusual, delicate or large items such as vehicles, boats, motorcycles, livestock, equipment, contents of homes and apartments, and more. Shipping Service Providers place competing bids on the auctions they choose to enter to win customer\u0026#8217;s business. The Shipper selects the competing bid that best serves their needs. Other websites charge a large commission to their SSP\u0026#8217;s. We offer low cost / flat rate subscription plans that meet the needs of any size Shipping Service Provider. This allows SSP\u0026#8217;s to pass additional savings onto the Shipper and win more business due to our no commission auction platform.\u003C/p\u003E\n\n\u003Cp\u003EShipping Service Providers (SSP\u0026#8217;s) always Win!\nAs a participating SSP on the ShipAlmostAnything.com website, the SSP\u0026#8217;s will have access to an unlimited number of auctions posted every day. The SSP pays a very affordable flat monthly subscription rate that allows unlimited bidding on all site auctions. This is so much more cost controlling and less expensive than the average commission paid on competing websites. Combine the flat fee with our open communication policy and the competing SSP\u0026#8217;s can make quick and informed decisions. We anticipate hundreds of shipping auctions posted daily. Small independent SSP\u0026#8217;s and larger SSP\u0026#8217;s have an equal opportunity to bid on jobs that suit their needs and scheduled routes. A subscribing member on the SAA website can fill their trucks, find profitable backhauls and avoid \u0026#8220;deadheading\u0026#8221;. The profitability of their business will immediately increase while reducing wasted time on the road. SAA provides the SSP\u0026#8217;s a number of useful tools to help them start a new or build their current online business.\u003C/p\u003E\n\n\u003Cp\u003EShippers always Win!\nShippers can post as many shipments as desired. All listings are free and our website makes finding someone to move all items simple and affordable. Shipping Service Providers place competitive bids to win the auction for your shipment. This helps drive down the cost of shipping dramatically versus conventional methods of obtaining shipping/moving price quotes. The SAA website provides Shippers all the tools necessary to make informed decisions when selecting a SSP. Unlike other websites, we do not charge a commission. Our platform, which allows for open communication between the SSP and the Shipper, aids all participants in the auction process to make the best decisions possible, making our website truly easy to ship your complicated stuff.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       25],
      "assets/images/resized/0010/6812/106812v1-max-150x150.jpg"],
     [[250,
       42],
      "assets/images/resized/0010/6812/106812v1-max-250x250.jpg"],
     [[300,
       51],
      "assets/images/resized/0010/6812/106812v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}