{"name": "Shiv Shakti Industries",
 "permalink": "shiv-shakti-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/shiv-shakti-industries",
 "homepage_url": "http://www.weldingmachinegujarat.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Electric Inverters, Cutting Machines",
 "created_at": "Wed Apr 11 17:11:01 UTC 2012",
 "updated_at": "Sat Apr 14 19:32:13 UTC 2012",
 "overview": "\u003Cp\u003EManufacturing, supplying \u0026amp; exporting high grade welding machines. Our entire range like TIG welding machine, MIG welding machine etc has worldwide market in all the relevant industries.\u003C/p\u003E\n\n\u003Cp\u003EShiv Shakti Industries was incepted in the year 1998, with a well-facilitated manufacturing unit in Odhav, Gujarat. We have vast market base all across the world in all the relevant industries. . We maintain stringent quality parameters that are at par with the international standards and are capable to meet the requirement of our clients. Our adept research and development wing along with latest testing amenities facilitates us to fabricate one of the most sophisticated and high performance components.\u003C/p\u003E\n\n\u003Cp\u003EWe started off by setting up a design, production and quality management facilities in Delhi. Having over 4 decades of experience in the fabricating Servo, CVT, manual transformer \u0026amp; welding machine i.e. tig welding machine, mig welding machine, industrial welding machine, spot welding machine, stud welding machine, arc welding machine, air plasma cutting machine and power inverter.\u003C/p\u003E\n\n\u003Cp\u003EUnder the aegis of our proficient entrepreneur Mr. Vikram Sinh Gohil we are a rapidly evolving organization. He has deep knowledge into clientele requirement and business policies which has positioned us into one of a well-reckoned welding machine manufacturer, supplier and exporter. We are fuelled by passion to outshine the industry best which allows us to offer one of the best equipment.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}