{"name": "Shiv Shakti Engineering",
 "permalink": "shiv-shakti-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/shiv-shakti-engineering",
 "homepage_url": "http://www.indiamart.com/shivshaktiengineering-gujarat/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shivshaktiengineering-gujarat@tradepassport.org",
 "phone_number": "9328056649",
 "description": "manufacturers and suppliers",
 "created_at": "Thu Apr 04 10:09:15 UTC 2013",
 "updated_at": "Thu Apr 04 10:09:18 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2002 we, “Shiv Shakti Engineering”, are an eminent organization engaged in manufacturing and supplying an excellent range of Plywood \u0026amp; Wood Working Machinery. Products that we are manufactured at our end can be obtained by the our clients at the most competitive and reasonable prices. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nTeam appointed by us are actively engaged in the entire business processes. Supported by their honest endeavors, we have been able to meet the satisfaction criteria of our clients in the best possible manner we can.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nSince inception, we have been giving importance to quality and that has earned us a very prestigious and dignified position in the concerned domain. In addition to that, our team of quality controllers keep a strict eye on the entire manufacturing process of Air Pneumatic Machine and Belt Sander, Finger Forming Machine, Finger Jointer, Plywood Machinery, Glue Spreader \u0026amp; Mixer and many more from the period of commencement of manufacturing process till delivery of the ordered consignments.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nAided by our state-of-art infrastructure that is sprawling across a wide area, we have been able to cater to the variegated demands of our clients by bringing forth an excellent range of Air Pneumatic Machine and Belt Sander, Finger Forming Machine, Finger Jointer, Plywood Machinery, Glue Spreader \u0026amp; Mixer and many more in a well-organized manner.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe strive very hard to satisfy our clients in from the day of our establishment for which we offer our clients a commendable range of Air Pneumatic Machine and Belt Sander, Finger Forming Machine, Finger Jointer, Plywood Machinery, Glue Spreader \u0026amp; Mixer and many more as per their specific requirements.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\n    Constantly effort to improve the functional efficiency of the products\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EContinuous improvement of work processes to achieve maximum customer satisfaction\n\nCapitalize on skilled \u0026amp;amp; experienced manpower\n\nPool of efficient engineers adept with the latest technologies\n\nEmpowered with strong market network\n\u003C/code\u003E\u003C/pre\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7792/247792v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7792/247792v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7792/247792v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}