{"name": "Shiva Enterprises",
 "permalink": "shiva-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/shiva-enterprises",
 "homepage_url": "http://www.indiamart.com/shivaenterprises-chandigarh/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shivaenterprises-chandigarh@tradepassport.org",
 "phone_number": "9316103303",
 "description": " Manufacturing and Supplying",
 "created_at": "Fri Apr 05 04:23:39 UTC 2013",
 "updated_at": "Fri May 31 14:31:34 UTC 2013",
 "overview": "\u003Cp\u003EWe, “Shiva Enterprise,” founded in the year 2003 at Chandigarh(Punjab, India), are a noteworthy manufacturer and supplier of superior quality Bakery Box, Plastic Pharmaceutical Products, Plastic Punnets, etc. Our exclusive range includes Plastic Bakery Biscuit Box, Plastic Sandwich Box, Muffin Packaging Box, Plastic Burger Box, Horticultural Trays, Grapes Punnets, Pea Punnets, Plastic Disposable Plates,Blister Packing and many more items.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure\u003C/p\u003E\n\n\u003Cp\u003EOur company is supported with spacious and sophisticated infrastructural facility that sprawls over a wide area of land. Further, this infrastructural base is categorised into various departments like manufacturing, quality testing, warehousing \u0026amp; packaging, etc in order to function smoothly. Our manufacturing unit is installed with the most advanced machinery and cutting edge tools that assists us in fabricating the entire range as per the international quality norms. The up-gradation and improvisation of these machines and departments are also done at regular intervals in order to enhance productivity. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality is the prime objective of our company and all of our professionals work jointly to deliver flawless products at clients’ end. The offered products are made using superior quality basic material and modern technology in compliance with the set industry norms. Our quality controllers test all the products thoroughly on diverse parameters to ensure their longer service life and optimum quality. We endeavor hard to recognize the diverse needs of clients and maintain dazzling quality in all our business operations.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe are working extremely hard to provide our valuable clients the maximum level of assurance by offering supreme quality Bakery Box, Plastic Pharmaceutical Products, Plastic Punnets, etc. Owing to our sincere efforts, close-coordination with the clients, easy modes of payment, transparent customer dealings and on time delivery, we are highly recognized among our precious customers. Furthermore, we have adopted different payment modes like cash, Cheque, Credit card, DD for the convenience of our prestigious patrons.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are instrumental in manufacturing and supplying marvellous quality Bakery Box, Plastic Pharmaceutical Products, Plastic Punnets and other Plastic Products. The standard of quality we deliver to the customers and our tireless efforts toward attaining utmost client satisfaction, have raised our demand in the national market.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       18],
      "assets/images/resized/0024/8189/248189v3-max-150x150.png"],
     [[250,
       31],
      "assets/images/resized/0024/8189/248189v3-max-250x250.png"],
     [[450,
       55],
      "assets/images/resized/0024/8189/248189v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Plot No. 44, 4, Kanal Industrial Area, Phase-2",
    "address2": "",
    "zip_code": "160002",
    "city": "Chandigarh ",
    "state_code": null,
    "country_code": "IND",
    "latitude": 30.6439933,
    "longitude": 76.82565}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        69],
       "assets/images/resized/0026/9757/269757v1-max-150x150.png"],
      [[250,
        115],
       "assets/images/resized/0026/9757/269757v1-max-250x250.png"],
      [[450,
        208],
       "assets/images/resized/0026/9757/269757v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}