{"name": "Shop My Power",
 "permalink": "shop-my-power",
 "crunchbase_url": "http://www.crunchbase.com/company/shop-my-power",
 "homepage_url": "http://www.shopmypower.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "compare-electric, compare-electricity, compare-electric-rates, compare-electricity-rates, energy-deregulation-in-texas, electricity-rates-in-texas, electric-companies-in-texas, texas-energy-rates, energy-deregulation-in-pennsylvania, electricity-rates-in-",
 "alias_list": null,
 "email_address": "contact@shopmypower.com",
 "phone_number": "469.342.6333",
 "description": "Electricity provider comparison guide.",
 "created_at": "Thu Dec 29 20:30:21 UTC 2011",
 "updated_at": "Thu Dec 29 21:06:20 UTC 2011",
 "overview": "\u003Cp\u003EShop My Power is an independent non biased comparison tool designed to help people select their electricity or gas company in those states which give consumers the power to choose and compare electricity rates. The people behind Shop My Power have over 20 years experience in the energy industry.\u003C/p\u003E\n\n\u003Cp\u003EShop My Power is a free, non biased comparison tool which assembles all of the electricity and gas providers in your area based on zip code. At the click of a button, Shop My Power displays all the different plans in your zip code, sorted by whatever features are important to you, whether that be price, a fixed or variable rate, or if that company uses green power to supply your energy such as wind, solar, hydro etc. Shop My Power takes all the frustration and confusion out of shopping for the best electricity or gas rates.\u003C/p\u003E\n\n\u003Cp\u003EFinding just the right provider for you can be even more difficult than finding the right auto insurance company. In Auto insurance most people know who many of the major providers are such as State Farm, Allstate, Farmers, and Geico among others. Even knowing who the players are you still have to take the time to call every one of them to get the best plan and coverage for you. It can be exhausting.\u003C/p\u003E\n\n\u003Cp\u003EWith Electricity companies, other than your default provider such as TXU or Reliant, many people are just not familiar with the dozens of other excellent electricity or gas companies available to them, and in some cases each electricity company can have over a dozen different plans to choose from. There could be more than 200 different electricity plans available in your area! How can you possibly know which plan is right for you when you compare electricity rates?\u003C/p\u003E\n\n\u003Cp\u003EKnowing this the creators of Shop My Power designed a comprehensive and extremely user friendly (even for those who do not normally use the Internet for research) comparison tool that in less than 30 seconds can narrow hundreds of available plans down to just a few based on what is important to you and displays them in an easy to read format that is clear, concise, and understandable. There are other resources on the web, but none have all the capabilities that Shop My Power does\u0026#8230; AND IT\u0026#8217;S FREE!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}