{"name": "Shopping Cart Elite",
 "permalink": "shopping-cart-elite",
 "crunchbase_url": "http://www.crunchbase.com/company/shopping-cart-elite",
 "homepage_url": "http://www.shoppingcartelite.com",
 "blog_url": "http://www.IgorSoshkin.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "shopping-cart, ecommerce, software",
 "alias_list": null,
 "email_address": "",
 "phone_number": "(800) 401-8296",
 "description": "Ecommerce Shopping Cart Software",
 "created_at": "Tue May 03 18:23:43 UTC 2011",
 "updated_at": "Mon May 09 00:23:45 UTC 2011",
 "overview": "\u003Cp\u003EShopping Cart Elite was designed not only to support businesses such as MimoUSA (online wholesalers) or AutoAccessoryStore.com (online retailer) but was also designed to support and fit the needs of other marketplaces online.\u003C/p\u003E\n\n\u003Cp\u003EBelow is a small brief of what we mean by fitting YOUR needs, No matter how specific your market place may be.\u003C/p\u003E\n\n\u003Cp\u003EThe lack of computer knowledge to build their own website\u003C/p\u003E\n\n\u003Cp\u003ELacking knowledge in web design, computer programming, marketing or all the above. \u003C/p\u003E\n\n\u003Cp\u003EMany would find cheap solutions through different hosting companies and spend a great amount of money trying to bring the website online. This often resulted in the retailer giving up or just quitting altogether. \u003C/p\u003E\n\n\u003Cp\u003ESome retailers would get lured into one of the many website schemes online, where the provider promised the retailer thousands of dollars in profits by going with their (provider\u0026#8217;s) solution. In conclusion the retailer would come to realize they have lost everything they spent on this solution and as you might expect, experienced a bad vibe of internet retailing. \u003C/p\u003E\n\n\u003Cp\u003EA great majority of retailers signed up with variety of different Shopping Cart Providers which couldn\u0026#8217;t support the MimoUSA 100,000 parts data feed. These Shopping Carts not only lacked in technology to properly categorize all the products. But the automotive industry demands a completely different type of technology which would not only support options for products, but also makes, models and years. To get even more advanced wheel and tire sizes were not even considered. In result the retailers would have no choice but to enter the products one by one which is theoretically possible, but highly impractical. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[107,
       120],
      "assets/images/resized/0013/3051/133051v2-max-150x150.jpg"],
     [[107,
       120],
      "assets/images/resized/0013/3051/133051v2-max-250x250.jpg"],
     [[107,
       120],
      "assets/images/resized/0013/3051/133051v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}