{"name": "shopobd2",
 "permalink": "shopobd2",
 "crunchbase_url": "http://www.crunchbase.com/company/shopobd2",
 "homepage_url": "http://www.shopobd2.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "obd2",
 "alias_list": null,
 "email_address": "shopobd2@hotmail.com",
 "phone_number": "8675556849662",
 "description": "shopobd2",
 "created_at": "Tue Nov 20 08:39:49 UTC 2012",
 "updated_at": "Wed Nov 21 08:40:22 UTC 2012",
 "overview": "\u003Cp\u003EShopobd2, as a professional auto diagnostic tools online supplier, providing our customers with a vast range of high-quality and affordable automobile maintenance tools .Our main business line covers: Automotive Professional Diagnostic Tools for OBD I and OBD II compliant vehicles; Auto Diagnostic tool, OBD2 Code Scanners, ECU Chip Tuning Tool, Car Key programmer Mileage Programmer as well as other more featured products. \n​\nIn our shop you could get universal and economical tools and free technical support for your car. Our promise is high-quality, high-efficiency, credibility and the principle of reciprocity, which aims to establish a long-term economic trade relation with the vast number of clients. \u003C/p\u003E\n\n\u003Cp\u003EFeatured items: Launch X431, Digimaster 3,Digiprog III, Immo/Seat Emulators, VAG Diagnostic Tools, BMW GT1 \u0026amp; OPS, BENZ Star C4/C4, ELM327,Autel tools, KWP2000, tacho pro 2008, T300,MVP, Ford VCM ,AUTOCOM, CARPROG full V4.1,etc. \u003C/p\u003E\n\n\u003Cp\u003EWith years of experience in trading auto diagnostic tool for cars and trucks, our servicing products have involved in a vast collection of categories. In short, shopobd2 supplies First-class Products, Competitive Price, Timely Delivery and free professional Technical Support \u0026amp; Service as your most valuable cooperator. \u003C/p\u003E\n\n\u003Cp\u003EWhy buy from shopobd2 ? \u003C/p\u003E\n\n\u003Cp\u003EFast Delivery - Available with plenty of stock and various delivery methods (DHL, UPS, EMS,)the package delivery time can be as short as 3-5 working days by express way. Besides, the delivery tracking system Courier Companies provide allow our customers track their packages at anytime and anywhere once the packages are shipped out. We aim to guarantee you a safe and fast delivery. \u003C/p\u003E\n\n\u003Cp\u003EFree Technical Support- our dedicated engineer will provide you free and complete after-sale technical service according to your specific needs. Moreover, we are available with \u0026#8220;Download\u0026#8221; Column; it is free for you to download the related tools’ software, user manual, USB driver, operation instruction. \u003C/p\u003E\n\n\u003Cp\u003EGood Customer Service- It’s our pleasure to answer all the customers\u0026#8217; questions. We are always free to reply our customers ASAP. \u003C/p\u003E\n\n\u003Cp\u003EService time:\nMonday ~ Saturday from 8:30 a.m. to 24:00 p.m. Peking time \u003C/p\u003E\n\n\u003Cp\u003EAny problems, please feel free to contact us .We are always free to answer your questions.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}