{"name": "Shree Tirupati Balaji Chemicals",
 "permalink": "shree-tirupati-balaji-chemicals",
 "crunchbase_url": "http://www.crunchbase.com/company/shree-tirupati-balaji-chemicals",
 "homepage_url": "http://www.indiamart.com/shreetirupati-balajichemicals/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "potassium-sulphate-for-agriculture-industry, potassium-sulphate-for-glass-industry, potassium-sulphate-for-pharma-industry",
 "alias_list": null,
 "email_address": "shreetirupati-balajichemicals@tradepassport.org",
 "phone_number": "9669729373",
 "description": "Potassium Sulphate \u0026 trading Potassium N",
 "created_at": "Fri Apr 05 05:39:19 UTC 2013",
 "updated_at": "Fri Apr 05 05:39:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “Shree Tirupati Balaji Chemicals”, are a distinguished manufacturer and supplier of an extensive range of Potassium Sulphate \u0026amp; trader of Potassium Nitrate and Zinc Sulphate. Our range of products encompasses Potassium Sulphate For Agriculture Industry, Potassium Sulphate For Glass Industry, Potassium Sulphate For Pharma Industry, Potassium Sulphate For Animal Feed Industry and Potassium Sulphate For Fertilizer Industry. Also, we offer Potassium Sulphate For Plastic Industry, Zinc Hepta Hydrate Sulphate, Zinc Mono Hydrate Sulphate, Potassium Sulphate and Potassium Nitrate. \u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio: \nPotassium Sulphate For Agriculture Industry \nPotassium Sulphate For Glass Industry \nPotassium Sulphate \nPotassium Sulphate For Animal Feed Industry \nPotassium Sulphate For Fertiliser Industry \nPotassium Sulphate \u003C/p\u003E\n\n\u003Cp\u003EOur Team: \nA proficient team of professionals is recruited by us, which greatly supports us in all the activities of our trade. The dedicated, sincere and hardworking professionals working with us are masters of their respective fields of specialization. These experts employ their rich experience of industry and in-depth knowledge to accomplish the assigned tasks in a successful manner. Furthermore, to attain the organizational goals in an effective and efficient manner, our team members work in close coordination with each other. Besides, we arrange training sessions and workshops at regular intervals to enhance their skills and knowledge. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance: \nWe are a quality-driven organization as we give prime importance towards maintaining high quality standards in our products and policies. The products offered by us are processed using high-grade ingredients that are sourced from most authentic vendors after doing an extensive market research. Latest machines and equipment are employed in the production process following standards and norms of industry. Moreover, we have appointed highly experienced quality controllers to scrutinize the range. These experts stringently test the final range on certain well-defined parameters of quality in order to rule out every possibility of flaw. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure: \nTo execute out all our business processes in a streamlined manner, we have established a state-of-the-art infrastructure facility at our premises. Sprawling across an extensive area, this facility is equipped with essential tools and machines that help in utilizing the resources in a judicious manner thus, making our range cost-effective. Owing to the high production capacity of our facility, we have been able to meet the increasing demands of clients in an efficient manner. Moreover, we have hired highly experienced and trained professionals to manage this facility. Apart from this, we have segregated our infrastructure into various departments to maintain a conducive working environment. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction: \nBeing a client-centric organization, we aim to maximize the contentment level of our esteemed clients in the best possible manner. For this reason, we make sure that superior quality products are offered to them at market-leading prices. All our offered products are processed using optimum-grade ingredients so that these are in tandem with international quality standards. Our team of experts maintains cordial relations with customers to understand their variegated requirements and cater t them accordingly. Furthermore, we ensure that the consignments are timely delivered at customers’ doorstep through our expansive distribution network. Due to these factors, we have become the prime choice of our esteemed clients spread throughout the nation. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us: \u003C/p\u003E\n\n\u003Cp\u003ESuperior quality products \nCompetitive prices \nTimely delivery \nCustomer satisfaction \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8272/248272v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8272/248272v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8272/248272v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}