{"name": "Shree Vishwakarma",
 "permalink": "shree-vishwakarma",
 "crunchbase_url": "http://www.crunchbase.com/company/shree-vishwakarma",
 "homepage_url": "http://www.minibatchingplant.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "manually-full-bag-concrete-mixer, stand-type-mixer-machine-full-bag, concrete-mixer-bag-and-concrete-mixer-without-hopper",
 "alias_list": null,
 "email_address": "webmaster@minibatchingplant.com",
 "phone_number": "9979257888",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Thu Apr 04 12:25:46 UTC 2013",
 "updated_at": "Thu Apr 04 12:25:48 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1976, we, “Shree Vishwakarma Engineering, Odhav”, are a renowned name, which is engaged in manufacturing, supplying and exporting Construction and Testing Equipment. Offered products are Mini Reversible Mobile Plant, Concrete Mixer, Manually Full Bag Concrete Mixer, Stand Type Mixer Machine (Full Bag), Concrete Mixer Bag and Concrete Mixer Without Hopper, to name a few. Furthermore, we offer Hydraulic Concrete Mixer With Hopper, Concrete Block Machine, Concrete Batching Machine, Mini Mobile Batching Plant, Concrete Batching Machine, Sand Screening Machine and Bar Cutting \u0026amp; Bending Machine, amongst few. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have hired a competent team of adept personnel, which aids us in delivering an unmatched assembly of Construction and Testing Equipment. These personnel are hired via stringent selection procedures. Moreover, the professionals employed by us make sure to keep a constant communication with the respectable clients so as to understand their precise demands accordingly. Our personnel dispatch the ordered consignment within the committed time frame.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have constructed a state-of-the-art infrastructure, which aids us in controlling the business related activities smoothly. The facility is equipped with modern machines and innovative technology that aid us in delivering an unparalleled range of Construction and Testing Equipment. Our experts categorize the infrastructure in different units so as to execute each business dealings systematically.\u003C/p\u003E\n\n\u003Cp\u003EConsiderations while Buying Concrete Mixing Plants:\nBuying Concrete Mixers \u0026amp; related accessories is not a simple task. It is essential that one buys the best quality concrete mixing equipment to ensure that only the best quality concrete is made. As such, there are several Concrete Mixer Manufacturers in the market offering a wide assorted of Concrete Mixers \u0026amp; related accessories to buyers. While buying, it is important to ensure that the Concrete Mixing Plant is up to mark, \u0026amp; capable of providing excellent performance.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality remains an impeccable factor, which aids us in strengthening our stature in this stiff market competition. Hence, we have constructed an advanced quality testing laboratory, which is installed with all the essential amenities that are needed for offering a flawless range of Construction and Testing Equipment.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n. Offered products are Mini Reversible Mobile Plant, Concrete Mixer, Manually Full Bag Concrete Mixer, Stand Type Mixer Machine (Full Bag), Concrete Mixer Bag and Concrete Mixer Without Hopper, to name a few. Furthermore, we offer Hydraulic Concrete Mixer With Hopper, Concrete Block Machine, Concrete Batching Machine, Mini Mobile Batching Plant, Concrete Batching Machine, Sand Screening Machine and Bar Cutting \u0026amp; Bending Machine, amongst few. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7895/247895v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7895/247895v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7895/247895v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}