{"name": "Shree Agro Industries",
 "permalink": "shree-agro-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/shree-agro-industries",
 "homepage_url": "http://www.indiamart.com/shreeagroindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shreeagroindustries@tradepassport.org",
 "phone_number": "",
 "description": "",
 "created_at": "Sat Apr 06 05:03:40 UTC 2013",
 "updated_at": "Mon Apr 08 00:11:22 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2006, we \u0026#8220;Shree Agro Industries\u0026#8221; are engaged in manufacturing, supplying and trading a quality assured range of Hydraulic Hose, Hydraulic Hose Fitting, Hydraulic Cylinder, Hydraulic Spare, Hydraulic Instrument, Three Wheeler Silencer, and Mini Tractor Silencer. The vast range that clients can avail from us includes Industrial Hydraulic Hose, High Pressure Hydraulic Hose, Rubber Hydraulic Hose, Concrete Pump Hydraulic Hose, R1 Hydraulic Hose, Flexible Hydraulic Hose and Hydraulic Adaptor.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality has been our foremost aspect and we ensure that all our products offered meet the industry standards. Thus, stringent measures are carried out at every stages of production and post production by our experienced quality controllers.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIn our endeavor to meet the variegated demands of clients, we have employed skilled professionals at our premises. Our stringent selection policy allows us to employ engineers, technicians, quality controllers, research associates, sales \u0026amp; marketing executives and warehouse personnel having vast expertise. They are further offered with requisite training to keep them abreast of the changing market trends.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have been client centric since our inception and as a result, we are able to build a vast client base across the country. Our optimum quality hydraulic products and automobile silencers are offered in varied specifications to meet the exact application demands. Apart from offering quality products, we also ensure timely delivery of the range and cost effective products. Our professionals remain in close contact with clients to gauge their exact demands and fulfill the same effectively.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nIndustrial Hydraulic Hose, High Pressure Hydraulic Hose, Rubber Hydraulic Hose, Concrete Pump Hydraulic Hose, R1 Hydraulic Hose, Flexible Hydraulic Hose and Hydraulic Adaptor. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/9029/249029v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/9029/249029v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/9029/249029v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}