{"name": "ShreejiSales Corporation",
 "permalink": "shreejisales-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/shreejisales-corporation",
 "homepage_url": "http://www.indiamart.com/shreejisalescorporation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "planetary-gear-boxes, 3-hi-pinion-gear-boxes, reduction-gear-boxes-and-single-phase-electric-motors-",
 "alias_list": null,
 "email_address": "shreejisalescorporation@tradepassport.org",
 "phone_number": "9925220628",
 "description": "Manufacturer and supplier of Gear Boxes,",
 "created_at": "Fri Apr 05 14:57:37 UTC 2013",
 "updated_at": "Fri Apr 05 14:57:40 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2009, we, “Shreeji Sales Corporation”, are one of the most renowned names of the industry engaged in manufacturing and supplying a superior quality range of Gear Boxes, Industrial Reducers, Gear Motors \u0026amp; Electric Motors. In our product range, we offer Planetary Gear Boxes, 3 Hi Pinion Gear Boxes, Reduction Gear Boxes and Single Phase Electric Motors. Moreover, we provide Double Phase Electric Motors, Three Phase Electric Motors \u0026amp; Gear Motors to the clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have been backed by a competent team of professionals, which is the driving force of our organisation. Our efficient team of professionals has clear understanding of the clients\u0026#8217; needs and offers a high quality range of Gear Boxes, Industrial Reducers, Gear Motors \u0026amp; Electric Motors to the customers.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nOur organisation has gathered the knowledge and expertise that has enables it to offer a genuine quality range of Gear Boxes, Industrial Reducers, Gear Motors \u0026amp; Electric Motors to our clients. we make use of qualitative raw material and components for manufacturing these products. Moreover, latest technology and sophisticated machinery are employed by us to make these products in compliance with the international quality standards. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have been identified as a client-centric organisation, thus, always make sure to offer a high quality range of Gear Boxes, Industrial Reducers, Gear Motors \u0026amp; Electric Motors in the market as per its demand. Our team of experts makes sure to offer the products that can meet the exact requirements of the clients and provide them maximum level of satisfaction. Moreover, we provide the facility of customisation to the clients, which helps us in gaining their trust and confidence. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nlanetary Gear Boxes, 3 Hi Pinion Gear Boxes, Reduction Gear Boxes and Single Phase Electric Motors. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8802/248802v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8802/248802v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/8802/248802v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}