{"name": "Shree Krishna Silk",
 "permalink": "shree-krishna-silk",
 "crunchbase_url": "http://www.crunchbase.com/company/shree-krishna-silk",
 "homepage_url": "http://www.indiamart.com/shreekrishnasilk/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 500,
 "founded_year": 1975,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "linen-fabric---mens-wear, linen-fabric---women-wear, linen-home-furnishing-fabric",
 "alias_list": null,
 "email_address": "shreekrishnasilk@tradepassport.org",
 "phone_number": "9825130540",
 "description": "manufacturer of fabric",
 "created_at": "Thu Apr 04 07:30:30 UTC 2013",
 "updated_at": "Thu Apr 04 07:30:35 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1975, we “Shree Krishna Silk” have been engaged in manufacturing and supplying a quality assured range of Linen Fabric - Mens Wear, Linen Fabric - Women Wear, Linen Home Furnishing Fabric, Bemberg Fabric, Bemberg Cotton Fabric, Silk Fabric and Polyester Fabric. In this range, we offer Linen Shirting Fabric, Linen Suiting Fabric, Linen Kurta Fabric, Women Linen Shirt Fabric and Linen Skirt Fabric. Along with this, we also offer Bemberg Satin Fabric, Bemberg Crepe Fabric, Chiffon Silk Fabric, Crepe Silk Fabric and Cotton Silk Fabric. In addition to this, we also offer Bemberg Twill Fabric, Bemberg-Cotton Plain Fabrics, Bemberg Satin Fabric and many more.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nmanufacturing and supplying a quality assured range of Linen Fabric - Mens Wear, Linen Fabric - Women Wear, Linen Home Furnishing Fabric, Bemberg Fabric, Bemberg Cotton Fabric, Silk Fabric and Polyester Fabric. In this range, we offer Linen Shirting Fabric, Linen Suiting Fabric, Linen Kurta Fabric, Women Linen Shirt Fabric and Linen Skirt Fabric. Along with this, we also offer Bemberg Satin Fabric, Bemberg Crepe Fabric, Chiffon Silk Fabric, Crepe Silk Fabric and Cotton Silk Fabric. In addition to this, we also offer Bemberg Twill Fabric, Bemberg-Cotton Plain Fabrics, Bemberg Satin Fabric and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe are quality-centric since inception and ensure that all our manufactured \u0026amp; imported fabrics are optimum in quality. Thus, our quality controllers check these Linen Fabric - Mens Wear, Linen Fabric - Women Wear, Linen Home Furnishing Fabric, Bemberg Fabric, Bemberg Cotton Fabric, Silk Fabric and Polyester Fabric on well defined parameters before being delivered to the clients.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nAs a leading manufacturer, importer and supplier, we have developed a state-of-the-art infrastructure that spreads across a sprawling area. It is housed with varied facilities that are essential for bulk and timely production of fabrics.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have established ourselves as a foremost manufacturer, importer and supplier of a quality assured range of Fabric. Our whole range encompasses Linen Fabric - Mens Wear, Linen Fabric - Women Wear, Linen Home Furnishing Fabric, Bemberg Fabric, Bemberg Cotton Fabric, Silk Fabric and Polyester Fabric. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       120],
      "assets/images/resized/0024/7629/247629v2-max-150x150.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7629/247629v2-max-250x250.jpg"],
     [[120,
       120],
      "assets/images/resized/0024/7629/247629v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}