{"name": "Shreeji Trading",
 "permalink": "shreeji-trading",
 "crunchbase_url": "http://www.crunchbase.com/company/shreeji-trading",
 "homepage_url": "http://www.indiamart.com/shreejitradingco/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shreejitradingco@tradepassport.org",
 "phone_number": "9322263177",
 "description": "Manufacturer and supplier ,",
 "created_at": "Sat Apr 06 06:01:41 UTC 2013",
 "updated_at": "Mon Apr 08 00:15:28 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1985, we “Shreeji Trading Co.” have established ourselves as a foremost \u0026amp; leading manufacturer and supplier of a premium collection of Casters and Wheels. The variegated range that clients can avail from us encompasses Medium Heavy Duty (EL) Polyurethane Wheel with Caster, Medium Heavy Duty (EL) Polypropylene Wheel with Caster, Medium Duty Polypropylene Wheel Caster and Medium Duty Polyurethane Wheel with Caster.\u003C/p\u003E\n\n\u003Cp\u003EOur Mission\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to solve your load moving problems with innovative ideas, best quality, prompt delivery and competitive rate. Hard working and experience engineers \u0026amp; product developers are always on their toes to meet customers’ needs and satisfaction. Out motto is to provide complete service and total support including sales, installation, inspection, maintenance and repair.\u003C/p\u003E\n\n\u003Cp\u003EOur Vision:\nOur inner soul is best quality, customer satisfaction, innovation, imagination and passion. Our hard work and service is the bridge between our past and future. Our ultimate goal is to earn valuable goodwill and great respect in material handling equipment industries.\u003C/p\u003E\n\n\u003Cp\u003EBusiness Competitiveness:\nWe provide best quality product with most competitive cost. We keep our deadlines. Technologically upgraded solution to the customer’s requirements.\u003C/p\u003E\n\n\u003Cp\u003EBusiness Concept:\nWe are plastic processing organization. We manufacture various industrial products with different plastic processing methods. we have in house mould designing developing \u0026amp; manufacturing facilities.\u003C/p\u003E\n\n\u003Cp\u003EIndustries We Serve:\nWe manufacture a flawless range of products that is supplied to various industries in order to meet their requirements. Our products are widely used by Synthetic Yarn Manufacturers, Trolley Manufactures, Tyre Cord Manufacturers, Fishing Net Suppliers and many others. The superior quality products are also used for twisting, Texturizers and Conning Machines.\u003C/p\u003E\n\n\u003Cp\u003EOur Professionals:\nIn order to meet the variegated demands of our clients, we have employed dexterous and diligent professionals in our team. Our stringent selection policy enables us to employ candidates having in-depth knowledge and ability to work under pressure.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/9069/249069v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/9069/249069v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/9069/249069v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}