{"name": "Shreeji Art",
 "permalink": "shreeji-art",
 "crunchbase_url": "http://www.crunchbase.com/company/shreeji-art",
 "homepage_url": "http://www.indiamart.com/shreejiart/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "embroidered-sequin-work, embroidered-thread-work, embroidery-zari-work, metallic-fabric",
 "alias_list": null,
 "email_address": "shreejiart@tradepassport.org",
 "phone_number": "9537619724",
 "description": "We, Shreeji Art, are an eminent name . ",
 "created_at": "Thu Apr 04 10:12:00 UTC 2013",
 "updated_at": "Thu Apr 04 10:12:03 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2003, we, “Shreeji Art”, are a profound organization of this domain specialized in manufacturing and trading an outstanding collection of Embroidered Work \u0026amp; Fabric. Under this range, we bring forth Embroidered Sequin Work, Embroidered Thread Work, Embroidery Zari Work, Metallic Fabric, Jacquard Fabric and Polyester Fabric. In addition to this, we also offer Weave Fabric, Embroidered Bridal Fabric, Embroidered Fancy Work, Embroidery Fabric and Fabric and others.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are backed by a competent team that works as a driving force for our organization that leads us towards the path of success. Backed by such an efficient and hardworking team, we have been so far able to cater to the distinct needs and requirements of clients in an organized manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOver the years, we have gathered immense knowledge and expertise of this domain, which has helped us to muster a huge client base. We work with the prime objective of providing our patrons with a highly innovative and peerless quality range of products that are fabricated by making use of optimum grade raw material that is obtained from the most valued vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nInfrastructure being a topmost priority for any organization, facilitates us in analyzing and delivering a quality range of Embroidered Sequin Work, Embroidered Thread Work, Embroidery Zari Work, Metallic Fabric, Jacquard Fabric, Polyester Fabric and many more to the valued patrons. \u003C/p\u003E\n\n\u003Cp\u003EClient satisfaction:\nBeing a client centric firm, we work with an aim to follow the path of achieving the patrons desires in the best possible manner. For the same, we manufacture our range by making use of optimum grade raw material in compliance with the industry laid standards and guidelines. In order to fulfill the patrons enormous needs, we also engage in offering a whole lot of customized range that can further be availed in diverse elegant designs and plethora of color combinations. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\n Embroidered Sequin Work, Embroidered Thread Work, Embroidery Zari Work, Metallic Fabric, Jacquard Fabric and Polyester Fabric. In addition to this, we also offer Weave Fabric, Embroidered Bridal Fabric, Embroidered Fancy Work, Embroidery Fabric and Fabric and others.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7793/247793v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7793/247793v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/7793/247793v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}