{"name": "Shri Venkatesh",
 "permalink": "shri-venkatesh",
 "crunchbase_url": "http://www.crunchbase.com/company/shri-venkatesh",
 "homepage_url": "http://www.indiamart.com/shrivenkatesh-packingindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "duplex-corrugated-boxes, die-cut-corrugated-boxes, hdpe-boxes, gunny-boxes, laminated-corrugated-boxes",
 "alias_list": null,
 "email_address": "shrivenkatesh-packingindustries@tradepassport.org",
 "phone_number": "9840137119",
 "description": "Corrugated Rolls and Packaging ",
 "created_at": "Fri Apr 05 07:17:57 UTC 2013",
 "updated_at": "Fri Apr 05 07:18:08 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1992, Shri Venkatesh Packing Industries is engaged in manufacturing and supplying an extensive range of Corrugated Boxes, Packaging Boxes, Telescopic Boxes, Corrugated Rolls, Packaging Rolls, Paper Rolls, Corner Protectors \u0026amp; Corrugated Partitions. Our product range include Kraft Corrugated Boxes, Printed Corrugated Boxes, Duplex Corrugated Boxes, Die Cut Corrugated Boxes, HDPE Boxes, Gunny Boxes, Laminated Corrugated Boxes, Light Duty Corrugated Boxes, Corrugated Telescopic Boxes, Corrugated Rolls, Corrugated 2 Ply Rolls, Corrugated Paper Rolls, Duplex Paper Rolls, Kraft Paper Rolls, Air Bubble Rolls, Corner Protectors \u0026amp; Kraft Corrugated Partitions and more. \u003C/p\u003E\n\n\u003Cp\u003EOur Aim:\nOur products are thoroughly checked before the final dispatch and henceforth, assure high efficiency and durability. Bulk orders are completed effectively within the given time slots to bring worth to the clients\u0026#8217; money.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur organization is supported by technically advanced manufacturing facility that is outfitted with latest tools and amenities. Our well-segregated manufacturing facility assists us to streamline the entire business operations in a systematic manner. Due to our in-house designing unit, we are able to fulfill the exact requirements of our discerning clients in a fruitful manner. Furthermore, our department is supervised by experienced professionals, who have attained years of experience in the respective domain. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing quality conscious firm, our prime aim is to deliver flawless range of products to our clients. Our entire product range is well-tested on varied parameters under the strict supervision of quality controllers thereby rendering utmost client satisfaction. We have in-house quality testing department that is outfitted with latest tools and techniques. This assists us to meet exact quality standards prevailing in the industry. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nKraft Corrugated Boxes, Printed Corrugated Boxes, Duplex Corrugated Boxes, Die Cut Corrugated Boxes, HDPE Boxes, Gunny Boxes, Laminated Corrugated Boxes, Light Duty Corrugated Boxes, Corrugated Telescopic Boxes, Corrugated Rolls, Corrugated 2 Ply Rolls, Corrugated Paper Rolls, Duplex Paper Rolls, Kraft Paper Rolls, Air Bubble Rolls, Corner Protectors \u0026amp; Kraft Corrugated Partitions and more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8378/248378v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8378/248378v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8378/248378v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}