{"name": "ShriRam Industries",
 "permalink": "shriram-industries",
 "crunchbase_url": "http://www.crunchbase.com/company/shriram-industries",
 "homepage_url": "http://www.indiamart.com/shriramindustries/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shriramindustries@tradepassport.org",
 "phone_number": "9829019422",
 "description": "manufacturer, supplier, trader, wholesal",
 "created_at": "Thu Apr 04 11:29:51 UTC 2013",
 "updated_at": "Thu Apr 04 11:29:54 UTC 2013",
 "overview": "\u003Cp\u003EShri Ram Industries is a sole proprietorship business entity that came into existence in the year 1999 at Jaipur in Rajasthan, India. We have emerged as one of the prominent names involved in offering a widespread array of Industrial Blades, Machine Gears, Industrial Machines, Slitter Blades, Shear Blades \u0026amp; many more. We manufacture, trade, retail, wholesale \u0026amp; supply the same product range.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nWe are consistently serving our customers with finest quality products present in the market. We introduce technically sound and innovative range of Industrial Machines. Our range is in line with set industrial trends and keeping in mind demands of our clients. We make use of superior quality materials as well as components that are sourced from trusted vendors. Our products are put through a series of quality-checks to ensure that our products are free from defect. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nInfrastructure is the most valuable asset of our organization. It stretches across acres of land area and is sectioned into varied departments. Our modernized manufacturing unit is installed with modernized tools and latest of the machinery. Our warehousing facility stands firm and enables us to safely store large volumes of our products with ease. By combining skills of our professionals and modernized machinery, we are able to offer immaculate range of products in the market.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nA strong team forms the lifeline of our organization. We have recruited finest and highly motivated professionals that carry immense experience and thorough knowledge in their domain. Our team comprises skilled professionals, specialist, engineers, quality monitoring experts, warehousing professionals, supervisors and more. Owing to their support and collective work approach, we are able to offer an immaculate product range and render complete client satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EOur Vendor Base:\nSometimes we also offer products to our valuable clientele are sourced from the certified industrial vendors, whom we have selected after conducting stern market research. Besides, our experts have selected vendors on the basis of their past industrial experience, prompt delivery schedules and market credibility. We do not entirely source our range from vendors but also manufacture at our vicinity.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nIndustrial Blades, Machine Gears, Industrial Machines, Slitter Blades, Shear Blades \u0026amp; many more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7856/247856v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7856/247856v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7856/247856v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}