{"name": "Shukla Enterprise",
 "permalink": "shukla-enterprise",
 "crunchbase_url": "http://www.crunchbase.com/company/shukla-enterprise",
 "homepage_url": "http://www.indiamart.com/shuklaenterprise/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dual-fuel-burner-and-dual-fuel-burner--along-with-this, we-offer-dual-fuel-burner-panel, single-stage-gas-burner",
 "alias_list": null,
 "email_address": "shuklaenterprise@tradepassport.org",
 "phone_number": "9824060598",
 "description": "Offered products are appreciated for dur",
 "created_at": "Thu Apr 04 09:58:13 UTC 2013",
 "updated_at": "Thu Apr 04 09:58:16 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2002 we, “Shukla Enterprise”, are a renowned manufacturer, supplier, importer and exporter of a superior range of peerless quality Gas \u0026amp; Oil Burner, Industrial Boiler, Hot Air Generator, Heating Equipment and Spares For Burner. In this offered range, we offer Process Burner, High Temperature Burner, Gas Burner, Gas Burner Two Stages Panel, Dual Fuel Burner and Dual Fuel Burner. Along with this, we offer Dual Fuel Burner Panel, Single Stage Gas Burner, Steam Boiler, Boiler, Hot Air Generator, Oil Filter, Burner Spare Parts and others. The aforementioned products are precision engineered at our well equipped manufacturing unit by making use of optimum grade raw material along with other components, procured from the acknowledged vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have appointed a team of dedicated personnel whose untiring efforts have enabled us to gain a reputed name in the international market. Further, our whole production processes and other business tasks are maintained by our team mates at different departments and levels. They take care of the latest technologies that are outfitted at our end. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nOur offered range of Gas \u0026amp; Oil Burner, Industrial Boiler, Hot Air Generator, Heating Equipment and Spares For Burner is widely appreciated in the market for its precision designs and construction that stands tall on peerless quality parameters. To provide clients with the best products, we make sure to utilize optimum grade raw material that is procured from the authentic sources of the market.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have a setup of a well structured infrastructure at our end that is outfitted with all the basic and modern technology that enables us to manufacture a peerless quality assortment of Gas \u0026amp; Oil Burner, Industrial Boiler, Hot Air Generator, Heating Equipment and Spares For Burner. In addition to this, experienced professionals at our end make sure to work in compliance with the customer’s needs and demands that help them to attain maximum level of satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EResearch \u0026amp; Development:\nWe have a separate team of Research and Development which conducts extensive research activities. The research team works solely in order to satisfy the technically advanced requirements of our clients. They have helped us in achieving the success by offering effective and technologically advanced machines to our esteemed clients.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nwe offer Process Burner, High Temperature Burner, Gas Burner, Gas Burner Two Stages Panel, Dual Fuel Burner and Dual Fuel Burner. Along with this, we offer Dual Fuel Burner Panel, Single Stage Gas Burner, Steam Boiler, Boiler, Hot Air Generator, Oil Filter, Burner Spare Parts and others.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7781/247781v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7781/247781v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7781/247781v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}