{"name": "Shyaamashyam Traders",
 "permalink": "shyaamashyam-traders",
 "crunchbase_url": "http://www.crunchbase.com/company/shyaamashyam-traders",
 "homepage_url": "http://www.indiamart.com/shyaamashyamtraders/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shyaamashyamtraders@tradepassport.org",
 "phone_number": "9821345722",
 "description": "Manufacturing, supplying and exporting,",
 "created_at": "Fri Apr 05 14:29:02 UTC 2013",
 "updated_at": "Fri Apr 05 14:29:05 UTC 2013",
 "overview": "\u003Cp\u003ESince our inception in the year, 2006, we, “Shyaamashyam Traders”, are considered one of the reputed manufacturers, suppliers and exporters of a wide array of Pure Saffron products. Under this range, we offer a qualitative assortment of Fresh Saffron, Saffron Threads, 1/2 gm Saffron, Kashmiri Saffron, Indian Saffron, 5 gm Saffron, 2 gm Saffron, 1 gm Saffron and lot more. These fresh saffron spices are largely used for taste enhancement in various Indian cuisines. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Standards:\nMaintaining effective quality standards is our first priority. Over the years, we have gathered immense knowledge and experience in offering a flawless range of products. These products are widely appreciated for several qualitative attributes. We always ensure that the entire range of products offered by us is in compliance with the specified standards and norms of the industry.\u003C/p\u003E\n\n\u003Cp\u003EOur infrastructure:\nFor conducting all the manufacturing processes in an organised and streamlined manner, we have developed a state-of-art infrastructure unit. This infrastructure unit is well-equipped with all modern amenities and facilities. We have set up an advanced gamut of machinery and equipment at our premises to carry out hassle free productions processes.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:Client Satisfaction:\nWe are committed towards ensuring the likes and dislikes of our esteemed clients. For this, we continuously strive to be in touch with them by conducting several conferences and feedback sessions. We include each and every specifications and details provided by the customers in the offered range of products so as to stand tall on the expectations of our valuable patrons. \nWe are supported by a team of adroit and diligent professionals, who put up their best efforts in serving the customers with a quality-approved range of products. These professionals are selected after a strict assessment of their qualities, skills and proficiency. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8772/248772v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8772/248772v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8772/248772v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}