{"name": "Shyama Textile",
 "permalink": "shyama-textile",
 "crunchbase_url": "http://www.crunchbase.com/company/shyama-textile",
 "homepage_url": "http://www.indiamart.com/shyamatextileengineers/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "precision-cheese-winder-machine, icon-winding-machine, vertical-winder-machine",
 "alias_list": null,
 "email_address": "shyamatextileengineers@tradepassport.org",
 "phone_number": "9426150118",
 "description": "Manufacturing and supplying Texturising ",
 "created_at": "Fri Apr 05 13:29:40 UTC 2013",
 "updated_at": "Fri Apr 05 13:29:43 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1999, we, \u0026#8220;Shyama Textile Engineers\u0026#8221;, are a trusted name engaged in manufacturing and supplying a comprehensive range of TTexturising Machine,jari coning machine,draw winder machine,jari covering hollow machine,Textile Machinery Our range of products include TFO Machine, Precision Cheese Winder Machine, Icon Winding Machine, Vertical Winder Machine, Cheese Winder, , Pineapple Conning Machine, Winding Machinery Parts and others. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a sound, sophisticated and well-maintained infrastructure, spread across a vast area of land. For the purpose of accelerating the production process, we have divided the entire unit into various departments. All these departments are impeccably furnished with the latest technology and advanced amenities, in order to carry out the manufacturing process in a smooth and streamlined manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are enriched with a team of highly experienced and qualified professionals, who are extremely knowledgeable about their respective domains and are instrumental in offering a qualitative range of Texturising Machine, Jari Coning Machine, Draw Winder Machine, Jari Covering Hollow Machine, Textile Machinery Our range of products include TFO Machine, Precision Cheese Winder Machine, Icon Winding Machine, Vertical Winder Machine, Cheese Winder, Pineapple Conning Machine, Winding Machinery Parts and others. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nEver since the time of inception, the primary aim of our organization has been to serve our clients with a qualitative range of products. In order to achieve the same, we exercise high-grade quality raw material in fabricating these machines, in compliance with international quality standards. Furthermore, our professionals make use of the latest technology based tools and equipment in designing these machines, in order to remain ahead in this highly competitive industry.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a customer-centric organization, we manage to serve our clients with a flawless range of machines. All these products are fabricated using premium quality raw material which is obtained from authentic sources of the industry, in absolute compliance with international quality standards. For the purpose of meeting their exact requirements, we make all these machines available to them in varied sizes and specifications.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nTTexturising Machine,jari coning machine,draw winder machine,jari covering hollow machine,Textile Machinery Our range of products include TFO Machine, Precision Cheese Winder Machine, Icon Winding Machine, Vertical Winder Machine, Cheese Winder, , Pineapple Conning Machine, Winding Machinery Parts and others. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8696/248696v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8696/248696v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8696/248696v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}