{"name": "SignTurbine",
 "permalink": "signturbine",
 "crunchbase_url": "http://www.crunchbase.com/company/signturbine",
 "homepage_url": "http://signturbine.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "flag, turbine, vertical, wind, power, electricity, energy, renewable, management, generation, clean, sign, ad, advertise, advertising, green",
 "alias_list": null,
 "email_address": "info@signturbine.com",
 "phone_number": "",
 "description": "Power Generation Management System",
 "created_at": "Sun May 06 16:34:59 UTC 2012",
 "updated_at": "Thu May 10 03:03:22 UTC 2012",
 "overview": "\u003Cp\u003ESignTurbine creates independent renewable power generation management systems.\u003C/p\u003E\n\n\u003Cp\u003ESignTurbine is engaged in the design of the FlagTurbine, which is a vertical wind turbine that provides advertising and electricity generation. It is interfaced into the SignTurbine Power Generation Management System to form an efficiency management network of load demand power management and distribution. The primary focus is to develop the foundation for clean charging of electric cars located in the parking lots. This target is first directed toward automotive dealerships to impact the transition of their product and provide the direction for additional business integration such as Banks, Universities, Restaurants, Retail, etc\u0026#8230;.\u003C/p\u003E\n\n\u003Cp\u003EOne quarter of the world electricity is consumed by lighting. By impacting power generation, lighting consumption and utilization management, SignTurbine can progressively impact the transition to energy independence.  Flag poles and light poles are underutilized and SignTurbine uses this existing structural and electrical wiring foundation to minimize overall cost in creating power generation management systems. America’s over 4 million parking lots can become power generation systems that promote the Green Energy of Advertising. Converting the single usage concept of powering lights in parking lots, into a controlled bi-directional process of power generation, distribution and load management, turns consumption into manufacturing, utilizing existing foundations. The 4 million parking lots that consume an estimated 200 TWh annually can become 2 PWh electricity manufacture.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       115],
      "assets/images/resized/0018/8039/188039v2-max-150x150.jpg"],
     [[250,
       193],
      "assets/images/resized/0018/8039/188039v2-max-250x250.jpg"],
     [[450,
       347],
      "assets/images/resized/0018/8039/188039v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}