{"name": "Signagelive",
 "permalink": "signagelive",
 "crunchbase_url": "http://www.crunchbase.com/company/signagelive",
 "homepage_url": "http://www.signagelive.com",
 "blog_url": "http://www.signagelive.com/index.php/news/",
 "blog_feed_url": "http://www.signagelive.com/index.php/feed/",
 "twitter_username": "Signagelive",
 "category_code": "software",
 "number_of_employees": 22,
 "founded_year": 1997,
 "founded_month": 11,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "digital-signage, digital-media, social-media, android, ios",
 "alias_list": null,
 "email_address": "ceo@signagelive.com",
 "phone_number": "+44 (0)1799 530110",
 "description": "Cloud-based digital media platform",
 "created_at": "Wed Sep 26 21:11:51 UTC 2012",
 "updated_at": "Fri Oct 12 20:30:00 UTC 2012",
 "overview": "\u003Cp\u003ESignagelive is a private company and a world leader in cloud-powered media delivery solutions, providing a platform that runs even the largest networks reliably, efficiently and cost effectively.\u003C/p\u003E\n\n\u003Cp\u003EOur UK and head office is based near Cambridge and our North American office is based in Chicago IL.\u003C/p\u003E\n\n\u003Cp\u003EOur platform allows you to deliver rich media to virtually any device.  It’s not just about the screens on the wall: from shelf-edge displays to video walls to the screen saver on the computer you’re reading this on, Signagelive unlocks affordable messaging solutions across industries and applications.\u003C/p\u003E\n\n\u003Cp\u003EHardware Agnostic\nWe don’t dictate what you have to use to power your displays.  We’ve certified dozens of boxes and add new ones all the time.  PC’s Android, screensaver, you name it.\u003C/p\u003E\n\n\u003Cp\u003ESimple, but Scalable\nDrag and Drop in your web browser, no installation needed.  Live video?  Check.  Video walls?  Check.  Multi-thousand endpoint, geographically distributed network with a mix of media players, file formats, HR and corporate messaging with dozens of administrators?  Check, check, check, check, check, check….. and check.\u003C/p\u003E\n\n\u003Cp\u003ECloud Based\nAll you need is a display, media player and an internet connection; we take care of the rest.  On-premise servers, lengthy installation and complicated licensing agreements are a thing of the past.\u003C/p\u003E\n\n\u003Cp\u003EAffordable Digital Signage\n6 products, 2 prices: £425/€510/$640 for the full Display Edition license, £200/€240/$300 for everything else. All licences include unlimited storage, software updates, support and users.\nFeature packed software easy to use, but very powerful\u003C/p\u003E\n\n\u003Cp\u003EAutomate Content\nWe feel your pain: you don’t have the time or the money to hire an agency to create content for you. That’s why Signagelive works with some of the best content delivery companies in the industry. News, sports, weather and entertainment are available, as well as Facebook and other apps.\u003C/p\u003E\n\n\u003Cp\u003EUse Existing Desktops\nWith Signagelive Screensaver and Corporate Communication Editions you can use any existing PC to deliver your message. Every time the PC goes into screensaver mode is an opportunity to message: Post important HR messages about health benefits;Show reminders on safety training;Show the companies Facebook or Twitter feed. Anything you can do with a screen on the wall, you can do on your company desktops.\u003C/p\u003E\n\n\u003Cp\u003EChoose Your Own Hardware\nSignagelive can run on a standard Windows-powered PC, but did you know that we also certify solid-state media players as well? Looking for HTML5-driven content? Try IAdea. 1080p video playback? BrightSign.\u003C/p\u003E\n\n\u003Cp\u003EDrag and Drop\nManage your network from anywhere, anytime, using any browser. Simply upload assets such as images, videos, live TV and web pages, drag them into a playlist and publish all via the cloud. You can also publish content by utilising meta-data, allowing automatic distribution by region, language, income levels, or anything else you can think of.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       42],
      "assets/images/resized/0021/3209/213209v2-max-150x150.png"],
     [[250,
       70],
      "assets/images/resized/0021/3209/213209v2-max-250x250.png"],
     [[250,
       70],
      "assets/images/resized/0021/3209/213209v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Jason",
      "last_name": "Cremins",
      "permalink": "jason-cremins",
      "image": null}},
   {"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Marc",
      "last_name": "Benson",
      "permalink": "marc-benson",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "UK Head Office",
    "address1": "Rectory Farm Barns, Walden Road",
    "address2": "Little Chesterford",
    "zip_code": "CB10 1UD",
    "city": "Saffron Walden",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.dailydooh.com/index.php?s=signagelive",
    "title": "DailyDOOH articles"}]}