{"name": "Silicon House",
 "permalink": "silicon-house",
 "crunchbase_url": "http://www.crunchbase.com/company/silicon-house",
 "homepage_url": "http://www.siliconhouse.net",
 "blog_url": "http://blogs.siliconhouse.net",
 "blog_feed_url": "http://blogs.siliconhouse.net/",
 "twitter_username": "siliconhouse",
 "category_code": "network_hosting",
 "number_of_employees": 100,
 "founded_year": 1998,
 "founded_month": 12,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "silicon-house, siliconhouse-reviews, siliconhouse-chennai, silicon-house-chennai, siliconhouse-net, silicon-hosting, web-hosting-india, web-hosting-chennai, reseller-hosting-india, linux-reseller-hosting, domain-registration, icann",
 "alias_list": "",
 "email_address": "sales@siliconhouse.net",
 "phone_number": "0091-44-24412748",
 "description": "Webhosting",
 "created_at": "Thu Jul 14 17:24:35 UTC 2011",
 "updated_at": "Sun Apr 07 07:31:05 UTC 2013",
 "overview": "\u003Cp\u003ESilicon House is a global leader in providing internet infrastructure and application development. For more than a decade, we have helped many of the corporate houses around the world to re-build their empire in the digital economy. Our presence is spread in over 57 countries.\u003C/p\u003E\n\n\u003Cp\u003EOur focus lies in implementing Internet business solutions such as domain name registration, web hosting, email solutions, high performance dedicated server clusters, application hosting for e-commerce and SaaS, payment gateways, media streaming etc.\u003C/p\u003E\n\n\u003Cp\u003EOn one hand we help small NGOs to make a web presence, on the other hand we are implementing e-governance for conglomerate federations for tracking thousands and thousands of their members. Be it a dedicated server solution for distribution chain management or a small hosting solution for a SOHO, our process \u0026amp; product automation has enabled us to provide the most sophisticated solution at the shortest possible time.\u003C/p\u003E\n\n\u003Cp\u003EAt Silicon House, we invest on high quality and future secured technologies. The State-Of-The-Art infrastructure, fully automated processes and dedicated world class support has been key to our success. Being an ISO 9001:2000 certified organization, our processes are well defined and globally benchmarked.\u003C/p\u003E\n\n\u003Cp\u003EWe are e-transforming organizations in North America, West Europe, Middle East, Asia and Australia. We constantly work on identifying your business needs and developing innovative solutions that address them completely. We future secure your business by constantly updating you on the latest trends of the digital economy.\u003C/p\u003E\n\n\u003Cp\u003EResearch and Development is our passion and work on some of the most exciting avenues such as Artificial Intelligence, VOIP \u0026amp; Video, Corporate Compliance, YBOX Shield, Super Reseller Suite, Extension of EPP in mitigating risks in e-commerce environment. These research has resulted in truly beneficial and cutting edge products such as XMAIL Trac, AIO, .Net based EPP tool kit etc.\u003C/p\u003E\n\n\u003Cp\u003EThe power behind Silicon House is our experienced and energetic team. We are a professionally managed and technology driven company.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       54],
      "assets/images/resized/0024/9209/249209v1-max-150x150.jpg"],
     [[193,
       70],
      "assets/images/resized/0024/9209/249209v1-max-250x250.jpg"],
     [[193,
       70],
      "assets/images/resized/0024/9209/249209v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "18, First Floor,Corporation Commercial Complex,",
    "address2": "Opp: CPWD Quaters, Third Main Avenue, Indira Nagar.",
    "zip_code": "600020",
    "city": "Adyar, Chennai",
    "state_code": null,
    "country_code": "IND",
    "latitude": 13.0011774,
    "longitude": 80.2564957}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.thewhir.com/web-hosting-news/sil022105",
    "title": ""},
   {"external_url": "http://www.hinduonnet.com/2005/02/17/stories/2005021704531800.htm",
    "title": ""}]}