{"name": "SimCraft",
 "permalink": "simcraft",
 "crunchbase_url": "http://www.crunchbase.com/company/simcraft",
 "homepage_url": "http://www.simcraft.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2003,
 "founded_month": 3,
 "founded_day": 31,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "simulator, simulation, simracing, flightsim, motion-simulation, motion-simulator, racing-simulator, racing-simulation, flight-simulator, flight-simulation",
 "alias_list": null,
 "email_address": "contact@simcraft.com",
 "phone_number": "877.746-2723",
 "description": "racing and flight simulation",
 "created_at": "Wed Aug 19 14:29:20 UTC 2009",
 "updated_at": "Mon Oct 12 22:32:00 UTC 2009",
 "overview": "\u003Cp\u003ESimCraft\u0026#8217;s core innovation and technology is the simulation of vehicle movement. The company\u0026#8217;s proprietary software and patented hardware provide realistic motion for racing simulation with zero latency from controls in to motion out. This high performance system provides an unparalleled virtual environment for drivers to hone their technical skills, experiment with vehicle setups, and imprint track layouts with motion cueing.\u003C/p\u003E\n\n\u003Cp\u003EThe SimCraft story began in 1997 with an idea; born from the late William MacDonald; for a balanced mass architecture to reduce the need for expensive high force actuation. This one idea created the concept for a new, more effective, more organic, and more affordable way to simulate vehicle dynamics. William MacDonald completed several versions of the new motion simulation method in fully functional applications and launching the first SimCraft product in 1999. Despite further revisions to the system, at the time of his passing, only a couple years later, the vision of William MacDonald for a distributable motion simulator was still unfulfilled. By mid-2003, Sean Patrick MacDonald, the founders son, began a complete refinement on what is now established as the proprietary SimCraft architecture. The original center of mass idea continued to develop over a 5 year period that encompassed what the company refers to as the Primus project.\u003C/p\u003E\n\n\u003Cp\u003EAs several generations of prototyping ensued, so did the young company\u0026#8217;s needs for planning in manufacturing and business development and SimCraft soon partnered with XenGenn, LLC, to catalyze these efforts and help refine the new technology and expand its applications. SimCraft\u0026#8217;s now patented simulation technology appeals to drivers and pilots alike because of its high-fidelity performance and military-grade quality. The company\u0026#8217;s proprietary software and hardware combination provides the most realistic motion experience with zero latency between the physical system and the software.\u003C/p\u003E\n\n\u003Cp\u003EAlong the journey of development toward compelling simulation, SimCraft\u0026#8217;s unique technology has been applied to practical application. As a result, the company is working on a United States government funded project called S.A.V.E. - Synthetic Automotive Virtual Environments - a research project to study, understand, and in the end effectively simulate the dynamics of a vehicle being driven in a loose surface environment. (Dirt, mud, snow, sand, gravel, etc.) This project aims to save the lives of the men and women in uniform by giving them a real training environment - synthetically - to practice high speed loose surface driving techniques. Collaborating on this project with SimCraft are Ford Motor Company, MIT, GA Tech, the Army Corps of Engineers, and Vehicle Control Training, among others.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to working with the bright minds involved in S.A.V.E., SimCraft\u0026#8217;s team has been working with professionals and serious amateurs in motorsports and aviation, specifically because it is within these groups where the company\u0026#8217;s benchmark of high performance is defined. Taking in these experiences and feedback over the years, the company has prototyped many different versions of the SimCraft application. The company launched the APEX sc830 in January, 2009 at the Consumer Electronics Show in Las Vegas, Nevada.\u003C/p\u003E\n\n\u003Cp\u003ESimCraft\u0026#8217;s motion simulators interface with dozens of commercially available PC based racing and flight titles as well as custom training applications for the military and commercial industries.\u003C/p\u003E\n\n\u003Cp\u003ESimCraft is a member company of the Advanced Technology Development Center at the Georgia Institute of Technology and is headquartered just outside Atlanta, Georgia.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0006/2532/62532v2-max-150x150.jpg"],
     [[250,
       62],
      "assets/images/resized/0006/2532/62532v2-max-250x250.jpg"],
     [[450,
       112],
      "assets/images/resized/0006/2532/62532v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "SimCraft",
    "address1": "1705 Enterprise Way",
    "address2": "Suite 102",
    "zip_code": "30067",
    "city": "Marietta",
    "state_code": "GA",
    "country_code": "USA",
    "latitude": 33.913559,
    "longitude": -84.492355}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}