{"name": "Simer Engineering Works",
 "permalink": "simer-engineering-works",
 "crunchbase_url": "http://www.crunchbase.com/company/simer-engineering-works",
 "homepage_url": "http://www.indiamart.com/simerengineeringworks/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mountings--couplings, anti-vibration-mount",
 "alias_list": null,
 "email_address": "simerengineeringworks@tradepassport.org",
 "phone_number": "9971222443",
 "description": "Suppliers of assortment of Power ",
 "created_at": "Fri Apr 05 06:06:35 UTC 2013",
 "updated_at": "Fri Apr 05 06:06:37 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nIncepted in the year 1989, at Noida (Uttar Pradesh, India), we, “Simer Engineering Works”, are renowned as the distinguished manufacturer and supplier of a comprehensive assortment of Power Transmission Accessories, Anti Vibration Mounts, Rubber Mat, Rubber Seal, Cast Iron Hub, Holset Coupling \u0026amp; Dala Pad, etc.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur extensive infrastructural unit is installed with modern fabrication technology and equipment that is spread over a wide area of land. Having sound infrastructure that incorporates variegated departments, which ensures the smooth production of an exclusive range of products, the company’s success rate is rising with a very high pace.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a team of highly dedicated and knowledgeable professionals that assists us to bring an excellent range of offered products. They work in close association with each other in order to achieve the company’s objectives of delivering quality assured products within the scheduled time frame. Moreover, in order to supply flawless range of products, they follow a strictly manufacturing process and stringently inspect each stage, right from procurement of raw material to final dispatch of goods.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nAs a quality centric firm, we work towards offering flawless quality products to our clients. We have allotted an experienced team of quality controllers who perform with great enthusiasm and dedication. Our offered products are tested by our skilled quality inspectors for any discrepancy following strict quality management policy that is designed as per the company’s procedure. Manufactured as per the universal norms, we ensure that the products are defect free.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nWe are the leading choice of the clients that are spread all over the nation, because of the ethical business policies that we adopt and of our offered products that fall in line with the universal standards. Having attained the highest client satisfaction, we are counted amongst our competitors. Following are the parameters that make us stand apart from our counterparts in this highly competitive market:\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8305/248305v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8305/248305v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8305/248305v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}