{"name": "Simplifydigital",
 "permalink": "simplifydigital",
 "crunchbase_url": "http://www.crunchbase.com/company/simplifydigital",
 "homepage_url": "http://www.simplifydigital.co.uk",
 "blog_url": "http://blog.simplifydigital.co.uk",
 "blog_feed_url": "http://blog.simplifydigital.co.uk/feed/",
 "twitter_username": "simplifydigital",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "compare-broadband, broadband-deals, broadband-providers, compare-broadband-deals",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Digital made simple",
 "created_at": "Wed Aug 18 09:33:02 UTC 2010",
 "updated_at": "Wed Aug 18 23:35:55 UTC 2010",
 "overview": "\u003Cp\u003EWhether you\u0026#8217;re a digital veteran or a digital virgin, Simplifydigital has one main aim - to make comparing, buying and installing digital TV, broadband and home phone services as simple as possible for you.\nThe Simplifydigital service is unique - there is nothing else like it, online or on the high street.\nWhat makes Simplifydigital different?\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cp\u003EWe are proud to be the only digital TV, broadband and home phone comparison service in the UK whose price comparison calculator is fully accredited by the UK regulator Ofcom to ensure accurate and impartial advice.  So the top deals we show you are genuinely the best around\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EOn average we save our customers Â£360 pa by finding them better deals.  Indeed our latest research shows that 10% of our customers save an amazing Â£462 per year! This is because we have a huge range of top deals to choose from all the top UK providers including AOL, BE Broadand, BT, Freesat, Freeview, O2, Orange, Plusnet, Post Office, Sky, TalkTalk, Tariam, T-Mobile, Virgin Media, Vodafone and 3.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EWe offer a unique \u0026#8220;digital concierge\u0026#8221; service, providing customers a free and impartial consultation via our friendly experts over the phone - to find the best value digital TV, broadband and home phone deals.  And the experts remain on hand to ensure that the services are installed with minimum of fuss.  They are available free on 0800 542 4704.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EOur online comparison service is designed to allow you to find a package that meets your precise needs at the cheapest price and our unique Personal Shopper allows you to choose the best package for you, simply be \u0026#8220;telling\u0026#8221; the Personal Shopper in plain English what you want - and the Personal Shopper does the rest of the work for you! \u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003ETo ensure that we give you the best possible advice and experience, Simplifydigital is a fully independent company (not linked to any of the service providers that we sell). \u003C/p\u003E\n\n\u003Cp\u003EWe first launched in late 2007 and since then we have generated a lot of media coverage as our service is genuinely different from the rest.  We were recently features on BBC Breakfast News and Channel 5\u0026#8217;s Gadget Show, as well as in most of the national newspapers, including:  The Daily Mail, The Telegraph, The Observer, The Sun and The Independent.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       31],
      "assets/images/resized/0009/8284/98284v2-max-150x150.png"],
     [[250,
       53],
      "assets/images/resized/0009/8284/98284v2-max-250x250.png"],
     [[278,
       59],
      "assets/images/resized/0009/8284/98284v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "London Office",
    "address1": "1 Lyric Square",
    "address2": "",
    "zip_code": "W6 0NB",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}