{"name": "SimpleE Technologies",
 "permalink": "simplee-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/simplee-technologies",
 "homepage_url": "http://www.indiamart.com/simpleetechnologies/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "single-port-ethernet-to-serial-converter, two-port-ethernet-to-serial-converter, modbus-tcpip-rtu-to-modbus-serial-rtu-gateway-board",
 "alias_list": null,
 "email_address": "simpleetechnologies@tradepassport.org",
 "phone_number": "9969282800",
 "description": "Manufacturer, wholesaler, supplier,",
 "created_at": "Thu Apr 04 12:50:55 UTC 2013",
 "updated_at": "Thu Apr 04 12:50:57 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, we, “Simple E Technologies”, are counted among the prominent manufacturers, wholesalers, suppliers and exporters of superior quality Serial Converters, Digital \u0026amp; Analog Input \u0026amp; Output Card and Date Acquisition Board. The range offered by us includes TTL To Ethernet Converter Module, Single Port Ethernet To Serial Converter, Two Port Ethernet To Serial Converter, MODBUS TCP/IP RTU to MODBUS Serial RTU Gateway Board, USB Converter Strip and USB to Serial Converter. In addition to this, we offer 8 Channel Analog Input Card, 8 Channel Analog Input-Output Card, 16 Channels Digital Output Board, 16 Channels Isolated Digital Input Board and GSM-GPRS Dialer. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by a team of skilled professionals, which helps us in developing a quality assured range of Serial Converters, Digital \u0026amp; Analog Input \u0026amp; Output Card and Date Acquisition Board. These professionals hold vast experience in this domain and manufacture the products as per the set industry standards and norms. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nOur organization pays high attention on the quality of our entire range of Serial Converters, Digital \u0026amp; Analog Input \u0026amp; Output Card and Date Acquisition Board. For this, we source superior quality raw material from the most reliable and certified vendors of the market to manufacture these products as per the international standards and norms.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nBased in Mumbai, Maharashtra, India, we have developed a contemporary infrastructure, which helps us in fulfilling the diverse requirements of our clients on time. Spread across a wide area, this infrastructure is well-segregated into various departments. This helps in carrying out the entire business operations in a swift manner.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe give high attention on attaining the complete satisfaction of our respected customers. For this, we make sure to offer a quality assured range of Serial Converters, Digital \u0026amp; Analog Input \u0026amp; Output Card and Date Acquisition Board to our clients as per their requirements. Our team members remain in contact with the clients, understand their requirements and serve them accordingly. Apart from this, for the convenience of our customers, we accept payment from various simple modes. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nThe range offered by us includes TTL To Ethernet Converter Module, Single Port Ethernet To Serial Converter, Two Port Ethernet To Serial Converter, MODBUS TCP/IP RTU to MODBUS Serial RTU Gateway Board, USB Converter Strip and USB to Serial Converter. In addition to this, we offer 8 Channel Analog Input Card, 8 Channel Analog Input-Output Card, 16 Channels Digital Output Board, 16 Channels Isolated Digital Input Board and GSM-GPRS Dialer. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/7910/247910v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/7910/247910v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/7910/247910v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}