{"name": "Sindicatum",
 "permalink": "sindicatum",
 "crunchbase_url": "http://www.crunchbase.com/company/sindicatum",
 "homepage_url": "http://www.sindicatum.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "cleantech",
 "number_of_employees": 170,
 "founded_year": 2005,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Sustainable Resources",
 "created_at": "Sat Mar 10 20:46:00 UTC 2012",
 "updated_at": "Tue Mar 20 21:27:20 UTC 2012",
 "overview": "\u003Cp\u003EKey people\u003C/p\u003E\n\n\u003Cp\u003EColin Goodall, Chairman; Assaad Razzouk, CEO; Michael Boardman, CFO; Robert Driscoll, President; Anthony Moody, Chairman of Asia\u003C/p\u003E\n\n\u003Cp\u003EProducts\u003C/p\u003E\n\n\u003Cp\u003EProject management\u003C/p\u003E\n\n\u003Cp\u003EEmployees\u003C/p\u003E\n\n\u003Cp\u003E170\u003C/p\u003E\n\n\u003Cp\u003EWebsite\u003C/p\u003E\n\n\u003Cp\u003Ewww.sindicatum.com\u003C/p\u003E\n\n\u003Cp\u003ESindicatum Sustainable Resources is a global sustainable resources company headquartered in Singapore. Sindicatum is an operator of clean energy projects worldwide and producer of sustainable resources from the utilization of natural products and waste.\u003C/p\u003E\n\n\u003Cp\u003ESindicatum moved its headquarters from London to Singapore in 2009 to be closer to its assets, most of which are in Asia. In 2011, Sindicatum Sustainable Resources became its new trading name (replacing Sindicatum Carbon Capital) because it more accurately describes what the group does.\u003C/p\u003E\n\n\u003Cp\u003ESindicatum uses its own expertise and capital to develop climate change mitigation projects from conception through to implementation and long-term operation, working in partnership with companies and governments to deliver cost effective means by which to reduce greenhouse gas emissions. Areas of specialization include abating GHG emissions from the waste management and natural resource sectors, as well as biomass and energy efficiency applications.\u003C/p\u003E\n\n\u003Cp\u003ESindicatum finances, executes and applies technologies to its projects and its team of engineers, technicians and climate change specialists working in four business units (US, India, South East Asia and China) to identify opportunities, develop solutions, implement projects and oversee their operation. SCC has raised more than US$ 300 million to date, of which US$ 200 million is invested in Asia and the United States. To date, SCC has 34 projects in China, India, Southeast Asia and the United States.[3]\u003C/p\u003E\n\n\u003Cp\u003ESindicatum is headquartered in Singapore and has business units and offices in Washington DC, New Delhi, Bangkok, Jakarta, London and Beijing.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}