{"name": "Sinelogix Technology",
 "permalink": "sinelogix-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/sinelogix-technology",
 "homepage_url": "http://www.sinelogix.com",
 "blog_url": "http://blog.sinelogix.com/",
 "blog_feed_url": "http://feeds.feedburner.com/ SinelogixTechnology",
 "twitter_username": "sinelogixseo",
 "category_code": "software",
 "number_of_employees": 15,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design, website-design, web-designers, web-development, content-management-systems, cms, ecommerce-solutions, ecommerce, hosting",
 "alias_list": null,
 "email_address": "todennismiller@gmail.com",
 "phone_number": "9019615566",
 "description": "providing software \u0026 internet solutions",
 "created_at": "Fri May 24 06:16:19 UTC 2013",
 "updated_at": "Mon May 27 15:07:06 UTC 2013",
 "overview": "\u003Cp\u003ESinelogix Technologies is an information technology company, providing customized software and internet solutions. Sinelogix Technologies is a team of dedicated and highly skilled software professionals focused on providing world class IT solutions. We offer a variety of services in the area of software and web development.\u003C/p\u003E\n\n\u003Cp\u003EOur Team\nWe have a committed team of professionals with experience in variety of tools and platforms. Our developers keep themselves updated with the latest technology trends. Our skilled people share a common vision of growth. We do what we believe in, and we believe in what we do.\nOur Leadership\nSinelogix Technologies is headed by a young, enthusiastic, entrepreneur with a strong technical background. He possesses extensive experience in IT industry and has successfully implemented many large scale projects. His technical insights combined with excellent managerial skills ensure a continuous growth for the company following a unique business model.\nOur Belief\nWe believe in utilizing technology to make things simple and easy to use. We also believe in thinking ahead and delivering products or services that can fit well with upcoming future technologies.\nOur Vision\nWe see ourselves as the world’s leading Information Technology company providing quality solutions backed up by unbeatable customer service.\nOur Focus\nMaximize the rewards of our diversity and delivery capabilities by providing end to end solutions, which are easy to maintain and upgrade. Modular Programming approach to provide innovative and easily manageable solutions, enabling customers all over the world to benefit from our services.\nPlease contact us to learn more about our company, services and capabilities.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       32],
      "assets/images/resized/0026/6316/266316v2-max-150x150.jpg"],
     [[250,
       54],
      "assets/images/resized/0026/6316/266316v2-max-250x250.jpg"],
     [[417,
       91],
      "assets/images/resized/0026/6316/266316v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}