{"name": "sinhasoft",
 "permalink": "sinhasoft",
 "crunchbase_url": "http://www.crunchbase.com/company/sinhasoft",
 "homepage_url": "http://www.sinhasoft.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "software",
 "number_of_employees": 20,
 "founded_year": 2004,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sinhasoft-com--open-source-solutions, joomla-web-design-delhi, new-delhi, web-designing-company-delhi, web-site-hosting-delhi, web-design-delhi, web-design-outsourcing-delhi, web-designers-delhi, hosting-delhi, delhi-ontario-web-design, ecommerce-website-",
 "alias_list": null,
 "email_address": "amit@sinhasoft.com",
 "phone_number": "919312105628",
 "description": "",
 "created_at": "Thu Apr 16 09:49:21 UTC 2009",
 "updated_at": "Thu Apr 16 21:23:46 UTC 2009",
 "overview": "\u003Cp\u003ESinhaSoft is a professional web design company in India (New Delhi) that supplies services of web design and development, web application development, professional ecommerce online shopping systems, Flash multimedia, website hosting, search engine optimization (SEO), software development and graphic design.\u003C/p\u003E\n\n\u003Cp\u003ESinhaSoft features an integrated team of web consultants, creative designers, programmers and SEO professionals that know how to get online results. Skill and Expertise are the tools we use to make the web work for your business bringing in maximum return on your investment in shortest possible time.\u003C/p\u003E\n\n\u003Cp\u003EOur business-driven approach separates us from typical web design companies. For more than three years, we have built a reputation for creating a positive return on investment for our clients. If you are serious about your web success, we can get you there. Strategic thinking, top designers, personal attention, competitive prices, real world results - discover the Sinha Soft difference.\u003C/p\u003E\n\n\u003Cp\u003EWeb Design and Web Development Solutions: As a complete web solutions company we offer customer-oriented web design services and more importantly, deliver them effectively. Whether you are a small business or a large corporate, SinhaSoft can help you achieve an online presence to give cutting edge to your business. If your goal is to provide information, products, e-commerce or online services, we can ensure that the visitors to your site enjoy an informative, user-friendly and interactive experience. We utilize the skills of our designers, experienced specialist programmers, SEO specialists and business management experts.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       45],
      "assets/images/resized/0004/1511/41511v2-max-150x150.png"],
     [[212,
       65],
      "assets/images/resized/0004/1511/41511v2-max-250x250.png"],
     [[212,
       65],
      "assets/images/resized/0004/1511/41511v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}