{"name": "Sino Biological",
 "permalink": "sino-biological",
 "crunchbase_url": "http://www.crunchbase.com/company/sino-biological",
 "homepage_url": "http://www.sinobiological.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": 200,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "Order@sinobiological.com",
 "phone_number": "+86-10-51029968",
 "description": "Antibody Protein Biological CRO",
 "created_at": "Tue Jan 05 09:05:37 UTC 2010",
 "updated_at": "Wed Jan 06 04:03:44 UTC 2010",
 "overview": "\u003Cp\u003ESino Biological provides a comprehensive set of biological solutions, including contract biological laboratory services and biological reagents, to help our customers accelerate their life science research, drug discovery, and biological product development. Our cutting-edge state-of-the-art platform technologies and proprietary processes allow us to deliver high quality results and products at record speed. Our solutions enable our clients to expand their in-house capacity, accelerate research and development programs, and generate significant cost-savings. Five of the top ten international pharmaceutical companies have taken advantages of our advanced platforms and high-quality services to support their drug discovery and biological R\u0026amp;D programs.\u003C/p\u003E\n\n\u003Cp\u003ESino Biological is a worldwide leader in recombinant protein and antibody expression using multiple platform technologies, including transient expression in mammalian cells, stable cell line expression, E. coli. fermentation, and baculovirus expression. Sino Biological is also emerging as an antibody service and diagnostic reagent provider through its creative and innovative antibody generation solutions including anti-idiotype antibody generation and IgM purification platforms.\u003C/p\u003E\n\n\u003Cp\u003EWe also offer a comprehensive list of biological research solutions including research protein and antibody reagents, purification resins, enzymes, transfection reagents, and diagnostic ELISA kits. We offer high quality reagents at a significant cost saving as compared to prices at US and Europe.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0007/2248/72248v2-max-150x150.png"],
     [[245,
       60],
      "assets/images/resized/0007/2248/72248v2-max-250x250.png"],
     [[245,
       60],
      "assets/images/resized/0007/2248/72248v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}