{"name": "SivaSakthi Springs",
 "permalink": "sivasakthi-springs",
 "crunchbase_url": "http://www.crunchbase.com/company/sivasakthi-springs",
 "homepage_url": "http://www.indiamart.com/siva-sakthi-springs/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "siva-sakthi-springs@tradepassport.org",
 "phone_number": "9585320078",
 "description": "manufacturing and supplying",
 "created_at": "Fri Apr 05 09:29:42 UTC 2013",
 "updated_at": "Fri Apr 05 09:29:48 UTC 2013",
 "overview": "\u003Cp\u003ESiva Sakthi Springs came into existence in the year 1991 and carved a niche as the leading manufacturer, exporter and supplier of a wide range of Coil Springs, Torsion Springs, Compression Springs, Industrial Springs and Industrial Washers. In addition to this, we also engaged in trading, supplying and exporting of Grinding \u0026amp; Drilling Machines. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Facilities:\nWe have developed well-equipped infrastructural unit, which is efficiently equipped with advanced facilities. This unit is technologically advanced and enables us to carry our business operations in smooth and efficient manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Clientele:\nWe have garnered huge clientele all across the globe by serving them with the products of best quality. We designed and developed our range as per the complete customer’s choice and try our best to serve them in an efficient manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Manpower:\nWe have been able to sustain the top position in industry by serving our clients in best possible manner. It became easy for us to understand the customer’s demands and serve them efficiently because of the efforts made by our skilled team. We have recruited them based upon their knowledge and expertise in the domain and further responsibilities were assigned to them accordingly. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base?:\nWe are able to efficiently address the diverse demands and requirements of our valued clients, owing to the long lasting relationship with our vendors. Our vendors provide us immaculate quality products at industry leading prices.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have become the first choice of the clients by serving them in an appropriate manner. Our skilled staff and well-equipped infrastructure has helped us to withstand the tough market competition in an efficient manner.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0024/8483/248483v2-max-150x150.jpg"],
     [[250,
       96],
      "assets/images/resized/0024/8483/248483v2-max-250x250.jpg"],
     [[260,
       100],
      "assets/images/resized/0024/8483/248483v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}