{"name": "Sivoo",
 "permalink": "sivoo",
 "crunchbase_url": "http://www.crunchbase.com/company/sivoo",
 "homepage_url": "http://www.sivoo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "games_video",
 "number_of_employees": 8,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "video, web-video, video-distribution",
 "alias_list": null,
 "email_address": "help@sivoo.com",
 "phone_number": "(215) 592-0483",
 "description": null,
 "created_at": "Tue Jun 10 18:12:36 UTC 2008",
 "updated_at": "Sat Jan 19 04:14:55 UTC 2013",
 "overview": "\u003Cp\u003ESivoo provides IT infrastructure for IP video, and has created a digital-media asset management solution to intake, encode, distribute, and monetize video across distribution channels including Internet, mobile, IPTV, and cable using Internet protocol (IP).\u003C/p\u003E\n\n\u003Cp\u003EThis solution is called CEDR, which is an acronym describing the life-cycle of IP-managed video (Capture, Encode, Distribute, and Report). CEDR leverages what we call \u0026#8220;cluster-in-cloud computing\u0026#8221; in order to radically transform this life-cycle from a cost-intensive, geographically specific, and hardware-dependent process to a cost efficient, decentralized, and software based process that resides in the \u0026#8220;cloud.\u0026#8221; CEDR has been developed by SIVOO and is proprietary to the Company.\u003C/p\u003E\n\n\u003Cp\u003ECEDR creates digital video assets from any format or source including Satellite, Internet stream, hard media, or digital file; encodes captured video into any and/or multiple specifications like CableLabs, Flash, Windows Media, Quicktime, H.264, MPEG2, etc.; distributes these assets to any IP video or broadcast distribution outlet; and tracks the views and monetization of assets in a single report.\u003C/p\u003E\n\n\u003Cp\u003EWith CEDR, video assets are easily and automatically managed and distributed by and between MSOs, content aggregators, and distribution outlets. CEDR allows customers to pull video assets between locations as either a file or as a stream-link on the Internet Edge. CEDR can also push video assets to Internet sites like YouTube and MetaCafe, mobile platforms like Verizon V-Cast, IPTV providers like Verizon FIOS TV and Verismo, and cable companies like Comcast.\u003C/p\u003E\n\n\u003Cp\u003ECEDR distribution outlets include AOL, Brightcove, Charter Communications, eyespot, Grouper, Guba, HotWire, iFilm, iTunes Podcasts, Joost, jumpcut, JumpTV, MediaMelon, MetaCafe, MobiTV, MySpace, SES Americom, Terra, Verismo, Verizon FIOS TV, Verizon V-Cast, Videoegg, Vimeo, VOY, VSocial, and YouTube. SIVOO is actively growing its distribution reach.\u003C/p\u003E\n\n\u003Cp\u003ESIVOO earns fees from processing video through CEDR and shares in the advertising revenue generated by views across CEDR distribution outlets. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0002/0226/20226v1-max-150x150.png"],
     [[250,
       62],
      "assets/images/resized/0002/0226/20226v1-max-250x250.png"],
     [[277,
       69],
      "assets/images/resized/0002/0226/20226v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": null,
    "address1": "239 Chestnut St",
    "address2": "",
    "zip_code": "19147",
    "city": "Philadelphia",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": 39.948587,
    "longitude": -75.145654}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}