{"name": "SJ International",
 "permalink": "sj-international",
 "crunchbase_url": "http://www.crunchbase.com/company/sj-international",
 "homepage_url": "http://www.sjjewelry.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 100,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fine-jewelry, wholesale-jewelry",
 "alias_list": null,
 "email_address": "sjonline@sjjewelry.com",
 "phone_number": "",
 "description": "Jewelry Company ",
 "created_at": "Fri May 11 17:51:08 UTC 2012",
 "updated_at": "Wed May 16 23:54:10 UTC 2012",
 "overview": "\u003Cp\u003E.J. International has a wide selection of jewelry.  From classic pieces to one-of-a-kind items, the gallery has an impressive selection for you to choose from.  And if there is something unique you wish to create, S.J. International is also able to assist and advice you to create the piece you envision.  S.J. International is home to many goldsmiths, diamond graders, gemologists and innumerable dedicated people who have over the years contributed their expertise to create an enjoyable jewelry experience.  \u003C/p\u003E\n\n\u003Cp\u003EWith S.J. International’s commitment to quality and service, the Thai Government recognized S.J. International as one of the leading players in the jewelry industry.  In addition, S.J. International has won several titles awarded by the Thai Government, including the “Top Ten Jewelry Design Award.”  S.J. International is also a highly regarded member of the Jewelry Trade Association in Thailand.  \u003C/p\u003E\n\n\u003Cp\u003EA continuous assurance to quality and service is important to S.J. International and the company believes that knowledgeable and personable human resource is one of the keys to fulfill this commitment.  It supports its current staff by encouraging and providing them with the necessary skills to achieve greater levels.  S.J. International has two full-time Gemologists (both graduated from the Gemological Institute of America) who are also constantly in touch with the industry’s movements and happenings; they are trained to give you advices on gem stone type and quality. \u003C/p\u003E\n\n\u003Cp\u003EWith superior designs, excellent service, and highly competitive prices, S.J. International has been attracting buyers from all over the world.  Meeting and surpassing, customer’s satisfaction is S.J. International’s utmost important commitment.  From the company’s outstanding reputation, S.J. International is placed at the forefront of the jewelry industry. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}