{"name": "SK Enterprises",
 "permalink": "sk-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/sk-enterprises",
 "homepage_url": "http://www.indiamart.com/skenterprisesjaipur/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "skenterprisesjaipur@tradepassport.org",
 "phone_number": "9950692608",
 "description": "manufacturer and supplier of Jens Gloves",
 "created_at": "Fri Apr 05 09:32:54 UTC 2013",
 "updated_at": "Fri Apr 05 09:32:58 UTC 2013",
 "overview": "\u003Cp\u003ES. K. Enterprises was established in 2007 and has been doing best in the relevant field. Our company has been in the field of manufacturing and supplying of Hand Gloves, Leather Products, Safety Masks, Cotton Cloth and many more. Our company has been engaged in providing only quality products to our valued clients without any delay and at reasonable prices. We leave no scope for any kind of complaint to be made by our clients due to our flawless services always.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have been able to carry out efficient and smooth production of quality products due to well equipped and advanced infrastructure facility in our own promises. It is well equipped with all the ultra modern and sophisticated amenities to ensure hassle free and efficient operations. The whole infrastructure is divided into units like that of manufacturing unit, tannery, research \u0026amp; development wing and warehousing \u0026amp; packaging division.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur company has able to perform at its best due to efficient team of industrious personals. The team members are experts in their relevant field with good amount if experience and knowledge. This team of highly skilled and diligent professionals helps us to meet the specific requirements of the clients. Our team efficiently handles all the business operations and judiciously utilizes all the machines and equipments.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe ensure to make use of finest grade raw material and advanced technology for manufacturing the products. Our quality inspectors strictly adhere to certain parameters so as to deliver flawless end products. \u003C/p\u003E\n\n\u003Cp\u003EOur Strengths:\nOur company has been able to mark a distinctive place for ourselves in this competitive market because it meets both the qualitative and quantitative demands of the clients. Some of the business objectives that have contributed in our phenomenal success are as follows:\n    Providing quality products\n    Innovative gifting ideas\n    Bulk supply\n    Competitive prices\n    Sophisticated Packaging\n    Making on time deliveries\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8486/248486v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8486/248486v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8486/248486v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}