{"name": "Skeedka",
 "permalink": "skeedka",
 "crunchbase_url": "http://www.crunchbase.com/company/skeedka",
 "homepage_url": "http://www.skeedka.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "SKEEDKA",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@skeedka.com",
 "phone_number": "647-836-3619",
 "description": "Daily Deal Marketplace",
 "created_at": "Thu Apr 14 17:24:33 UTC 2011",
 "updated_at": "Sat Apr 16 18:47:35 UTC 2011",
 "overview": "\u003Cp\u003EA daily deal marketplace that allows users to buy and sell unused daily deal vouchers.\u003C/p\u003E\n\n\u003Cp\u003ESKEEDKA was designed to give consumers the opportunity to take back control when it comes to group buying. SKEEDKA is an online marketplace for the exchange of unused daily deal vouchers. As a member you are able to buy and sell daily deals that were previously sold on sites like Groupon and LivingSocial.\u003C/p\u003E\n\n\u003Cp\u003ESkeedka.com gives users several options to buy and sell daily deals through a secure and user-friendly platform. Sellers can post deals for sale through auction style listings, sell them for a fixed price, or accept best offers. Buyers are given the opportunity to buy, bid on, or make offers for unused daily deals in their city.\u003C/p\u003E\n\n\u003Cp\u003ESkeedka.com has implemented various safeguards to ensure the safety of its users. All Sellers must go through a simple and easy identity validation process. Skeedka requires sellers to provide their credit card number, in order to use tools such as Verified by Visa and MasterCard SecureCode to ensure that Sellers are who they say they are.\nSpecialties:\u003C/p\u003E\n\n\u003Cp\u003EProvide an easy to use and safe platform, several options to buy and sell daily deals, post deals for sale through auction style listings, sell them for a fixed price, or accept best offers, buy, bid on, or make offers for unused daily deals in your city. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}