{"name": "Sketchcan Ltd.",
 "permalink": "sketchcan-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/sketchcan-ltd",
 "homepage_url": "http://www.sketchcan.com",
 "blog_url": "http://www.sketchcan.com/blog",
 "blog_feed_url": "http://www.sketchcan.ie/blog/?feed=rss2",
 "twitter_username": "sketchcan",
 "category_code": "ecommerce",
 "number_of_employees": 3,
 "founded_year": 2006,
 "founded_month": 1,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "art, art-prints, limited-edition-prints",
 "alias_list": null,
 "email_address": "john@sketchcan.ie",
 "phone_number": "00353 65 6824750",
 "description": "Digital and traditional Illustration",
 "created_at": "Sat Feb 27 14:36:25 UTC 2010",
 "updated_at": "Mon Mar 01 19:25:15 UTC 2010",
 "overview": "\u003Cp\u003ELimited Edition Art Prints - Sketchcan.ie\u003C/p\u003E\n\n\u003Cp\u003Esketchcan Ltd. is based in Ireland, along the wild Irish west coast. We produce and\nprovide unique and often rare images and works of art by established and new artists\nand photographers. These works come as original art works or as limited edition art\nprints. Our collection is growing daily and is for serious collectors and new\ncollectors that are just beginning a collection. A collection can beginning on a\nsmall budget its not unattainable and can be a great investment.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;This is a place for artists and collectors to make there own, I wanted this to be a\nplace where collectors can get in touch and tell me \u0026#8216;I think you should do this or I\nwant you to do that, \u0026#8217; I want collectors involved in the growth of sketchcan, as\nartists and photographers will be, I want them to feel this is about new ideas and\ntrying new things to bring both artists and collectors closer, knowing what each\nwants.\u0026#8221; say\u0026#8217;s  John Lee one of the Founder\u0026#8217;s of Sketchcan.\u003C/p\u003E\n\n\u003Cp\u003EFor the Love Of Art\nthe company was first developed in 2000, and with the support of  the Enterprise\nBoard and the European Union, through the NDP and Shannon Development, it became\nSketchcan ltd. in 2005.\n\u0026#8220;I\u0026#8217;m an artist, I\u0026#8217;ve been painting since I was born more or less, I was brought up\nwith it, my father was a painter and it just flows through my veins\u0026#8221;  say\u0026#8217;s John,\nAfter several years working in feature animation both in Ireland and around Europe\nhe decided to go with what felt right and begin a platform for artists and\ncollectors, having worked along so many talented people he could see the potential\nbeing lost in the production mentality.  With a passion for classical art, and the\nrespect to the  practice of great artists and the work involved, its important and\nnecessary to create something to bring attention to that side of the art. \u003C/p\u003E\n\n\u003Cp\u003EArt Prints \u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E    Our Prints come with a seal, or an embossed seal which is placed in the\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003Ebottom left hand corner, and each art work is signed by the artist who\ncreated the work and on the back carries the details of the printer and the\ntime and date of printing. Along with that a certificate is created unique\nto the art prints and this along with the work caries a unique serial number\nwith can be used to track and authenticate the art prints resale history and\nother important details. We keep records of all art prints and are available\nto purchasers for any occasion that requires them to show proof of any kind\nin any situation. Our Art prints are printed by artists so the integrity of\nthe original is carried through to the reproduction or giclee print.  This\nof course dose not relate to prints that are not printed by us but sold by\nus. Giclee Printing is a french term relating to the process of jet\nprinting, or fine art printing. Its used by top galleries around the world\nand top art print stores.\u003C/p\u003E\n\n\u003Cp\u003EArtists and Photographers.\u003C/p\u003E\n\n\u003Cp\u003EHere is an opportunity to work with artists in a creative environment where your\ninput is taken on board and may help shape the next step. Its a place to show work\nby exceptional artists who are successful and those who have been left on the\noutside for some reason or other,  Photographers and Artists can sink into dispear\nbecause they haven\u0026#8217;t the opportunity to get directly involved with something like\nsketchcan, now you can. The Internet is a rapidly changing but powerful medium and\nis less daunting if you belong to a close knit network of like minds, get in touch,\nlet us know all about you and your work.\u003C/p\u003E\n\n\u003Cp\u003EWhat Artists are you looking for ?\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;Art is art, illustration to installation, its all mark making, either on paper or\non your mind \u0026#8221; is the way John Described it when I asked him that question. All\nArtists and Photographers are welcome to join us, Illustrator\u0026#8217;s, painter\u0026#8217;s,\nsculpture\u0026#8217;s, film makers, designers, fashion photographers, exhibitionists etc.\u003C/p\u003E\n\n\u003Cp\u003EWhere do you see it going in terms of art\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;I want this to take shape by the people involved, the artists, the photographers\nthe collectors, designers, software developers.. with that collective input and when\nthere is a balanced input of ideas and creative direction then it will be a success.\nA platform for collecting and showing great work otherwise lost,\u0026#8221; John Lee, Director\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003ESketchcan Ltd. \u003C/li\u003E\n\u003C/ul\u003E",
 "image":
  {"available_sizes":
    [[[150,
       146],
      "assets/images/resized/0007/8483/78483v2-max-150x150.png"],
     [[250,
       243],
      "assets/images/resized/0007/8483/78483v2-max-250x250.png"],
     [[450,
       438],
      "assets/images/resized/0007/8483/78483v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}