{"name": "Skills Matter",
 "permalink": "skills-matter",
 "crunchbase_url": "http://www.crunchbase.com/company/skills-matter",
 "homepage_url": "http://skillsmatter.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "skillsmatter",
 "category_code": "software",
 "number_of_employees": 12,
 "founded_year": 2003,
 "founded_month": 11,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "community, software, scala, python, haskell, fsharp, java, dotnet, agile, software-craftsmanship, testing, ddd, architecture, bdd, conferences, talks, meetups, training, space, courses, nosql, html5, javascript, web, groovy, grails, spring, nservicebus, n",
 "alias_list": null,
 "email_address": "marketing@skillsmatter.com",
 "phone_number": "02071839040",
 "description": "Real Experts Real Skills",
 "created_at": "Mon Oct 08 13:05:51 UTC 2012",
 "updated_at": "Wed Dec 12 07:02:02 UTC 2012",
 "overview": "\u003Cp\u003ESkills Matter is a hyper active, 9 year old startup, sustaining a community of over 35,000 passionate developers in London and some 200,000 world wide. Our mission is to help members in our community learn and share skills to write better software. We do so by staying right on top and ahead of trends. We weed through them and serve the relevant ideas, technologies and innovations to our community through our expert-led talks, conferences, training courses, articles, hackatons, meetups\u0026#8230;.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to organising our own events, we help realise events by many software and programming related meetup groups in London. Some of these groups prefer to be left to their own devices - so we help them by providing space to meet, to converge, to cross pollinate. Other groups rely on our support to introduce them to some of the most brilliant experts, by filming their talks, presentations or meetups (including demo-ed code, slides and film footage) or they like us to help grow their community\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EBesides playing host to many meetup groups, we also run our very own In the Brain Series, comprising of talks by the world\u0026#8217;s most innovative minds, often the creators of new ideas or practices, who we invite over to London to share their expertise, skills and Brain with our community. These talks are free and we often run 2 or 3 different talks each night (except Friday, when our team goes for a drink :-)\u003C/p\u003E\n\n\u003Cp\u003EIf you learned something new at any of our talks, the deal is you try it out at work or on your pet project and, if you learn something new whilst doing so, we hope you come back to share what you\u0026#8217;ve learned with others in our community!\u003C/p\u003E\n\n\u003Cp\u003EWe also run some 25 different conferences every year, both in London and New York. We ussually run a conference when we have discovered a new trend of ideas, technology or practice - we believe in it - and are keen to spread the word \u0026#8230; Our 1 or 2 day eXchanges offer a brilliant opportunity to learn all about these in a small, intimate environment where speakers and attendees mingle, share skills and attend talks. With plenty of breaks and a speaker delegate ratio of 1:6, you can really spend time directly with the creators - to learn what the technology is now, but also where it is going.  Our Progressive Technology Tutorials are 2 to 3 day long conferences, comprising of 4-hour long hands-on workshops on the theme Technology, as well as software craftsmanship and agile best practices.\u003C/p\u003E\n\n\u003Cp\u003EAnd once you\u0026#8217;ve decided to adopt a technology or practice on your project, you can come along to one of our multi-day courses. You\u0026#8217;ll be learning from real experts: the creators, inventors and authors of the technologies and ideas. Who better to put your questions to and get your hands dirty with?!\u003C/p\u003E\n\n\u003Cp\u003EIf you are unable to join us in our London or New York venues, don\u0026#8217;t despair. Just visit http://skillsmatter.com where you\u0026#8217;ll find thousands of SkillsCast video recordings of all those brilliant expert-led talks. Our SkillsCast video\u0026#8217;s feature film footage as well as code and slides, so many in our community find these useful - we hope you\u0026#8217;ll find these useful too!\u003C/p\u003E\n\n\u003Cp\u003EFinally, we publish a magazine, The Open Source Journal, packed with in-depth technical articles, which you ca pick up at our events or get delivered to your desk, for free, by emailing osj-subscribe@skillsmatter.com\u003C/p\u003E\n\n\u003Cp\u003EThat\u0026#8217;s it - hope to see you soon - so you can check us out or real - Find out what\u0026#8217;s up at skillsmatter.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       59],
      "assets/images/resized/0021/4657/214657v2-max-150x150.png"],
     [[150,
       59],
      "assets/images/resized/0021/4657/214657v2-max-250x250.png"],
     [[150,
       59],
      "assets/images/resized/0021/4657/214657v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Wendy",
      "last_name": "Devolder",
      "permalink": "wendy-devolder",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$5M",
 "funding_rounds":
  [{"round_code": "unattributed",
    "source_url": "http://venturebeat.com/2012/12/06/london-calling-developer-hub-rings-up-5m-to-foster-software-innovation-in-europe/",
    "source_description": "London calling: Developer hub rings up $5M to foster software innovation in Europe",
    "raised_amount": 5000000.0,
    "raised_currency_code": "USD",
    "funded_year": 2012,
    "funded_month": 12,
    "funded_day": 6,
    "investments":
     [{"company": null,
       "financial_org":
        {"name": "Beringea Private Equity",
         "permalink": "beringea-private-equity",
         "image":
          {"available_sizes":
            [[[150,
               108],
              "assets/images/resized/0002/8939/28939v1-max-150x150.png"],
             [[159,
               115],
              "assets/images/resized/0002/8939/28939v1-max-250x250.png"],
             [[159,
               115],
              "assets/images/resized/0002/8939/28939v1-max-450x450.png"]],
           "attribution": null}},
       "person": null}]}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Skills Matter",
    "address1": "116-120 Goswell Road",
    "address2": "",
    "zip_code": "EC1V 7DP",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.5245148,
    "longitude": -0.0991562}],
 "milestones":
  [{"description": "Skills Matter raises $5M to invest in its thriving community of passionate software developers",
    "stoned_year": 2012,
    "stoned_month": 12,
    "stoned_day": 5,
    "source_url": "http://venturebeat.com/2012/12/06/london-calling-developer-hub-rings-up-5m-to-foster-software-innovation-in-europe/",
    "source_text": null,
    "source_description": "",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Skills Matter",
      "permalink": "skills-matter"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}