{"name": "SkilledWizard",
 "permalink": "skilledwizard",
 "crunchbase_url": "http://www.crunchbase.com/company/skilledwizard",
 "homepage_url": "http://www.skilledwizard.com",
 "blog_url": "http://www.tumblr.com/blog/skilledwizard",
 "blog_feed_url": "",
 "twitter_username": "SkillWizard",
 "category_code": "ecommerce",
 "number_of_employees": 12,
 "founded_year": 2012,
 "founded_month": 4,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "skilled-workers, jobs, hiring, social-media, manufacturing, engineering",
 "alias_list": null,
 "email_address": "lexi@skilledwizard.com",
 "phone_number": "917-449-4331",
 "description": "Networking site for Skilled Workers",
 "created_at": "Sat Aug 11 01:49:04 UTC 2012",
 "updated_at": "Mon Aug 13 01:03:44 UTC 2012",
 "overview": "\u003Cp\u003ESkilledWizard is The largest Professional Social Network dedicated to Skilled Workers in every corner of the world. \u003C/p\u003E\n\n\u003Cp\u003EFounders:\u003C/p\u003E\n\n\u003Cp\u003EJohn Ducar - \u003C/p\u003E\n\n\u003Cp\u003EFounder / CEO of SkilledWizard.com:John moved up the executive ladder in awesome organizations (UPS,DHL, SAKS 5th Avenue) Then began his own Sales business specifically designed for clients in the importing and exporting business globally. John has a deep passion and appreciation for creating great company cultures. Deep practice in lean Human Capital. John has been fortunate to have great mentors and a unique background crossing over many functional areas of responsibilities. John has a tremendous appreciation for talent, retention and has zero fear to step out of the normal boundaries to improve companies. A true change catalyst that believes anything is possible. John enjoys time with his beautiful wife and daughter. \u003C/p\u003E\n\n\u003Cp\u003ESebastian Skwarek - \u003C/p\u003E\n\n\u003Cp\u003ECo - Founder and EVP of Technology at SkilledWizard.com.Sebastian entered the IT field over 14 years ago. In 2001, he opened his first IT company specializing in IT development and systems integration. Over the past 10 years, his company has served large public and private organizations throughout the U.S. and Canada as Adobe® Solutions Partner, Adobe® Solutions Integrator and AmazonAWS Solution Provider. In 2003, his company Microinput (www.microinput.com) expanded into Eastern Europe and has since become recognized by Adobe as a leading provider of IT solutions (www.boldalliance.com) in that part of the world. Sebastian’s company continues to be involved in diverse projects with large financial institutions, various fortune 500 companies, as well as government agencies throughout United States, Canada, and Eastern Europe. \u003C/p\u003E\n\n\u003Cp\u003ESebastian is also an Adobe Certified Instructor, offering his expertise in the areas of development and integration. Sebastian has dedicated himself to a career of creating systems using Adobe, Open Source and Cloud Based (AmazonAWS) technologies that allow companies to become more efficient at what they do. It is this experience and dedication to creating enhanced systems for leading-edge companies around the world that Sebastian brings to all industries. Sebastian enjoys time with his wife and son. \u003C/p\u003E\n\n\u003Cp\u003EAlexandra Nolan - Executive Vice President of Creative Strategy and Social Media. Alexandra has over ten years of experience in creative development in several industries. She has championed social media campaigns in the hospitality sector and designed websites for various clients. Her background is in photography publishing and digital design. She is an avid photographer and equestrian. Alexandra enjoys time with her husband, daughter and Bulldog.\u003C/p\u003E\n\n\u003Cp\u003ESkilledWizard\u0026#8217;s team has collaborated to bring the most necessary platform for Skilled Workers Worldwide. We set out to erase the void that currently exists today. We have focused throughout our architecture process to ensure our end user experience will be simple, relevant, and that our technology will be seamless for our end users regardless of Mobile, Web or Tablet use. We have poured our resources into the end user and maximizing the relevancy of our app when we Launch in November 2012 (and every day thereafter). A true platform to improve the world.\u003C/p\u003E\n\n\u003Cp\u003EThe world is built on competition and Skilled Workers are in high demand in every corner of the world. While combining my collective experience in human resources, operations, and the global exposure it greatly afforded ; I realized the disconnect between the demand for these workers and the supply. During my importing and exporting sales business I was exposed to many parts of the world. As I would close deals I would have candid conversations with clients from many industries. The majority expressed their interest in a platform to directly connect with the Skilled Worker population. It was clear as day to me that Skilled Workers are vital to all societies and they are the people that create the products, develop the technology and transport our consumer goods.\u003C/p\u003E\n\n\u003Cp\u003EI made each of these business partners a promise that I would make it happen and now we are living the moment! - John Ducar\u003C/p\u003E\n\n\u003Cp\u003EWhat problem does SkilledWizard solve?\u003C/p\u003E\n\n\u003Cp\u003ESkilledWizard solves the void seen in the media multiple times everyday. That void is the global critical shortages of Skilled Workers. We have created the community where Skilled Workers can connect with other Skilled Workers, and employers can have access to the critical population they need. Our technology makes it simple and seamless to connect career opportunities directly(no more job boards!). While also addressing education resources so we can improve the caliber of talent, connecting the world so Skilled Workers can find the work when they are needed. Companies can improve the products they manufacture, the supply chain industry will improve by eliminating the shortages of drivers and those are two powerful examples that SkilledWizard addresses.\u003C/p\u003E\n\n\u003Cp\u003EOur secret sauce is coming in November. A small hint: our platform is super end user relevant and their experience will be unmatched! We will be introducing an individualized \u0026#8220;Wizard Board\u0026#8221; where the Skilled Worker member will create a magical place to improve their life, or the life of a fellow Skilled Worker!\u003C/p\u003E\n\n\u003Cp\u003EWhat\u0026#8217;s one dilemma you\u0026#8217;ve encountered in the startup process?\u003C/p\u003E\n\n\u003Cp\u003ECreating a business is a journey! We deeply believe in collaboration. When you have a strong , diverse team there are decisions that become very passionate and that is amazing, when it hinders our progress I step in and make the best decision for SkilledWizard.com we look at this as a positive dilemma!\u003C/p\u003E\n\n\u003Cp\u003EWe love the challenge of all the moving parts and finding the necessary balance. Do not be mistaken, starting a business from scratch tests you each day. There are many outstanding ideas but execution, hitting the milestones and driving forward humble are key. An idea has to come to life and that is where the true test of champions begin!\u003C/p\u003E\n\n\u003Cp\u003EWe feed off our passion for SkilledWizard, as we know we are going to make a difference in every corner of the world. There is nothing more rewarding then helping people. \u003C/p\u003E\n\n\u003Cp\u003EWe are investing our dollars into protecting our users (privacy, security, e.t.c\u0026#8230;), a lean Human Capital Model, and our end user content and experience.  We have a unique advertising platform and we will continue to enhance this to be the leaders in online advertising for our Corporate Sponsors and users..\u003C/p\u003E\n\n\u003Cp\u003ESkilledWizard.com is live today for Pre-Registrations and we will be introducing continuous updates to members that Pre-register. \u003C/p\u003E\n\n\u003Cp\u003EWe officially launch November 2012, we will deliver a monthly update that will come form our membership feedback model so we constantly re-enforce the commitment to end user relevancy. \u003C/p\u003E\n\n\u003Cp\u003ESkilledWizard.com LIVE TODAY and OFFICIAL LAUNCH NOVEMBER 2012!!!\u003C/p\u003E\n\n\u003Cp\u003EWhere can people find out more?\u003C/p\u003E\n\n\u003Cp\u003EOn our website:\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.skilledwizard.com\u003C/p\u003E\n\n\u003Cp\u003EOur Blog:\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.tumblr.com/blog/skilledwizard\u003C/p\u003E\n\n\u003Cp\u003E\u0026amp; on our pages:\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.twitter.com/skillwizard\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.facebook.com/skilledwizard\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.twylah.com/SkillWizard\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[144,
       150],
      "assets/images/resized/0020/5548/205548v2-max-150x150.jpg"],
     [[241,
       250],
      "assets/images/resized/0020/5548/205548v2-max-250x250.jpg"],
     [[342,
       354],
      "assets/images/resized/0020/5548/205548v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO/Founder",
    "person":
     {"first_name": "John",
      "last_name": "Ducar",
      "permalink": "john-ducar",
      "image": null}},
   {"is_past": false,
    "title": "EVP of Technology",
    "person":
     {"first_name": "Sebastian",
      "last_name": "Skwarek",
      "permalink": "sebastian-skwarek",
      "image": null}},
   {"is_past": false,
    "title": "EVP of Creative Strategy \u0026 Social Media",
    "person":
     {"first_name": "Alexandra",
      "last_name": "Nolan",
      "permalink": "alexandra-nolan-2",
      "image":
       {"available_sizes":
         [[[144,
            150],
           "assets/images/resized/0020/5892/205892v2-max-150x150.jpg"],
          [[241,
            250],
           "assets/images/resized/0020/5892/205892v2-max-250x250.jpg"],
          [[342,
            354],
           "assets/images/resized/0020/5892/205892v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [{"competitor":
     {"name": "SkilledWorkers.com",
      "permalink": "skilledworkers-com",
      "image": null}},
   {"competitor":
     {"name": "LinkedIn",
      "permalink": "linkedin",
      "image":
       {"available_sizes":
         [[[150,
            68],
           "assets/images/resized/0001/1055/11055v23-max-150x150.png"],
          [[150,
            68],
           "assets/images/resized/0001/1055/11055v23-max-250x250.png"],
          [[150,
            68],
           "assets/images/resized/0001/1055/11055v23-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "304 E 38th Street",
    "address2": "",
    "zip_code": "10016",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0020/5547/205547v2-max-150x150.png"],
      [[250,
        156],
       "assets/images/resized/0020/5547/205547v2-max-250x250.png"],
      [[450,
        281],
       "assets/images/resized/0020/5547/205547v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}