{"name": "Sky Software",
 "permalink": "sky-software",
 "crunchbase_url": "http://www.crunchbase.com/company/sky-software",
 "homepage_url": "http://www.skyits.com",
 "blog_url": "http://www.skyits.com/company/news",
 "blog_feed_url": "http://www.skyits.com/rss.xml",
 "twitter_username": "skysoftwareco",
 "category_code": "software",
 "number_of_employees": 40,
 "founded_year": 1997,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it, software, hotel, resort, club, human-resources, hr, payroll, quality, engineering, management, ivr, recruiting, training, attendance, mobile, fixed-assets, booking, reservation, store, inventory, fb, food, beverage, recipe, cost-control",
 "alias_list": null,
 "email_address": "info@skyits.com",
 "phone_number": "+962 (0)6 533-9616",
 "description": "Total hospitality software solutions",
 "created_at": "Wed Feb 27 08:34:28 UTC 2013",
 "updated_at": "Sun Mar 03 08:12:43 UTC 2013",
 "overview": "\u003Cp\u003ESky Software provides the hospitality industry world-wide with the most advanced and innovative high-quality software solutions and IT services.\u003C/p\u003E\n\n\u003Cp\u003ESky Software has been a trusted name in software development since 1997 and continues to provide the hospitality industry world-wide with the most advanced and innovative high-quality software solutions and IT services that cover all modern hospitality business needs such as property and financial management, materials control, human resources and payroll, time attendance control, quality and engineering management using the latest programming technologies and tools while providing professional implementation, training, and technical support services to our clients.\u003C/p\u003E\n\n\u003Cp\u003ESky Software is now known as a major provider of advanced solutions and associated professional services covering development and customization, project management and implementation, interfacing with major international systems, as well as customer care and technical support.\u003C/p\u003E\n\n\u003Cp\u003EAs a result of its fast-growing reputation, Sky Software succeeded in capturing the attention of a number of international hotel corporations, who have consistently listed Sky Software products and services as their preferred solution throughout their hotel groups both locally and internationally. Some examples are IHG group (Intercontinental Hotels, Crowne Plaza and Holiday Inns) , Rotana, Four Seasons MEA Hotels and Moevenpick hotels MEA. Those hotels selected Sky Software\u0026#8217;s many products to handle their operations in the areas of Telephone Management, FBM (Food, Beverage and Materials Management), Quality Management, Engineering and Maintenance, and Human Resources Management Systems with Sky Software\u0026#8217;s innovative Bayan HR system.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0023/8655/238655v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0023/8655/238655v2-max-250x250.jpg"],
     [[300,
       300],
      "assets/images/resized/0023/8655/238655v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "31 Ahmad Tarawinah Str.",
    "address2": "PO Box 2164",
    "zip_code": "11941",
    "city": "Amman",
    "state_code": null,
    "country_code": "JOR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}