{"name": "SL Eyewear",
 "permalink": "sl-eyewear",
 "crunchbase_url": "http://www.crunchbase.com/company/sl-eyewear",
 "homepage_url": "http://www.indiamart.com/sleyewear/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "acetate-eyeglass-frames, acetate-spectacle-frames-and-eyewear-sunglasses",
 "alias_list": null,
 "email_address": "sleyewear@tradepassport.org",
 "phone_number": "9998196240",
 "description": "SL Eyewear is a reckoned manufacturer, ",
 "created_at": "Thu Apr 04 09:06:19 UTC 2013",
 "updated_at": "Thu Apr 04 09:06:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we, “SL Eyewear”, are listed at the apex among widely acclaimed manufacturers, suppliers, distributors and wholesalers of Optical Frames and Sunglasses. The range of spectacles we bring forth is consists of Acetate Eyeglass Frames, Acetate Spectacle Frames and Eyewear Sunglasses. All these offered eyewear spectacles are manufactured using optimum quality acetate, polyamide, plastic, monal, stainless steel,gold, aluminum and polyflex. Clients prefer these spectacles for their striking attributes such as light weight, extreme comfortability wearing, smooth edges, attractive designs, unique patterns, trendy styles, excellent finish and soft texture.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nIt is our human resource, which acts as the major driving force behind the success of our all business operations. A team of dexterous professionals has been appointed by us to design and manufacture Acetate Eyeglass Frames, Acetate Spectacle Frames and Eyewear Sunglasses in a seamless manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur quality is major attribute of our organization, which is always adhered to with an aim to facilitate clients with best-in-class Acetate Eyeglass Frames, Acetate Spectacle Frames and Eyewear Sunglasses. Each frame that we offer is manufactured in tandem with the international industry guidelines and standards. We obtain optimum quality material from our associated vendors and ensure that an attractive assortment of eyewear is dispatched from our premises. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nAdhering to our set aim of completing entire production process within the committed time-frame, we have strategically constructed a sprawling infrastructure setup at Vadodara, Gujarat. We have furnished the entire setup with latest equipment and amenities that are essentially required for undertaking smooth flow of entire production process related to manufacturing of Acetate Eyeglass Frames, Acetate Spectacle Frames and Eyewear Sunglasses. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe employ all our efforts towards attainment of utmost customer satisfaction. In order to meet the exact expectations of the patrons, we offer unmatched Acetate Eyeglass Frames, Acetate Spectacle Frames and Eyewear Sunglasses that are manufactured using supreme quality basic material, in compliance with their requirements.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7725/247725v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7725/247725v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7725/247725v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}