{"name": "SLS Worldwide Transportation",
 "permalink": "sls-worldwide-transportation",
 "crunchbase_url": "http://www.crunchbase.com/company/sls-worldwide-transportation",
 "homepage_url": "http://www.slstransportation.com",
 "blog_url": "http://www.slstransportation.com/blog",
 "blog_feed_url": "",
 "twitter_username": "selectlimousine",
 "category_code": "security",
 "number_of_employees": 300,
 "founded_year": 1993,
 "founded_month": 11,
 "founded_day": 14,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "limousine-los-angeles, limousine-service-austin, limousine-minneapolis",
 "alias_list": null,
 "email_address": "slsaustin@hotmail.com",
 "phone_number": "(310) 737-7571",
 "description": "Limousine Austin Los Angeles",
 "created_at": "Tue May 14 16:15:25 UTC 2013",
 "updated_at": "Wed May 15 21:29:43 UTC 2013",
 "overview": "\u003Cp\u003ESLS Worldwide Transportation is a nation luxury transportation firm with major bases in Los Angeles, Minneapolis, New York, and Las Vegas. SLS Worldwide Transportation offers the very best value in executive transportation, airport transfers, charters, personal or corporate sedan, limousine, SUV, mini-coach, shuttle or motor coach/bus charters and chauffeured transportation. Whether you are accustomed to livery or luxury limousine car services, you will find SLS Worldwide Transportation is the company for you.\u003C/p\u003E\n\n\u003Cp\u003EWe are a company large enough to meet the needs of any corporate client, with bases in every major city throughout the United States, and an affiliate network throughout the world.  At the same time, we cater to the needs of individual clients seeking limousine or Town Car service for airport transfers and hourly assignments. We eagerly support our clients in their personal transportation needs, whether it be with airport transportation, nights out on the town, charters, custom tours, or other car services and chauffeured ground transportation. Whether it be a CEO, executive or any administrative staff member, SLS treats everyone as a VIP and looks forward to the opportunity to get to assist our clients with their personal and individual chauffeured transportation and livery/car-service needs. We even routinely assist our clients with their ground transportation needs for weddings, anniversaries, wine tasting trips, funerals, children’s proms, nights out on the town, award shows and company parties, mom and dad date-nights, ski trips, ball games, and many other charter services. \u003C/p\u003E\n\n\u003Cp\u003EWe offer comprehensive account management to corporate clients who require nationwide and international transportation for their executives and staff.  Our state of the art dispatch and accounting system ensures that thousands of transfers can be managed seamlessly and accurately by our staff. Years of development and numerous global clients have resulted in an affiliate network so established and standardized that the service may seem seamless to the end customer. SLS can also customizes national “single-rate” pricing plans for our volume clients with routine travel.\u003C/p\u003E\n\n\u003Cp\u003EPassengers can travel most anywhere in the world and feel assured that they will receive the best quality transportation from a proven and successful network. They can also be comforted by the fact that SLS has completed quality control evaluations, has all ready worked out the details of the transportation, will stay involved in the assignment to completion and will bill or charge the client only a single bill, no matter where the transportation took place.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[28,
       43],
      "assets/images/resized/0026/2241/262241v2-max-150x150.jpg"],
     [[28,
       43],
      "assets/images/resized/0026/2241/262241v2-max-250x250.jpg"],
     [[28,
       43],
      "assets/images/resized/0026/2241/262241v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.slstransportation.com",
    "title": "limousine los angeles"}]}