{"name": "Small Business Innovation Research",
 "permalink": "small-business-innovation-research",
 "crunchbase_url": "http://www.crunchbase.com/company/small-business-innovation-research",
 "homepage_url": "http://www.sbir.gov/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sbirsttr",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1982,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "small-business-administration, research, innovation, us-government",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "U.S. Government Program",
 "created_at": "Fri Dec 17 06:15:01 UTC 2010",
 "updated_at": "Fri Dec 17 06:15:00 UTC 2010",
 "overview": "\u003Cp\u003EThe U.S. Small Business Administration (SBA) Office of Technology administers the Small Business Innovation Research (SBIR) Program and the Small Business Technology Transfer (STTR) Program. Through these two competitive programs, SBA ensures that the nation\u0026#8217;s small, high-tech, innovative businesses are a significant part of the federal government\u0026#8217;s research and development efforts. Eleven federal departments participate in the SBIR program; five departments participate in the STTR program awarding $2billion to small high-tech businesses. The U.S National Science Foundation administers the SBIR.GOV site on behalf of the federal government.\u003C/p\u003E\n\n\u003Cp\u003EGRANTS.gov\u003C/p\u003E\n\n\u003Cp\u003EGRANTS.gov is your source to FIND and APPLY for federal government grants. Before completing an application, please contact the Agency you are applying to to make sure they use GRANTS.gov\u003C/p\u003E\n\n\u003Cp\u003EHistory\nThe program was established with the passing of the Small Business Innovation Development Act in 1982, and must be periodically reauthorized by the United States Congress. Reauthorization is generally included in each new budget. The latest authorization extends the program by continuing resolution until January 31, 2011.\u003C/p\u003E\n\n\u003Cp\u003EThe SBIR program was created to support scientific excellence and technological innovation through the investment of federal research funds in critical American priorities to build a strong national economy \u0026#8230; one business at a time. In the words of program founder Roland Tibbets: \u0026#8220;to provide funding for some of the best early-stage innovation ideas \u0026#8211; ideas that, however promising, are still too high risk for private investors, including venture capital firms.\u0026#8221;[citation needed] For the purposes of the SBIR program, the term \u0026#8220;small business\u0026#8221; is defined as a for-profit business with fewer than 500 employees, owned by one or more individuals who are citizens of, or permanent resident aliens in, the United States of America.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       17],
      "assets/images/resized/0011/4418/114418v1-max-150x150.png"],
     [[250,
       28],
      "assets/images/resized/0011/4418/114418v1-max-250x250.png"],
     [[450,
       50],
      "assets/images/resized/0011/4418/114418v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}