{"name": "Smart Meetings",
 "permalink": "smart-meetings",
 "crunchbase_url": "http://www.crunchbase.com/company/smart-meetings",
 "homepage_url": "http://aboutsmartmeetings.com/",
 "blog_url": "http://smartmeetingsplan.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "SmartMeetings",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "smart-meetings",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "A Monthly Meetings Journal",
 "created_at": "Tue Apr 23 17:32:19 UTC 2013",
 "updated_at": "Fri Apr 26 23:28:55 UTC 2013",
 "overview": "\u003Cp\u003EPublished by Bright Business Media, LLC, Smart Meetings is a monthly journal that provides extensive resources to professionals in the meetings industry. From trade shows to incentive programs, the publication offers information on meetings concepts as well as detailed descriptions of venues across North America. Smart Meetings also hosts 12 live networking events every year, known as Smart Events, which allow meeting professionals to network and share valuable insights. These events, held in major meetings markets, inspire attendees with engaging professional programming and events that feature professional speakers and entertainment. \u003C/p\u003E\n\n\u003Cp\u003EWith expansive coverage of the meetings industry, Smart Meetings features interviews with industry leaders; profiles of top venues, including luxurious Caribbean resorts; and topical insights into event planning concepts, among other informative articles and columns. It has earned a number of awards, including the Professional Convention Management Association\u0026#8217;s 2011 Legend Award and ASPBE\u0026#8217;s 2010 Top 10 Award for Website of the Year. The publication has also earned numerous Maggie Award nominations, including Best Overall Publication and Best Theme Issue. In 2011, the publication won a Maggie Award for Best Regularly Featured Column.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://pinterest.com/smartmeetingsca/",
    "title": "Smart Meetings - Pinterest"}]}