{"name": "Smart Remaps",
 "permalink": "smart-remaps",
 "crunchbase_url": "http://www.crunchbase.com/company/smart-remaps",
 "homepage_url": "http://www.smartremaps.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "smartremaps",
 "category_code": "other",
 "number_of_employees": 3,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 31,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ecu-remapping, car-tuning, chip-tuning",
 "alias_list": null,
 "email_address": "info@smartremaps.co.uk",
 "phone_number": "07702475178",
 "description": "ECU Remapping",
 "created_at": "Wed Jan 18 10:40:30 UTC 2012",
 "updated_at": "Wed Jan 18 23:50:01 UTC 2012",
 "overview": "\u003Cp\u003ESmart Remaps (Manchester) in association with the award winning Viezu Technologies are the UK’s leading ECU Remapping specialists. Whether you are looking for better fuel economy, more power or both you can be rest assured that our customised vehicle ECU remapping services will give results beyond your expectations. With our no quibble 14 day money back guarantee and insurance backed guarantee you also have that piece of mind.\u003C/p\u003E\n\n\u003Cp\u003ESmart Remaps also offer a mobile service as well as a workshop service. S o if you reside in and around Manchester, near area\u0026#8217;s such as Liverpool, Bury, Rochdale, Blackburn, Preston, Cheshire or within a 35 mile radius then we can come to you.\u003C/p\u003E\n\n\u003Cp\u003EUP TO 20% ON FUEL SAVINGS\nUP TO 35% MORE POWER AND PERFORMANCE\nENHANCED SHARPER THROTTLE RESPONSE\nGREATER TORQUE\nSMOOTHER, MORE PROGRESSIVE DELIVERY OF POWER\nIMPROVED DRIVABILITY\u003C/p\u003E\n\n\u003Cp\u003ESmart Remaps tuning services are carried out using some of the very latest and most advanced ECU remapping/chip tuning tuning software available. Our development engineers are among the world\u0026#8217;s leading experts in the field of vehicle tuning. Our tuning programmes have been developed and tested to deliver the very best results – We leave nothing to chance.\u003C/p\u003E\n\n\u003Cp\u003EWe develop our tuning programmes in laboratory conditions on real vehicles, where dynamometer and emissions readings allow us to verify our figures. We then test the results of our work on the roads in real life conditions for many hundreds of miles – nothing is left to chance. Our tuning services, and in particular our Blue Optimize economy and carbon reduction tuning is also Multi Award winning and is internationally recognised as industry leading.\u003C/p\u003E\n\n\u003Cp\u003EWe are pioneers in tuning engines for enthusiastic drivers. No one else has invested the time, money and effort into research and development or has the technological know-how that only 27 year’s experience can bring. Leading car manufacturers trust us as the market leaders, recognising our proven skills in engine tuning and ECU Remapping.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       45],
      "assets/images/resized/0017/0681/170681v2-max-150x150.jpg"],
     [[250,
       75],
      "assets/images/resized/0017/0681/170681v2-max-250x250.jpg"],
     [[450,
       136],
      "assets/images/resized/0017/0681/170681v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}