{"name": "SMART Biotech",
 "permalink": "smart-biotech",
 "crunchbase_url": "http://www.crunchbase.com/company/smart-biotech",
 "homepage_url": "http://www.smartube-bio.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": 10,
 "founded_year": 2004,
 "founded_month": 8,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "biotech, infectious-diseases, diagnostics, hiv, hcv, window-period, early-detection",
 "alias_list": null,
 "email_address": "ohads@smartube-bio.com",
 "phone_number": "972-8-9470240",
 "description": "Medical Device",
 "created_at": "Fri Nov 30 12:35:28 UTC 2012",
 "updated_at": "Mon Dec 03 07:39:12 UTC 2012",
 "overview": "\u003Cp\u003ESMART Biotech Ltd. develops a unique family of products called SMARTube™- a pre-analytic device for enhancing antibody production in a blood sample enabling commercially available assays to detect various infections within days.\nUsing the SMARTube enables essentially to close the window period between infection and detection, independent of the length of the window period and the presence of virus in the blood. \nThe SMARTube is not an assay. It is a complementary product improving the performance of existing assays by reducing the rate of both false positive and false negative results. It is able to warn of hidden, current, infection even if the pathogen is not present in the blood at that time.\nThe SMARTube can also be used as an effective tool to distinct between recent and non-recent infection and as a tool to inform regarding viral clearance (be it spontaneous or drug elicited) shortly after it happens. \nThe SMARTube is the diagnostic application of the Company\u0026#8217;s platform technology, Stimmunology™- culturing a small volume of fresh whole blood, in an activation media in which lymphocytes, which have been primed in-vivo by a virus, are stimulated to produce virus specific antibodies in-vitro within days even when facing immune suppression. Thus, antibodies which were not present or detectable in a regular sample would be present in the Stimmunology enhanced sample.\nThe SMARTube™HIV\u0026amp;HCV is the Company\u0026#8217;s first developed product. Over 15,000 blood samples have been tested around the world using the SMARTube, clearly demonstrating the benefit of treating a blood sample in the SMARTube prior to routine antibody testing. The controlled clinical trials were conducted with official health authorities in countries such as USA, Israel, Russia, China, South Africa, Kenya, Mexico and others. Results of the clinical trials have been published in both peer reviewed journals and leading international conferences.\nThe SMARTube™HIV\u0026amp;HCV is registered in several countries including the EU (CE Mark), Israel, Russia, and others. It is currently in the FDA process in the U.S.A.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       76],
      "assets/images/resized/0022/3173/223173v2-max-150x150.jpg"],
     [[250,
       126],
      "assets/images/resized/0022/3173/223173v2-max-250x250.jpg"],
     [[450,
       228],
      "assets/images/resized/0022/3173/223173v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}