{"name": "Smart Receptionist",
 "permalink": "smart-receptionist",
 "crunchbase_url": "http://www.crunchbase.com/company/smart-receptionist",
 "homepage_url": "http://www.smartreceptionist.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmanager@smartreceptionist.com",
 "phone_number": "9830106106",
 "description": "offering software for Call Management",
 "created_at": "Thu Apr 04 13:48:25 UTC 2013",
 "updated_at": "Thu Apr 04 13:48:28 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year of 2012, we, “Smart Receptionist”, are dedicated towards rendering software for Call Management. Developed with advanced technology, this range conforms to the defined parameters of the industry. Our offered range aims at eliminating hassle and confusion during handling multiple calls at restaurants, hotels, multinational companies, call centers and many others. To cater to the divergent demands of the clients, we design and develop software keeping in their exact requirement and industry laid parameters.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Designers\n    Managers\n    Software developers\n    IT experts\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWith the firm commitment towards quality, we are engaged in designing and developing the best-in-class software for Call Management. We precisely design this range incorporating advanced technology in accordance with the established quality parameters of the industry. Total Quality Management (TQM) is being followed at each stage of designing so as to develop efficient software.\u003C/p\u003E\n\n\u003Cp\u003EDomain Expertise:\nWe hold all the aces in designing and developing the most efficient software for Call Management. This range is precisely designed by our qualified software developers who hold expertise over their respective domain. They precisely develop software incorporating advanced technology in accordance with the defined parameters of the industry.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a responsible corporate citizen, we have made all our endeavors dedicated towards attaining complete clients\u0026#8217; satisfaction. To meet expectations of the clients, we offer the most efficient software for Call Management. Developed with latest technology, this range conforms to the prevailing market trends and industry laid parameters.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7938/247938v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7938/247938v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7938/247938v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}