{"name": "Smart Bible Search",
 "permalink": "smart-bible-search",
 "crunchbase_url": "http://www.crunchbase.com/company/smart-bible-search",
 "homepage_url": "http://www.smartbiblesearch.com/",
 "blog_url": "http://smartbiblesearch.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "Bible_Search",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 7,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bible, search, engine, site",
 "alias_list": null,
 "email_address": "info@smartbiblesearch.com",
 "phone_number": "724-880-0829",
 "description": "Bible search engine",
 "created_at": "Tue Mar 20 01:33:39 UTC 2012",
 "updated_at": "Mon Mar 26 01:16:51 UTC 2012",
 "overview": "\u003Cp\u003ESmart Bible Search uses the latest search engine technology to give you accurate results ordered by relevance. As you type, Bible passages are auto suggested to further help find passages.\u003C/p\u003E\n\n\u003Cp\u003ESmart Bible Search uses complex algorithms to return the passages you really wanted. Our algorithms fall into several categories to make this happen which are listed below with description and definitions of each.\u003C/p\u003E\n\n\u003Cp\u003EWORD FOR WORD (Literal)\nResults based on what you would see in the passage. How most Bible search sites return results\u003C/p\u003E\n\n\u003Cp\u003EDYNAMIC EQUIVALENT (Thought for Thought)\nThe search does not have to be perfect, or even contain the actual words you are typing. Search examples would be “Jesus is God”, “The Holy Spirit Convicts of Sin”, “lineage of Melchizedek”, “buried investment in the yard” and “Pregnancy of Mary”.\u003C/p\u003E\n\n\u003Cp\u003EAMBIGUOUS \nA good example would be the phrase “I Am”. On any traditional search engine the search for “I Am” would return results that would be irrelevant, since it is not realizing the significance of the phrase. When a search for “I Am” is made on Smart Bible Search, it is understood that you are referring to a search for Jesus as the “I Am.” Another semi-ambiguous example would be the search for “Pauls Thorn”.\u003C/p\u003E\n\n\u003Cp\u003ECONCEPTUAL\nReturns results for Biblical concepts that are not specifically mentioned word for word in the bible, but are still inferred or are common terms and phrases used by Christians. Some examples would be “Trinity”, “Rapture”, “Christmas”, “Easter”, “Omnipresent”, “Omniscient” and “Omnipotent”.\u003C/p\u003E\n\n\u003Cp\u003ETOPICAL\nReturns relevant topical results based on single keywords, such as “Prayer”, “Salvation”, “Abortion” and “Sin”.\u003C/p\u003E\n\n\u003Cp\u003EThese latest technologies results in the very accurate and relevant search results.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "Bible Gateway",
      "permalink": "bible-gateway",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}