{"name": "smebooth",
 "permalink": "smebooth",
 "crunchbase_url": "http://www.crunchbase.com/company/smebooth",
 "homepage_url": "http://www.smebooth.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "smebooth",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "enterprise-networking, branding, company-profile, customer-management, sell, search-companies, business-card-design",
 "alias_list": null,
 "email_address": "admin@smebooth.com",
 "phone_number": "",
 "description": "small enterprises networking \u0026 branding",
 "created_at": "Tue Jan 08 09:24:03 UTC 2013",
 "updated_at": "Sun Jan 13 21:36:57 UTC 2013",
 "overview": "\u003Cp\u003EStarted nurturing the idea in year 2011 and design architecture and the actual development took entire year 2012 and now ready for launch. This is a very innovative platform for small and medium enterprises for marketing/promotion and branding using through the medium of networking with the small medium enterprise community. \nSMEBooTH is a collaboration, communication and coordination platform for small and medium businesses. This platform allows the businesses to manage their enterprise business view and the user view (members and employees of the company). This platform can be used only by first registering the company and then the user gets registered underneath the company (company admin user has to validate the user and accept them as legitimate associates of the company). \nSMEBooTH allows its registered companies and users to manage their associates as customer, collaborators, and competitors and also allows creating own public, private or Government \u0026amp; Legal group categories to manage associations. Companies and users can control the communication and sharing of information per the association.\nSMEBooTH allows the display of products, its brands and its company details so that other companies can easily search it. Say a company requires a legal services and couple of legal services companies are registered in SMEBooTH, then they can be searched by the this company which needs legal services. Similarly companies, people, products all can be searched via its complex but user friendly search engine. SMEBooTH allows the companies to add their products for renting, bartering, selling or giveaways. SMEBooTH also allows the companies to add coupons and discounts for other enterprises to buy in bulk.\nSMEBooTH allows its users and companies to manage their files like presentations, excels, word document in cloud space. These can be used in any device at any time using smebooth.com or its mobile applications. SMEBooTH allows its companies and users to write business articles and share it with its fellow enterprises. SMEBooTH provides all the important websites and links to help the small and medium enterprises to finds most of the knowledge and useful references handy.\nSMEBooTH allows companies and users to review and rate other businesses. The company dashboard also provides the snapshot of the type of associations and  number of visitors to your company. This also has the mobile apps.\nVALUE PROPOSITION\nSMEBooTH is the only platform being created to cater for Small and medium businesses to discuss their problems and grow their revenue and customer through product and business promotions and understanding the customers and competitors.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       93],
      "assets/images/resized/0022/8585/228585v2-max-150x150.jpg"],
     [[250,
       156],
      "assets/images/resized/0022/8585/228585v2-max-250x250.jpg"],
     [[450,
       281],
      "assets/images/resized/0022/8585/228585v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Partha",
      "last_name": "Pal",
      "permalink": "partha-pal-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.dailworkbook.com",
    "title": "social networking"},
   {"external_url": "http://www.dailydoctorbook.com",
    "title": "medical networking"}]}