{"name": "SMS Assembly",
 "permalink": "sms-assembly",
 "crunchbase_url": "http://www.crunchbase.com/company/sms-assembly",
 "homepage_url": "http://www.smsassembly.com/",
 "blog_url": "http://www.smsassembly.com/itliquidation/",
 "blog_feed_url": "",
 "twitter_username": "SMSAssemblyINC",
 "category_code": "hardware",
 "number_of_employees": null,
 "founded_year": 1989,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sell-memory, sell-processors, sell-used-memory, discount-memory, used-ram, sell-ram, sell-used-ram, recycle-computer-memory, recycle-memory-and-recycle-memory-modules",
 "alias_list": null,
 "email_address": "Joanne@smsassembly.com",
 "phone_number": "239-596-2254",
 "description": "The Right Memory Upgrades",
 "created_at": "Wed Jan 09 22:05:52 UTC 2013",
 "updated_at": "Sun Jan 13 22:31:48 UTC 2013",
 "overview": "\u003Cp\u003ESMS Memory Module Assembly, Inc. 24 Years in the Memory Business! was founded in 1989 by Jeff Bittner and is a leading distributor/wholesaler of new and off lease computer memory modules. Originally based in Laguna Hills, California, we are now located in beautiful Naples, Florida.\nOur Focus\u003C/p\u003E\n\n\u003Cp\u003EWe\u0026#8217;ve grown to be a strong presence in the computer electronics industry. We want to give our customers the confidence that they are getting exactly what type of memory they need, whether it be for a computer upgrade or for resale and also continue to progress with the market, realizing that electronics are constantly evolving and we need to keep up with the demands of our customers.\nOur Products\u003C/p\u003E\n\n\u003Cp\u003EWe specialize wholly in Computer Memory Upgrades and Modules of high quality and for all major brands. We supply Laptop Memory Modules, Recycle computer memory, Sell cisco router, Memory Chips, Discount memory, Sell memory, Used ram, Sell Ram, Desktop Accessories, Buy sell p4 processors, Dell Memory, Buy sell xeon processors, E-Scrap, Notebook Memory, Sell cisco switch, Laptop Components, Sell Cisco Memory, Recycle memory modules, Desktop Memory, Macintosh Memory Modules, IBM memory, Sell Amd Athlon, Cheap memory, Sun Microsystems memory, PC DDR SDRAM Memory Upgrades.\nOur Service and Product Quality\u003C/p\u003E\n\n\u003Cp\u003EWe are one of the leading distributors and wholesalers and ensure our services and products are of highest quality. Our service and quality come in at a low price and include a lifetime warranty (exchange).\nLow Price Guarantee\u003C/p\u003E\n\n\u003Cp\u003EWe understand the need of our customers who needs quality products and services at low cost and we give them. This is the reason we have a successful history in the international market and welcome business from overseas.\nOur Promise\u003C/p\u003E\n\n\u003Cp\u003EWe will conduct business with our customers, suppliers and employees in the easiest, most hassle-free way possible. Our goal is to have employees that adapt to change and suppliers and customers that keep coming back.\u003C/p\u003E\n\n\u003Cp\u003EContact us for more information or if you have any questions\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "PO Box: 15275 Collier Blvd Ste 201 Pmb 307",
    "address2": "",
    "zip_code": "15275",
    "city": "Naples",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": 40.4510612,
    "longitude": -80.1805318}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}