{"name": "SNAPPII",
 "permalink": "snappii",
 "crunchbase_url": "http://www.crunchbase.com/company/snappii",
 "homepage_url": "http://snappii.com",
 "blog_url": "http://snappii.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "Snappii_app",
 "category_code": "mobile",
 "number_of_employees": 50,
 "founded_year": 2010,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-service, iphone-app, make-iphone-apps, wysiwyg-editor, iphone, apps-for-businesses, smart-phone, itunes",
 "alias_list": null,
 "email_address": "alexandra@snappii.com",
 "phone_number": "+1 603 651 0066",
 "description": "A Web Service",
 "created_at": "Fri Jul 22 12:45:02 UTC 2011",
 "updated_at": "Fri Mar 29 03:34:32 UTC 2013",
 "overview": "\u003Cp\u003ESnappii is a do-it-yourself platform for creating mobile apps. We offer free assistance to help you build apps. Create your own mobile app in a matter of minutes with no programming at all!\u003C/p\u003E\n\n\u003Cp\u003EWhy every business needs a mobile app?\nThe most basic answer is because smart phone has become the #1 screen that people pay attention to.  When a business has a custom branded iPhone app, it can\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EReach customers 8+ hours\u003C/li\u003E\n\u003Cli\u003Eachieve higher conversion on special offers and discounts sent to customers and prospects \u003C/li\u003E\n\u003Cli\u003Edrive customers to nearest locations\u003C/li\u003E\n\u003Cli\u003Eoffer customers better support  \u003C/li\u003E\n\u003Cli\u003Eleverage the community to grow the brand though social networks \u003C/li\u003E\n\u003Cli\u003Eincrease build customer database\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EWhy Snappii?\nUnlike competitors which generate nearly identical apps, Snappii offers the ability to create 100% individualized apps while achieving remarkable ease of use\u003C/p\u003E\n\n\u003Cp\u003ESnappii offers:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EWYSIWYG (what you see is what you get) editor for creating custom user interface (UI) and making each app unique\u003C/li\u003E\n\u003Cli\u003EWeb2iPhone testing. Test your app on your iPhone in minutes  \u003C/li\u003E\n\u003Cli\u003ENo apps to download from AppStore,  No iTunes, No cables\u003C/li\u003E\n\u003Cli\u003EOutstanding real human assistance and support\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EHow it works\nGo to Snappii.com and register\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EChoose how you want to make your app. \u003C/li\u003E\n\u003Cli\u003EUsing the editor, simply drag and drop buttons and screen elements on the iPhone and see exactly how your iPhone app will look like.\u003C/li\u003E\n\u003Cli\u003ETest the app on your iPhone using Web2iPhone copy.\u003C/li\u003E\n\u003Cli\u003ESubmit the App to Apple/Google play.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EConvenient app creating system\nUntil now Snappii was a DIY platform (do-it-yourself) for non programmers who wanted to create mobile apps. Based on customer demand Snappii has expanded its service to include full service app development. Clients fill out an App Request Form and Snappii builds the app. Customers can also choose to have Snappii maintain the app for them.\u003C/p\u003E\n\n\u003Cp\u003EAll app requests are reviewed in 24 hours. Clients will get a reply with an estimate time frame needed for their app development. App development starts at only from $500 depending on the app complexity. In addition to full app development Snappii now offers 3 app maintenance plans which enable customers to enjoy ongoing app development and improvement. The app maintenance plans cover ANY app changes that customers desire and enable customers’ apps to continue to evolve based on new requirements and new features in mobile technology:\u003C/p\u003E\n\n\u003Cp\u003EThe 3 app maintenance and ongoing development plans are:\u003C/p\u003E\n\n\u003Cp\u003EA - Monthly Unlimited Changes - Changes can be submitted to Snappii once a month for the next 12 months. Customers can submit unlimited number of changes!\u003C/p\u003E\n\n\u003Cp\u003EB - Quarterly Unlimited Changes - Changes can be submitted to Snappii once a quarter for 12 months. Customers can submit unlimited number of changes.\u003C/p\u003E\n\n\u003Cp\u003EC – Anytime Unlimited Changes – Customers can submit unlimited number of changes any time.\u003C/p\u003E\n\n\u003Cp\u003EEach plan includes:\u003C/p\u003E\n\n\u003Cp\u003E• App content and feature changes,\u003C/p\u003E\n\n\u003Cp\u003E• Release on all mobile platforms supported by Snappii,\u003C/p\u003E\n\n\u003Cp\u003E• Use of analytics dashboard and push notifications,\u003C/p\u003E\n\n\u003Cp\u003E• Hosting,\u003C/p\u003E\n\n\u003Cp\u003E• Rapid Change distribution\u003C/p\u003E\n\n\u003Cp\u003ESnappii customers can also benefit from the “You-Start-We-Finish” Special offer for only $30 per hour. \u003C/p\u003E\n\n\u003Cp\u003ESnappii offers FREE apps for Associations. \u003C/p\u003E\n\n\u003Cp\u003EAnyone can request a free prototype from Snappii. Free prototypes are delivered to a customer within 48 hours. \u003C/p\u003E\n\n\u003Cp\u003EDIY customers are welcome to submit their apps to Apple for $39 per app per month. If customers want to make sure their app looks good enough for Apple, they can ask the Snappii team to review the app first for only $150. Snappii team will make all the necessary changes. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       79],
      "assets/images/resized/0014/5654/145654v2-max-150x150.png"],
     [[250,
       132],
      "assets/images/resized/0014/5654/145654v2-max-250x250.png"],
     [[450,
       239],
      "assets/images/resized/0014/5654/145654v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "12 Old Broad Bay Rd Center ",
    "address2": "",
    "zip_code": "03814 ",
    "city": "Ossipee",
    "state_code": "NH",
    "country_code": "USA",
    "latitude": 43.794243,
    "longitude": -71.1003284}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[81,
        150],
       "assets/images/resized/0014/5653/145653v2-max-150x150.png"],
      [[135,
        250],
       "assets/images/resized/0014/5653/145653v2-max-250x250.png"],
      [[243,
        450],
       "assets/images/resized/0014/5653/145653v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.youtube.com/user/SnappiiApp",
    "title": ""},
   {"external_url": "http://snappii.blogspot.com/",
    "title": ""}]}