{"name": "socialization.ME",
 "permalink": "socialization-me",
 "crunchbase_url": "http://www.crunchbase.com/company/socialization-me",
 "homepage_url": "http://www.socialization.me",
 "blog_url": "http://blog.socialization.me",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 12,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "socialization-me, socialization, social, media, facebook, hnyb, knowledge-360, smms, branding, marketing, digital, dashboard, analytics",
 "alias_list": null,
 "email_address": "info@socialization.me",
 "phone_number": "",
 "description": "Social Media Branding Application",
 "created_at": "Fri Feb 01 09:07:24 UTC 2013",
 "updated_at": "Sun Feb 03 06:50:37 UTC 2013",
 "overview": "\u003Cp\u003ESocialization is a cutting edge Social Media Innovation developed by Knowledge 360 Team which makes Social branding more effective, easier and impressive by using Next Generation Social Technology.\u003C/p\u003E\n\n\u003Cp\u003ESocialization is a Digital Branding nursery enabling present and future brands to cultivate strong social media focused ecosystem.  Acting as landing as well as launch page for social initiative, Socialization not only aggregates dispersed social and digital media activities but also connects diverse Brand assets into a consistent story.\u003C/p\u003E\n\n\u003Cp\u003ESocialization is designed for harvesting social branding power by removing complexity associated with managing multiple social campaigns or digital assets and making process of engaging with audience across diverse social media channels and segments intuitive.\u003C/p\u003E\n\n\u003Cp\u003ESocialization makes social media more effective and convenient for all, whether a seasoned social branding agency managing multiple brands or a social media newbie surfing shallow water of  social media enabled marketing and promotion. It makes harvesting of social branding power a breeze by removing complexity associated with managing multiple social campaigns or digital assets and making process of engaging with audience across diverse social media channels and segments intuitive.\u003C/p\u003E\n\n\u003Cp\u003ESocialization allow prospects, customers and other audience segments access all activities about the brand across different social channels at one place. On other hand it provide brand managers or content creators great ease and flexibility in creating, posting, commenting, and sharing content. Socialization is inspired by the usability, symmetry and neatness of modular design hence special care has been taken to ensure presentation of all features including user’s public page as well dashboard are modular. \u003C/p\u003E\n\n\u003Cp\u003ESocialization is an innovation of massive proportion is powered by HnyB Platform and leverages all positives of HnyB tools as well as Social Networking philosophy while removing various gaps existing in present methods.\u003C/p\u003E\n\n\u003Cp\u003EThe Brain behind Socialization is Team Knowledge 360, Knowledge 360 facilitates technology development and also develops innovative Applications as per continually-changing Information \u0026amp; Communication Technology environments. Knoe More about Knowledge 360: http://www.crunchbase.com/company/knowledge-360\u003C/p\u003E\n\n\u003Cp\u003ESome Key Features:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003ESingle Click Management of More than 16 Social Networks form Single Dashboard\u003C/li\u003E\n\u003Cli\u003ESingle Click Posting to one or multiple or all connected networks\u003C/li\u003E\n\u003Cli\u003ECustomized Layouts, themes and Images\u003C/li\u003E\n\u003Cli\u003ENo Coding Required, Creation of Unique Social Web front within 1 minute\u003C/li\u003E\n\u003Cli\u003EAdvanced Analytics which includes Advanced Analytics with Complete Social Reports Engagement Rates, Key Influencers, Post Response Rate, Question Response Rate, Social Interactions, Monitor Response Time etc.\u003C/li\u003E\n\u003C/ul\u003E",
 "image":
  {"available_sizes":
    [[[150,
       134],
      "assets/images/resized/0023/2931/232931v2-max-150x150.png"],
     [[250,
       224],
      "assets/images/resized/0023/2931/232931v2-max-250x250.png"],
     [[450,
       404],
      "assets/images/resized/0023/2931/232931v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Mr.",
    "person":
     {"first_name": "Deepak",
      "last_name": "Pareek",
      "permalink": "deepak-pareek-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "A 604, S G Highway,",
    "address2": "Titanium Square,",
    "zip_code": "380054",
    "city": "Ahmedabad",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}