{"name": "SocialSiteCreator",
 "permalink": "socialsitecreator",
 "crunchbase_url": "http://www.crunchbase.com/company/socialsitecreator",
 "homepage_url": "http://www.socialsitecreator.com/",
 "blog_url": "http://www.socialsitecreator.com/blog/",
 "blog_feed_url": "http://www.socialsitecreator.com/blog/rss.php",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2009,
 "founded_month": 11,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-network-software, social-network-template, social-network-hosting, social-network-script, social-network-provider, start-social-network, build-social-network, create-social-network",
 "alias_list": null,
 "email_address": "",
 "phone_number": "8007781360",
 "description": "Social Networking Software",
 "created_at": "Tue Feb 01 18:18:26 UTC 2011",
 "updated_at": "Thu Feb 03 07:17:20 UTC 2011",
 "overview": "\u003Cp\u003EHow to create your own social network? You need a social networking software, social networking template, hosting, and technical support. Our Social Network Solution is your perfect choice for creating a social network and community website.\u003C/p\u003E\n\n\u003Cp\u003EBefore you start, think carefully about the name you want to use for your community. It should communicate purpose clearly and be easy for users to remember and recommend.\u003C/p\u003E\n\n\u003Cp\u003EWhen you are ready, sign up an account with us. There\u0026#8217;s a drag and drop interface to quickly add features to your network. Features you can choose from include videos gallery, photo sharing, groups, events, audio and video webcam chat, instant messenger, blogs, forums, twitter, facebook, and mobile access, and more!\u003C/p\u003E\n\n\u003Cp\u003EThe whole point of a social network is interaction with others. So you want to be able to moderate that interaction so nobody spams or posts inappropriately. Our social network software allows you to setup moderation rules for the network, which decides what members of the network can and can\u0026#8217;t do: Can they create posts? Upload photos? You can also set rules for how you will ban members.\u003C/p\u003E\n\n\u003Cp\u003EOf course, you are going to be concerned about appearance. Our social networking templates manager allows you to customize layout, appearance, look and feel for the site, decide which widgets to include and more.\u003C/p\u003E\n\n\u003Cp\u003EThe final step is to invite your friends to join. Our Social Network CMS allows you to import your contacts from your yahoo, hotmail, gmail, aol contacts. You will also publicize the new network and generally let the world know that you are on the Web and open for discussion and networking.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       60],
      "assets/images/resized/0011/9990/119990v2-max-150x150.jpg"],
     [[241,
       97],
      "assets/images/resized/0011/9990/119990v2-max-250x250.jpg"],
     [[241,
       97],
      "assets/images/resized/0011/9990/119990v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}