{"name": "socialterminals",
 "permalink": "socialterminals",
 "crunchbase_url": "http://www.crunchbase.com/company/socialterminals",
 "homepage_url": "http://socialterminals.com",
 "blog_url": "http://socialterminals.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "socialterminal",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "shani@socialterminals.com",
 "phone_number": "",
 "description": "Social Media Management Platform",
 "created_at": "Thu Apr 19 14:54:34 UTC 2012",
 "updated_at": "Sat Feb 02 04:42:27 UTC 2013",
 "overview": "\u003Cp\u003ESocialterminals offers a ground breaking, innovative approach to building your online presence, working with you to define and implement the right strategy to unleash your brand onto the world, from designing and customizing your online channels to building the ultimate distribution strategy.\u003C/p\u003E\n\n\u003Cp\u003EFounded in October of 2010, the CEO, Shani Peled, crafted socialterminals under the vision of providing SMB’s with the same level of technology and marketing tools available to fortune 500’s. And with that vision socialterminals has become the most advanced social media management platform today, offering groundbreaking tools and technology, driving higher results, increasing user interaction, purchasing intent, conversion and ultimately revenue. As investors who place high value on creativity and strategy, socialterminals maps the lifecycle and direction of your company.\u003C/p\u003E\n\n\u003Cp\u003EPeled says, “socialterminals is a completely open house for all its clients and businesses. Socialterminals is not simply acting as a vendor but it promises to be a part of the process. It is important for the client to know that they have a team behind them.” And what a team it is. Rest assured you are in capable hands. Think of socialterminals as an incubator to nurture your vision to its fullest potential.\u003C/p\u003E\n\n\u003Cp\u003EThe socialterminals platform integrates a variety of tools all designed to help your brand identify, target and engage their audience, such as Social Talk, which allows you to manage all your social pages and channels from one central hub. You can compare and analyze your audience’s reaction to each page, gauging their response and tracking their interests.\u003C/p\u003E\n\n\u003Cp\u003ESocial Content then reformats all of your inputs directly to your social pages. No middleman is necessary anymore. Any articles, photographs or videos you wish to post are automatically customized to fit each page.\u003C/p\u003E\n\n\u003Cp\u003EKey Users identifies the people and companies most relevant to your brand by scanning online channels for the right keywords, trends and user interactions, putting the focus on gaining ambassadors to spread the word.\u003C/p\u003E\n\n\u003Cp\u003ESocial Feed is a nifty tool that expands your online presence into additional channels such as mobile apps and social commerce, by repurposing your existing channels and content feed.\u003C/p\u003E\n\n\u003Cp\u003EAudience Report is designed to collect data across all of your online channels and applications, tracking trends and driving traffic back to your website. As a brand you can track your audience throughout all your social pages, understanding where, when and how they interact in any and all selected channels.\u003C/p\u003E\n\n\u003Cp\u003ELike a magnet socialterminals pulls your target audience to your branded environment, a place where desire meets expectation.\u003C/p\u003E\n\n\u003Cp\u003EWith their investment fund, socialterminals is able to turn talented entrepreneurs into genuine leaders and their concepts into towers. As investors who place high value on creativity and strategy, Socialterminals maps the lifecycle and direction of your company.\u003C/p\u003E\n\n\u003Cp\u003EPrimarily, socialterminals invests in seed-stage start-up companies in the fields of Software, Communications, Internet, Media, gaming, social shopping and advertising. Coming on board with socialterminals, they make it their mission to provide you with a host of customized services, including seed financing, hands-on management, product development, distribution, marketing and strategic guidance.\u003C/p\u003E\n\n\u003Cp\u003ESocialterminals guides you through the entire cycle of securing the funds needed for your venture to bloom and bear fruit, maintaining the necessary financial support required to sustain your brand and take it to its furthest potential.\u003C/p\u003E\n\n\u003Cp\u003ERide the wave of the future with socialterminals.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}