{"name": "SocialParadox",
 "permalink": "socialparadox",
 "crunchbase_url": "http://www.crunchbase.com/company/socialparadox",
 "homepage_url": "http://www.socialparadox.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "socialparody",
 "category_code": "network_hosting",
 "number_of_employees": 5,
 "founded_year": 2009,
 "founded_month": 7,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social, network, platform, niche, community, branding, css, monetize",
 "alias_list": null,
 "email_address": "support@socialparody.com",
 "phone_number": "7029531455",
 "description": "Social Network Platform",
 "created_at": "Thu Aug 26 07:06:07 UTC 2010",
 "updated_at": "Thu May 09 14:31:24 UTC 2013",
 "overview": "\u003Cp\u003ESocial Parody is a dedicated platform for creating monetized adult social communities.\u003C/p\u003E\n\n\u003Cp\u003EFounded in June 2009, Social Parody is a free online platform that empowers adults to create and discover new social experiences for whatever their interests in life maybe. Anyone 18+ can sign up to create, discover, or join new adult social networks on the Social Parody Platform.\u003C/p\u003E\n\n\u003Cp\u003ESocial Parody\u0026#8217;s hallmark application is your own social network for anything. Anything goes! We are the first and only free adult social network on the web. Launched in June 2009, your own adult social network for \u0026#8220;anything goes\u0026#8221; gives individuals and companies the ability to rapidly create and scale entirely new adult social networks for free.\u003C/p\u003E\n\n\u003Cp\u003EYour own adult social network for anything offers over 100 different design themes, option to completely control the CSS of a social network as well as the option for community members to add HTML to their profile.\u003C/p\u003E\n\n\u003Cp\u003EThe application offers a wide choice of features - videos, photos, video chat, music, groups, events, forums, blogs, live bulletin (shout box), and live wire (what are you doing now?) - in addition to a latest activity stream, customized member profile pages, friends, instant messaging, email notifications, RSS support, and third-party applications a member or Social Parody Creator chooses to add to their social network on Social Parody. As a result of this broad set of choices, each social network on Social Parody is unique and special in its purpose, design, branding, and features.\u003C/p\u003E\n\n\u003Cp\u003EFrom the beginning, Social Parody has incorporated comprehensive privacy features into the Social Parody Platform that allow both creators and members to control their privacy at every level. Social Parody uniquely offers the choice of public or private social networks as well as multiple privacy levels within your own social network for anything.\u003C/p\u003E\n\n\u003Cp\u003ENetwork creators can choose to moderate members before they join or simply show the social network\u0026#8217;s homepage to non-members. Members of social networks have full control over who sees their profiles and content within a social network or on Socialparody.com.\u003C/p\u003E\n\n\u003Cp\u003ENetwork owners can monetize their communities by charging a member fee for user access, placing relevant advertisements on the pages and create premium pages on their networks in order to encourage people to subscribe.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[134,
       150],
      "assets/images/resized/0011/5166/115166v2-max-150x150.png"],
     [[218,
       244],
      "assets/images/resized/0011/5166/115166v2-max-250x250.png"],
     [[218,
       244],
      "assets/images/resized/0011/5166/115166v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "COO",
    "person":
     {"first_name": "Weiqi",
      "last_name": "Yang",
      "permalink": "weiqi-yang",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "US Headquarters",
    "address1": "2251 N.Rampart Blvd",
    "address2": "#114",
    "zip_code": "89128",
    "city": "Las Vegas",
    "state_code": "NV",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://about.socialparody.com/",
    "title": ""}]}