{"name": "SocInteract",
 "permalink": "socinteract",
 "crunchbase_url": "http://www.crunchbase.com/company/socinteract",
 "homepage_url": "http://www.socinteract.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Socinteract",
 "category_code": "other",
 "number_of_employees": 1,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "mitch.smith@socinteract.com",
 "phone_number": "305-479-6732",
 "description": "Socialize For A Cause ",
 "created_at": "Fri Dec 02 21:49:37 UTC 2011",
 "updated_at": "Mon Dec 05 05:19:08 UTC 2011",
 "overview": "\u003Cp\u003EThis is a new and unique social media company with a primary focus on charity, furndraising, and giving back to communities all over the world.\u003C/p\u003E\n\n\u003Cp\u003EBringing Entertainment, \nSocial Media, and Charity together as one!\u003C/p\u003E\n\n\u003Cp\u003ECreation of a Global Fundraising Conglomerate\nImpact the Needs of the World Like Never Before In History!\u003C/p\u003E\n\n\u003Cp\u003ESocInteract is a company that will strive to excel in the business of establishing a social networking website that helps raise funds and awareness for charities throughout the world. \u003C/p\u003E\n\n\u003Cp\u003EThis company represents a new, unique and exciting way to raise funds and give back to the community.  This will give any profit or nonprofit organization an opportunity to raise money for a good cause and awareness.  This is an opportunity for the users on the website to socialize while raising money for a cause. \u003C/p\u003E\n\n\u003Cp\u003ESocInteract made the decision very early in the planning stage to give 50% of all revenue generated to a nonprofit organization.  Currently SocInteract has one revenue stream, the subscription to join the website.  There are future projects on the horizon that will include new avenues to increase the money that we give back to the community. SocInteract will charge a subscription fee of $3.32 per month and half of that will go to the charity of the subscriber’s choice.  The payment method will be Paypal.  The users will be automatically charged quarterly or $9.95 every 3 months.   $4.97 every 3 months per user will go towards a cause.\u003C/p\u003E\n\n\u003Cp\u003EThis represents a tremendous opportunity for any global organization to raise millions of dollars.  Socinteract is looking to form a long term relationship with these organizations.  We could invite anyone associated with these organizations to participate by promoting Socinteract and raising money for a cause.  The main focus here is the social networking.  One person joining the website could mean that 10, 20, 30, or even 100 people will join the website.  The opportunities are unlimited in terms of the number of people who will join the website and donate to a cause of the  organization’s choice.   \u003C/p\u003E\n\n\u003Cp\u003ERaising money through social media is a new and unique concept.  The users will be socializing for a cause.  The money raised by that organization will be over and above what they are already raising.  Socinteract represents a new and innovative way to raise funds.\u003C/p\u003E\n\n\u003Cp\u003ESocinteract is a new and unique company that is bringing social media together with charity.  SocInteract takes the position that its primary focus is to provide the newest and most exciting social media website while giving back to the community at the same time.  We want to create a win-win situation for both the user and the community. This is how SocInteract distinguishes itself in the marketplace.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}