{"name": "Socialmarks",
 "permalink": "socialmarks",
 "crunchbase_url": "http://www.crunchbase.com/company/socialmarks",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Sun Nov 07 08:32:15 UTC 2010",
 "updated_at": "Thu Dec 29 20:41:23 UTC 2011",
 "overview": "\u003Cp\u003E\u003Cstrong\u003EFirst 5 in Social RSS and Bookmarks\u003C/strong\u003E\nSocialmarks was founded by Matt Kaufman (NYC based entrepreneur and software developer).  The project began pre-2005 with original roots dating back to Nov 2001 of TechBoost, Inc.  Socialmarks, Inc. was created and funded later this year in August 2005 on the developer\u0026#8217;s 18th birthday, by Web Xtreme, Inc. (an Internet holding corporation).\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EAugust 2005\u003C/strong\u003E\nSocialmarks, funded in August 2005 (was within the first five contenders for the social rss news reading and bookmarking space), was started in personal research by programmer (and New York entrepreneur) Matt Kaufman. \u003C/p\u003E\n\n\u003Cp\u003ESocialmarks, Inc. emergent roots trace back to November of 2000; in the initial incorporation filing of TechBoost, Inc. a Lancaster, PA based technology/web/programming and \u0026#8220;Linux for Business\u0026#8221; consultancy and distributed ad-hoc technology group.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003E* Original Homepage Text *\u003C/em\u003E\u003C/p\u003E\n\n\u003Cp\u003EWhat Is Socialmarks?\u003C/p\u003E\n\n\u003Cp\u003EThe main goal of Socialmarks is to streamline the discovery, organization, and sharing of information.\u003C/p\u003E\n\n\u003Cp\u003EThe popularity of folksonomy-driven services, along with the general acceptance of their use, has grown tremendously within the recent months. The most popular of these services focus particularly on the \u0026#8216;social bookmarking\u0026#8217; aspect of the social networking concept. Socialmarks furthers this concept by, in addition, providing RSS and Atom feed aggregation tools (we\u0026#8217;re currently tracking 0 feeds, and have indexed 0 posts)! With these features, Socialmarks gives users the ability to tag specific feeds, a feed\u0026#8217;s post, as well as allowing the user to add the post to their list of social bookmarks (which can also be tagged).\u003C/p\u003E\n\n\u003Cp\u003EIf you think like we do, you\u0026#8217;ll see the potential of this combined data, especially over a longer time period. Using this data to the advantage, Socialmarks provides automated trend discovery tools, which show the rate and pace of information being shared (bookmarks, tags, RSS/Atom feeds), and more.\nHow Soon Is This Coming?\u003C/p\u003E\n\n\u003Cp\u003ESocialmarks has been in development (day and night) for several months now. Fortunately, all the hard work is paying off, and Socialmarks soon be available to be tested (in beta) by a select few. Let us know you\u0026#8217;re out there and aware of us! We\u0026#8217;ll be sending out invites in small batches (first come, first serve style). Excited? Check out an example of the interface, and remember, that\u0026#8217;s only capturing a small set of the features of our service!\u003C/p\u003E\n\n\u003Cp\u003EIf you have any feedback (comments, suggestions, etc.), we\u0026#8217;d love to hear from you! You can get in touch with us at feedback@socialmarks.com.\u003C/p\u003E\n\n\u003Cp\u003E\u0026lt;!\u0026#8211;The intent of Socialmarks was to combine the functionality found in the emerging Del.icio.us products with the RSS / Feed Subscription and Reading capabilities found in Bloglines.  Crossing the two site\u0026#8217;s feature sets and merging tagging, following (other users, feeds, feed posts, tagged feed categories, tagged post categories, tagged user interests, feeds or feed posts or bookmarks tagged by users, bookmarks) starring concepts\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Founder",
    "person":
     {"first_name": "Matthew",
      "last_name": "Kaufman",
      "permalink": "matthew-m-kaufman",
      "image":
       {"available_sizes":
         [[[129,
            150],
           "assets/images/resized/0010/0491/100491v2-max-150x150.png"],
          [[215,
            250],
           "assets/images/resized/0010/0491/100491v2-max-250x250.png"],
          [[238,
            276],
           "assets/images/resized/0010/0491/100491v2-max-450x450.png"]],
        "attribution": "\u003Cp\u003Ein Boston\u003C/p\u003E"}}},
   {"is_past": true,
    "title": "COO",
    "person":
     {"first_name": "Dave",
      "last_name": "Conklin",
      "permalink": "dave-conklin",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Lancaster, PA",
    "address1": "1830 Colonial Village Lane",
    "address2": "",
    "zip_code": "17601",
    "city": "Lancaster",
    "state_code": "PA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}