{"name": "SoftLabs",
 "permalink": "softlabs",
 "crunchbase_url": "http://www.crunchbase.com/company/softlabs",
 "homepage_url": "http://www.indiamart.com/softlabs/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "softlabs@tradepassport.org",
 "phone_number": "9492937226",
 "description": " Service Provider",
 "created_at": "Fri Apr 05 10:43:05 UTC 2013",
 "updated_at": "Fri Apr 05 10:43:09 UTC 2013",
 "overview": "\u003Cp\u003ESoftLabs is a leading Information Technology and Communications (ITC) company with core competency in providing Information Technology (Application Development \u0026amp; QA Services), Communication and Business Consulting services worldwide. We are supported by a passionate team of industry and functional expertise and renowned technology practices with a global delivery model which enables us to deliver the demands of customers on time.\u003C/p\u003E\n\n\u003Cp\u003EVision:\n\u0026#8220;To provide products, services and solutions of the highest quality and deliver more value to the customers\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003EMission:\n\u0026#8220;To be trusted business partner and advisor to each of our clients by delivering long term Values \u0026amp; Services for sustainable existence\u0026#8221;.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe pay utmost care and attention in providing and maintaining standard of quality services to our clients. In spite of highly competitive business scenarios, we are able to carve a special niche in market due to our best quality assurance and prompt services. We hire only qualified and well experienced professionals and engineers to deliver quality services to our clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Jalla Lokesh Reddy\n    Annapurna Devi.K\n    Dr. Venkat Nimmagadda\n    Venkateswaran.K.A\n    Bhaskara Reddy\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nClient satisfaction is our prime objective and in order to fulfill this task we work with highest efficiency and provide only quality services. Comprehensive policies have been adopted by our renowned company for fair dealing with our clients. Along with quality maintenance and prompt supply, we provide easy mode of payment for convenience of our valuable clients.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have earned this position in market due to our quality standard, quick availability, timely supply and above all ethical business dealing. There are various other factors of our growth and also helping us to gain the faith of our valuable patrons.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8538/248538v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8538/248538v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8538/248538v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}