{"name": "SOFTECH MICROSYSTEMS",
 "permalink": "softech-microsystems",
 "crunchbase_url": "http://www.crunchbase.com/company/softech-microsystems",
 "homepage_url": "http://www.softechms.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "softechms",
 "category_code": "public_relations",
 "number_of_employees": null,
 "founded_year": 1987,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "it, telecommunications-company, pabx, pbx, router, switches, time-attendance, phone-systems, data, information-security, call-recording",
 "alias_list": null,
 "email_address": "softechmicrosystem@gmail.com",
 "phone_number": " +92 (21) 3280-3112 (9 Lines)",
 "description": "Softech Microsystems",
 "created_at": "Mon Nov 19 10:50:48 UTC 2012",
 "updated_at": "Thu Nov 22 08:01:26 UTC 2012",
 "overview": "\u003Cp\u003ESoftech Microsystems, is an Information and Communication Technology Company, Founded in 1987.\u003C/p\u003E\n\n\u003Cp\u003EHaving more than 70 experienced and dedicated team of engineers, developers and technicians and 25 years of experience in the field of IT and Telecommunications Softech offers its customers highly Reliable, Trustworthy and customer oriented Products and services.\u003C/p\u003E\n\n\u003Cp\u003ESoftech Represents in Pakistan Arista Systems Corporation Taiwan, AutoTelecom Taiwan, KCA Taiwan, Yan Yung Taiwan, Yosin Electronics Taiwan, Focus systems Taiwan for their IT and Telecom Products.\u003C/p\u003E\n\n\u003Cp\u003ESoftech is Microsoft Gold certified Partner, Cisco Certified Partner, and Alcatel-Lucent Partner in Pakistan.\u003C/p\u003E\n\n\u003Cp\u003ESoftech is the largest Company in Pakistan In the field of IT \u0026amp; Telecommunications, Voice \u0026amp; Data, Security \u0026amp; Surveillance Products providing complete range under one roof.\u003C/p\u003E\n\n\u003Cp\u003EFrom Digital-ISDN-VoIP PABX/KTS Systems, Voice Mail Systems, Active and Passive Data, IP/CCTV surveillance, Fire security to Voice Logging Systems, Softech offers Total Communication Management and Holds the market across Pakistan, through a large base of Dealers and Resellers.\u003C/p\u003E\n\n\u003Cp\u003ESoftech has a client base of over 9000+ in Pakistan. Through its Customer Support Department and Tech-Support Help line Softech provides its customers an UN-paralleled, unending bond of confidence and After Sales Support.\u003C/p\u003E\n\n\u003Cp\u003ESoftech also Designs and develops Electronic and Computerized Telecommunication and Switching products. Our priority is to enable communication solution seekers to optimize their communication facilities by matching each application to the best hardware technology and to the most appropriate communication facilities.\u003C/p\u003E\n\n\u003Cp\u003ESoftech is proud to be associated with Government Defense production organizations. Softech has well established history of developing local/indigenous resources to fulfill demand generated by Defense production organizations. Softech has capabilities in design and development of electronics, R\u0026amp;D, Digital \u0026amp; Microprocessor based system design and scientific and engineering software application development.\u003C/p\u003E\n\n\u003Cp\u003ESoftech has since last 25 years applied its resources in developing a full range of telecommunication products such as PBX systems, Voice logging systems, Voicemail systems. Softech has worked with Pakistan Navy and Air Force in fulfilling their specific needs.\u003C/p\u003E\n\n\u003Cp\u003EImportant milestone of Softech in Defense sector has been development of Submarine Simulator for Pakistan Navy and Voice Logging System (VLS) for Pakistan Air Force. Softech also provided R\u0026amp;D and production support to Pakistan Navy in 1990s for the replacement of older electronic technology.\u003C/p\u003E\n\n\u003Cp\u003EIn the year 1997, Softech Worldwide LLC USA emerged as a software development and consulting organization under the leadership of the same management team who drove Softech Microsystems for 25 years to success as designers, manufacturers of electronic , computerized telecommunication products and hardware and software solutions for local market with the vision to tap into the foreign market.\u003C/p\u003E\n\n\u003Cp\u003EWith its head office located in Virginia, USA with its development center in Karachi, Pakistan, it was established with highly qualified Software engineers to work on offshore projects with a vast experience and expertise. Softech Worldwide offers various services such as Web Application Development, B2C \u0026amp; B2B e-commerce, Intranet solutions, Video Based Online Trainings and Content Delivery Solutions, and Customized software development.\u003C/p\u003E\n\n\u003Cp\u003ESince April 1997 Softech WorldWide has been involved in designing and creating e-Commerce, Enterprise Application Integration (EAI), Custom Built Applications and Web presence solutions for businesses and organizations seeking a dynamic and outstanding group of consultants, experienced in all areas of Information Technology (IT) Development.\u003C/p\u003E\n\n\u003Cp\u003ESoftech’s goal is to aim for a higher understanding of business problem and providing the exact solution to a business along with meeting the quality standards required.\u003C/p\u003E\n\n\u003Cp\u003ENow with having Gold Certified partner status with Microsoft, Softech WorldWide’s vision involves focusing more on Video based training, Sharepoint, CRM, Azure, Silverlight etc.\u003C/p\u003E\n\n\u003Cp\u003EDuring the last 10 years, Softech Worldwide has been working with numerous US organizations including Government, Educational as well as Commercial small, medium sized and fortune 500 organizations.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       35],
      "assets/images/resized/0022/0985/220985v2-max-150x150.jpg"],
     [[250,
       59],
      "assets/images/resized/0022/0985/220985v2-max-250x250.jpg"],
     [[300,
       71],
      "assets/images/resized/0022/0985/220985v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0022/0984/220984v2-max-150x150.png"],
      [[250,
        156],
       "assets/images/resized/0022/0984/220984v2-max-250x250.png"],
      [[450,
        281],
       "assets/images/resized/0022/0984/220984v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}