{"name": "Sohal Industrial",
 "permalink": "sohal-industrial",
 "crunchbase_url": "http://www.crunchbase.com/company/sohal-industrial",
 "homepage_url": "http://www.indiamart.com/sohalindustrialcorporation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sohalindustrialcorporation@tradepassport.org",
 "phone_number": "09953361804",
 "description": "manufacturer, exporter \u0026 supplier",
 "created_at": "Thu Apr 04 15:23:09 UTC 2013",
 "updated_at": "Thu Apr 04 15:23:12 UTC 2013",
 "overview": "\u003Cp\u003ESohal Industrial Corporation was incepted in the year 1966 at Ludhiana and since then it has become one of the most sought-after manufacturer, exporter and supplier of an extensive range of Ball Joint Components, CNC Machine Parts, Forged Components and many more. High grade raw materials are sourced from reputed vendors adhering to international quality standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a sophisticated facility that is well equipped with all the advanced tools and modern technology that allow us to boast our high production capacity. There are various departments in our facility like manufacturing unit, warehousing facility, sales and marketing department etc. Our capacious warehouse spreads over a large area and has enough space to enable a safe storage of all the finished products.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality has always been the top priority for our organization and that is why we make use of the finest quality raw materials that are well tested and verified adhering to international quality standards. Reliable, sturdy, durable, cost effective, our products are able to successfully live up to the expectations of the customers. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric company, we have earned an enviable position in the industry by offering a range of quality driven products. We follow an ethical business approach and offer complete transparency in our business dealings. All the products are delivered within the assigned period of time as client’s time is always precious for us. We handle client’s concerns and enquiries with the utmost care in order to precisely comprehend their requirements.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are an esteemed manufacturer, exporter and supplier of a wide spectrum of impeccable quality products. Our feasible price range makes our products available at market leading prices to be availed within the assigned period of time.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8026/248026v2-max-150x150.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8026/248026v2-max-250x250.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8026/248026v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}