{"name": "Solgari",
 "permalink": "solgari",
 "crunchbase_url": "http://www.crunchbase.com/company/solgari",
 "homepage_url": "http://www.solgari.com",
 "blog_url": "http://www.solgari.com/blog/",
 "blog_feed_url": "http://www.solgari.com/CMS/UI/Modules/BizBlogger/rss.aspx?tabid=597017\u0026moduleid=1246495\u0026maxcount=25\u0026t=e158a15ab4df36269f1bdf0765076ae1",
 "twitter_username": "solgaritweets",
 "category_code": "public_relations",
 "number_of_employees": 15,
 "founded_year": 2012,
 "founded_month": 7,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cloud-pbx, hosted-pbx, cloud-contact-centre, multi-channel-communications, crm-integration",
 "alias_list": null,
 "email_address": "sales@solgari.com",
 "phone_number": "+353 1 246 1130",
 "description": "Cloud Communication Services",
 "created_at": "Thu Nov 29 11:34:23 UTC 2012",
 "updated_at": "Mon Dec 03 07:13:29 UTC 2012",
 "overview": "\u003Cp\u003ESolgari provides Cloud Integrated Communications Services to business customers globally including Cloud PBX, Contact Center, CTI, Predictive Dialing \u0026amp; IVR solutions. \u003C/p\u003E\n\n\u003Cp\u003EThis SOAP based cloud service is provided both directly to Enterprise \u0026amp; SMB customers and through partners such as telcos, system integrators and CRM consultants. The services are available on a monthly subscription basis providing our customers business enhancing cost savings and productivity gains compared to traditional phone and telecoms infrastructure. Solgari Connect offers integration of our services with leading CRM vendors such as Salesforce.com, Bullhorn and Microsoft Dynamics as well as enabling interaction between voice, email, mobile devices, IM and Social Media. Solgari is positioned at the centre of the Cloud Communications space which is one of fastest growing cloud services globally.\u003C/p\u003E\n\n\u003Cp\u003ECloud PBX\u003C/p\u003E\n\n\u003Cp\u003ESolgari’s Cloud PBX offering is a service that combines the advantages of lowering both telephony infrastructure and call costs while increasing the communications features available to a business. There is no need to install and maintain a local telephone PBX system with IP phones connecting to Solgari’s full service cloud telephony platform. By taking advantage of the lowest platinum wholesale rates, all calls are charged at the lowest rates. The extensive feature list includes the facility to make the Cloud PBX platform the centre of any company’s Unified Communications strategy. Solgari provides Cloud PBX services as part of our Enterprise and Small Business offerings.\u003C/p\u003E\n\n\u003Cp\u003EContact Centre\u003C/p\u003E\n\n\u003Cp\u003ESolgari’s Automated Call Distribution (ACD) system ensures that each contact is handled appropriately through Solgari’s ACD Queues and Skill-Based Routing. Solgari has the flexibility to prioritize inbound contact traffic to maximize business results. When queue times are long or particular agents are unavailable, Solgari can be customized to handle these calls any way your business requires such as hold music, marketing messages, in-queue announcements such as estimated wait times, voicemail or call back options to reduce abandoned contacts. Solgari also offers full blended contact centre functionality to provide the ultimate contact centre utilisation and management.\u003C/p\u003E\n\n\u003Cp\u003ESolgari Contact Center can increase the productivity of contact centre staff whether office, or home based, by delivering smarter predictive dialling capability by using Solgari Connect to integreate with CRM systems and Solgari Engage to integrate Social Media communications as part of an overall UC (Unified Communications) strategy.\u003C/p\u003E\n\n\u003Cp\u003EFlexibility in both technology and implementation are the key drivers for the new generation of contact centres and the ability to cope with different choices of interaction by consumers at different times and deliver that all important quality customer experience.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       71],
      "assets/images/resized/0022/2975/222975v2-max-150x150.png"],
     [[250,
       118],
      "assets/images/resized/0022/2975/222975v2-max-250x250.png"],
     [[450,
       213],
      "assets/images/resized/0022/2975/222975v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}