{"name": "Soltech Pumps",
 "permalink": "soltech-pumps",
 "crunchbase_url": "http://www.crunchbase.com/company/soltech-pumps",
 "homepage_url": "http://www.indiamart.com/soltechpumps/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "soltechpumps@tradepassport.org",
 "phone_number": "9310156040",
 "description": "We are engaged in Supplying of quality ,",
 "created_at": "Thu Apr 04 08:33:36 UTC 2013",
 "updated_at": "Thu Apr 04 08:33:38 UTC 2013",
 "overview": "\u003Cp\u003EWe “Soltech Pumps \u0026amp; Equipment Pvt. Ltd.” are known as the renowned company involved in Supplying \u0026amp; Exporting a broad array of Chemical Process Pumps, Industrial Centrifugal Pump, Various types of Valves, Filter Press, Pipes and Fittings. The product range includes Polypropylene Pumps, PVDF Pumps, Metallic Chemical Process Pump, Self Priming Pumps, Vertical, Glandless Pump, PFA/FEP Chemical Process Pumps, Barrel Pumps, etc. These products are manufactured using optimum quality raw material and use of sophisticated technology at our vendors’ end.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality is always our one of the prime objectives and we make possible endeavors to deliver quality range of Pumps, Industrial Centrifugal Pump, Valves, Filter Press, Pipes and Fittings. We have specially implemented a quality management system to check that defect free products are being procured and supplied to our valued clients. \u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are cordially and strongly associated with most trustworthy and certified vendors at global level for procurement of quality products. Our associated vendors are competent in their domain and manufacture using quality factor inputs and advanced technology. In order to associate ourselves with genuine vendors, our procuring agents conduct various market researches over vendor in relation to financial stability, goodwill, past clients served and quality. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur team strives hard to attain a high level of client satisfaction by offering our clients superior quality range of Pumps, Industrial Centrifugal Pump, Valves, Filter Press, Pipes and Fittings. Owing to features such as timely delivery, defect free consignment, transparent dealing and optimum pricing policy, our clients experience utmost level of satisfaction.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nVarious types of Valves, Filter Press, Pipes and Fittings. The product range includes Polypropylene Pumps, PVDF Pumps, Metallic Chemical Process Pump, Self Priming Pumps, Vertical, Glandless Pump, PFA/FEP Chemical Process Pumps, Barrel Pumps, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7693/247693v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7693/247693v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7693/247693v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}