{"name": "Solution Mighty Marketing Solutions",
 "permalink": "solution-mighty-marketing-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/solution-mighty-marketing-solutions",
 "homepage_url": "http://www.facebook.com/MightyMarketing",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "mightymktsol",
 "category_code": "advertising",
 "number_of_employees": 1,
 "founded_year": 2011,
 "founded_month": 5,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "webdesign-website-marketing-seo-sem-social-media-reseaux-sociaux-site-web-ppc",
 "alias_list": null,
 "email_address": "gtouchette08@ubishops.ca",
 "phone_number": "819-212-4006",
 "description": "Webdesign e-marketing expert",
 "created_at": "Tue Mar 20 16:49:50 UTC 2012",
 "updated_at": "Mon Mar 26 01:22:35 UTC 2012",
 "overview": "\u003Cp\u003ESocial Medias such as Facebook, Twitter, LinkedIn, etc are growing at incredible speed. They offer businesses access to large audiences, great contact opportunities and enable you to advertise directly to interested individuals all around the world. When combined to a great web site design by Mighty Marketing, there is no reason not to succeed!\u003C/p\u003E\n\n\u003Cp\u003EMighty Marketing Solutions is a company that specializes itself in Social Medias promotion and web design to increase visibility of our clients. We offer a wide variety of products from the simple creation of Social Media pages all the way to web site configuration and design. All this, to allow our clients to benefit of maximum internet coverage for the most competitive price!\u003C/p\u003E\n\n\u003Cp\u003ELes médias sociaux comme Facebook, Twitter, LinkedIn et autres grandissent à une vitesse impressionnante. Ils offrent aux différentes entreprises un accès large au public, plusieurs opportunités de communications et permettent une diffusion d’information directement avec les diverses personnes intéressées tout autour du monde. Lorsque ces éléments sont combinés aux attrayants sites web faits par Mighty Marketing Solutions, le succès est assuré!\u003C/p\u003E\n\n\u003Cp\u003EMighty Marketing Solutions est une entreprise qui se spécialise en promotion par les médias sociaux et le design de sites internet afin d’élargir la visibilité de nos clients. Nous offrons plusieurs une large variété de produits qui permettent à nos clients de bénéficier d’une couverture maximum sur le réseau d’internet. Le tout, au meilleur prix qui soit!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       70],
      "assets/images/resized/0018/0227/180227v2-max-150x150.jpg"],
     [[250,
       117],
      "assets/images/resized/0018/0227/180227v2-max-250x250.jpg"],
     [[320,
       150],
      "assets/images/resized/0018/0227/180227v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}