{"name": "Solve My Question Inc",
 "permalink": "solve-my-question-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/solve-my-question-inc",
 "homepage_url": "http://solvemyquestion.com/",
 "blog_url": "http://solvemyquestion.com/services/solution-library/",
 "blog_feed_url": "",
 "twitter_username": "solvemyquestion",
 "category_code": "education",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": 5,
 "founded_day": 12,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "education, business, homework-help, assignment, solution-library, entire-course, solvemyquestion-com",
 "alias_list": null,
 "email_address": "care@solvemyquestion.com",
 "phone_number": "",
 "description": "Home Work and Assignment Help",
 "created_at": "Fri Jun 15 16:48:01 UTC 2012",
 "updated_at": "Tue Jun 19 14:11:16 UTC 2012",
 "overview": "\u003Cp\u003Esolvemyquestion.com is the market place for homework and assignment. \u003C/p\u003E\n\n\u003Cp\u003EWelcome in the world of Solve My Question. We can help you out in Homework, Assignments, Case Studies, Projects and Paper wirting. We undertake almost all subjects including Accounts, Business, Finance, Math, Law, Computer, Geography, History, Economics, Taxation, Geography and many more other subjects from School to Postgraduate level.\nWe are here to help you out at lest possible price so that you can use your money for asking more questions or for some other purpose…..Is it not Great!!!\nYes, it is true… Just email or Fax your Questions, Assignments, Case Studies and Homework and get AAA Quality, Original, Complete help without any plagiarism. All answers, assignment, case studies, projects etc will be prepared by our academic experts who have at least master degree with number of years of experience in their respective areas. Therefore, you should not worry about quality and originality of the answer.\nSo, Start Mailing or Faxing your questions.\nWe also have a huge SOLUTION LIBRARY . This library contains number of questions as well as case studies related to different subjects. We also have separate page for Various FULL COURSES.\nYou can search your question on our website by using box given in top-right on this page. ‘Search Box’ also available in the top-right hand side in SOLUTION LIBRARY. If you are still unable to find question in our SOLUTION LIBRARY then just email your question at question@solvemyquestion.com or you can submit your question by clicking here.\nTo know how it works(our process) click here\nTo know  how to contact with us click here\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0019/5697/195697v2-max-150x150.png"],
     [[250,
       250],
      "assets/images/resized/0019/5697/195697v2-max-250x250.png"],
     [[281,
       281],
      "assets/images/resized/0019/5697/195697v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}