{"name": "Sondor Travel",
 "permalink": "sondor-travel",
 "crunchbase_url": "http://www.crunchbase.com/company/sondor-travel",
 "homepage_url": "http://www.sondortravel.com",
 "blog_url": "http://blog.sondortravel.com",
 "blog_feed_url": "",
 "twitter_username": "SondorTravel",
 "category_code": "other",
 "number_of_employees": 8,
 "founded_year": 1991,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "albania, balkan, travel, tours, adventure, holidays, travel-to-albania, hiking-in-albania, walking-in-albania, cycling-in-albania, walking-tours-albania, cycling-tours-albania, tours-in-albania, travel-to-balkan, tours-in-balkan, travel-to-montenegro, tra",
 "alias_list": null,
 "email_address": "incoming@sondortravel.com",
 "phone_number": "+355684051766",
 "description": "Albanian Inbound Tour Operator ",
 "created_at": "Thu Jan 17 16:28:46 UTC 2013",
 "updated_at": "Sat Feb 02 08:31:23 UTC 2013",
 "overview": "\u003Cp\u003ESondor Travel is an Albanian Inbound Tour Operator which provides tours in Albania, Macedonia, Kosovo and Montenegro. \u003C/p\u003E\n\n\u003Cp\u003ESondor Travel has been providing travel services and products to a wide range of travel companies and individual travelers since 1991. In time we have become one of the leading Albanian Inbound Tour Operators focusing ourselves as a Destination Management Company and providing services in several Balkan Countries such as: Albania, Macedonia, Kosovo, Montenegro and Bosnia Herzegovina. We like to share with everyone what we know about the region, this is why we offer a diverse kind of tours not only in Albania but in the neighboring countries as well, be it Active Tours, City Breaks, Tailormade Holidays, Transportation Services or Special Interest tours. We believe that this part of the Balkan has a lot to discover and Sondor Travel always strives to bring the best of the region to those who are still looking for perfect holiday adventures.\u003C/p\u003E\n\n\u003Cp\u003EHistory\nWe began operating in the tourism market since 1991 after Albania became a democratic country. Being one of the first private travel companies in Albania has helped us become more experienced and hopefully a trusted partner to everyone who relies on our services.We are passionate about travel. This has continually remained the core of Sondor from the humble beginnings since 1976 of its founding director through the hard times of communism and the transition which enveloped Albania during the 90\u0026#8217;s.We still maintain the same spirit in Sondor which is reflected every day in the tours we provide for our clients and partners as well as the services we offer.\u003C/p\u003E\n\n\u003Cp\u003EWhat we do better? \u003C/p\u003E\n\n\u003Cp\u003ERegional expertise\u003C/p\u003E\n\n\u003Cp\u003EWe spend a lot of time personally knowing in depth and continually upgrading our selection of accommodation facilities, restaurants, transportation and guides we work with. This has helped us know what to offer exactly to different requests we process every day. As an inbound tour operator we feel secure and appreciative on the network of partners knowing that we are providing the best solutions to the customers needs.   \u003C/p\u003E\n\n\u003Cp\u003EBetter Value\u003C/p\u003E\n\n\u003Cp\u003EWe like to focus on the value of our products and services and we do our best to ensure top quality in everything we provide. This has helped us stay ahead of other regional travel companies and built a relationship based on trust with our clients.\u003C/p\u003E\n\n\u003Cp\u003EContinual improvement of services \u003C/p\u003E\n\n\u003Cp\u003EWe like to have a lasting relationship with our new and old partners as well as with individual clients. This is why we continually improve the same product or service provided to a specific client in time. Be it a regional tour or a specific service provided, we will always think how to make it better.\u003C/p\u003E\n\n\u003Cp\u003ECustomer satisfaction\u003C/p\u003E\n\n\u003Cp\u003EIt is imperative to us to have each client be satisfied from our services. We know that the experience they had will be a lasting one if it is positive. We know as well that by providing the best experience will help our partner travel companies be more confident in our products in the future.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0023/3065/233065v2-max-150x150.png"],
     [[250,
       60],
      "assets/images/resized/0023/3065/233065v2-max-250x250.png"],
     [[450,
       109],
      "assets/images/resized/0023/3065/233065v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "Walking Tours",
    "permalink": "walking-tours",
    "image": null},
   {"name": "Cultural Tours",
    "permalink": "cultural-tours",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Founder of Sondor Travel ",
    "person":
     {"first_name": "Sadik",
      "last_name": "Malaj",
      "permalink": "sadik-malaj",
      "image": null}},
   {"is_past": false,
    "title": "General Manager",
    "person":
     {"first_name": "Dorien",
      "last_name": "Malaj",
      "permalink": "dorien-malaj",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Sondor Travel",
    "address1": "Address: Rr. Mine Peza, Pll 1 Shk 13 Ap 3 (perballe Grand Cafe)  Tirane, Albania ",
    "address2": "",
    "zip_code": "1010",
    "city": "Tirana",
    "state_code": null,
    "country_code": "ALB",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        107],
       "assets/images/resized/0023/3084/233084v2-max-150x150.png"],
      [[250,
        179],
       "assets/images/resized/0023/3084/233084v2-max-250x250.png"],
      [[450,
        322],
       "assets/images/resized/0023/3084/233084v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.wtmlondon.com/2011/page.cfm/Action=Exhib/ExhibID=13058",
    "title": "Sondor Travel International Fair London"}]}