{"name": "Sonetica",
 "permalink": "sonetica",
 "crunchbase_url": "http://www.crunchbase.com/company/sonetica",
 "homepage_url": "http://www.sonetica.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "_sonetica",
 "category_code": "consulting",
 "number_of_employees": 4,
 "founded_year": 2012,
 "founded_month": 12,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "consulting, seo, social-media, reputation-management, project-management",
 "alias_list": null,
 "email_address": "support@sonetica.net",
 "phone_number": "",
 "description": "Technology Consultant ",
 "created_at": "Thu Dec 06 08:11:31 UTC 2012",
 "updated_at": "Mon Dec 17 20:46:35 UTC 2012",
 "overview": "\u003Cp\u003EThe role of consultants in advising and implementing software and hardware solutions for businesses and organizations has increased significantly. Businesses depend on the latest cutting edge technology in order to streamline certain processes that increase efficiency and cut costs. \u003C/p\u003E\n\n\u003Cp\u003EHere at Sonetica we combine years of industry expertise and personal obsession with all things technical, to deliver the highest caliber of technical advice, support and integration possible.\u003C/p\u003E\n\n\u003Cp\u003EWe are a unified collective of motivated, personable business professionals, but first and foremost programmers, with multiple college degrees and in-depth relevant industry exposure. We have years of direct experience in the Education, Healthcare, Government, Telecommunications and Investment Banking sectors. \u003C/p\u003E\n\n\u003Cp\u003EBuilding a resilient information infrastructure requires skilled technical professionals to transform products into technical solutions that address your business challenges.\u003C/p\u003E\n\n\u003Cp\u003ESonetica offers end to end support in Search engine optimization, web design and development, Social Media management, proprietary software applications for both mobile and desktop, staffing and outsourcing, training, systems administration, IT networking, logistics and much more. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}