{"name": "Sososher",
 "permalink": "sososher",
 "crunchbase_url": "http://www.crunchbase.com/company/sososher",
 "homepage_url": "http://www.sososher.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": 2,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sososher, shop, shopping, design, webstart, fasion, it",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "Online Shopping",
 "created_at": "Tue Apr 01 08:38:49 UTC 2008",
 "updated_at": "Sat Jan 05 20:33:48 UTC 2013",
 "overview": "\u003Cp\u003ESocial Shopping Website \u0026#8220;Sososher\u0026#8221;\u009d Has Now Launched\u003C/p\u003E\n\n\u003Cp\u003EAfter an eagerly anticipated wait, Sososher has now launched. Sososher which is an acronym of four words (S) Savvy (o) Online (so) Social (sher) Shopper is marketing itself as the world\u0026#8217;s first website that combines social shopping, member picture and video purchase review uploads, the viewing of retailer promo videos, voucher codes and cash back on all purchases that members make  - all on one website. \u003C/p\u003E\n\n\u003Cp\u003EBoasting a selection of over 2,000 online stores spread across 40 different categories with big names such as Debenhams, HMV, Thomson Holidays and The Carphone Warehouse to name but a few, the chances are that if you\u0026#8217;re looking to purchase a product or service online then you\u0026#8217;ll find it on Sososher.\u003C/p\u003E\n\n\u003Cp\u003EThe way in which consumers shop online is now geared towards making a purchasing decision based on impartial product recommendations and reviews. Sososher harnesses this by giving its members the facility to upload video and picture reviews of the purchases they have made via the website and also to view video and picture reviews left by other members. Before other members decide to make a purchase they have the option to search for a video or picture review for their desired  product or store left by other members, thus giving them a more informed purchasing decision and eliminating \u0026#8220;regretful purchases.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003ESome of the key elements of Sososher are:-\u003C/p\u003E\n\n\u003Cp\u003ECash Back—members receive cash back on every purchase they make. With the current economic climate, consumers are increasingly looking at ways to reduce costs. Members can receive for example, 2.5% cash back on all purchases they make at Marks \u0026amp; Spencer and £35 cash back when they take out insurance with Aviva.\u003C/p\u003E\n\n\u003Cp\u003EMember Video and Picture Uploads—members have the facility to upload picture and video reviews of their purchase alongside their written review. All too often online consumers make regretful purchases based on what they thought a product would do or how it would look based on retailer advertising. Having the facility to watch a video review by someone who has actually bought and used the product proves an invaluable resource when it comes to making an online purchasing decision.\u003C/p\u003E\n\n\u003Cp\u003EToday\u0026#8217;s Hot Offers—highlights special offers that retailers have such as 70% Off Sales and Buy One Get One Free deals \u0026#8220;many of which consumers may not be aware of\u0026#8221; simply by searching via a Search Engine. With many of the Hot Offers combining Voucher and Discount Codes from Free delivery to additional discounts, this coupled with cash back that members receive would go on to show huge cost savings.\u003C/p\u003E\n\n\u003Cp\u003EWhat The?—this section shows products and services that you might not be aware of such as Diamond Encrusted iPhones or the underwater MP3 player.\u003C/p\u003E\n\n\u003Cp\u003EThe team at Sososher maintains that everyone will love the using the website and if you have one \u0026#8220;even your boss\u009d,\u0026#8221; but for those of you in the office should your boss walk in unexpectedly — be sure to click on the Look Busy Button.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[127,
       127],
      "assets/images/resized/0001/6648/16648v1-max-150x150.jpg"],
     [[127,
       127],
      "assets/images/resized/0001/6648/16648v1-max-250x250.jpg"],
     [[127,
       127],
      "assets/images/resized/0001/6648/16648v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": null,
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.500152,
    "longitude": -0.126236}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}