{"name": "Sourcine",
 "permalink": "sourcine",
 "crunchbase_url": "http://www.crunchbase.com/company/sourcine",
 "homepage_url": "http://www.sourcine.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "java, java-ee, j2ee, jee, software-development, software-engineering, enterprise-software, application-integration, enterprise, insurance, finance, banking, nearshore, it-outsourcing, outsourcing-services, java-outsourcing, outsourcing-central-europe, ded",
 "alias_list": null,
 "email_address": "contact@sourcine.com",
 "phone_number": "",
 "description": "Software development outsourcing",
 "created_at": "Wed Jun 13 18:01:09 UTC 2012",
 "updated_at": "Sun Jun 17 14:02:50 UTC 2012",
 "overview": "\u003Cp\u003ESourcine is an outsourcing company based in Poland, bringing together IT professionals dedicated to creating top quality software solutions for businesses. Our services consist in providing clients with managers and software developers that can be combined into teams tailored to meet individual needs of the customers. \u003C/p\u003E\n\n\u003Cp\u003EWe offer our experience and knowledge to customers all over the globe. There are two main models of cooperation, with varying levels of responsibility:\u003C/p\u003E\n\n\u003Cp\u003EClient Own Team model – we assemble a project team comprised of full time specialists under the customer\u0026#8217;s management. We will handle HR (e.g. recruitment), administration (e.g. provision of technical infrastructure) or legal issues (such as agreements with the employees). The customer stays focused on management issues and remains in full control of the team\u0026#8217;s shape, growth and costs. \u003C/p\u003E\n\n\u003Cp\u003EManaged Team – we assemble a full team in line with the customer\u0026#8217;s requirements. The team of professionals is managed, coached and supervised by our team leader, who is in charge of the performance of the tasks on schedule. The team leader reports to the customer and serves as a point of contact.\u003C/p\u003E\n\n\u003Cp\u003EWe are ready to cooperate on every organizational level – starting from a single developer reporting directly to your representative up to a fully-fledged team capable of taking charge of every stage in the software development life cycle.\u003C/p\u003E\n\n\u003Cp\u003ESourcine is based in the European Union and all our members are EU citizens. The amount of employment-related paperwork to go through is thus distinctly limited. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0019/5343/195343v2-max-150x150.png"],
     [[189,
       31],
      "assets/images/resized/0019/5343/195343v2-max-250x250.png"],
     [[189,
       31],
      "assets/images/resized/0019/5343/195343v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "Slowackiego 26/1",
    "address2": "",
    "zip_code": "60-823",
    "city": "Poznan",
    "state_code": null,
    "country_code": "POL",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}