{"name": "South Indian",
 "permalink": "south-indian",
 "crunchbase_url": "http://www.crunchbase.com/company/south-indian",
 "homepage_url": "http://www.indiamart.com/southindianindustires/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "willow-wood-cricket-bats, badminton-rackets, shuttlecocks, wooden-carrom-boards, champion-carrom-boards",
 "alias_list": null,
 "email_address": "southindianindustires@tradepassport.org",
 "phone_number": "9814122477",
 "description": "We are the most eminent Manufacturer,  ",
 "created_at": "Thu Apr 04 09:38:20 UTC 2013",
 "updated_at": "Thu Apr 04 09:38:22 UTC 2013",
 "overview": "\u003Cp\u003ESituated at Jalandhar (Punjab, India), we, “South Indian Industries”, are noted as the trustworthy manufacturer, exporter and supplier of a qualitative assortment of Bats, Rackets, Shuttlecocks, Carrom Boards, Sports Balls, Skipping Ropes and Sports Nets. The skills of our team members reflects in our entire array comprising Tennis Cricket Bats, Willow Wood Cricket Bats, Badminton Rackets, Shuttlecocks, Wooden Carrom Boards, Champion Carrom Boards, Cricket Tennis Balls, etc. We manufacture these products from supreme quality raw material, which is procured from some of the certified vendors of the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWith the valuable assistance of our proficient team members, we have been able to muster immense recognition for our excellent quality of Bats, Rackets, Shuttlecocks, Carrom Boards, Sports Balls, Skipping Ropes and Sports Nets manufactured, exported and supplied by us. These professionals work with dedication and passion to boost the quality and quantity of the offered products during the manufacturing process. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructural Facilities:\nTo manufacture supreme quality collection of Bats, Rackets, Shuttlecocks, Carrom Boards, Sports Balls, Skipping Ropes and Sports Nets, we have constructed a well-organized infrastructural base. This unit is divided into various functional departments such as manufacturing, quality control lab, sales \u0026amp; marketing, etc. in order to carry out our entire business operations in a systematic and timely way. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince the inception of the organization, our prime objective has been to exceed the expectations of our clients by offering an exquisite assortment of products at the most competitive prices. Our team members work closely with the clients to understand their detailed specifications and further offer them the products in customized form.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nTennis Cricket Bats, Willow Wood Cricket Bats, Badminton Rackets, Shuttlecocks, Wooden Carrom Boards, Champion Carrom Boards, Cricket Tennis Balls,\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7761/247761v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7761/247761v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7761/247761v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}