{"name": "Spark Rebel",
 "permalink": "spark-rebel",
 "crunchbase_url": "http://www.crunchbase.com/company/spark-rebel",
 "homepage_url": "http://www.sparkrebel.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sparkrebel",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Fashion start up",
 "created_at": "Tue Oct 09 16:12:05 UTC 2012",
 "updated_at": "Thu Oct 18 00:11:48 UTC 2012",
 "overview": "\u003Cp\u003ESparkRebel has 18 fashion and beauty channels divided into categories (accessories, shoes, jewelry), topics (runway designers, wedding, inspiration) and budget (look for less, sales and promos). SparkRebel has also recently partnered with Getty Images, allowing members to follow celebrities and major fashion and entertainment events like the Emmys or New York Fashion Week. \u003C/p\u003E\n\n\u003Cp\u003EMembers get personalized streams of customized, engaging content based on their individual fashion style, further curated by the community. By ‘re-sparking’ things they love, members in turn contribute to the curation process for the benefit of the community.  \u003C/p\u003E\n\n\u003Cp\u003ESparkRebel provides both serendipitous fashion inspiration, and custom product content that entices members to shop and purchase items. Members follow brands they love, and are served up fresh daily feeds of new and on- sale products from these merchants. SparkRebel gets a commission for every product sold.\u003C/p\u003E\n\n\u003Cp\u003EFor the retailer, SparkRebel is a platform for driving direct e-commerce revenue, communicating their brand to potential customers and a valuable source of data and business intelligence that can put them ahead of the competition. Retailers enjoy hyper-engaged fans who serve as brand ambassadors for their products. As members distribute and curate brand content, retailers benefit from the authentic, viral endorsement from actual consumers.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}