{"name": "SpareTime",
 "permalink": "spare-time",
 "crunchbase_url": "http://www.crunchbase.com/company/spare-time",
 "homepage_url": "http://www.gosparetime.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "gosparetime",
 "category_code": "network_hosting",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "volunteer, donor, engagement, community, service",
 "alias_list": null,
 "email_address": "founders@gosparetime.com",
 "phone_number": "",
 "description": "technology driven engagement/volunteeri ",
 "created_at": "Mon Sep 24 18:13:55 UTC 2012",
 "updated_at": "Wed Dec 12 07:05:37 UTC 2012",
 "overview": "\u003Cp\u003EAs co-founders of Seeds That Feed, a project aimed at fighting food insecurity in Northwest Arkansas, we were able to take $50 in seed funding, and within 6 months, collect and distribute over 15,000 pounds of fresh produce to local food pantries and community meal programs. The ability to spread awareness, engage volunteers, and attract resources is now imperative to our project’s growth. Seeds that Feed now stands face to face with the need for SpareTime. \u003C/p\u003E\n\n\u003Cp\u003EThere are lots of organizations and projects needing help but many face barriers to engagement and lack visibility. SpareTime is an engagement platform for advancing social good that provides organizations with a way to market their projects to the newest generation of volunteers and donors. Additionally, organizations will be able to sponsor project ideas from the community and/or connect and collaborate with organizations with similar social initiatives.\u003C/p\u003E\n\n\u003Cp\u003EWithin SpareTime, users can\u0026#8230;\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003Ebrowse the local landscape of community projects\u003C/li\u003E\n\u003Cli\u003Ecreate and generate project ideas for the community*\u003C/li\u003E\n\u003Cli\u003Evolunteer and connect with projects based on availability and interests\u003C/li\u003E\n\u003Cli\u003Espread awareness about projects and causes through shares and tweets\u003C/li\u003E\n\u003Cli\u003Efund projects sponsored by one or more accredited organizations\u003C/li\u003E\n\u003Cli\u003Etrack and grow your community influence and economic impact\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003Eview and personalize the first ever living history of your community involvement\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EA portion of our revenue will be used to promote and support youth led project initiatives through SpareTime for Schools.\u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EThis is the only platform where users can track and personalize a central record of projects they have supported by adding journal entries and photos. Furthermore, all centralized records are validated and reported by accredited organizations and can serve as a reference for secondary education applications and resumes.\u003C/p\u003E\n\n\u003Cp\u003ELastly, foundations and private donors will have an opportunity to support their communities by funding newly created and sponsored projects. The project based funding approach will provide the most transparent way for donors to see, monitor, and track the direct impact of their charitable contributions.\u003C/p\u003E\n\n\u003Cp\u003EMany hats\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EIn 2005, while working together at a local restaurant and attending the Walton College of Business, we began our partnership working side by side in a competitive environment. During this time, not only did we find a way to work collaboratively for both of our best interests, but we also laid the foundation of trust that has sustained us since. Our friendship continued to be cultivated because of our common interests, passions, and drive to make a difference. \u003C/p\u003E\n\n\u003Cp\u003EBeginning again in 2009, our working relationship was rekindled upon the idea of SpareTime and our partnership was formed. While working full time jobs and further developing our concept for SpareTime, we launched Seeds that Feed and continue to watch it grow beyond our wildest expectations!\u003C/p\u003E\n\n\u003Cp\u003EAron Shelton is the Architect and Visionary of SpareTime\u0026#8211;generator of new ideas, surveyor of the competitive landscape, and researcher who shapes and defines our position in the marketplace.\u003C/p\u003E\n\n\u003Cp\u003EAlyssa Snyder is the Director and Marketer behind SpareTime\u0026#8211;business and customer developer, scaler and analyzer of new ideas, organizer and strategic planner, and protector of our concept and user experience.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       29],
      "assets/images/resized/0021/2778/212778v7-max-150x150.png"],
     [[209,
       41],
      "assets/images/resized/0021/2778/212778v7-max-250x250.png"],
     [[209,
       41],
      "assets/images/resized/0021/2778/212778v7-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": " Co Founder",
    "person":
     {"first_name": "Aron",
      "last_name": "Shelton",
      "permalink": "aron-shelton",
      "image": null}},
   {"is_past": false,
    "title": " Co Founder",
    "person":
     {"first_name": "Alyssa",
      "last_name": "Snyder",
      "permalink": "alyssa-snyder",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Iceberg",
    "address1": "509 W. Spring Street  ",
    "address2": "Suite 105",
    "zip_code": "72701",
    "city": "Fayetteville",
    "state_code": "AR",
    "country_code": "USA",
    "latitude": 36.0643818,
    "longitude": -94.1666722}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"430\" height=\"270\" src=\"http://www.youtube.com/embed/LXLEoCV9wBw\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003ETeam\u003C/p\u003E"}],
 "screenshots":
  [{"available_sizes":
     [[[98,
        150],
       "assets/images/resized/0021/5175/215175v2-max-150x150.png"],
      [[164,
        250],
       "assets/images/resized/0021/5175/215175v2-max-250x250.png"],
      [[295,
        450],
       "assets/images/resized/0021/5175/215175v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[78,
        150],
       "assets/images/resized/0021/6179/216179v2-max-150x150.png"],
      [[131,
        250],
       "assets/images/resized/0021/6179/216179v2-max-250x250.png"],
      [[236,
        450],
       "assets/images/resized/0021/6179/216179v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}