{"name": "Speed Locksmith U.S.A",
 "permalink": "speed-locksmith-u-s-a",
 "crunchbase_url": "http://www.crunchbase.com/company/speed-locksmith-u-s-a",
 "homepage_url": "http://www.speedlocksmithusa.com",
 "blog_url": "http://www.southern-pride.com/_new/vanso/profile/mikek",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "security",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "locksmith-las-vegas",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Locksmith Services",
 "created_at": "Mon Apr 22 05:23:10 UTC 2013",
 "updated_at": "Mon Apr 29 15:18:11 UTC 2013",
 "overview": "\u003Cp\u003EHave you ever been locked up inside your house owing to a defective lock? Have you ever been unable to get into your car because the door lock broke down? Have you ever been involved in any such situation where you felt helpless because of a malfunctioning lock and had to waste a lot of time to solve the situation? Chances are that you have been in such situations quite a few times. All of us have encountered such moments in life where the lock gets out of order and we are left scratching our heads, and scramble to get hold of a locksmith who can solve the situation immediately. Getting the locksmith, who is licensed, experienced and quick to arrive, however, is the tricky part. But this is where Speed Locksmith comes in.\u003C/p\u003E\n\n\u003Cp\u003EWe are a specialized company which basically brings together locksmiths and those in need of locksmith services. No matter what locksmith services you need, from residential to commercial to automotive, we can help you find the most feasible locksmith. \u003C/p\u003E\n\n\u003Cp\u003ESo how does it work? It’s fairly simple. All you have to do is to call our 24/7 hotline or fill out a form on our website. The form basically asks you your credentials and what sort of locksmith service you need. Within moments licensed, experienced and reputable locksmiths from your region will contact you. All you have to do is to decide which one is the most feasible for you after comparing their offers. And this is how we hook up locksmiths with you. The best part is that our service is available in every town of the country.\u003C/p\u003E\n\n\u003Cp\u003EWe have the most respected and experienced locksmiths in our list. All the locksmiths in our list are licensed. We ask for feedback from every customer about the quality of services rendered by a particular locksmith, and time taken to reach the destination. Based on this feedback system, we make sure that the locksmiths who are not satisfying customers are removed immediately from the list, and only the best service providers are allowed to remain. This makes sure that you avail the services of the best locksmiths in your region.\u003C/p\u003E\n\n\u003Cp\u003ENow you might be wondering why you should use Speed Locksmith and not call a locksmith yourself? There are several benefits that you can avail by using our service. Firstly, in an emergency situation, you can save precious time by simply calling us and we’ll make sure that several locksmiths call you and reach out to help you. Secondly, when you use our service you can rest assured that the locksmith is licensed and experienced with a good reputation. So you don’t have to do any research yourself. Thirdly, you will save money because various locksmiths in your locality compete to get your order and thus this competition reduces their asking service charges. So you simply cannot go wrong with Speed Locksmith. \u003C/p\u003E\n\n\u003Cp\u003EOur services are most appropriate for anyone stuck in an emergency situation. In an emergency situation, you not only need a locksmith who can arrive as soon as possible but also rectify your problem promptly. This is only possible if the locksmith is experienced and properly equipped and trained. And this is exactly what you get by using our service, since we only keep the most professional locksmiths in our list. However, we would like to mention that unfortunately we cannot take complete guarantee that the locksmith will reach you immediately, since we are not providing that service. This part is the locksmith\u0026#8217;s responsibility but we make sure that we only have extremely fast responders on our list through the feedback system. \u003C/p\u003E\n\n\u003Cp\u003EApart from emergency situations, Speed Locksmith can hook you up with the best locksmiths in your region for a plethora of other locksmith services which you might require. These services could range from installing a lock at your premises or designing a fool-proof lock security system. In short, whatever your needs maybe in this regard, you will definitely find Speed Locksmith to be extremely useful. \u003C/p\u003E\n\n\u003Cp\u003EThere are plenty of reasons to patronize Speed Locksmith. You get the best locksmith at your convenience. This unprecedented convenience is just a call away. So what are you waiting for? Call us or visit our website to avail our unique service. You won’t regret your decision. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.speedlocksmithusa.com/index.php/about-us-locksmiths",
    "title": "Locksmiths"},
   {"external_url": "https://www.facebook.com/pages/Speed-Locksmith-USA/309201242539165?ref=hl",
    "title": "Facebook"},
   {"external_url": "http://golfstar.gamigo.com/forum/user/34154-mikek/",
    "title": "Goldstar"},
   {"external_url": "http://www.speedlocksmithusa.com/index.php/brooklyn-locksmith",
    "title": "Locksmith Brooklyn"}]}