{"name": "Splitflix",
 "permalink": "splitflix",
 "crunchbase_url": "http://www.crunchbase.com/company/splitflix",
 "homepage_url": "http://www.splitflix.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "splitflix",
 "category_code": "web",
 "number_of_employees": 1,
 "founded_year": 2012,
 "founded_month": 2,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "streaming-video-memberships, sharing-a-netflix-passwod, sharing-a-hulu-plus-password, sharing-a-netflix-account, sharing-a-hulu-plus-account, shared-netflix-membership, shared-hulu-plus-membership",
 "alias_list": null,
 "email_address": "Splitflix@gmail.com",
 "phone_number": "",
 "description": "password sharing service",
 "created_at": "Sat Feb 18 23:01:46 UTC 2012",
 "updated_at": "Sat Mar 03 12:24:47 UTC 2012",
 "overview": "\u003Cp\u003ESplitflix is a peer-to-peer network of Netflix and Hulu Plus subscribers and wannabe subscribers which automatically pairs users with Netflix/Hulu Plus memberships and users without Netflix/Hulu Plus memberships, allowing them to split the cost of said memberships based on a specific duration of time together.\u003C/p\u003E\n\n\u003Cp\u003EMembers of Splitflix can split the cost of a Netflix or Hulu Plus account, or both accounts for that matter. We provide the platform and manage the process of introducing our members to one another anonymously and securely so they can enjoy the benefits of dual membership to a singe account. We also give each member a shared email address and generic login/password to be used in the establishment of a truly mutually beneficial and secure Netflix or Hulu Plus account.     \u003C/p\u003E\n\n\u003Cp\u003ETheir membership term is based solely on the the amount of time they select to share with one another. For example, if a member decides they would like 6 months of access to Netflix with another one of Splitflix users, they pay $.99 per month for 6 months (This money goes to Splitflix and is in addition to the monthly fees charged by Netflix and Hulu Plus). To be fair to one another, there is no cancellation before the term they select, this allows for an uninterupted viewing experience without worries of termination. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        119],
       "assets/images/resized/0017/4868/174868v2-max-150x150.png"],
      [[250,
        199],
       "assets/images/resized/0017/4868/174868v2-max-250x250.png"],
      [[450,
        358],
       "assets/images/resized/0017/4868/174868v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}