{"name": "Sports Stats App For Iphone",
 "permalink": "sports-stats-app-for-iphone",
 "crunchbase_url": "http://www.crunchbase.com/company/sports-stats-app-for-iphone",
 "homepage_url": "http://itunes.apple.com/us/app/ats-stats/id478778209?mt=8",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "atsstatsiphone",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sports-stats-app",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Download The ATSStats App  today and let",
 "created_at": "Fri Apr 05 13:08:46 UTC 2013",
 "updated_at": "Fri Apr 05 13:08:55 UTC 2013",
 "overview": "\u003Cp\u003EATS Database App New Feature\u003C/p\u003E\n\n\u003Cp\u003EBy Sports Handicapper Ron Raymond\nDecember 11th 2012\u003C/p\u003E\n\n\u003Cp\u003EStats on the Go! \nThat’s what the ATS Database APP can be considered for the serious sports bettors. If you’re in an NFL Football pool or in a Fantasy Football league, the new and improved ATS Database App can be the deal closer on your final selections. \nIn the new ATS Stats app, you will get improved stats such as the SMART STATS, which looks for winning cycles of statistics and provides them to your app. Here’s an example of an 80% CLUB STATS that could be found in the SMART STATS section when you purchase your APP. \nExample: When NEW YORK GIANTS played as a road team - With 1 Over or Less - Won Last Game by 25 Points or Less - With SU Record of 2 Win 1 Lost in L3G; the Giants are 10-2 SU in this role since 1984. \nFurthermore, stats fans will be able to get instant access to each team streaks! Winning streak, losing streak, over/under streak, you name it, it’s on the ATS Database APP. \nIn fact, following a team’s winning streak is one of the best ways of making money betting on sports, as everybody loves to ride that hot team! The ATS Database APP streaks section is where the ATS Database software tracks the winning and losing streaks of the Sides and Totals of each team from the following leagues; NCAA Football, NFL Football, CFL Football, NBA Basketball, NCAA Basketball, NHL Hockey, and MLB Baseball.\nFurthermore, not only will you get streak, but the \u0026#8220;ATS Forecast\u0026#8221; of every game on the LAS VEGAS board. The ATS Stats app forecaster generates predicted scores from past game situations which relates to current matchup between Favorites and Underdogs! Each team enters a game with a \u0026#8220;coming off\u0026#8221; or \u0026#8220;Before playing\u0026#8221; type situation and we\u0026#8217;ve taken past results from those situations, included our own formula to accommodate the Las Vegas point spread and we\u0026#8217;ve generated tomorrow\u0026#8217;s score now!\nThe new ATS Forecast will provide members the LAS VEGAS line on the game and how many games from the past it took to predict an upcoming final score. \nGet the information the Sportsbooks don’t want you to have and start winning on a more consistent basis. You can purchase the APP by going to the apple store and type in “ATS STATS”.\u003C/p\u003E\n\n\u003Cp\u003EGood luck.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       138],
      "assets/images/resized/0024/8675/248675v2-max-150x150.jpg"],
     [[203,
       187],
      "assets/images/resized/0024/8675/248675v2-max-250x250.jpg"],
     [[203,
       187],
      "assets/images/resized/0024/8675/248675v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}