{"name": "spreet.it",
 "permalink": "spreet-it",
 "crunchbase_url": "http://www.crunchbase.com/company/spreet-it",
 "homepage_url": "http://www.spreet.it",
 "blog_url": "http://blog.spreet.it",
 "blog_feed_url": "",
 "twitter_username": "spreet_it",
 "category_code": "software",
 "number_of_employees": 2,
 "founded_year": 2010,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "location-based-service, hyperlocal, local-communication, mobile",
 "alias_list": null,
 "email_address": "team@spreet.it",
 "phone_number": "0049-173-8866981",
 "description": "hyperlocal communication tool",
 "created_at": "Wed Sep 07 11:11:36 UTC 2011",
 "updated_at": "Sat Sep 24 13:18:41 UTC 2011",
 "overview": "\u003Cp\u003ESpreet.it, short for \u0026#8216;spread it in your street\u0026#8217;, is a map based tool which brings together people that do not know each other yet. Put in a nutshell, users are able to spread a locally relevant message from a defined position on a map. \nIn addition to that, users place virtual antennas on a map and define a radius in which they want to listen to messages by other users. By doing so, users can listen to messages spread in different areas they have an interest in without being physically present. We do not consider ourselves to be part of social media as we know it, but more precisely of what we would name \u0026#8216;local media\u0026#8217;.\u003C/p\u003E\n\n\u003Cp\u003EThe team is quite straightforward at the moment. Roman is a professional coder specializing on ruby on rails and edgy developments of all kinds. He has gained a lot of experience working as a freelancer for different companies throughout the past years. Mathis is a law student just about graduating from Bucerius Law School in Hamburg. He has experience in e-commerce and is the project manager at spreet.it. We are close friends and are more than just passionate for our \u0026#8216;baby\u0026#8217; - we have spent hours and hours on spreet.it in the past months and think of improvements day and night. We are open for any criticism, feedback, or partnership. Feel free to contact us, we wil get back to you as soon as possible.\u003C/p\u003E\n\n\u003Cp\u003EWe are still self-funded, but we are looking for a strong partner and investor. By now we have a public beta-version of spreet.it online. We are seeking feedback and proceeding the work on our web app. The iPhone app will be presented very soon.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}