{"name": "Sprike",
 "permalink": "sprike",
 "crunchbase_url": "http://www.crunchbase.com/company/sprike",
 "homepage_url": "http://www.sprike.co.uk/",
 "blog_url": "http://www.sprike.co.uk/blog",
 "blog_feed_url": "",
 "twitter_username": "sprike_ltd",
 "category_code": "search",
 "number_of_employees": 10,
 "founded_year": 2003,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "marketing-company-birmingham, pay-per-click-birmningham, seo-birmingham, website-marketing-agency, graphic-designers, web-design, midlands, birmingham",
 "alias_list": null,
 "email_address": "m.singh@sprike.co.uk",
 "phone_number": "01213742123",
 "description": "Marketing Company Birmingham",
 "created_at": "Fri May 27 13:15:28 UTC 2011",
 "updated_at": "Sat May 28 14:36:09 UTC 2011",
 "overview": "\u003Cp\u003EYou are here: Home Â» Who we are?\nSo who are Sprike then?\nWe are a Midlands digital marketing agency. A creative team of graphic designers, website programmers, photographers and marketing specialists with one common belief - that good client relationships are good business.\u003C/p\u003E\n\n\u003Cp\u003ESprike was founded in Birmingham with the goal of maximising the potential in all our clients. With backgrounds in engineering, electronics, marketing and computer programming, we think it\u0026#8217;s time for a revolution in the way businesses are marketed. The power of internet advertising, combined with traditional methods of promotion presents unique opportunities to companies willing to embrace the digital revolution.\u003C/p\u003E\n\n\u003Cp\u003EOur design process places the client at the heart of the job. Before we even think about what we\u0026#8217;re going to do for you, we have to understand what your company needs to reach its true potential. Whether you need a website or complete digital marketing solutions, we\u0026#8217;ll advise you on the best way of growing your business. Only when we understand your business do our specialists get to work creating the identity that your business needs.\u003C/p\u003E\n\n\u003Cp\u003EWe want more than to give you a product. We practice what we preach. Our products are designed to allow you to engage with and expand your client base, and we stay in touch with all of our clients to ensure that our work is exactly doing what it was meant to do.\u003C/p\u003E\n\n\u003Cp\u003EWe like to think our portfolio says more about us than words ever can. Take a look at the work we\u0026#8217;ve done to see what we can do for you.\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.sprike.co.uk/portfolio.php\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       75],
      "assets/images/resized/0013/6715/136715v2-max-150x150.jpg"],
     [[150,
       75],
      "assets/images/resized/0013/6715/136715v2-max-250x250.jpg"],
     [[150,
       75],
      "assets/images/resized/0013/6715/136715v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}