{"name": "Sree Engineering Equipments",
 "permalink": "sree-engineering-equipments",
 "crunchbase_url": "http://www.crunchbase.com/company/sree-engineering-equipments",
 "homepage_url": "http://www.indiamart.com/sree-engineering-equipments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sree-engineering-equipments@tradepassport.org",
 "phone_number": "9953360687",
 "description": "We are one of the prominent manufacturer",
 "created_at": "Fri Apr 05 05:27:03 UTC 2013",
 "updated_at": "Fri Apr 05 05:27:07 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction;\nSree Engineering Equipments is a Sole Proprietorship business venture that started its operations in the year 2012 at Coimbatore, Tamil Nadu, India. We have emerged as one of the fastest growing organizations involved in manufacturing as well as supplying a broad spread array of high quality Hydraulic Press Machines, Molding Machines, Brick Making Machines, Roofing Sheet Making Machines, Iron Scrap Baling Presses, Hydraulic Cylinders, Hydraulic Presses and Hydraulic Spare Parts. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have with us the support of highly robust infrastructural facility that is sectioned into varied departments. Owing to such segregation, we are able to efficiently manage our professionals as well as streamline all business processes with ease. Our manufacturing unit is installed with modernized machines and cutting-edge tools that enable us to offer products in large volumes. These machines are regularly services, cleaned and timely upgraded to ensure smooth functioning. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nSince the time of our inception, we are a quality-focused organization that is involved in offering finest quality products in the market. Finest quality components and metals are used to develop our range. All stages of development involving material procurement, production, designing, packaging and storing is carried under the watchful eyes of our quality monitoring experts. Our offered products are approved by the Government Recognized Laboratories and are superior in quality.  \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have with us the support of well trained and skilled pool of professionals. These professionals have clear idea of their domain and are fully aware about the trends prevailing in the market. They work in compliance with one another and work tirelessly hard to render immaculate range of products to our clients. Owing to their technical expertise, experience, coordinated work approach and hard work, we have rendered complete client satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nSince our establishment, we have emerged as one of the prominent names involved in manufacturing and supplying exclusive range of Industrial machines. Being technically sound and superior in quality, our machines enables us to perform exceptionally well and is low on maintenance. To our client’s delight, our Machines can be availed in varied specifications, designs and sizes.\u003C/p\u003E\n\n\u003Cp\u003EKey Strengths:\n    Technically advanced products\n    Finest quality\n    On-time deliveries\n    Competitive pricing\n    Superior Customer Service\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8255/248255v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8255/248255v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8255/248255v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}