{"name": "Sree Sandhiyamman",
 "permalink": "sree-sandhiyamman",
 "crunchbase_url": "http://www.crunchbase.com/company/sree-sandhiyamman",
 "homepage_url": "http://www.indiamart.com/sreesandhiyamman-fibreworks/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "frp-products, fiberglass-products-and-frp-planters-",
 "alias_list": null,
 "email_address": "sreesandhiyamman-fibreworks@tradepassport.org",
 "phone_number": "9380819859",
 "description": "manufacturing and supplying a wide array",
 "created_at": "Sat Apr 06 05:23:25 UTC 2013",
 "updated_at": "Mon Apr 08 00:12:54 UTC 2013",
 "overview": "\u003Cp\u003ESree Sandhiyamman Fibre Works was incorporated in 2007, as a sole proprietorship firm situated in Chennai, Tamil Nadu, India. We are counted amongst the reckoned names in the industry, we are engaged in manufacturing and supplying a wide range of FRP Boxes, FRP Flower Pots, FRP Tanks, FRP Biogas Tanks, FRP Musical Instrument Covers, FRP Products, Fiberglass Products and FRP Planters. Additionally, we also offering most reliable FRP Lining Job Works and Leakage Arresting Services.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nFRP Box\nFRP Tanks\nFRP Biogas Tanks\nFRP Flower Pots\u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Set-Up:\nWe have developed an advanced manufacturing unit at our facility that assists us to manufacture quality approved range of products to our clients. Our department is strategically segmented into different segments that assist us to develop and fabricate immaculate range of products. Our unit is supervised by talented professionals, who have years of experience in their respective domain.  \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are blessed by experienced professionals, who have rich industrial knowledge in their respective domain. Their experience assists us to achieve the desired organizational goals in well-defined time frame. All the professionals are hired by conducting stringent recruitment tests which is calculated on the basis of qualification, experience and skills.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality conscious firm, our prime aim is to offer a flawless range of products to our clients. We are able to maintain high quality standards with the assistance of skilled and experienced quality controllers. Our entire production process is carried under the supervision of dexterous professionals, who alertly supervise the entire production process.  Our entire product range is in compliance with set quality standards and policies. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       148],
      "assets/images/resized/0024/9047/249047v2-max-150x150.jpg"],
     [[160,
       158],
      "assets/images/resized/0024/9047/249047v2-max-250x250.jpg"],
     [[160,
       158],
      "assets/images/resized/0024/9047/249047v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}