{"name": "Sri Raghavendra Enterprises",
 "permalink": "sri-raghavendra-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/sri-raghavendra-enterprises",
 "homepage_url": "http://www.indiamart.com/sriraghavendra-enterprises-bengaluru/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sriraghavendra-enterprises-bengaluru@tradepassport.org",
 "phone_number": "9945082953",
 "description": "supplying and trading",
 "created_at": "Thu Apr 04 14:09:31 UTC 2013",
 "updated_at": "Thu Apr 04 14:09:36 UTC 2013",
 "overview": "\u003Cp\u003EWe would like to introduce ourselves as authorized dealers for renowned company, Zicom. Our focus is on Home \u0026amp; Business Security Systems mainly Security Video Door Phones, CCTV Surveillance Systems, Burglar Alarm Systems, Smoke \u0026amp; Fire Alarms, Access Control Systems etc.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe source products from most trustworthy vendors of industry, possessing in-depth knowledge and experience of respective domain. They manufacture products using latest techniques and optimum grade raw material, which improves their efficiency and make them widely preferable among vast clientele. Our vendors are selected by skilled procuring agents after an in-depth market surveys in which, their delivery schedule, quality, past record and financial stability are thoroughly checked. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe progress and achievement of our organization is an outcome of our team’s dedication as well as hard work. Our experts not only ensure to perform operations with responsibility but also carry out task with result bound solutions. They undertake each task with perfection as well as ensure to meet the prescribed targets of company in a successful manner. Their hard work and dedication has helped us in lacing a desirable position in the industry. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nOur company does not strive to be conventional of international quality standards but strive to surpass them. Following this principle, we are continuously setting new quality benchmark in the industry. Moreover, we give utmost importance towards excellence for which, various quality parameters are adopted by us that have been recommended by the industry. Thus, we ensure that products we offer are in compliance to prescribed standards of industry. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur company is devoted towards its objective of  customer comes first, therefore pay utmost importance to provide best quality range to our esteemed clientele. Our experts remain in touch with the clients to understand their exact requirements and after that provide range accordingly. We provide customization packaging solutions to our clients as per their specified details. They can also receive products according to their choice and at reasonable prices.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7952/247952v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7952/247952v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7952/247952v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}