{"name": "SriKrishna Convertors",
 "permalink": "srikrishna-convertors",
 "crunchbase_url": "http://www.crunchbase.com/company/srikrishna-convertors",
 "homepage_url": "http://www.indiamart.com/srikrishnaconvertors/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "srikrishnaconvertors@tradepassport.org",
 "phone_number": "9944941126",
 "description": "Manufacture and supply Coconut Shell,",
 "created_at": "Thu Apr 04 13:38:13 UTC 2013",
 "updated_at": "Thu Apr 04 13:38:17 UTC 2013",
 "overview": "\u003Cp\u003ESri Krishna Convertors is a partnership firm, established in the year 2000 as a manufacturer and supplier of a comprehensive range of Coconut Shell Powder, Sawdust Powder, Mosquito Coil Raw Material and Raw Coconuts. Furthermore, we are engaged in offering reliable Glass Frosting Services to our valuable clientele. The major thrust of our organization is to keep our customers satisfied with the excellence of services as well as products we offer to them. Utmost satisfaction to the customers is our organization’s prior objective, for which, we maintain cordial relationship with them and follow customer centric policies. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe possess a highly advanced infrastructure, sprawls over a huge landmass as well as well-outfitted with the requisite technology and machines. Here, our entire production process is carried out with utmost precision by our dexterous professionals that ensure to complete their whole task within the scheduled time frame. Besides, for prompt delivery and qualitative productivity, we have skillfully partitioned our infrastructure into various departments. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe foremost objective of our every business endeavors are intended to garner maximum client satisfaction. For this, we offer only those products and services, which are in accordance to the prescribed standards and guidelines of the industry. Besides, we consider all sorts of clients’ queries s well as incorporate their suggestions to bring forth an improved range. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur company has recruited a highly experienced and dedicated team of professionals that make relentless endeavor to supply products and services according to the actual specifications of clients. We have hired them only after examining their skills and knowledge on defined parameters as well as assigned them posts according to that only. Their dedication and hard work lead to the expansion of our products and services with matchless quality.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nCoconut Shell Powder, Sawdust Powder, Mosquito Coil Raw Material and Raw Coconuts. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0024/7931/247931v2-max-150x150.jpg"],
     [[250,
       96],
      "assets/images/resized/0024/7931/247931v2-max-250x250.jpg"],
     [[260,
       100],
      "assets/images/resized/0024/7931/247931v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}