{"name": "Srikanth Engineering",
 "permalink": "srikanth-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/srikanth-engineering",
 "homepage_url": "http://www.indiamart.com/srikanthengineering-works/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "plant-designing, plant-installation-suggestion, fiber--glass-maintenance-and-mining-consultancy",
 "alias_list": null,
 "email_address": "srikanthengineering-works@tradepassport.org",
 "phone_number": "9849062497",
 "description": "We are specializing in manufacturing",
 "created_at": "Thu Apr 04 07:31:34 UTC 2013",
 "updated_at": "Thu Apr 04 07:31:41 UTC 2013",
 "overview": "\u003Cp\u003ESrikanth Engineering Works is a sole proprietorship company, established in 1993. Since then, we are engaged in manufacturing and supplying a comprehensive range of Industrial Conveyers, Vibrating Screens, Industrial Crushers, Industrial Feeders many more. In addition to this, we offer reliable and best solutions of Plant Designing, Plant Installation Suggestion, Fiber \u0026amp; Glass Maintenance and Mining Consultancy. Our range is manufactured using high grade raw material, sourced from the authorized vendors of industry. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructural Facilities:\nOur company has established advanced infrastructure, spread across an extensive landmass as well as fitted with latest equipment. To streamline our entire business operations, we have strategically segregated our whole set-up into varied other departments such as manufacturing, quality control, sales and marketing and others. Each department is fitted with necessary and ultramodern equipment, which helps us in delivering products within stipulated time period.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nProducts and services we offer to our clients have played a pivotal role in our company’s success and achievements. Moreover, our experienced team of quality controllers performs with dedication to improve the products as well as services excellence. They also stringently examine products on defined industrial parameters, so that flawless delivery could be made into the market. Thus, we ensure that our products are at par with the suggested industrial standards.\u003C/p\u003E\n\n\u003Cp\u003ECustomer Satisfaction:\nThe foremost concern of our organization, is to provide maximum satisfaction to the customers. We leave no stone unturned and work 24x7, to meet the bulk requirements in best possible manner. Our professionals are engaged in manufacturing the range of products in strict compliance with defined industry standards. \u003C/p\u003E\n\n\u003Cp\u003EOur Warehousing Unit:\nFor safe and sound storage of bulk consignment for maximum time period, we have developed highly spacious warehouse within the organization. This unit is managed by experienced warehousing personnel, who properly keep themselves the complete record of stored as well as delivered products. Further, we have properly partitioned our warehouse into varied other segments to accommodate products in well-organized manner. \u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nwe offer reliable and best solutions of Plant Designing, Plant Installation Suggestion, Fiber \u0026amp; Glass Maintenance and Mining Consultancy    \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7632/247632v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7632/247632v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7632/247632v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}