{"name": "Srinath PolyFibre",
 "permalink": "srinath-polyfibre",
 "crunchbase_url": "http://www.crunchbase.com/company/srinath-polyfibre",
 "homepage_url": "http://www.indiamart.com/srinathpolyfibre/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "srinathpolyfibre@tradepassport.org",
 "phone_number": "9391009376",
 "description": "manufacturing and supplying",
 "created_at": "Thu Apr 04 10:12:29 UTC 2013",
 "updated_at": "Thu Apr 04 10:12:32 UTC 2013",
 "overview": "\u003Cp\u003ESrinath Poly Fibre Industries is a partnership firm, established in 2001 as a manufacturer, supplier and wholesaler of vast range of Polypropylene Fabrics, Woven Fabrics, Bags, Woven Sacks and BOPP Bags. Our range encompasses Shopping Bags, Surface Printed Bags, Reverse Printed Bags, Woven Sacks, Laminated Woven Sacks, Unlaminated Woven Sacks, BOPP Coated Bags.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWith the support of our highly advanced and state-of-the-art infrastructural set-up, we are able to meet the bulk demands of our clients. It consists of various departments, which helps us to perform our all business operations in a systematic way. We have developed a spacious warehouse that enables us to store the entire product range safely and for maximum period of time.\u003C/p\u003E\n\n\u003Cp\u003EQuality Standards:\nWe are a quality-centric organization that has directed our all its endeavors to make flawless delivery of products in the market. Further, we have developed a sophisticated quality control laboratory, which is handled skillfully by our experienced team of quality controllers. They stringent conduct test over the manufactured product range to ensure the supply of quality approved products at the client end.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nOur company has achieved a remarkable position in the industry by supplying products as per the specifications of clients without compromising upon the excellence of products. We ensure to make timely delivery of bulk consignment.\u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nWe have acquired huge customers’ support by consistently providing desired and quality approved range at industry leading prices. Our prompt and cost efficient solutions have enabled our customers to making consistent dealing with us. Apart from this, we have enlarged our serving network, which successfully enabled us to meet the diverse and growing requirements of clients in an efficient manner.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       149],
      "assets/images/resized/0024/7794/247794v2-max-150x150.jpg"],
     [[180,
       179],
      "assets/images/resized/0024/7794/247794v2-max-250x250.jpg"],
     [[180,
       179],
      "assets/images/resized/0024/7794/247794v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}