{"name": "SriRajaRajeshwari Furniture",
 "permalink": "srirajarajeshwari-furniture",
 "crunchbase_url": "http://www.crunchbase.com/company/srirajarajeshwari-furniture",
 "homepage_url": "http://www.indiamart.com/sriraja-rajeshwari-furnitureworks/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sriraja-rajeshwari-furnitureworks@tradepassport.org",
 "phone_number": "9916011290",
 "description": "manufacturer and supplier",
 "created_at": "Thu Apr 04 10:59:34 UTC 2013",
 "updated_at": "Thu Apr 04 10:59:37 UTC 2013",
 "overview": "\u003Cp\u003ESri Raja Rajeshwari Furniture Works has been successful in earning a name which is taken with pride amongst all associates. We established our business in the year 1998 in Bengaluru, capital city of Karnataka. Since our inception we are deftly engaged in manufacturing and supplying of Workstation Chairs, Workstation Chairs, Workstation, Executive Chairs, Cafeteria Chairs, Conference Tables, School Desks, Bar Stools, Auditorium Chairs, Banquet Chairs, Training Chairs, Netted High Back Chairs, Round Stools, Sofas, Workstation Office Chairs, Visitor Office Chairs, Round Tables \u0026amp; many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur entire facility is supported by robust infrastructure where we have all the facilities capable of delivering world class products. Our unit is sprawled in a vast area which is in a beautiful location. The ambiance creates perfect atmosphere to work. Our manufacturing unit is facilitated with machine and equipment which support the technicians in manufacturing and designing the products of desire. Entire unit has been divided into small units to ensure work is done in accordance to the set industrial guidelines.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nAn organization can consistently meet demands and achieve targets only if it is supported by technicians, who have great skills and aptitude to meet the needs of clients and we can proudly claim our organization is fortunate to have such workers. The display of amazing team work is the key to success, new employees are warmly welcomed which builds their confidence and helps them perform better. We have engineers, designers, technicians and others with us which make a complete team.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur organization is a client centric firm where we take great care in assisting the clients in best possible manner. Our products make clients more than happy. We provide number of services which keep the customers satisfied and builds their confidence in keeping relations with us, our services for clients include easy payment options, customized products, best packaging, and all our products are available at industry leading price. We work on their feed back to bring improvement in our manufacturing and services.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have been able to sustain in the market almost for last fifteen years owing to our commitment and our quality. Our wide range in itself is suggestive about our intention to cater needs of the clients in the best possible way. We entertain all the requests for product customization from our clients and our packaging is also the best in the industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7829/247829v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7829/247829v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7829/247829v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}