{"name": "SriSai KiranGlass",
 "permalink": "srisai-kiranglass",
 "crunchbase_url": "http://www.crunchbase.com/company/srisai-kiranglass",
 "homepage_url": "http://www.indiamart.com/srisaikiranglasscentre/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "srisaikiranglasscentre@tradepassport.org",
 "phone_number": "9701502774",
 "description": "Manufacturing and supplying",
 "created_at": "Fri Apr 05 04:32:36 UTC 2013",
 "updated_at": "Fri Apr 05 04:32:39 UTC 2013",
 "overview": "\u003Cp\u003ESRI SAI KIRAN GLASS CENTRE was established in the year 2002 as a sole proprietorship company, engaged in manufacturing and supplying a vast range of Aluminium Works and Tuff Glass. Besides, we offer reliable and trustworthy solutions for Aluminium Fabrication. Our product range encompasses Aluminium Sliding Windows, Aluminium Sliding Doors and Aluminium Partitions. In addition, we offer Aluminium Fabrication Services such as Aluminium Glazing, Aluminium Cladding and Elevation Work. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are backed by a state-of-the-art infrastructural set-up that enables us in developing bulk products within the stipulated time. The manufacturing unit is manned by adept workers, who manage and operate the installed technologies in an efficient manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nBeing a quality driven firm, we ensure to make and supply best quality products in market, which are in strict conformation to prescribed industrial guidelines. In addition to this, we follow specific industrial policies as well as a Total Quality management system, for the assurance of quality approved range. Besides, to perform all quality related operations, we have established a sophisticated quality control laboratory at our premises. \u003C/p\u003E\n\n\u003Cp\u003EOur Warehouse:\nIn our highly advanced infrastructure, we have developed a separate warehousing department, where our products can be stored in bulk. This department is well-segregated into various sections for smooth execution of warehousing activities. Our storing area is well-maintained as well as consists of all requisite amenities that enable us to carry out our operations in the best possible manner. \u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nOur product range encompasses Aluminium Sliding Windows, Aluminium Sliding Doors and Aluminium Partitions.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8199/248199v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8199/248199v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/8199/248199v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}