{"name": "SriTirumala Bags",
 "permalink": "sritirumala-bags",
 "crunchbase_url": "http://www.crunchbase.com/company/sritirumala-bags",
 "homepage_url": "http://www.indiamart.com/sritirumalabags/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we-are-one-of-the-renowned-manufacturers-and-suppliers-of-a-vast-array",
 "alias_list": null,
 "email_address": "",
 "phone_number": "8754034080",
 "description": "",
 "created_at": "Thu Apr 04 05:04:51 UTC 2013",
 "updated_at": "Thu Apr 04 05:04:52 UTC 2013",
 "overview": "\u003Cp\u003ESri Tirumala Bags is a partnership based business concern, which was incorporated in the year 2010 at Coimbatore, Tamil Nadu. We are counted among the eminent manufacturers and suppliers of the market engaged in offering an excellent range of W Cut Bags, Printed Carry Bags, Non Woven Bags and D Cut Bags. These products are trusted and demanded among the clients for their unsurpassed quality standards and some dynamic features such as high strength, attractive designs, moisture resistance, eye catchy appearance, accurate dimensions and durability. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nIn order to keep our business related processes streamlined, we have developed a robust infrastructural building over a vast area of land. This facility consists of several departments, which are resourced with state-of-the-art facilities. Our manufacturing plant is operational with cutting-edge technology based machines, which enables us to produce flawless products for the clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team of knowledgeable and talented professionals enables us to efficiently fulfill the diverse demands of clients belonging from different sectors of the industry.  These professionals work with complete dedication to assist the clients in best possible manner. Our professionals are well-versed with the intricacies of manufacturing process, which help them develop defect free products.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe focus to provide high-end quality products to our valued clients at competitive prices. Our product range is developed using finest quality materials, which are sourced from the trustworthy vendors. We strictly adhere to set industrial guidelines in our manufacturing process to deliver highly reliable product line in the market. Our products are tested on well defined parameters prior to the final packaging and dispatch to clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nNon Woven D Cut Bags\nNon Woven W Cut Bags\nNon Woven Printed Carry Bags\nWoven Sack Bag Cutting Machine\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7535/247535v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7535/247535v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7535/247535v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}