{"name": "SS Enterprises",
 "permalink": "ss-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/ss-enterprises",
 "homepage_url": "http://www.indiamart.com/ssenterprisespune/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "ssenterprisespune@tradepassport.org",
 "phone_number": "9881478567",
 "description": "Manufacturer and Supplier",
 "created_at": "Fri Apr 05 12:29:17 UTC 2013",
 "updated_at": "Fri Apr 05 12:29:20 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2005, we, “S.S. Enterprises”, are engaged in manufacturing and supplying an extensive range of Powder Coating Plants, Sheet Metal Component, Electrical Panels, Sheet Metal Boxes, etc. Apart from this, we are involved in providing Fabrication Services, etc. The products offered by us comprise Electrical Control Panels, LT Control Panels, PCC Control Panels, Automotive Control Panels, Desk Panels, Transformer Panels,  etc.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a well-developed infrastructural facility that is equipped with modern and sophisticated technologies to offer the best grade Sheet Metal Component, Electrical Panels, Sheet Metal Boxes, etc.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe main aim of our organization is to provide clients utmost satisfaction by offering them the best quality products. To attain the set organizational objectives, the professionals of our team follow ethical business policies and perform transparency in all our business dealings to achieve maximum client contentment. With the help of their close-interaction maintained with the customers, we are able to comprehend their exact requirements, due to which we have become victorious in climbing towards the peak of achievement.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nFor better production process, we have skilled quality inspectors who conduct rigorous checks at each stage of product development. Moreover, the procured raw material is also tested on various parameters to ensure consistency in the finished products. The quality control process starts from the early stage of the procurement of raw material and continues till the final product in order to fulfill the needs of the customers. In addition to this, our team works together and supports each other for continuous business growth.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have fixed a distinct position amongst our competitors due to our quality products and services. Apart from this, our professionals enable us to manufacture Sheet Metal Component, Electrical Panels, Sheet Metal Boxes, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8652/248652v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8652/248652v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8652/248652v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}