{"name": "SS Vardhman",
 "permalink": "ss-vardhman",
 "crunchbase_url": "http://www.crunchbase.com/company/ss-vardhman",
 "homepage_url": "http://www.indiamart.com/ss-vardhman-knitwears/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "baby-suits, t-shirts, striped-t-shirts",
 "alias_list": null,
 "email_address": "ss-vardhman-knitwears@tradepassport.org",
 "phone_number": "9814025957",
 "description": "We are into manufacturing, supplying ,",
 "created_at": "Thu Apr 04 10:41:25 UTC 2013",
 "updated_at": "Thu Apr 04 10:41:29 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year, 1992, we S. S. Vardhman KnitWears are engaged in manufacturing, supplying and exporting attractively designed range of Baby Suits, T-Shirts, Striped T-Shirts and different others. Our entire product range is fabricated using quality approved fabric procured from reliable and certified vendors in the industry. Our entire product range is skin-friendly in nature, elegantly designed and are designed and developed as per the latest fashion trends prevailing in the industry.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nQuality is considered as the prime asset of our organization. We perform different quality tests to test our products as per the set quality standards and guidelines. We have hired apneal of quality controllers, who stringently test the entire product range in varied parameters and ensure the quality of the products. Our procurement agents select best vendors in the industry, and procure quality approved fabric for the manufacturing process.\u003C/p\u003E\n\n\u003Cp\u003EOur Valued Clientele:\nOur organization is proficient in handling the diverse requirements of the clients in most efficient manner. With proper utilization of advanced techniques and quality tested fabric, we are able to cater diverse requirements of the clients across the nation. We offer the entire product range with customized solutions in order to meet individual needs. Our products are innovatively and creatively designed as per the changing fashion trends of the industry.  \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe are backed by technically advanced range of manufacturing facility that assists us to manufacture quality approved range of products to our clients. Our entire facility is outfitted with advanced technologies and methods that assist us to manufacture quality approved range for or clients. We have well-segmented our departments into different sections that assists us to streamline the entire business operations in a systematic manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nBaby Designer Suits\nRompers For Kids\nChildren\u0026#8217;s Rompers\nStylish Baby Suits\nBaby Suits For Kids\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7816/247816v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7816/247816v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7816/247816v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}