{"name": "StartUpInBrazil",
 "permalink": "startupinbrazil",
 "crunchbase_url": "http://www.crunchbase.com/company/startupinbrazil",
 "homepage_url": "http://www.startupinbrazil.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "legal",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "legal-services, foreign-investor, brazil, company-formation, taxation, brazilian-taxation",
 "alias_list": null,
 "email_address": "info@startupinbrazil.com",
 "phone_number": "55 11 30458803",
 "description": "services for investor in Brazil",
 "created_at": "Tue Sep 13 18:23:17 UTC 2011",
 "updated_at": "Wed Oct 05 00:27:40 UTC 2011",
 "overview": "\u003Cp\u003EWe provide legal services to foreign investors wishing to establish a business in Brazil.\u003C/p\u003E\n\n\u003Cp\u003EWhile we work with companies of all sizes, our focus is on small to medium size companies, which in many cases are investing abroad for the first time and require greater attention since they are often confronting novel situations for the first time.\u003C/p\u003E\n\n\u003Cp\u003EWe provide our legal services through a small boutique-type law firm, composed of experienced professionals with legal expertise in all aspects of business law.  This ensures that the client gets the advice it needs in a timely fashion, which may not happen with large law firms where the smaller client  may not possess the requisite leverage.  We value the close personal relationships which results from our collaborative approach and consider the successful achievement of our clientsÂ´ goals as our principal objective.\u003C/p\u003E\n\n\u003Cp\u003EClient work is always performed by specialist lawyers having the particular legal skills required for the matter at hand.  However, the partner in charge of the clientÂ´s services will coordinate all client services and will serve as the principal communications link with the client.\u003C/p\u003E\n\n\u003Cp\u003EThe professionals in the firm have helped hundreds of foreign investors set up their businesses in Brazil, assisting them in incorporating companies and providing them with the necessary legal advice related to their intended activities.  Where required, firm lawyers actively participate in acquisition and joint venture negotiations together with their clients.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}