{"name": "Startup Colorado",
 "permalink": "startup-colorado",
 "crunchbase_url": "http://www.crunchbase.com/company/startup-colorado",
 "homepage_url": "http://co.startupamericapartnership.org/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "StartupColorado",
 "category_code": "other",
 "number_of_employees": 4,
 "founded_year": 2011,
 "founded_month": 11,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "entrepreneurship, tech-stars, horsfall, feld, weiser, colorado, ecosystem",
 "alias_list": null,
 "email_address": "dcmangum@gmail.com",
 "phone_number": "801.243.2795",
 "description": "New Company Creation",
 "created_at": "Tue Jan 10 00:58:39 UTC 2012",
 "updated_at": "Fri Jan 13 01:00:33 UTC 2012",
 "overview": "\u003Cp\u003EStartup Colorado is a regional initiative to increase the breadth and depth of entrepreneurial ecosystem across Colorado’s Front Range.  From Fort Collins to Boulder, from Denver to Colorado Springs, their mission is to multiply connections among entrepreneurs and mentors, improve access to entrepreneurial education, and build a more vibrant entrepreneurial community. \u003C/p\u003E\n\n\u003Cp\u003EStartup Colorado’s various programs will deepen the communal backdrop out of which new companies emerge.  Vibrant new company creation, by extension, improves the broader economic base of Colorado. Their first year goals include:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EExpanding new tech meetups, open coffee clubs, and community office hours in Fort Collins, Denver, and Colorado Springs\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ECreating an entrepreneurial summer camp in Boulder (talented college students from throughout Colorado will work as interns for Boulder startups)\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ESupport entrepreneurial education in the Front Range\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EEvaluate current barriers that entrepreneurs face, including an assessment of what best practices are in place at entrepreneurial communities around the US and world\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EEngaging larger companies in the entrepreneurial ecosystem through commitments to help entrepreneurs\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EBuilding the Startup Colorado website to be a user-friendly, thorough database for information and connections\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003ELed By Entrepreneurs, For Entrepreneurs\u003C/p\u003E\n\n\u003Cp\u003EFor an entrepreneurial initiative to be successful, it must be entrepreneur led.  Startup Colorado is based entirely on the efforts of entrepreneurs; from chairpersons to individual project leaders, entrepreneurs are front and center in theirefforts. \u003C/p\u003E\n\n\u003Cp\u003ELong-term view\u003C/p\u003E\n\n\u003Cp\u003EBuilding a sustainable and successful entrepreneurial community requires taking the long view.  By working with entrepreneurs and building on grassroots connections, Startup Colorado is focused on supporting entrepreneurship in an organic fashion so as to develop an ecosystem that lasts.\u003C/p\u003E\n\n\u003Cp\u003EEngaging the Entire Entrepreneurial Stack\u003C/p\u003E\n\n\u003Cp\u003EOver the long-term, Startup Colorado will focus on all levels of entrepreneurship: serial entrepreneurs, first-timers, would-be and wannabe.  Only through engagement with all levels of the entrepreneurial scene in the Front Range will be build the long term viability necessary for sustained success.\u003C/p\u003E\n\n\u003Cp\u003ETalent Flow: The Lifeblood of Entrepreneurial Community\u003C/p\u003E\n\n\u003Cp\u003EFor any entrepreneurial community to have long term vibrancy, it needs a continual influx of new talent, both from higher education and from industry.  Startup Colorado is engaging with both educational institutions and established companies to ensure that new talent is continually exiting the system.\u003C/p\u003E\n\n\u003Cp\u003EStartup Colorado is chaired by Brad Feld, Jan Horsfall, and Phil Weiser; its Executive Director is Silicon Flatirons Fellow David Mangum. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Chairman",
    "person":
     {"first_name": "Brad",
      "last_name": "Feld",
      "permalink": "brad-feld",
      "image":
       {"available_sizes":
         [[[99,
            150],
           "assets/images/resized/0001/2127/12127v3-max-150x150.jpg"],
          [[100,
            151],
           "assets/images/resized/0001/2127/12127v3-max-250x250.jpg"],
          [[100,
            151],
           "assets/images/resized/0001/2127/12127v3-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "Co-Chairman",
    "person":
     {"first_name": "Phil",
      "last_name": "Weiser",
      "permalink": "phil-weiser",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}