{"name": "Star Enterprises",
 "permalink": "star-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/star-enterprises",
 "homepage_url": "http://www.indiamart.com/starenterprises-thane/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "starenterprises-thane@tradepassport.org",
 "phone_number": "9167754098",
 "description": "manufacturing, supplying, trading, ",
 "created_at": "Fri Apr 05 06:42:18 UTC 2013",
 "updated_at": "Fri Apr 05 06:42:20 UTC 2013",
 "overview": "\u003Cp\u003ESince our establishment is in year 2009, we, “Star Enterprises” are a leading manufacturer of Electrical Control Panels and Electronic Products. In our product range we offer Control Panel Systems, APFC Panel, VFD Panels, Pumping System Panels, Fire Fighting Panels, PID Base Heater Control Panels, Servo Drives, AC \u0026amp; DC Drives \u0026amp; many of Automation Products for various industry. All these products are designed by our expert engineers who are well versed in this domain. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nBacked by a competent and proficient team of members, we are able to offer our clients with Electrical Control \u0026amp; Power Distribution. These professionals are selected after analyzing their knowledge, qualifications, skills and experience in this industry. Dedicated towards their assigned work, our professionals incorporate their extensive knowledge in manufacturing our entire range. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur organization possesses state-of-the-art infrastructure facility, which enable us in manufacturing a wide range of Electrical Control \u0026amp; Power Distribution . Spread across an extensive area, our infrastructure aids in manufacturing precision-engineered products to our clients.\u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\nAs we believe in offering total customer satisfaction to our clients, we give our foremost priority to the quality products. With the assistance of our quality experts, we are able to offer the best grade of products. We also, supply all our products in accordance with the requirements of the clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nBeing a client-centric organization, we are engaged in manufacturing a wide range of Electrical Control \u0026amp; Power Distribution. Manufactured in adherence with the highest benchmarks of quality, our offered products cater to the needs of many industries. In order to attain maximum client satisfaction, top-notch quality products are manufactured utilizing quality-approved raw material and sophisticated technology.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8340/248340v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8340/248340v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8340/248340v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}