{"name": "Stockoy",
 "permalink": "stockoy",
 "crunchbase_url": "http://www.crunchbase.com/company/stockoy",
 "homepage_url": "http://www.stockoy.com",
 "blog_url": "http://blog.stockoy.com",
 "blog_feed_url": "http://blog.stockoy.com",
 "twitter_username": "stockoy",
 "category_code": "other",
 "number_of_employees": 35,
 "founded_year": 2012,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "stock-market-trading, new-user-registration, live-stock-update, stock-market-tips, online-share-trading, share-market-brokers, share-social-network",
 "alias_list": null,
 "email_address": "support@stockoy.com",
 "phone_number": "9160002726",
 "description": "Stockoy.com is the first online social c",
 "created_at": "Sat Oct 27 05:42:20 UTC 2012",
 "updated_at": "Fri Dec 14 04:39:01 UTC 2012",
 "overview": "\u003Cp\u003EAccess to Information is key to understand complex economic inter-relation ships.Stockoy.com is completely engaged in providing social and investor networking in most efficient way which makes as guardians for Stock and Trade Information high way.Here You can exchange pictures,discuss top picks of the following stocks with armed and accurate information that brings greater responsibility in your profession.Multi Lingual Facility option helps users to follow the specific country Tickers reviews with specific contributors of all types.\u003C/p\u003E\n\n\u003Cp\u003EIf you are in to stock market, especially into global markets or forex trading you may not know it,but you can actually organize streams of information with social media. share and exchange ideas for business community which helps to take some good trading decisions .It also teaches how to make good trades if you are relatively new to trading , and provides you advice before going further.The More time you take to study up the better off you are going to be across the social web.\u003C/p\u003E\n\n\u003Cp\u003ESocial Networking can be just fun,of course.But Social or Investor community has greater importance .Because it organizes Streams of information that are used by investors,analysts ,media and other research stockists to manage their investments around markets across the globe.Today millions of investors ,market professionals and public companies share and exchange information and ideas about market and individual stocks.Like many other parts of the Internet ,Online Trading sites are turning into collaborative experiences.\u003C/p\u003E\n\n\u003Cp\u003EStockoy.com gives the Stock\u0026#8217;s performance relative to the market with vibrant and intelligent finance discussions which incorporates social media and social networking features that brings the mutual advantage for stock agents,\u0026amp; customers. It is also for Investors to guarantee the most credible \u0026amp; Legitimate information from various trustworthy resources. You can get Innovative market analysis,discussions about various stock markets by filtering unrelated Spam messages and content which will ensure the legitimacy of the users and also information on websites.\u003C/p\u003E\n\n\u003Cp\u003ESocial Media will aid your business and helps in building relationship and trust your online presence if we have consistency and clarity with key strategies. Stockoy.com helps enables you connect with people around the world.Information sharing among common interests can share their strategies and insights with a simple click.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       32],
      "assets/images/resized/0021/7511/217511v2-max-150x150.png"],
     [[190,
       41],
      "assets/images/resized/0021/7511/217511v2-max-250x250.png"],
     [[190,
       41],
      "assets/images/resized/0021/7511/217511v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Developer",
    "person":
     {"first_name": "Subramanyam",
      "last_name": "Reddy",
      "permalink": "subramanyam-reddy",
      "image": null}},
   {"is_past": false,
    "title": "",
    "person":
     {"first_name": "Devendra",
      "last_name": "Kumar",
      "permalink": "devendra-kumar",
      "image": null}},
   {"is_past": true,
    "title": "Founder",
    "person":
     {"first_name": "Raja",
      "last_name": "Sekhar",
      "permalink": "raja-sekhar",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"560\" height=\"315\" src=\"http://www.youtube.com/embed/BXQEc2FN8EQ\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003ESocial Network for Trading community\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}