{"name": "Stonera Systems",
 "permalink": "stonera-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/stonera-systems",
 "homepage_url": "http://www.indiamart.com/stonerasystems/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "waterproofing--anti-staining-chemicals-line, epoxy-resins-for-marble--granite",
 "alias_list": null,
 "email_address": "stonerasystems@tradepassport.org",
 "phone_number": "9845045645",
 "description": "We are importer and supplier,",
 "created_at": "Thu Apr 04 15:00:06 UTC 2013",
 "updated_at": "Thu Apr 04 15:00:12 UTC 2013",
 "overview": "\u003Cp\u003EYear of Establishment 1993, Stonera Systems Pvt. Ltd. is one of the most trustworthy companies involved in supplying and importing a complete range of Italian consumables, machinery and spare parts for marble and granite industries. We supply steel grit from AMI, pumps and rain units for granite gang saws from Alfa, hydraulic tensioner and tie-rods and also CNC machines for milling and shaping with up to 6 axis interpolated, lathe and water jet machines from Officine Marchetti and diamond wire and cutting and polishing tools from Diamante-D.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nIn order to offer our esteemed clients with quality products, we have built alliances with a vast and authentic vendor base. Our vendors are known to use quality ingredients and processing techniques while developing the range. We choose our vendors on the basis of their market position and credibility. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur company focuses on scrutinizing the continuous improvement of the quality of products by employing highly trained professionals. We ensure molding and developing an individual with self-confidence, best technical skills; encourage innovative ideas etc. with required resources to meet the competitive market. We are not only known to provide customer satisfaction through latest manufacturing technology but also deliver real business benefits. We explore technologies and human resource in India to the maxim for the convenience and benefits of our clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have been delivering high end products to our clients as per their requirements. Our quality assurance guideline for these chemical agents and cleaning agents clearly notifies that all the products which we distribute must go through an internal quality check pattern. Assurance of a round the clock customer support has enabled us to satisfy the wants of our clients and deliver high end results.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nEpoxy Resins For Marble \u0026amp; Granite\nLine\nFiber Nets\nLine\nStone Cleaning Products\nLine\nStone Abrasives\nLine\nMarble \u0026amp; Granite Cleaners\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8004/248004v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8004/248004v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8004/248004v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}