{"name": "Straight Shot",
 "permalink": "straight-shot",
 "crunchbase_url": "http://www.crunchbase.com/company/straight-shot",
 "homepage_url": "http://www.straightshot.co",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "StraightShotNE",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2013,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ecommerce, saas, accelerator, web-services, software",
 "alias_list": null,
 "email_address": "faith@straightshot.co",
 "phone_number": "",
 "description": "E-commerce \u0026 SaaS accelerator in Omaha.",
 "created_at": "Mon Apr 01 21:39:19 UTC 2013",
 "updated_at": "Wed Apr 03 17:01:12 UTC 2013",
 "overview": "\u003Cp\u003EStraight Shot offers entrepreneurs the tools they need to rapidly develop their business in a way that prepares them to succeed the first time. The program is built by entrepreneurs with successful ecommerce and software as a service (“SaaS”) business experience and driven by experienced mentors who attack problems and create solutions alongside startups.\u003C/p\u003E\n\n\u003Cp\u003EThe ninety-day program begins in July 2013 and concludes with a demo day event in which each startup presents their business to the community. The program offers seed capital, workspace, and mentorship from both entrepreneurs and industry experts along with support from invested sponsors. \u003C/p\u003E\n\n\u003Cp\u003EEntrepreneurs\n• Straight Shot knows what it takes to successfully get a startup going the first time.\n• Straight Shot’s core focus is on e-commerce and software as a service (SaaS) startups. \n• Straight Shot are experts in this space, and our knowledge, as well as that of our mentors, provide startups with the tools they need to succeed.\n• Straight Shot’s location offers access to incredible support from sponsor organizations.\u003C/p\u003E\n\n\u003Cp\u003EMentors \n• Straight Shot offers an opportunity to use a mentor’s expertise to guide and develop connections with talented minds and startups.\n• Straight Shot provides experts the chance to interact with other talented mentors in a collaborative environment. \n• Mentors have the opportunity to work with emerging entrepreneurs and cutting edge businesses. \n• The value of the mentor network increases each year as relationships are strengthened and new mentor talent is added. \u003C/p\u003E\n\n\u003Cp\u003ESponsors\u003Cbr/\u003E\n• Straight Shot provides an opportunity to propel the emerging tech and startup community in Omaha. \n• Straight Shot creates opportunities for sponsors to have teams work closely with startups on a day to day basis. \n• Employees of sponsors are able to bring back new ideas and skill sets to their company. Employee retention is higher as a result of the exposure to creativity and their involvement in really “making it happen”.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[149,
       150],
      "assets/images/resized/0024/7047/247047v2-max-150x150.jpg"],
     [[249,
       250],
      "assets/images/resized/0024/7047/247047v2-max-250x250.jpg"],
     [[449,
       450],
      "assets/images/resized/0024/7047/247047v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "6825 Pine Street",
    "address2": "",
    "zip_code": "68106",
    "city": "Omaha",
    "state_code": "NE",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}