{"name": "StrictlyTalent",
 "permalink": "strictlytalent",
 "crunchbase_url": "http://www.crunchbase.com/company/strictlytalent",
 "homepage_url": "http://www.strictlytalent.com",
 "blog_url": "http://strictlytalent.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "StrictlyTalent",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 2009,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "unjiudeshi@strictlytalent.com",
 "phone_number": "(512) 761-5049",
 "description": "Career matching service",
 "created_at": "Tue Jan 04 18:14:25 UTC 2011",
 "updated_at": "Fri Jan 07 22:46:06 UTC 2011",
 "overview": "\u003Cp\u003EStrictlyTalent is a confidential and niche based matching tool that links both recruiters and employees with meaningful career relationships.\u003C/p\u003E\n\n\u003Cp\u003EST has been described as an Eharmony like tool for career seeking professionals and recruiters. This system attracts the top 30% of talent as well as great opportunities and then matches them together by a profiling algorithm.  Through this new way of recruiting and job searching, employees no longer have to send their resumes to a black hole. Often a high level professional is not in the position to openly seek future employment, StrictlyTalent provides the confidentiality to do that. On the other hand, recruiters, hiring managers, and HR waste a lot of time receiving resumes from unqualified candidates. StrictlyTalent will not show the user-base which jobs and companies are in the system and even after a match is made, the relationship has to be requested and accepted by both parties to move forward.  StrictlyTalent does not claim to be the full solution, rather the initial platform or filter. The concept is to proactively manage a career and proactively recruit rather than reactionary actions when it\u0026#8217;s absolutely necessary.  Currently StrictlyTalent hosts two networks; StrictlyExecs (a network just for executive level positions) and StrictlyClosers (a network geared to high level sales and marketing professionals).  StrictlyWebDev and StrictlyITPros are the next networks that will be offered by StrictlyTalent.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       126],
      "assets/images/resized/0011/6203/116203v2-max-150x150.png"],
     [[240,
       202],
      "assets/images/resized/0011/6203/116203v2-max-250x250.png"],
     [[240,
       202],
      "assets/images/resized/0011/6203/116203v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.hrexaminer.com/review-strictlyexecs",
    "title": "HR Examiner Reviews StrictlyTalent"}]}