{"name": "Strikersoft",
 "permalink": "strikersoft",
 "crunchbase_url": "http://www.crunchbase.com/company/strikersoft",
 "homepage_url": "http://www.strikersoft.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": 30,
 "founded_year": 2010,
 "founded_month": 6,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "software, developers, android, iphone, ipad, java, black-berry, samsung-bada-developer, uiux-design, server-development, cms, web, database-design, m2m, sap-ipad-apps",
 "alias_list": null,
 "email_address": "scandinavia@strikersoft.com",
 "phone_number": "",
 "description": "Enterprise app provider",
 "created_at": "Sun Sep 25 21:13:58 UTC 2011",
 "updated_at": "Thu Nov 17 22:11:12 UTC 2011",
 "overview": "\u003Cp\u003EStrikersoft is software development company that offers a comprehensive range of services bringing high quality and cost effective solutions to telecommunication operators, enterprises and vendors. Our main goal is establishment of strong development network that will deliver innovative solutions to partners and customers throughout Europe.\u003C/p\u003E\n\n\u003Cp\u003EStrikersoft was formed in 2010 by alliance between Wexcellcia AB and Ukrainian Mobile Technologies Solutions llc. Both companies were established in 2004 and have successfully provided telecommunication and IT solutions in competitive markets. Headquarters is positioned in Kista - Stockholm, Sweden, the Telecommunication and IT hub of Europe, while our Development and Competence Centre is located in Kiev, Ukraine.\u003C/p\u003E\n\n\u003Cp\u003EStrikersoft employes are highly competent engineers with extensive and diverse background in telecommunication and IT field. Our engineers have expertise in distributed system design and implementation and possess hands-on development experience in majority of modern programming languages and technologies. Moreover, all of them have in-depth understanding of software engineering and project management process, methodologies and modern practices.\u003C/p\u003E\n\n\u003Cp\u003EDevelopment team is strongly supported by team of top consultants who each have more then ten years of practice in designated area of their work.\u003C/p\u003E\n\n\u003Cp\u003EStrikersoft is dedicated to deliver high-end, long-lasting mobile and enterprise solutions that are the best match between business and infrastructure-implemented by top experts in the industry.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "Isafjordsgatan 39B",
    "address2": "",
    "zip_code": "18440",
    "city": "Kista",
    "state_code": null,
    "country_code": "SWE",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}