{"name": "Studentsarea",
 "permalink": "studentsarea",
 "crunchbase_url": "http://www.crunchbase.com/company/studentsarea",
 "homepage_url": "http://www.studentsarea.com",
 "blog_url": "http://www.studentsarea.com/blogs/",
 "blog_feed_url": "",
 "twitter_username": "Studentsarea",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "studentsarea-portal, portal-for-students, buy-academic-books-online, students-social-network",
 "alias_list": null,
 "email_address": "support@studentsarea.com",
 "phone_number": "8951249618",
 "description": "Studentsarea Portal",
 "created_at": "Fri May 04 10:49:16 UTC 2012",
 "updated_at": "Mon Jul 09 16:33:12 UTC 2012",
 "overview": "\u003Cp\u003EStudentsarea is an the world’s No.1 students portal headquartered in HSR Layout, Bangalore, India. Our Studentsarea portal stands as one stop solutions for all students needs, provides you the latest news, apply online, upcoming events, free classifieds, online shopping, students connect, list of colleges, fresher jobs listings, document sharing, online tutorials, online test, online games, free downloads, students forum, students blogs, professors rating, education results.\u003C/p\u003E\n\n\u003Cp\u003EThe Portal has been developed as a Mission Mode of One stop solutions for all students in this world. The objective behind the Portal is to provide a one point access to gathering all information related to educations, read the latest news in the field of educations, colleges, universities, sports, entertainment, national, world and fashion. search best colleges, institutions and schools around state and city, apply online for bank accounts, passport, driving license, get an easy educational loan, get scholarships. students easy to find out educational, musical, dancing, comedy, sports, social events happening around world.\u003C/p\u003E\n\n\u003Cp\u003EEasy to purchase text books, computers, laptops, dress materials, shoes, sports equipments, other accessories online from home. starts networking of students around the world for knowledge transfer through students connect. Latest job offers in engineering, medical, fashion, managements fields.share and search your technical documents with friends, In online tutorial bring you the best in educational solutions by providing technical and innovative solutions that help you to manage your online education services.\u003C/p\u003E\n\n\u003Cp\u003ELearn and practice technical, aptitude questions and answers online with explanation for interviews, multiple choice and objective type examinations and entrance exam tests.your place to play free online games, updated each day with new free games, including action games, cricket games, board \u0026amp; card games, multiplayer games, puzzle games, racing games, skill games, sports games, and more flash games.\u003C/p\u003E\n\n\u003Cp\u003Estudentsarea blogs is designed for school, college students who want to understand the knowledge about the fields like software, technology, medical, engineering, fashion, programming and etc generals. studentsarea forum an online student’s forum community where you can interact with other students from around the world discussing all things related to education and employment. students can asks questions about their field of study and get answers from experts. find information about abroad educations and get an solutions from the senior experts.\u003C/p\u003E\n\n\u003Cp\u003ESite Url: http://www.studentsarea.com\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Studentsarea",
    "person":
     {"first_name": "Students",
      "last_name": "Portal",
      "permalink": "students-portal",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "Students Portals",
      "permalink": "students-portals",
      "image": null}}],
 "providerships":
  [{"title": "Web application portal",
    "is_past": false,
    "provider":
     {"name": "Studentsarea",
      "permalink": "studentsarea",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Studentsarea ",
    "address1": "#2621, 3rd floor, 27th main, HSR Layout, Sector 1",
    "address2": "#2621, 3rd floor, 27th main, HSR Layout, Sector 1",
    "zip_code": "560102",
    "city": "Bangalore",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.studentsarea.com",
    "title": "Studentsarea portal"}]}