{"name": "Sujatha Paints",
 "permalink": "sujatha-paints",
 "crunchbase_url": "http://www.crunchbase.com/company/sujatha-paints",
 "homepage_url": "http://www.indiamart.com/sujatha-paints/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "09953358435",
 "description": "manufacturing and supplying",
 "created_at": "Thu Apr 04 07:39:40 UTC 2013",
 "updated_at": "Thu Apr 04 07:39:46 UTC 2013",
 "overview": "\u003Cp\u003ESujatha Paints is a proprietor firm, established in the year 1983. Ever since our incorporation, we are engaged in manufacturing and supplying a comprehensive range of Decorative Paints, Industrial Paints, Automotive Paints, Emulsion Paints, Decorative Primers, Wall Putty, Paint Finishes and Enamel Thinners.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are blessed to have the support of highly experienced and knowledgeable team of professionals, who enable us in accomplishing the specific demands of clients efficiently. To boost up our team’s knowledge and skills, we organize training programs for them on regular intervals. This helps them to ably understand and fulfill the prevailing clients’ specifications. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWorking on the principle “Quality has to be caused, not controlled but sustained”, our company has acquired a remarkable position in this competitive industry. Several measures for excellence have been adopted by us, to ensure the supply of world class range to our valued clientele.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur company is equipped with ruggedly constructed infrastructural set-up, comprising ultramodern equipment and technology. The machines we have installed here are of reputed brands that give outstanding performance while usage.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe are the most preferred choice of vast clientele as it is just because of our ability to provide them solutions as per their accurate demands. Further, we have earned huge clientele support by making simplicity in our business dealings and following ethical practices.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       67],
      "assets/images/resized/0024/7640/247640v2-max-150x150.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7640/247640v2-max-250x250.jpg"],
     [[250,
       112],
      "assets/images/resized/0024/7640/247640v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}