{"name": "Sundaybell",
 "permalink": "sundaybell",
 "crunchbase_url": "http://www.crunchbase.com/company/sundaybell",
 "homepage_url": "http://www.sundaybell.com",
 "blog_url": "http://www.sundaybell.com/blog",
 "blog_feed_url": "",
 "twitter_username": "SundaybellTWEET",
 "category_code": "public_relations",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 4,
 "founded_day": 22,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "real-estate, find-agents, real-estate-fees, pdi, mortgage-information",
 "alias_list": null,
 "email_address": "info@sundaybell.com",
 "phone_number": "",
 "description": "Online Real Estate Solution",
 "created_at": "Wed Mar 30 20:56:18 UTC 2011",
 "updated_at": "Mon Apr 02 01:32:37 UTC 2012",
 "overview": "\u003Cp\u003EFinding the right real estate agent, at the right price, may just have become a lot easier thanks to Sundaybell Inc., an innovative new company that introduces consumers to agents online using a profile based matching system.\u003C/p\u003E\n\n\u003Cp\u003EWhy Sundaybell? Rather than having the pressure of face-to-face meetings and intimidating contracts to review, buyers and sellers can evaluate the services and commission structures local agents are willing to offer, correspond with them anonymously and decide what is right for them. \u0026#8220;An educated customer can make better decisions. After all, it\u0026#8217;s their money. Real estate can be a confusing business: at Sundaybell, our goal is more than just matching you with agents of your choice, we also want to help you understand what all your options are.\u003C/p\u003E\n\n\u003Cp\u003EOnce a consumer fills in their profile, they can choose from three proprietary web-based tools allowing them to invite agents they know, or send out their anonymous profile to all agents in the system. It gives consumers the ability to identify their needs and ask uncomfortable questions. This way, they can really evaluate who is the best match for them.\u003C/p\u003E\n\n\u003Cp\u003EThe system has been developed to benefit the agents too. By bringing potential customers directly to the agents, they can save on marketing costs and focus on differentiating themselves. Educated consumers know what they want and it\u0026#8217;s important for agents to meet those needs and make recommendations, not sell them or charge them for services they are not interested in. Among the many resources available to agents are a customized profile, unlimited consumer correspondences and a chance to \u0026#8216;qualify\u0026#8217; potential clients through their communications.\u003C/p\u003E\n\n\u003Cp\u003ESundaybell is free to use for consumers while agents can decide from two modestly priced membership options. Sundaybell is neither a real estate agency nor a brokerage; it\u0026#8217;s a resourceful tool for consumers to use to learn about real estate and connect with agents. So if you want to find an agent who can meet your specific needs, www.sundaybell.com is a great place to start.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       29],
      "assets/images/resized/0018/1656/181656v2-max-150x150.jpg"],
     [[250,
       48],
      "assets/images/resized/0018/1656/181656v2-max-250x250.jpg"],
     [[450,
       88],
      "assets/images/resized/0018/1656/181656v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        94],
       "assets/images/resized/0012/8493/128493v2-max-150x150.jpg"],
      [[250,
        158],
       "assets/images/resized/0012/8493/128493v2-max-250x250.jpg"],
      [[450,
        284],
       "assets/images/resized/0012/8493/128493v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://vimeo.com/34899331",
    "title": "See How Bob and Carly found their ideal agent at Sundaybell"}]}