{"name": "Sunil Communication",
 "permalink": "sunil-communication",
 "crunchbase_url": "http://www.crunchbase.com/company/sunil-communication",
 "homepage_url": "http://www.indiamart.com/sunilcommunication/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gprs-tracking-system, truck-tracking-system, school-bus-tracking-system, smart-security-surveillance-camera-and-internet-dongle-",
 "alias_list": null,
 "email_address": "sunilcommunication@tradepassport.org",
 "phone_number": "9225201555",
 "description": "Services and Leased ",
 "created_at": "Fri Apr 05 09:26:21 UTC 2013",
 "updated_at": "Fri Apr 05 09:26:23 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2006, we “Sunil Communication” have been engaged in trading, distributing and supplying a quality assured range of GPRS Vehicle Tracking System, and Smart Security Surveillance Camera and Internet Dongle. The variegated range that clients can avail from us includes Car Tracking System, GPRS Tracking System, Truck Tracking System, School Bus Tracking System, Smart Security Surveillance Camera and Internet Dongle. Apart from this, we are also engaged in offering Leased Line Connectivity Service, DTH Service, Fixed Wireline \u0026amp; Broadband Service and Mobile Voice Service. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nA leading organization from Maharashtra (India), we have been able to establish ourselves as a foremost trader, distributor, supplier and service provider owing to the immense domain knowledge of our skilled professionals.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality-oriented organization, we ensure that all our procured range of Vehicle Security Systems and Smart Cameras are designed \u0026amp; developed by our vendors in compliance with the industry standards. Thus, they check the procured products on well defined parameters before these are delivered to the clients to assure.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nA sole proprietorship firm, we are well aware of the fact that it is essential to offer quality products in order to build a vast customer base. Thus, we have associated ourselves with some of the leading manufacturers across the country in order to procure premium quality range of Vehicle Security Systems and Smart Cameras.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have more than half a decade of experience in the domain supplying, distributing and trading quality assured range of smart cameras and vehicle security systems. Along with quality products, we assure that these are delivered to the client’s place within the stipulated time period and at cost effective prices. We further accept payment from clients in varied modes that are convenient modes to assure hassle free monetary transaction for them.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services :\nCar Tracking System, GPRS Tracking System, Truck Tracking System, School Bus Tracking System, Smart Security Surveillance Camera and Internet Dongle. Apart from this, we are also engaged in offering Leased Line Connectivity Service, DTH Service, Fixed Wireline \u0026amp; Broadband Service and Mobile Voice Service. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8482/248482v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8482/248482v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8482/248482v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}