{"name": "SunLab Equipments",
 "permalink": "sunlab-equipments",
 "crunchbase_url": "http://www.crunchbase.com/company/sunlab-equipments",
 "homepage_url": "http://www.indiamart.com/sunlabequipments/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hot-air-oven, bod-incubator, autoclave-machine, water-bath, humidity-oven, muffle-furnace",
 "alias_list": null,
 "email_address": "sunlabequipments@tradepassport.org",
 "phone_number": "9930857626",
 "description": "Manufacturing, supplying and exporting  ",
 "created_at": "Thu Apr 04 15:40:13 UTC 2013",
 "updated_at": "Thu Apr 04 15:40:18 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2009, we, “Sun Lab Equipments”, are engaged in manufacturing, supplying and exporting of a wide range of Lab Equipment \u0026amp; Machines. The offered range includes different products such as Hot Air Oven, Bod Incubator, Autoclave Machine, Water Bath, Humidity Oven, Muffle Furnace, Pour Point Apparatus, Platform Shaker. The range of products we offer is widely known for its robust construction, smooth functionality, efficient performance and precision designs. These products find wide application in many. Also, we offer these products as per the customized specifications given by the clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have a competent and talented workforce, which works in coordination with the clients to come up with a product line which suit the clients\u0026#8217; requirements. To ensure that we have a talented pool of professionals in our organization, we hire them after a thorough assessment of their skills and domain knowledge.\u003C/p\u003E\n\n\u003Cp\u003EQuality Policy:\nSun Lab Equipments, delivers excellence in product and services by continual improvement of integrated management system that ensures customer satisfaction.We shall strive for reduction of defect, reduction of environmental pollution \u0026amp; improve health \u0026amp; safety of employee, by complying with applicable legal, customer and organizational requirements.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have developed a vast infrastructural set up, which is installed the latest technology and advanced machines. This infrastructure allows us to have a huge manufacturing unit which is capable of undertaking bulk production of various orders placed by the clients. In addition to this we have a section dedicated to research and development, which constantly works to keep us ahead in the competition. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince our inception we have been a client-centric organization. We always strive to provide utmost satisfaction to the clients at all costs. We are widely known in the market for our clients centric policies, transparent dealings, ethical trade practices and feasible prices. Moving further in the direction of client satisfaction, we avail our clients with customized versions of the offered range. Additionally, we work in coordination with the clients to come up with a range of products, which is exactly as per the clients\u0026#8217; needs. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8041/248041v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/8041/248041v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/8041/248041v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}