{"name": "SuperChem Plast",
 "permalink": "superchem-plast",
 "crunchbase_url": "http://www.crunchbase.com/company/superchem-plast",
 "homepage_url": "http://www.indiamart.com/superchemplast/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "superchemplast@tradepassport.org",
 "phone_number": "9982678000",
 "description": "Manufacturer, exporter \u0026 supplier ,",
 "created_at": "Fri Apr 05 11:58:49 UTC 2013",
 "updated_at": "Fri Apr 05 11:58:52 UTC 2013",
 "overview": "\u003Cp\u003ESuper Chem Plast, a Rajasthan based organization is located in the famous pink city of Jaipur. We are partnership firm, which came into inception in the year 2012. We are engaged into manufacturing, exporting and supplying of Black Masterbatch, White Masterbatch, Colour Masterbatch, Dessicant Masterbatch, Additive Masterbatch and Moisture Absorbent Powder. Owing to wide application and usage of these products, we ensure the production is carried out as per industrial guidelines to obtain highest standards of quality. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a great support in terms of infrastructure which is the essence of our success. It is spread over a vast area in a splendid locality. The entire facility comprises quality, manufacturing, warehousing and packaging, research \u0026amp; development and many more. All these departments are functional and deliver what is expected out of them. We have installed machine and equipment known for trouble free performance. We ensure proper maintenance of all our equipments.\u003C/p\u003E\n\n\u003Cp\u003EOur team:\nWith the able support we receive from our team members, we are able to manufacture exclusive range of Masterbatches which are widely applauded by our clients. Our professionals who work with us possess great domain expertise, which helps them in manufacturing the world class products. It is owing to their support, that we are able to outshine our competitors and have made our presence felt in domestic and international market in a short span of time.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nOur firm is catering not only to domestic clients but our products are in great demand in foreign land as well, for this very reason we pay a significant amount of focus to quality. Our quality auditors work in tandem with other professionals to achieve the same. We have set up strict quality benchmarks and our team of professionals works deftly to achieve the desired quality continually. We strictly follow industrial guidelines to ensure our line of manufacturing is in accordance with set standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nBlack Masterbatch, White Masterbatch, Colour Masterbatch, Dessicant Masterbatch, Additive Masterbatch and Moisture Absorbent Powder.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8614/248614v2-max-150x150.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8614/248614v2-max-250x250.jpg"],
     [[230,
       155],
      "assets/images/resized/0024/8614/248614v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}