{"name": "SuperConnect",
 "permalink": "superconnect",
 "crunchbase_url": "http://www.crunchbase.com/company/superconnect",
 "homepage_url": "http://www.superconnect.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 50,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "superconnect, mobile, workforce, apps, enterprise, platform, employee, productivity, social, computing, business, solutions, mobility, gamification",
 "alias_list": null,
 "email_address": "info@superconnect.com",
 "phone_number": "206-438-5700",
 "description": "SuperConnect creates secure mobile enter",
 "created_at": "Sat Oct 06 07:41:08 UTC 2012",
 "updated_at": "Wed Oct 17 23:44:16 UTC 2012",
 "overview": "\u003Cp\u003ESuperConnect creates secure mobile enterprise apps that help enterprise businesses maximize the value of internal connections and leverage mobile devices to get work done in the most convenient and simple ways.  \u003C/p\u003E\n\n\u003Cp\u003ESuperConnect is the newest division of Slalom, LLC, created April 2, 2012, to leverage the years of knowledge and experience gained working with enterprise clients of Slalom Consulting.\nSlalom Consulting, a division of Slalom, LLC, is a national business and technology consulting firm, founded in 2001 and headquartered in Seattle, Washington, with offices in Atlanta, Boston, Chicago, Dallas, Denver, Hartford, Los Angeles, Portland, Palo Alto, New York and San Francisco. There are now three divisions that make up Slalom, LLC: Slalom Consulting, 2Degrees and SuperConnect. Capitalizing on its local consultant model, which minimizes travel overhead for clients, Slalom has grown to more than 1,800 consultants who cover a wide range of business and technology services.\nIn recent years, Slalom Consulting has excelled in bringing innovation to its clients with a myriad of applications and projects such as a mobile employee directory for the Slalom consultants spread out across the country to put faces with names and find internal experts, targeted 90-second games to promote learning and team collaboration, and other tools that saw enormous demand from customers. We watched and learned how these early tools succeeded and identified areas for improvement. The Slalom teams saw a need to address trending business problems that many organizations face by offering standardized products. Slalom identified key leaders in the technology and mobile spaces from within Slalom Consulting to explore the possibility of a product division, and SuperConnect was born.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       42],
      "assets/images/resized/0021/4477/214477v2-max-150x150.png"],
     [[250,
       70],
      "assets/images/resized/0021/4477/214477v2-max-250x250.png"],
     [[311,
       88],
      "assets/images/resized/0021/4477/214477v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Director of User Experience",
    "person":
     {"first_name": "Brbara",
      "last_name": "Ballard",
      "permalink": "brbara-ballard",
      "image":
       {"available_sizes":
         [[[75,
            88],
           "assets/images/resized/0025/4323/254323v1-max-150x150.png"],
          [[75,
            88],
           "assets/images/resized/0025/4323/254323v1-max-250x250.png"],
          [[75,
            88],
           "assets/images/resized/0025/4323/254323v1-max-450x450.png"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.superconnect.com/",
    "title": "Mobile gaming platform"}]}