{"name": "Super Refrigeration",
 "permalink": "super-refrigeration",
 "crunchbase_url": "http://www.crunchbase.com/company/super-refrigeration",
 "homepage_url": "http://www.superrefrigerationasia.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "stop-valves, in-line-valves, weld-in-line-valves, check-valves, liquid-level-gauges, in-line-check-valves, safety-valves, dual-safety-valves",
 "alias_list": null,
 "email_address": "webmaster@superrefrigerationasia.com",
 "phone_number": "9811538277",
 "description": "Manufacturing, Exporting, ",
 "created_at": "Thu Apr 04 14:40:08 UTC 2013",
 "updated_at": "Thu Apr 04 14:40:13 UTC 2013",
 "overview": "\u003Cp\u003EWe “Super Refrigeration (Asia)” were established in the year 1968, in Delhi, India. In our product array, we Manufacture, Export, Trade And Supply premium quality products like Stop Valves, In Line Valves, Weld In line Valves, Check Valves, Liquid Level Gauges, In Line Check Valves, Safety Valves, Dual Safety Valves and many more items to our clients. For the fabrication of our products array, we procure only premium quality raw material from some of the selected vendors of the industry. Our offered products are widely used in various industries like automobiles, engineering, manufacturing unit etc. To meet the specific requirements of our esteemed clients, we also provide these products in customized options. Our major markets are Indian Subcontinent, Middle East and South East Asia.\u003C/p\u003E\n\n\u003Cp\u003EOur Philosophy:\nEver since our inception, we have been striving to be recognized as world leaders in our field by constantly upgrading with latest technology. Our vision is to identify and realize our client’s future needs and dreams prior to our clients realizing it.\u003C/p\u003E\n\n\u003Cp\u003EProduct Profile:\nWe are engaged in Manufacturing, Supplying and Exporting of an extensive assortment of refrigeration equipment. The entire methodology used in fabricating our range of refrigeration equipment is in adherence to the ISO 9001:2008 standards which ensures that quality is the common feature in our diversified array. Our range of Refrigeration Equipment is the result of perfect combination of high grade raw material with latest technology.\u003C/p\u003E\n\n\u003Cp\u003EOur Management and Team:\nLeveraging on the knowledge and expertise of our professionals, we have paved our way among the prominent names in the industry. Their judiciousness and industriousness is the strength of our organization and they are priced position for our organization. To make the best out of the talent and expertise of our team, we have channelized their potential by dividing them into various departments. This helps us to bring out the maximum out of our professionals.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\n“Our organization ensures that quality is never compromised, we are totally committed to achieve superior quality standards of our products and services which are pursued through a suitable quality policy which is in accordance to the overall business direction and mission. With our dedication towards quality we meet our targeted goal of total customers’ satisfaction.”\u003C/p\u003E\n\n\u003Cp\u003EResearch And Development:\nContinuous research in all the areas leads to incredible development; this establishes the relationship between research and development. In order to undertake various research undertakings, we have employed knowledgeable research professionals in our organization. This is one of the reasons for leading us towards implausible development in various spheres such as quality, diversity of the range and improvement of the existing array. Our research professionals are trained to conduct exhaustive research and explore all the possible measures which can be incorporated in our organization and improvise our current operational techniques. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7988/247988v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7988/247988v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7988/247988v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}