{"name": "Superb Products",
 "permalink": "superb-products",
 "crunchbase_url": "http://www.crunchbase.com/company/superb-products",
 "homepage_url": "http://www.indiamart.com/superbproducts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "our-range-comprises-low-voltage-soldering-iron-products",
 "alias_list": null,
 "email_address": "superbproducts@tradepassport.org",
 "phone_number": "9822056550",
 "description": "Manufacturer and Supplier ,",
 "created_at": "Thu Apr 04 11:42:50 UTC 2013",
 "updated_at": "Thu Apr 04 11:42:52 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1968, at Pune (Maharashtra, India), we, Superb Products, are reputed manufacturer and supplier of finest quality Soldering Irons and Solder Pots. Our range comprises Low Voltage Soldering Iron Products, Thermal Wire Strippers, Solder Baths, Flow Solder Baths, Rota Solders, High Voltage DC Power Supply, Temperature Controlled Soldering Irons, etc. All our products are valued among the clients for their diverse features like robust construction, durability, sturdiness, longer working life. We manufacture Instrument Transformers as per UL, IEC and VDE standards. High Voltage DC Power supplies up to 25 KV DC and with 30 mA short circuit current that is used in Oil Cleaning, Water Purification, Air Ionization and Cable Testing. Also, we manufacture Electronic Neon Power Supply used in Advertisement.\u003C/p\u003E\n\n\u003Cp\u003EOur Strengths:\nDue to our superior quality Soldering Irons and Solder Pots, we are able to crave the niche in the market. In reference to these factors, we have become the prime and first choice of our customers.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nWe make tireless effort to provide our customers maximum level of satisfaction by offering world class Soldering Irons, Solder Pots and Special Purpose Soldering machines. Also, we ensure that an effectual communication system is maintained and developed with the clients, so as to deliver the product as per their different specifications.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nWe have established an in-house quality control facility, which is well-equipped with all the sophisticated devices and instruments that facilitate the effective quality tests. They perform a number of quality checks on the basis of following quality parameters.\u003C/p\u003E\n\n\u003Cp\u003EProducts:\nOur range comprises Low Voltage Soldering Iron Products, Thermal Wire Strippers, Solder Baths, Flow Solder Baths, Rota Solders, High Voltage DC Power Supply, Temperature Controlled Soldering Irons, etc.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7865/247865v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7865/247865v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7865/247865v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}