{"name": "SureSkills",
 "permalink": "sureskills",
 "crunchbase_url": "http://www.crunchbase.com/company/sureskills",
 "homepage_url": "http://www.sureskills.com",
 "blog_url": "http://www.sureskills.com/blog/",
 "blog_feed_url": "http://www.sureskills.com/blog/",
 "twitter_username": "SureSkillsLtd",
 "category_code": "other",
 "number_of_employees": 95,
 "founded_year": 1993,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "technical-training, training, technical-it, business-skills, service-management, it-infrastructure-training, consulting, large-training-portfolio, consulting-company, austin-texas",
 "alias_list": null,
 "email_address": "dan.goggin@sureskills.com",
 "phone_number": "+1 512 238 3098",
 "description": "Technical Training Company",
 "created_at": "Thu Oct 06 17:14:27 UTC 2011",
 "updated_at": "Thu Oct 27 17:50:36 UTC 2011",
 "overview": "\u003Cp\u003ESureSkills is a rapidly growing multi-national services training company.\u003C/p\u003E\n\n\u003Cp\u003ESureSkills offer a range of Technical IT, Business Skills, Service Management and IT Infrastructure Training and Consulting to some of the world\u0026#8217;s leading companies. Headquartered in Dublin, Ireland, the company has not only grown its large training portfolio but has also been recognised as a significant systems integrator and consulting company. \nSureSkills parent company is a private limited company registered at 14 Fitzwilliam Place, Dublin 2, Ireland. CRO Number 204821. SureSkills offices are located in Austin, Texas USA, Dublin, Ireland and in Belfast, Northern Ireland, UK\u003C/p\u003E\n\n\u003Cp\u003ET Training: \nHaving grown over the past number of years organically and through some strategic acquisitions - SureSkills can now boast a full suite of IT training that includes; VMware, Microsoft, Dell, CommVault, Social Media, Cisco, ITILÂ®, PRINCE2Â® (strengthened through the acquisition of ESMI), ECDL and many more. SureSkills long list of accreditations gives prospective clients peace of mind. Clients include international government departments; corporate bodies and financial institutions. Services are provided to: Accenture; KPMG; Pioneer Investments; IBM; Microsoft; Citi Bank; Bank of Ireland; Dell; Symantec; eBay; LinkedIn and many more.\u003C/p\u003E\n\n\u003Cp\u003EGlobal Training Services\nSureSkills Global Training Services Instructional Design and Delivery Division, has developed a systematic approach to course development that ensures that specific learning goals are accomplished. We have developed significant skills and process to help technology vendors develop technical sales training programmes and deliver courses world wide aimed at increasing sales of highly technical solutions. \u003C/p\u003E\n\n\u003Cp\u003EIT Services\nSureSkills IT Services division has a number of core competencies including: complex infrastructure migrations, storage solutions design and implementation, disaster recovery and high availability, data lifecycle management, messaging solutions, project management, systems migration, security services, IT outsourcing and contract staff. \u003C/p\u003E\n\n\u003Cp\u003EService Management \u0026amp; Project/Programme Management \nSureSkills Service Management and Project/Programme has been established as a core element of our business with the acquisition of ESMI in June 2011. This provided SureSkills an experienced and ready functioning ITILÂ®, PRINCE2Â®, PMP, MSPÂ®, Business Analysis and consulting best practice division in Service Management and Project and Programme Management. Holding international accreditations which are now not only a service offered by SureSkills but also the processes under which we provide our services and solutions.\u003C/p\u003E\n\n\u003Cp\u003EBusiness Skills Training\nSureSkills Business Skills training division provides a comprehensive training schedule. The company also provides a fully managed training service and has extensive experience developing and implementing bespoke training solutions for its larger corporate clients. Providing cutting edge training and facilitation to improve organisational performance and achieve results. SureSkills Business Skills division enables people to develop their business skills, management decision making and commercial acumen. Our pragmatic approach creates immediate and sustainable benefits for organisations in both the public and private sectors. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}