{"name": "SurfCanister",
 "permalink": "surfcanister",
 "crunchbase_url": "http://www.crunchbase.com/company/surfcanister",
 "homepage_url": "https://surfcanister.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "SurfCanister",
 "category_code": "security",
 "number_of_employees": 8,
 "founded_year": 2011,
 "founded_month": 3,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "safe-browsing, malware, secure-browser, antimalware",
 "alias_list": null,
 "email_address": "info@surfcanister.com",
 "phone_number": "",
 "description": "A Safe Browsing Technology",
 "created_at": "Sun Mar 25 16:59:57 UTC 2012",
 "updated_at": "Tue May 22 04:21:42 UTC 2012",
 "overview": "\u003Cp\u003ESurfCanister announced the launch of their first security product. SurfCanister is a patent pending safe browsing technology, which protects users’ computer, as well as valuable and confidential data against latest Trojans and Viruses.\u003C/p\u003E\n\n\u003Cp\u003EThere are 55,000 new malware samples submitted by various organizations to AVtest.org every day. It has been really hard for Antivirus companies to keep up with sheer volume of malware variants. There is a lag between new malware comes out and Antivirus engine detect them. In this window when there are no signatures users are exposed to new viruses and Trojans (also known as Zero Day). \nSurfCanister founder Sunil Shilimkar said “Instead of traditional reactive security approach, users need preventive security. SurfCanister has advanced malware protection mechanism which conventional Anti-virus softwares lack. SurfCanister runs viruses and Trojans in isolated environment and blocks malware from accessing to users confidential files and documents. SurfCanister does not need signature definitions or updates to protect users’ computer, hence users are protected 24X7.”\u003C/p\u003E\n\n\u003Cp\u003EAccording to recent study published by Sophos, Web has become the biggest source for malware. More than 85% of malware comes from web. While browsing web, a lot of confidential information such as user’s credit card number, social security number, bank user name and password are stored inside web browser’s cache. Spyware can steal such valuable information stored in user’s browser other confidential locations on users’ computer. \nSurfCanister isolates browser and operating system resources and gives one click option to the user to clean up isolated browsing data or operating system resources to get rid of malware foot prints as well as protects the user’s identity by cleaning the critical information such as credit card number, social security number, bank user name and passwords.\u003C/p\u003E\n\n\u003Cp\u003ESurfCanister’s advanced protection mechanism automatically secures user’s valuable data reside inside My Documents, My Pictures, My Music folders and other personal folders while browsing. SurfCanister also allows users to select any folder(s) which has user’s valuable or confidential data.\u003C/p\u003E\n\n\u003Cp\u003EThere is a one year free trial version of SurfCanister is available for users to protect against latest threats. SurfCanister is also offering 25% discount on their final release to all its beta users. Visit www.surfcanister.com/download to download the beta product.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       60],
      "assets/images/resized/0018/0953/180953v2-max-150x150.png"],
     [[250,
       100],
      "assets/images/resized/0018/0953/180953v2-max-250x250.png"],
     [[252,
       101],
      "assets/images/resized/0018/0953/180953v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO and Founder",
    "person":
     {"first_name": "Anil",
      "last_name": "Shilimkar",
      "permalink": "anil-shilimkar",
      "image": null}},
   {"is_past": false,
    "title": "CTO and Founder",
    "person":
     {"first_name": "Sunil",
      "last_name": "Shilimkar",
      "permalink": "sunil-shilimkar",
      "image": null}},
   {"is_past": false,
    "title": "Director, Business Development",
    "person":
     {"first_name": "Abhishek",
      "last_name": "Dubey",
      "permalink": "abhishek-dubey",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "530 Lytton Avenue, 2nd Floor",
    "address2": "",
    "zip_code": "94301",
    "city": "Palo Alto",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}