{"name": "SURGEAccelerator",
 "permalink": "surgeaccelerator",
 "crunchbase_url": "http://www.crunchbase.com/company/surgeaccelerator",
 "homepage_url": "http://www.surgeaccelerator.com",
 "blog_url": "http://www.surgeaccelerator.com/blog",
 "blog_feed_url": "",
 "twitter_username": "surgeaccelerate",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 6,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "surge, accelerator, energy-software, energy-entrepreneur, smart-grid, energy-trading, etrm, energy-efficiency, regulatory-compliance-",
 "alias_list": null,
 "email_address": "kirk@surgeaccelerator.com",
 "phone_number": "713.510.3011",
 "description": "Energy Software Accelerator",
 "created_at": "Sun Dec 18 23:24:55 UTC 2011",
 "updated_at": "Mon Dec 19 23:02:03 UTC 2011",
 "overview": "\u003Cp\u003ELocated in \u0026#8220;The Energy Capital of the World,\u0026#8221; SURGE Accelerator is looking for entrepreneurs, startup companies, and later-stage companies who are solving the world\u0026#8217;s energy problems using software.\u003C/p\u003E\n\n\u003Cp\u003EBased in Houston, “The Energy Capital of the World,” SURGE assists companies seeking to innovate and exploit the massive shifts in technology, policy, and expertise in the traditional energy industry. SURGE will accelerate both entrepreneurs and established companies who are innovating in five primary segments: Smart Grid Applications, Energy Trading \u0026amp; Risk Management, the Digital Oilfield, Energy Efficiency, and Regulatory Compliance. We accomplish this goal by providing both startups and later-stage companies with the expert mentorship, access to the energy ecosystem, and opportunities for capital to reach market validation or market expansion.\u003C/p\u003E\n\n\u003Cp\u003EThere is no better place on the planet to bring an energy software idea, product, or service to market than Houston. SURGE Accelerator\u0026#8217;s Houston and Gulf Coast resources ensure access to the largest deregulated electricity market, hub of global oil and gas operators /  service companies, population of smart meters, second largest information technology service economies, and one of the world’s best ecosystems to help an entrepreneur grow their company from idea to prototype to market leader. For more established, later-stage companies, SURGE Accelerator offers the same services to a team or division within a company to expand rapidly into other markets. \u003C/p\u003E\n\n\u003Cp\u003EThe vision of SURGE Accelerator is created through the collaboration of successful energy industry experts, venture capitalists, angel investors, and community organizations. Entrepreneurs and established companies who are accepted into the Spring 2012 Program will invest three intense months in our Houston-based bootcamp. This allows time for companies to prepare their ideas and teams for rapid customer acquisition and their next round of financing or market expansion. Each team is partnered with segment experts, experienced investors and energy market leaders who will mentor the entrepreneurs through the complexities of developing their go-to-market strategies in today\u0026#8217;s new energy economy.\u003C/p\u003E\n\n\u003Cp\u003EThe capstone of the program is “SURGE DAY” where Program Finalists present their company to an audience of energy-focused venture capitalists, angel investors, corporations and their development teams, key community energy and information technology leaders and the media. SURGE DAY provides a platform for the next great wave of energy technology entrepreneurs to demonstrate the value and viability of their graduating company.\u003C/p\u003E\n\n\u003Cp\u003EThe Spring 2012 Program is the inaugural class that launches in March 2012. \u003C/p\u003E\n\n\u003Cp\u003EMISSION \u0026amp; CORE PURPOSE\nSURGE is the pre-eminent venture accelerator in the World focused solely on enabling entrepreneurs to create the efficient energy software technologies of tomorrow, reducing the country\u0026#8217;s reliance on fossil fuels and improving energy efficiency. SURGE is capitalizing on “The Energy Capital of The World” to attract and develop the efficient energy software technologies of tomorrow by blending development, education and investment.\u003C/p\u003E\n\n\u003Cp\u003EThe SURGE focus is to nurture, discover, accelerate and promote a combination of entrepreneurs, startup companies, and established companies. By providing capital, customers, collaborators, connections, and the energy community exposure to them, SURGE helps companies create the new energy efficiency platforms of tomorrow.\u003C/p\u003E\n\n\u003Cp\u003ELeadership Team\nKIRK BRAND COBURN\nBRIAN LANDRUM\nBLAIR GARROU\nANDREW CLARK\nKERRI SMITH\nBRETT PERLMAN\nMARY-HELEN O\u0026#8217;LEARY\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [{"funding_round":
     {"round_code": "seed",
      "source_url": "",
      "source_description": "",
      "raised_amount": 30000.0,
      "raised_currency_code": "USD",
      "funded_year": 2013,
      "funded_month": 2,
      "funded_day": 1,
      "company":
       {"name": "Skynet Labs",
        "permalink": "skynet-labs",
        "image":
         {"available_sizes":
           [[[87,
              150],
             "assets/images/resized/0019/5253/195253v2-max-150x150.jpg"],
            [[145,
              250],
             "assets/images/resized/0019/5253/195253v2-max-250x250.jpg"],
            [[262,
              450],
             "assets/images/resized/0019/5253/195253v2-max-450x450.jpg"]],
          "attribution": null}}}}],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "SURGE Accelerator LLC",
    "address1": "ONE GREENWAY PLAZA",
    "address2": "SUITE 930",
    "zip_code": "77046",
    "city": "Houston",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}