{"name": "Surya Handicrafts",
 "permalink": "surya-handicrafts",
 "crunchbase_url": "http://www.crunchbase.com/company/surya-handicrafts",
 "homepage_url": "http://www.suryahandicrafts.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "webmaster2@suryahandicrafts.com",
 "phone_number": "9928368388",
 "description": "We are a coveted manufacturer, ",
 "created_at": "Sat Apr 06 05:26:09 UTC 2013",
 "updated_at": "Mon Apr 08 00:13:16 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1988, “Surya Handicrafts”, are a reputed manufacturer, supplier and exporter of Handicraft Items. All our products are crafted with utmost precision and perfection owing to which these display elegance, optimum creativity and excellent work of craftsmanship. The attractive appearance and enthralling designs of our products make widely used in various hotels, offices, homes and other establishments for enhancing the overall looks of the interior. Our offered products are extensively used by the customers for gifting purposes to near and dear ones.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\nWe are a reputed enterprise, engaged in manufacturing, supplying and exporting a plethora of Handicraft Items. The range offered by us encompasses Blue Pottery Items, Lac Items, Marble Items, Wooden Handicraft, Wooden Jewelery Box and Pen Stand. In addition to these, we offer Meenakari Items, Hanging Chimes, White Metal Items, Handmade Sculpture and Camping \u0026amp; Sporting Instruments, to name a few. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOver the years, we have been able to carve a sophisticated niche of success in the market due to the tremendous support provided by our experts. The professionals working with us implement their skills and expertise to design and craft our offered Handicraft Items in sync with the prevailing market trends. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nSince commencement, quality is the center of our all business proceedings, which is not only reflected in our products as well as trade business practices. For maintaining our optimum quality standards, we ensure that the raw material used in production of offered range is procured from certified vendors. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nFor having trouble-free production and post-production of offered Handicraft Items, we have constituted a sound infrastructure facility. Sprawling over a vast area of land, this facility is segregated into different sections like manufacturing, quality testing and warehousing \u0026amp; packaging for having efficient working.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       70],
      "assets/images/resized/0024/9049/249049v2-max-150x150.jpg"],
     [[125,
       70],
      "assets/images/resized/0024/9049/249049v2-max-250x250.jpg"],
     [[125,
       70],
      "assets/images/resized/0024/9049/249049v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}