{"name": "SV Plastochem",
 "permalink": "sv-plastochem",
 "crunchbase_url": "http://www.crunchbase.com/company/sv-plastochem",
 "homepage_url": "http://www.indiamart.com/svplastochem/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "svplastochem@tradepassport.org",
 "phone_number": "9272227865",
 "description": "manufacturing, exporting and supplying",
 "created_at": "Fri Apr 05 09:51:16 UTC 2013",
 "updated_at": "Fri Apr 05 09:51:20 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1997, we, “S V Plastochem Pvt. Ltd.”, is a trusted organization engaged in the business of manufacturing, exporting and supplying an unbeatable range of Industrial Chemical. Under this range, we includes Tri Butyl Tin Chloride, Stannous Chloride, Stannic Chloride, Methyl Tin Stabiliser, Butyl Tin Stabiliser and Di Butyl Tin Oxide.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have established a state-of-the-art infrastructure premises to carry out our business activities in an organized manner. Equipped with advanced machinery and equipment, our manufacturing unit helps to maintain the swift rate of production. All our machines are frequently upgraded to keep in pace with current technological advancements.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality conscious organization, who always believes in providing the best-in-class quality products to our clients. We are capable to produce the best quality Industrial Chemical for our precious customers. There is a full fledged, well equipped laboratory close to our manufacturing unit in order to ensure quality consistency of products. We also offer new ideas and development coming either from members of our team or a clients sitting at a far away from our production unit.\u003C/p\u003E\n\n\u003Cp\u003ETeam \u0026amp; Manpower:\nOur organization is backed by an efficient team of professionals in order to cater to the distinct requirements of our clients. These professionals are well versed with latest technologies and methodologies that enable us to process these Industrial Chemical. Further, our team works in harmony with our clients and has the capability of fulfilling their demands and requirements.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur organization is offering the best-in-class Industrial Chemical to our customers, which is in adherence with the global quality standard. Due to our quality-assured products and transparency in business dealings, we have established a reputed position in the market.\u003C/p\u003E\n\n\u003Cp\u003ECrisil Certification:\nWe are a CRISIL verified company, engaged in offering in various Tin Compounds, Organic / Inorganic Tin Compounds, PVC Heat Stabilizers for food as well as non-food applications. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8503/248503v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8503/248503v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8503/248503v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}