{"name": "SVB Interior",
 "permalink": "svb-interior",
 "crunchbase_url": "http://www.crunchbase.com/company/svb-interior",
 "homepage_url": "http://www.indiamart.com/svbinterior/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "gypsum-powders, gypsum-plaster-boards, gypsum-false-ceiling-tiles, gypsum-boards",
 "alias_list": null,
 "email_address": "svbinterior@tradepassport.org",
 "phone_number": "9840279311",
 "description": "We are engaged in importing, supplying, ",
 "created_at": "Thu Apr 04 09:27:30 UTC 2013",
 "updated_at": "Thu Apr 04 09:27:32 UTC 2013",
 "overview": "\u003Cp\u003ESVB Interior was established in 2000, as a sole proprietorship firm, engaged in importing, supplying, exporting and trading an extensive range of glasses, gypsum boards, doors and offer timely executed services of outdoor designs and kitchen services. Our product range includes Stucco Gypsum Plasters, Gypsum Powders, Gypsum Plaster Boards, Gypsum False Ceiling Tiles, Gypsum Boards, Bend Glasses,  Sound Proof Glasses, Colored Glasses, Security Glasses, Fire Fusion Glasses, Modular Kitchen Design Services, Modular Living Room Design Services, Outdoor Designing Services and varied others.\u003C/p\u003E\n\n\u003Cp\u003EOur Motto:\nOur motto being to provide high quality, efficient and specialized interior and exterior designing solutions, to clients of all sections, we have extended operations to make our various designing expertise available to commercial establishments also, in and around Chennai, India.\u003C/p\u003E\n\n\u003Cp\u003EOur Manpower:\nOur experts have adopted creative approach and thus providing matchless designs and wonderful results. We have knowledgeable team of professionals who hold rich experience in this domain. Our professionals cautiously analyze the complete procedure in order to make sure the high quality of the offered services. All our teammates are highly qualified \u0026amp; trained to meet the expectations and requirements of our customers. \u003C/p\u003E\n\n\u003Cp\u003EOur Clientele:\nWe are quality driven organization and thus we make sure that the all the Interior Designing services like Bathroom Interior Designing Services, Wooden Flooring Services, False Ceiling Services, etc. are rendered gauging the international standards.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nStucco Gypsum Plasters, Gypsum Powders, Gypsum Plaster Boards, Gypsum False Ceiling Tiles, Gypsum Boards, Bend Glasses,  Sound Proof Glasses, Colored Glasses, Security Glasses, Fire Fusion Glasses, Modular Kitchen Design Services, Modular Living Room Design Services, Outdoor Designing Services and varied others.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/7750/247750v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/7750/247750v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/7750/247750v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}