{"name": "SVG Media Pvt. Ltd.",
 "permalink": "svg-media-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/svg-media-pvt-ltd",
 "homepage_url": "http://svgmedia.in/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 117,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ad-network-india, affiliate-network, performance-network, disgital-media-network, multi-screen-performance-network, affiliate-marketing, retargeting, target-reach-network, digital-ad-network, display-advertisng",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Leading Indian Digital Media Network ",
 "created_at": "Wed Apr 03 07:19:49 UTC 2013",
 "updated_at": "Wed Apr 03 18:39:17 UTC 2013",
 "overview": "\u003Cp\u003ESVG Media, a Smile Vun Group company, is a leading Indian Digital Media Network with over 33 Million Unique Visitors in India. \u003C/p\u003E\n\n\u003Cp\u003ESVG Media, formerly known as Tyroo Media, started its India operations in 2006. Currently, SVG Media has presence in India, South East Asia and the Middle East.\u003C/p\u003E\n\n\u003Cp\u003ESVG Media’s operations are divided into four businesses: \n• Tyroo- APAC’s Largest Multi-Screen Performance Network, Tyroo (previously known as Tyroo Direct) works with over 5000 publisher’s across the globe to offer solutions such as- affiliate marketing, mobile affiliate marketing, retargeting and pay-per-call. Tyroo reaches over 75% unique advertisers in India works with all major e-commerce and internet companies to drive transactions and acquisitions utilizing its performance network. Tyroo is amongst the top 3 customer acquisition channels for a majority of digital businesses and is clocking 100% y-o-y growth.\u003C/p\u003E\n\n\u003Cp\u003E• Velocity- India’s Largest Targeted Reach Network, Velocity is the audience display network of SVG Media. Velocity is the first and only data backed display network in India and APAC with over 40 mn unique users across multiple audience segments. Velocity works with over 200 brands and 1200+ Publishers, Apps \u0026amp; Exchanges to track and offer relevant audience. The product portfolio includes offerings such as Audience Display, Video, Mobile, Rich Media, Social, Data Targeting and Specialty Display.\u003C/p\u003E\n\n\u003Cp\u003E• DGM- India’s Leading Digital ad-Network, DGM India was formed in the year 2007 and was a subsidiary of Asia Digital Holdings Plc., a London Stock Exchange listed company. DGM is the first affiliate network in the country and amongst the leading ad networks in the country. DGM is the largest acquisition channel for online travel businesses. Tyroo acquired DGM India in April 2012. \u003C/p\u003E\n\n\u003Cp\u003E• PrecisionMatch- 1st Data Provider for Digital Marketing in India, SEA and UAE, PrecisionMatch was launched in October 2012. PrecisionMatch is the only provider of effective audience data for display advertising. PrecisionMatch launched operations simultaneously in three markets: India, Singapore and Dubai with 50M unique users and around 60% of internet users across a variety of consumer segments.\u003C/p\u003E\n\n\u003Cp\u003E• PlatformPlay- Everything Digital That’s it!” is the axiom of SVG Media’s latest venture PlatformPlay Media Ventures. PlatformPlay is the first of its kind company in the Indian digital space focussed on devising the India Entry Strategy for businesses looking at increasing their presence in India. PlatformPlay will be offering 360 degree services to help international digital media players launch their business in India. PlatformPlay’s offerings include- Build Operate Transfer (BOT) model, monetization through representation, joint ventures, brand licensing, consulting etc. The venture is being led by Rammohan Sundaram as the Chairman and Managing Director with majority stakes from SVG Media.\u003C/p\u003E\n\n\u003Cp\u003ESVG Media is the largest Indian Digital Media Network with the current reach of over 33 million total unique visitors, representing more than 60 percent reach of India’s Internet base. SVG Media’s projected reach is 45-50 million unique visitors per month including all business entities (this is not tracked on Comscore).\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       102],
      "assets/images/resized/0024/7289/247289v2-max-150x150.png"],
     [[250,
       170],
      "assets/images/resized/0024/7289/247289v2-max-250x250.png"],
     [[294,
       200],
      "assets/images/resized/0024/7289/247289v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder and CEO",
    "person":
     {"first_name": "Manish",
      "last_name": "Vij",
      "permalink": "manish-vij-2",
      "image": null}},
   {"is_past": false,
    "title": "Founder and Chairman",
    "person":
     {"first_name": "Harish",
      "last_name": "Behl",
      "permalink": "harish-behl",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Smile Vun Group:",
    "address1": "Smile Campus, Plot 7C, Sector 18",
    "address2": "Maruti Industrial Area, HUDA",
    "zip_code": "122015",
    "city": "Gurgaon",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.mxmindia.com/2013/04/svg-media-boasts-of-31-2-million-unique-visitors/",
    "title": "SVG Media boasts of 31.2 million unique visitors"}]}