{"name": "Swadeshi Aluminium",
 "permalink": "swadeshi-aluminium",
 "crunchbase_url": "http://www.crunchbase.com/company/swadeshi-aluminium",
 "homepage_url": "http://www.indiamart.com/swadeshialuminiumcompany/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "heavy-aluminum-extrusions, structural-aluminum-extrusions, custom-aluminum-extrusions, aluminum-rods",
 "alias_list": null,
 "email_address": "swadeshialuminiumcompany@tradepassport.org",
 "phone_number": "9810005201",
 "description": "We are prominent manufacturer, supplier ",
 "created_at": "Thu Apr 04 14:10:16 UTC 2013",
 "updated_at": "Thu Apr 04 14:10:20 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2001, at Delhi, we “Swadeshi Aluminium Company Pvt. Ltd.,” are recognized among the noteworthy Manufacturer, Supplier and Exporter of a broad assortment of Aluminum Extrusions, Industrial Aluminum Extrusions, Heavy Aluminum Extrusions, Structural Aluminum Extrusions, Custom Aluminum Extrusions, Aluminum Rods, Aluminum Extruded Profiles, Modular Aluminum Profiles and Aluminum Profiles. \u003C/p\u003E\n\n\u003Cp\u003EManufacturing Facility:\nInfrastructure is our support for enterprise producing method and thereby meeting the majority necessities of our clients. Our products are manufactured using world class raw materials keeping in mind defined industry standards. Owing to our client centric approach and high quality standards, we have been able to provide utmost satisfaction to our clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have hired a team of experienced and qualified professionals, who are extremely dedicated towards the tasks assigned to them. These products are manufactured using world class raw materials keeping in mind defined industry standards. We offer high quality products as per their specific requirements. Clients can easily avail these products in numerous dimensions according to the application area.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe are providing our customer premium quality of Aluminum Extrusions, Briquettes, Scraps and Rods. We have manufactured using quality raw material. These products are tested on various parameters to make sure that we are offering nothing but the best. These products are well-known for their unquestionable quality, durability and efficiency. We are providing these products in various specifications at highly competitive price in order to meet the varied need the clients. \u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nAluminum Extrusions, Industrial Aluminum Extrusions, Heavy Aluminum Extrusions, Structural Aluminum Extrusions, Custom Aluminum Extrusions, Aluminum Rods, Aluminum Extruded Profiles, Modular Aluminum Profiles and Aluminum Profiles. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7953/247953v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7953/247953v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7953/247953v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}