{"name": "Sweatdrops, LLC",
 "permalink": "sweatdrops",
 "crunchbase_url": "http://www.crunchbase.com/company/sweatdrops",
 "homepage_url": "http://www.sweatdrops.com",
 "blog_url": "http://www.sweatdrops.com/blog",
 "blog_feed_url": "",
 "twitter_username": "sweatdropsapp",
 "category_code": "mobile",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "alan@sweatdrops.com",
 "phone_number": "646-926-2046",
 "description": "Mobile Fitness Social Community",
 "created_at": "Fri Mar 30 18:13:27 UTC 2012",
 "updated_at": "Sat Apr 21 08:42:38 UTC 2012",
 "overview": "\u003Cp\u003EStories have always inspired people to take action. We wanted to build a tool that will allow people tell stories about their healthy lifestyle choices, and so inspire others to get active and healthy.\u003C/p\u003E\n\n\u003Cp\u003ESweatdrops has designed a way to identify, track, and measure all the actions and behaviors associated with your fitness life story (FLS), and a simple mobile user interface to help you tell it. We define your FLS as the end-to-end experience across all your healthy activities. Specifically, your FLS is made up of 5 components: your personal progress, your accomplishments, the progress of others, the support you offer others, and community recognition.\u003C/p\u003E\n\n\u003Cp\u003ECurrently, there is no single tool to track or share your FLS. Despite the technology available, avid runners and cyclists still write emails and send texts to each other to share information, motivate each other, and brag. Our team (made of athletes) feels this gap and has decided to build a tool specifically for people interested in sharing their FLS with each other. In the process, we developed a system to reward positive behaviors and activities, to further inspire (and incentivize) people to continue their healthy activities.\u003C/p\u003E\n\n\u003Cp\u003ESweatdrops recognizes that fitness lifestyle is split into activity verticals, but within activities, there are similar patterns in the way that we interact with our communities and in the information that we share. Your FLS is full of rich data, allowing us to recommend activities and products, according to patterns in your behavior. \u003C/p\u003E\n\n\u003Cp\u003EOur two big disruptions are: 1) that the FLS framework can be applied across activity verticals (ex: running, cycling, yoga) to address the fundamental needs of people who are passionate about fitness and 2) that the sharing currently taking place on email lists, text, Facebook can now take place on one convenient mobile app.\u003C/p\u003E\n\n\u003Cp\u003ETo enable the measurement of your FLS, we’ve created a measurement system for tracking, sharing, and rewarding all actions across your fitness story—a common currency represented by sweat drops. Whether you go for a swim, upload a picture of a cross-fit class, or check in to a local juice bar with a friend, your actions will be earning sweat drops. They will act as a numeric representation of your FLS and will be redeemable for discounts on products and services. Committed and aspiring fitness enthusiasts love public recognition, but we believe they love rewards even more. There are multiple incentives to engage with the app. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       93],
      "assets/images/resized/0018/4711/184711v3-max-150x150.jpg"],
     [[221,
       138],
      "assets/images/resized/0018/4711/184711v3-max-250x250.jpg"],
     [[221,
       138],
      "assets/images/resized/0018/4711/184711v3-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO \u0026 Founder",
    "person":
     {"first_name": "Alan",
      "last_name": "Benenson",
      "permalink": "alan-benenson",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$300k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 300000.0,
    "raised_currency_code": "USD",
    "funded_year": 2011,
    "funded_month": 9,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "NY Office",
    "address1": "175 Varick Street",
    "address2": "4th Floor",
    "zip_code": "10014",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "http://vimeo.com/36422814",
    "description": "\u003Cp\u003Esweatdrops video\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}