{"name": "SwiftAuxi Technik",
 "permalink": "swiftauxi-technik",
 "crunchbase_url": "http://www.crunchbase.com/company/swiftauxi-technik",
 "homepage_url": "http://www.indiamart.com/swiftauxitechnik/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dehumidifier, granulator, water-chiller, gravimetric-blender, auxiliary-spares-for-air-dryer--hopper-loader, hot-air-dryer",
 "alias_list": null,
 "email_address": "swiftauxitechniks@tradepassport.org",
 "phone_number": "9724797978",
 "description": "M manufacturing and supplying",
 "created_at": "Thu Apr 04 11:08:14 UTC 2013",
 "updated_at": "Thu Apr 04 11:08:17 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, we “SWIFT AUXI TECHNIK PVT. LTD.”, are one of the accredited organizations, engaged in manufacturing and supplying a comprehensive array of Dehumidifier, Granulator, Water Chiller, Gravimetric Blender, Auxiliary Spares for Air Dryer \u0026amp; Hopper Loader, Hot Air Dryer, Hopper Loader \u0026amp; Screw Doser. Our offered array of auxiliary equipment is manufactured using premium quality machines and other requite material, sourced from the vendors of high prestige. The whole manufacturing process of equipment is carried out under the watch of quality controllers, who ensure their compliance with international quality standards and norms. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are supported by an adroit team of professionals, who ensure that our offered outstanding assembly of Auxiliary Spares for Air Dryer \u0026amp; Hopper Loader is manufactured as per the requirements of patrons. These professionals ensure that the raw material used in the manufacturing process is of optimum quality, therefore they select only prestigious vendors of the industry.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nSince our inception, we have never compromised on the front of quality for our range of Auxiliary Spares of Air Dryer \u0026amp; Hopper Loader, owing to which we have been able to establish ourselves a leading name in this domain, in short time span. To manufacture these auxiliary equipment, we make use of optimum quality machines and other required material, sourced from the most prestigious vendors of the industry. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWith an aim to carry out the business activities related to our range of Auxiliary Spares for Air Dryer \u0026amp; Hopper Loader, we have developed a state-of-the-art-infrastructure at Ahmedabad, Gujarat, which is sprawled across a huge area of land and is equipped with modern machinery as well as latest technology. Owing to the support of modern machinery and latest technology, we are able to shape our range of auxiliary equipment as per the requirements of patrons.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have been able to establish ourselves as a leading name in the domain of manufacturing and supplying a comprehensive array of  Auxiliary Spares for Air Dryer \u0026amp; Hopper Loader, owing to client centric approaches. Under these approaches, we use using high grade machines and other requisite material in the manufacturing process to ensure that our offered equipment-array serves our patrons in a long run.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nDehumidifier, Granulator, Water Chiller, Gravimetric Blender, Auxiliary Spares for Air Dryer \u0026amp; Hopper Loader, Hot Air Dryer, Hopper Loader \u0026amp; Screw Doser. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7836/247836v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7836/247836v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7836/247836v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}