{"name": "Swoboda Hospitality Specialists",
 "permalink": "swoboda-hospitality-specialists",
 "crunchbase_url": "http://www.crunchbase.com/company/swoboda-hospitality-specialists",
 "homepage_url": "http://www.shshotels.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 8,
 "founded_year": 1957,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "hotel, motel, restort, restaurant, hospitality, broker, advisor, loan, mortgage, lodging, resort, investment, investor--management",
 "alias_list": null,
 "email_address": "info@shshotels.com",
 "phone_number": "425-418-5018",
 "description": "",
 "created_at": "Thu Mar 28 01:34:51 UTC 2013",
 "updated_at": "Thu Mar 28 01:34:57 UTC 2013",
 "overview": "\u003Cp\u003EPROFESSIONAL AND EXPERIENCED HOTEL \u0026amp; MOTEL BROKERS\nSWOBODA HOSPITALITY SPECIALISTS is committed to serving the needs of the\nHospitality marketplace in an integrated, professional manner. We strive to maintain the\nhighest standards of discretion and integrity. All private information is held in strict\nconfidence and kept fully confidential. From reviewing simple contracts to co-brokering\ncomplex mergers, we deliver competent service. To keep abreast of frequent changes\nin the business climate, industry standards and government regulations we regularly\nattend seminars and workshops germane to the industry. Through the construction and\nfinance divisions Swoboda, has been involved in the Construction, Finance, and\nRenovation of Hospitalty Assets.\nAt Swoboda Hospitality Specialists, we maintain a staff with impeccable credentials who\nspecialize only in the development, financing, operations, and sales of hotel \u0026amp; lodging\nproperties. Swoboda Hospitality Specialist brokers hold the only certification in hotel\nbrokerage; the Certified Hotel Broker (CHB) designation. Fewer than 50 brokers,\nnationwide, have earned the CHB designation. Hospitality Specialists brokers also hold\nthe Certified Commercial Investment Member (CCIM) designation. Only five percent\n(5%) of the estimated 125,000 commercial real estate practitioners nationwide hold the\nCCIM designation. The coveted Certified Hotel Administrator (CHA) is held by Swoboda\nbrokers as well confirming their understanding and expertise in the operations of lodging\nproperties. The limited number of individuals holding these designations versus the total\nnumber of brokers nationwide reflects not only the caliber of the programs, but also why\neach is one of the most coveted and respected designations in the industry.\nFor additional information please feel free to contact either Willie Meinhold\nwillie@shshotels.com, 425-879-5335 or Greg Meinhold greg@gregmeinhold.com 425-\n418-5018. Visit our website at www.shshotels.com, or reach our corporate office at\n602-HOTEL4U (602-468-3548) info@shshotels.com.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0024/6099/246099v2-max-150x150.png"],
     [[250,
       83],
      "assets/images/resized/0024/6099/246099v2-max-250x250.png"],
     [[450,
       151],
      "assets/images/resized/0024/6099/246099v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}