{"name": "Synergix Technologies",
 "permalink": "synergix-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/synergix-technologies",
 "homepage_url": "http://www.synergixtech.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 55,
 "founded_year": 1990,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "erp-software, erp-solutions, erp-system, erp-systems, web-based-erp, weberp",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Singapore ERP software provider",
 "created_at": "Thu Mar 01 09:48:09 UTC 2012",
 "updated_at": "Sat Mar 10 06:10:08 UTC 2012",
 "overview": "\u003Cp\u003EFounded in 1990 by our Managing Director, Mr Koh Yang Uei, Synergix Technologies has always been a leading web-based ERP software solution provider in the Singapore market. Our first roots began with the venturing into the development of a pure accounting software. Since then, the company has made progressive advancements into the development of fully web-based ERP solutions that provides proven solutions covering more than 20 fully integrated modules for industries such as trading \u0026amp; distribution , project-based, manufacturing-based ,healthcare and several other sectors.\u003C/p\u003E\n\n\u003Cp\u003EDue to having an extensive ERP solution, there is virtually no limit to the industries that we penetrate.  Our recent corporate focus is to move towards turnkey solutions development. Our greatest strength lies in our ability to deliver end-to-end web based turnkey ERP software solutions, as we recognise that no two businesses are alike and these uniqueness should not be compromised when companies are looking into automating their business process. Our role as a principal developer further propels our capacity to customise the solution according to your needs and requirements, without compromising on your future upgrade path. Thus, at Synergix, we are committed to provide you with a robust, comprehensive, real-time and customized ERP software that generates the greatest value-add for your business. \u003C/p\u003E\n\n\u003Cp\u003ESynergix has an extensive customer base spanning across more than 20 industries. With a total of 400 (and growing) customers under our belt, they range from small \u0026amp; Mid-sized enterprises (SMEs) to multinational corporations with operations not just in Singapore, but also in Malaysia, Indonesia, Vietnam, Thailand and China. Through the support of our customers, TaskHub e-business solution today is used beyond the shores of Singapore, further propelling our regional presence.\u003C/p\u003E\n\n\u003Cp\u003EWith our strong experience in the development of e-business ERP software and turnkey ERP software solutions, Synergix Technologies, with our 55 headcounts strong team will continue to focus on your core business needs and equip you with high business competencies. We shall aim to continue to lead in Singapore e-business ERP software market , upholding the quality, promoting the Singapore brand ERP software to Asia and Emerging Markets.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       65],
      "assets/images/resized/0017/6512/176512v2-max-150x150.jpg"],
     [[250,
       108],
      "assets/images/resized/0017/6512/176512v2-max-250x250.jpg"],
     [[300,
       130],
      "assets/images/resized/0017/6512/176512v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarter",
    "address1": "2 Jurong East Street ",
    "address2": "21 #05-13 IMM Building",
    "zip_code": "609601",
    "city": "Singapore",
    "state_code": null,
    "country_code": "SGP",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        97],
       "assets/images/resized/0017/7414/177414v2-max-150x150.png"],
      [[250,
        162],
       "assets/images/resized/0017/7414/177414v2-max-250x250.png"],
      [[450,
        291],
       "assets/images/resized/0017/7414/177414v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.synergixtech.com",
    "title": "ERP, ERP software, Web-based ERP "}]}