{"name": "Syntho Pharmaceuticals",
 "permalink": "syntho-pharmaceuticals",
 "crunchbase_url": "http://www.crunchbase.com/company/syntho-pharmaceuticals",
 "homepage_url": "http://www.indiamart.com/synthopharmaceuticals/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "synthopharmaceuticals@tradepassport.org",
 "phone_number": "9336709966",
 "description": "manufacturing, exporting and supplying",
 "created_at": "Thu Apr 04 06:14:15 UTC 2013",
 "updated_at": "Thu Apr 04 06:14:18 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1975, at Lucknow (Uttar Pradesh, India), we, “Syntho Pharmaceuticals Private Limited”, are engaged in manufacturing and supplying a qualitative assortment of Eye Drops and Eye Ointment. Our offered range includes PHENOSULF, QUGAT, Obra F, NUGEN, MYCIN, MOSS, MEZOL, F-LONE, Calodin Eye Drops, Ulcers Preventing Cream, Allergies and Conjunctivitis Drops, etc.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur firm has established a wide infrastructure that is supported with hi-tech laboratory, which assist us in formulating these pharmaceutical products in line with the international standards. This infrastructure encompasses various sub-functional departments to ensure smooth flow of the entire business operation.\u003C/p\u003E\n\n\u003Cp\u003ETeam:\nOur workforce consists of different teams of professionals which includes a set of skilled and knowledgeable personnel. The entire team works in complete collaboration and carries profound expertise which assists us in maintaining topmost position in the market.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfiction:\nAs a quality centric firm, we strictly adhere to the quality control procedures that starts right from the procurement of raw material till the production process and dispatch of the finished product. Our offered range is manufactured using supreme class raw material and advanced techniques in adherence with the market prevalent norms.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have emerged as one of the renowned companies engaged in manufacturing and supplying a wide range of Eye Drops and Eye Ointment. Our superior quality range has gained huge appreciation by our esteemed clients and helps us carve the niche for ourselves in the national as well as international market.\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.indiamart.com/synthopharmaceuticals/\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7570/247570v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7570/247570v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0024/7570/247570v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}