{"name": "Tabture",
 "permalink": "tabture",
 "crunchbase_url": "http://www.crunchbase.com/company/tabture",
 "homepage_url": "http://www.tabture.com",
 "blog_url": "http://www.tabture.com/blog",
 "blog_feed_url": "",
 "twitter_username": "tabture",
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "browser, link-sharing, consumer, sharing, social",
 "alias_list": null,
 "email_address": "founders@tabture.com",
 "phone_number": "613-255-5077",
 "description": "Welcome to Social Browsing",
 "created_at": "Tue Mar 05 05:22:08 UTC 2013",
 "updated_at": "Thu Mar 07 05:33:51 UTC 2013",
 "overview": "\u003Cp\u003EBrowsing is a solitary activity.\u003C/p\u003E\n\n\u003Cp\u003EWhen you think social browsing you’re likely unsure of how to describe it. That’s because other attempts such as bookmarklets and co-browsing have failed to define it. We’d like to let you know what social browsing really means and why it will be known as Tabture. More importantly, you’ll know why getting it right means disrupting a multi-billion dollar industry.\u003C/p\u003E\n\n\u003Cp\u003EThe secret is link sharing. Everyone shares links. They clutter timelines, inboxes, and tweets. It\u0026#8217;s as if your friends, by sending links in messages are standing in a lobby where they\u0026#8217;re holding a door open, except they can\u0026#8217;t go with you. You click the link and move to the new\nsite. Alone.\u003C/p\u003E\n\n\u003Cp\u003EWe at Tabture think link sharing should be social and fun. That’s why our revolutionary technology will not only will change how you share links, but how you experience the Internet. Tabture lets you send a website to your friends, not a message containing a link. We then add\nyour note, name, and picture across the top of the page you sent so they know who it’s from and why you sent it. To boot, you can manage your link history, send to groups, and much more. It has an exquisite design too.\u003C/p\u003E\n\n\u003Cp\u003EWhat we haven’t told you yet is that it also happens to be the easiest way to share. Tabture takes the link sharing methods of the past and boils them down to this: Click, Type-Name, Click. You’ve just sent that website to your friend who by now has already looked at it. It’s that\neasy.\u003C/p\u003E\n\n\u003Cp\u003ESocial Browsing is about browser-to-browser communication, and how we stay in touch all over the web, not just relying on social network hubs to find other people online. We’ve built it, we love it, and so do our users.\u003C/p\u003E\n\n\u003Cp\u003EWe’re dreaming big. We’re changing how people use the Internet. Feel free to reach out and learn more. We welcome the chance to tell you how we at Tabture plan to make browsing a social affair.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Jordan",
      "last_name": "Graham",
      "permalink": "jordan-graham",
      "image": null}},
   {"is_past": false,
    "title": "",
    "person":
     {"first_name": "Francois",
      "last_name": "Lessard",
      "permalink": "francois-lessard",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Tabture HQ",
    "address1": "334 Queen Street",
    "address2": "",
    "zip_code": "E3B3N7",
    "city": "Fredericton",
    "state_code": null,
    "country_code": "CAN",
    "latitude": 45.9636068,
    "longitude": -66.644678}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}