{"name": "Taglocity",
 "permalink": "taglocity",
 "crunchbase_url": "http://www.crunchbase.com/company/taglocity",
 "homepage_url": "http://www.taglocity.com",
 "blog_url": "http://blog.taglocity.com/",
 "blog_feed_url": "http://blog.taglocity.com/",
 "twitter_username": "taglocity",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 1,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "email-productivity, email-overload, knowledge-sharing, knowledge-harvest, enterprise2-0",
 "alias_list": "",
 "email_address": "dave.towert@taglocity.com",
 "phone_number": "604.909.3499",
 "description": "",
 "created_at": "Sat Sep 06 14:30:45 UTC 2008",
 "updated_at": "Thu Apr 04 07:10:09 UTC 2013",
 "overview": "\u003Cp\u003ETaglocity 2.0 for Outlook is a free, non-disruptive email management add-in for Microsoft Outlook 2003/2007. Essentially, it puts the best features of Google Gmail and much more into the most popular email management client used in business today. \u003C/p\u003E\n\n\u003Cp\u003ETaglocity 2.0 for Outlook enables users to assign unlimited keyword tags\u009d to any MS Outlook items such as email, contacts, calendar entries, etc. This helps create an organizational system better adapted to business use.  For instance, instead of forcing content into conventional folder structures that are far too rigid and often redundant or ambiguous,  each tag essentially acts as a virtual folder, thus reducing the need for folder hierarchies altogether. So instead of making copies of an email to put in several different folders, users can simply set multiple tags on the original message and later, can quickly find that email with dynamic filtering or a simple tag search. \u003C/p\u003E\n\n\u003Cp\u003ETags also provide additional context to keyword searches which improves the relevancy of search results.  With Taglocity intelligent search pruning feature, users spend less time wading through huge volumes of keyword generated search results to quickly find what they are looking for.\u003C/p\u003E\n\n\u003Cp\u003ETo help improve organizational efficiency, Taglocity can also automate common tasks by running actions when tags are set, such as turning email into appointments or tasks, assigning additional tags, or simply moving messages into specified folders.  Tags can be automatically assigned to incoming email based on user specified criteria such as who the message is from, or containing certain words in the message body, etc.  \u003C/p\u003E\n\n\u003Cp\u003ETaglocity tags are either private or public.  Public tags travel with messages to extend the benefit of tagging to others and also round trip so that reply messages come back pre-tagged, even if the other recipients are not Taglocity users.   Another time saving feature with Taglocity is tag bundling.  Tags that are commonly used together are presented as suggestions so that multiple tags can be assigned with a single click or keystroke.\u003C/p\u003E\n\n\u003Cp\u003ETaglocity 2.0 for Outlook also delivers another popular Gmail feature to Outlook: proper conversation viewing.  A single mouse click brings up all related emails in a single viewer in chronological order similar to a blog. Attachment handling with Taglocity 2.0 for Outlook is more contact-centric than before, and attachments are also much easier to find.\u003C/p\u003E\n\n\u003Cp\u003ETaglocity Groups\nTaglocity Groups is an online (or intranet-based) secure repository where email can be posted for others to see and collaborate on  (think del.icio.us but for your teams email).\u003C/p\u003E\n\n\u003Cp\u003ETaglocity Groups serves two main purposes:  minimize email overload by significantly reducing inbox bloating office spam (Reply All abuse and needless CCs); and reveal and share valuable business information which is typically locked up on the desktops of authors and original recipients.  Group members voluntarily publish email to their Taglocity Groups with any email client, and can then access shared group emails from any Web browser or directly with Taglocity 2.0 for Outlook. To join the free public Taglocity Groups beta, visit https://groups.taglocity.com/Login/CreateAccount.aspx.  \u003C/p\u003E\n\n\u003Cp\u003EAlso soon to come, a Taglocity client that works with Gmail/Yahoo and Live/Hotmail.\u003C/p\u003E\n\n\u003Cp\u003ETo sum it up, Taglocity 2.0 is an Enterprise Web 2.0 inspired email productivity and knowledge sharig solution for enterprises. It really is simple-to-use yet very powerful - and its enthusiastically adopted by users because it provides personal value and works within an environment they already use every day.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0002/4808/24808v4-max-150x150.png"],
     [[188,
       38],
      "assets/images/resized/0002/4808/24808v4-max-250x250.png"],
     [[188,
       38],
      "assets/images/resized/0002/4808/24808v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President \u0026 CEO",
    "person":
     {"first_name": "Dave",
      "last_name": "Towert",
      "permalink": "dave-towert",
      "image": null}},
   {"is_past": false,
    "title": "CTO \u0026 Co-founder",
    "person":
     {"first_name": "David",
      "last_name": "Ing",
      "permalink": "david-ing",
      "image":
       {"available_sizes":
         [[[100,
            100],
           "assets/images/resized/0026/5078/265078v1-max-150x150.jpg"],
          [[100,
            100],
           "assets/images/resized/0026/5078/265078v1-max-250x250.jpg"],
          [[100,
            100],
           "assets/images/resized/0026/5078/265078v1-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$1.2M",
 "funding_rounds":
  [{"round_code": "angel",
    "source_url": "http://www.prleap.com/pr/65942/",
    "source_description": "Terazen Acquires Taglocity to Deliver Revolutionary Email Tagging Solution",
    "raised_amount": 1200000.0,
    "raised_currency_code": "USD",
    "funded_year": 2007,
    "funded_month": 1,
    "funded_day": 10,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "425 Carrall Street,",
    "address2": "Suite 220",
    "zip_code": "V6B 6E3",
    "city": "Vancouver",
    "state_code": null,
    "country_code": "CAN",
    "latitude": 49.2812342,
    "longitude": -123.1043395}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}