{"name": "Taiba Exim",
 "permalink": "taiba-exim",
 "crunchbase_url": "http://www.crunchbase.com/company/taiba-exim",
 "homepage_url": "http://www.indiamart.com/taibaexim/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "taibaexim@tradepassport.org",
 "phone_number": "9415077798",
 "description": "manufacturer, exporter, distributor",
 "created_at": "Thu Apr 04 13:42:07 UTC 2013",
 "updated_at": "Thu Apr 04 13:42:10 UTC 2013",
 "overview": "\u003Cp\u003ESince our establishment is in year 2009, we, “Taiba Exim”, are a prominent organization engaged in manufacturing, suppling, wholesaling and trading Leather Products. Our offered leather products are highly acknowledged in the market for their qualitative attributes like excellent stitching, glossy finish, tear resistance, less maintenance, elegant look, beautiful designs, eye-catching patterns and vibrant colors.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\n    Designers\n    Quality analysts\n    Warehousing \u0026amp; packaging experts\n    Administration staff\n    Sales \u0026amp; marketing personnel\n    Skilled and semi-skilled workers\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nQuality being a main concern for our organization, we lay special emphasis on the quality, while offering an impeccable range of Leather Products. The raw material like leather and other basic things used in developing these leather products are sourced from accredited vendors of the industry. Further, we also ensure that the leather products offered by us are developed in strict adherence with the international standards of quality.\u003C/p\u003E\n\n\u003Cp\u003EOur Reliable Resources:\nSupported by a ultra-modern infrastructure facility at our premises, we are able to offer our clients with a reliable range of Leather Products. The infrastructure constructed by us is well installed with sophisticated machinery like wire cutting machines, turning machines, thickness charting machines and polishing machines, which are operated by our diligent team of professionals.\u003C/p\u003E\n\n\u003Cp\u003EWarehousing and Packaging:\nSince inception, we are engaged in manufacturing a wide range of Leather Products, which are known to be fragile in nature. To avoid any damage to our products, we have constructed a spacious warehousing unit at our infrastructure, which is segregated in a effective manner. \u003C/p\u003E\n\n\u003Cp\u003ECustomization:\nBeing a client-oriented company, we strive to offer customized range of Leather Products to meet the specific demands of our clients. By following customization policy, we offer customization on various specifications like buckles, sizes of shoes, lengths and designs. Based on these parameters, we customize our leather products that meet the discerning expectations of our clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7933/247933v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7933/247933v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/7933/247933v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}