{"name": "TaiyoPet Products",
 "permalink": "taiyopet-products",
 "crunchbase_url": "http://www.crunchbase.com/company/taiyopet-products",
 "homepage_url": "http://www.indiamart.com/taiyopetproducts/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "pet-foods, pet-cages, pet-accessories, fish-tanks, aquarium-filters, aquarium-accessories-and-aquarium-flakes-",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "supplier and wholesaler of Aquarium ,",
 "created_at": "Fri Apr 05 07:52:03 UTC 2013",
 "updated_at": "Fri Apr 05 07:52:13 UTC 2013",
 "overview": "\u003Cp\u003EFormed in the year 1996 as a private limited company, Taiyo Pet Products Pvt. Ltd has established itself as a leading name in the industry engaged in importing, supplying and wholesaling of Aquarium Fish, Pet Dogs, Pet Cats, Pet Hamsters and Pet Birds. In addition to this, we also engaged in manufacturing, supplying, importing, distributing and wholesaling of Pet Foods, Pet Cages, Pet Accessories, Fish Tanks, Aquarium Filters, Aquarium Accessories and Aquarium Flakes. We have grown as a company supplying high quality products at market competitive prices.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nInfrastructure really spurs the productivity with the latest and sophisticated machines enabling higher productivity. The infrastructure has really helped us to create a wider market base of ourselves. We base our operations within a sound infrastructure that includes latest technologies and machinery used to produce highest quality of products.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nQuality has always been one of the strong fortes in our production process. To further educate our people we constantly engage them on certain platforms where in they interact with industry stalwarts and sharpen their base. This not only helps them to work with finesse, at the same time create a healthy image in the mind of clients.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe constantly work towards achieving the highest level of client satisfaction. During the production process, the client role is very important, that helps them to have their say. Based on their input and our technical expertise we combine together to excel with our products. This helps us to deliver truly customized products that can be a delight for the clients.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are a consumer centered organization, therefore it becomes our major responsibility to render them utmost satisfaction with the most effective of our endeavors moreover as ability. Therefore, we tend to source our variety from certified and most trustworthy vendors of business. By physical phenomenon demanding choice procedure, we\u0026#8217;ve chosen our vendors. They\u0026#8217;re hand-picked on the premise of their market expertise, money stability \u0026amp; timely delivery schedule.\u003C/p\u003E\n\n\u003Cp\u003EOur Product Range:\nPet Foods, Pet Cages, Pet Accessories, Fish Tanks, Aquarium Filters, Aquarium Accessories and Aquarium Flakes.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/8404/248404v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/8404/248404v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/8404/248404v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}