{"name": "Take MY Journey",
 "permalink": "take-my-journey",
 "crunchbase_url": "http://www.crunchbase.com/company/take-my-journey",
 "homepage_url": "http://www.takemyjourney.com",
 "blog_url": "http://www.takemyjourney.com",
 "blog_feed_url": "http://www.takemyjourney.com",
 "twitter_username": "takemyjourney1",
 "category_code": "other",
 "number_of_employees": 1,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "experience, journey, life",
 "alias_list": null,
 "email_address": "scott@takemyjourney.com",
 "phone_number": "",
 "description": "user based experience ",
 "created_at": "Thu Dec 29 04:41:09 UTC 2011",
 "updated_at": "Fri Dec 30 01:25:47 UTC 2011",
 "overview": "\u003Cp\u003ETakeMyJourney.com aims to build an online community for sharing life experiences. For making a long journey, or to tell others about your academic choices, this site may be inspiring for others by reading your experiences. Or also, you might find inspiration by reading about how some people acted about a certain issue.\nNormally, we read about experiences of people who became famous because of it and published a book telling the experience. A sport achievement, such as climbing Mount Everest in record time, or a scientific discovery which changed our lives since then, will make it to many books. Of course, the latest of these kinds of cases is the late Steve Job’s Biography by Walter Isaacson. Certainly we will be inspired by his wonderful achievements in the face of so much adversity since he was a baby.\nBut maybe people not so famous have been wise enough to make very good decisions or learn from some experience that meant very much for them and could mean very much for someone who comes after them. So TakeMyJourney.com asks users to write down their gained knowledge, their thoughts or their choices about particular topics, so that they are available for the rest of us.\nSuccess is not everything, though. Sometimes we all learn from our own mistakes hard but necessary lessons, and this is also good. So at Take My Journey you can tell others what you did wrong and why you think it was wrong. If you are on some crossroad about anything, you might get the chance to read why some choice you were thinking to take was not good for the person who wrote on the site.\nThe page is well organized with a menu to choose among many different categories which go from “Architecturee” to “Marketing” or “Spiritual”.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [{"description": "Now have reached over 45 countries in visits!",
    "stoned_year": 2011,
    "stoned_month": 12,
    "stoned_day": 29,
    "source_url": "http://takemyjourney.com/forum-added-out-visits-45-countries/",
    "source_text": null,
    "source_description": "New Forum Added- Just reached over 45 countries",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Take MY Journey",
      "permalink": "take-my-journey"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0016/8122/168122v2-max-150x150.png"],
      [[250,
        156],
       "assets/images/resized/0016/8122/168122v2-max-250x250.png"],
      [[450,
        281],
       "assets/images/resized/0016/8122/168122v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}