{"name": "TalkAide",
 "permalink": "talkaide",
 "crunchbase_url": "http://www.crunchbase.com/company/talkaide",
 "homepage_url": "http://www.talkaide.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2000,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "support@talkaide.com",
 "phone_number": "+1 408 228 4945",
 "description": "Call Recorder for Skype",
 "created_at": "Fri Mar 11 19:07:15 UTC 2011",
 "updated_at": "Sat Mar 19 04:36:42 UTC 2011",
 "overview": "\u003Cp\u003ETalkAide company specializes in the production and distribution of Mac software and technologies. TalkAide has developed the recording software for Skype which is a perfect for private and business usage. TalkAide for Skype turns from an ordinary recording tool into an appreciable application in everyday life and reliable software at work. \u003C/p\u003E\n\n\u003Cp\u003EThe importance of a reliable call recorder is obvious. Our developers have worked out an ideal tool to save audio and video Skype sessions. The list of spheres our customers have succesfully used TalkAide for Skype is endless. Engaged with all necessary features, it will be an excellent choice for those who deal with all sorts of negotiations in a real time. That means that journalists, office-workers, doctors participating in online video conferencing, students studying on-line will benefit from this powerful software. \u003C/p\u003E\n\n\u003Cp\u003EHowever, the demand on our software is closely connected not only with the wide range of possibilities but also with the excellent quality of this call recorder. We realise that the high quality should be provided not only during the recorded process but also during the conversion. That is why TalkAide for Skype is engaged with in-built flawless converter that launches its work as soon as the Skype session is over. Unique features and various settings embedded into TalkAide for Skype give an option to regulate the sound quality and video image manually. With the ability to adjust parameters at will, our customers will enjoy watching or listening to the recorded files without any noises, but with high sound quality and excellent resolution. \u003C/p\u003E\n\n\u003Cp\u003ETalkAide for Skype is designed as a reliable Skype recorder that saves all important details during the online communication. Functionality and convenience of work with the program are one of the main priorities for TalkAid production. That is why TalkAide for Skype is engaged with the intuitive and friendly interface and the ability to save Skype conversations by default. \u003C/p\u003E\n\n\u003Cp\u003ETherefore the strategy of TalkAide company is to improve the quality and features of our software, attract new customers, increase productivity, to make the software available for customers, and come to be more high speed development oriented. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[85,
       150],
      "assets/images/resized/0012/5959/125959v2-max-150x150.png"],
     [[141,
       250],
      "assets/images/resized/0012/5959/125959v2-max-250x250.png"],
     [[195,
       344],
      "assets/images/resized/0012/5959/125959v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "PR Manager",
    "person":
     {"first_name": "Valentina",
      "last_name": "Vysotina",
      "permalink": "valentina-vysotina",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}