{"name": "Taswiq On Line",
 "permalink": "taswiq-on-line",
 "crunchbase_url": "http://www.crunchbase.com/company/taswiq-on-line",
 "homepage_url": "http://www.TaswiqOnline.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Taswiqonline",
 "category_code": "network_hosting",
 "number_of_employees": 15,
 "founded_year": 2010,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "website, website-design, website-development, emarketing, web-site-hosting, hosting, facebook-ads, google-ads",
 "alias_list": null,
 "email_address": "Sales@taswiqonline.com",
 "phone_number": "22449660",
 "description": "websites designing,  hosting, developing",
 "created_at": "Sat Mar 09 21:24:29 UTC 2013",
 "updated_at": "Sat Mar 09 21:24:35 UTC 2013",
 "overview": "\u003Cp\u003ETaswiqOnline is more than a name, it is a way of thinking, in Arabic it means that which is in union. And that is our goal, to unify your requirements with that of your potential client\u0026#8217;s needs online. \u003C/p\u003E\n\n\u003Cp\u003EOur team lead by Hussein Ahmed has created and operated some of the largest web sites in the Middle East, our knowledge of technology is deep and driven by passion, a passion to technology. But we do not offer you technology we offer you a return on your investment, we will work with you to find out what is the best solution for you, we will focus not only on technology but on innovative and often viral ways to market and sell your products and services using the Internet as an extension to your business. \u003C/p\u003E\n\n\u003Cp\u003EOur open source Internet technology will save you cost and effort and will allow you to provide your clients and prospective clients with a deeper and more engaging interactive experience. We will help you use this new and wonderful communication medium to its full potential for your organization. \u003C/p\u003E\n\n\u003Cp\u003EAt Taswiqonline, we try to merge your goals with that of your customers by using systems and design with a clear objective of reaching your business goals. This unity of your goals, your client\u0026#8217;s goals is our main objective at Taswiq On Online , hence our name.\u003C/p\u003E\n\n\u003Cp\u003ETaswiqOnline Web (www.TaswiqOnLine.com), is a full service web site design, content and Internet technologies agency. The pride of the agency is the general interest Arabic language portal kzameza.com (www.KzaMeza.com) which is fully owned by Taswiqonline Web. Taswiqonline also designed, developed and operates www.aqaratretaj.com The services of Taswiqonline include web site design and development, implementation of content management systems and CRM systems as well as new media centric services like photography, video clip production, copy writing, server management and more.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[100,
       100],
      "assets/images/resized/0024/1303/241303v2-max-150x150.jpg"],
     [[100,
       100],
      "assets/images/resized/0024/1303/241303v2-max-250x250.jpg"],
     [[100,
       100],
      "assets/images/resized/0024/1303/241303v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}