{"name": "Taurus Engineering",
 "permalink": "taurus-engineering",
 "crunchbase_url": "http://www.crunchbase.com/company/taurus-engineering",
 "homepage_url": "http://www.indiamart.com/taurusengineering/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "micro-brewery-equipment, mini-brewery-equipment-and-pub-breweries-",
 "alias_list": null,
 "email_address": "taurusengineering@tradepassport.org",
 "phone_number": "9535200002",
 "description": "Manufacturing and supplying of Brewery,",
 "created_at": "Thu Apr 04 12:45:01 UTC 2013",
 "updated_at": "Thu Apr 04 12:45:04 UTC 2013",
 "overview": "\u003Cp\u003ETaurus Engineering was formed as a Partnership firm in Bengaluru, Karnataka, India. We are primarily engaged in manufacturing and supplying Brewery Equipment, Large Scale Industrial Breweries, Micro Brewery Equipment, Mini Brewery Equipment and Pub Breweries. We are also an esteemed Service Provider of Brewery Expansions, Up Gradations \u0026amp; Automations. The idea of starting Brewery manufacturing equipment came into the mind after observing the dearth of quality equipments in the Brewery production units. Beer today is an important beverage in Indian market and the quality of beer depends solely on the brewing process. Breweries and equipment manufactured at our unit ensure the clients to provide best quality beverage in the market. Our team of professionals is working hard to ensure manufacturing of excellent equipments which help our clients to enhance their business activities.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nInfrastructure is the backbone of any manufacturing unit. We are proud to have a robust infrastructure which caters to the need of our entire workforce. We are equipped with the best quality machines which assist in manufacturing process. The entire manufacturing unit is subdivided into various units which ensure accountability and quality production. Our entire unit is equipped with all the modern facilities which help the workforce to give their best.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur complete unit works as a team. Our employees are qualified enough to understand the needs of manufacturing and they put all their skills to ensure quality. Our entire workforce puts its efforts to deliver as per the requirements of the clients. The vast experience enhances the quality production of equipments which get applauded at the client’s end.\u003C/p\u003E\n\n\u003Cp\u003EQuality:\nOur company is a quality centric organization. We put in hard efforts to provide best quality products to our clients. The efforts to ensure quality starts from raw material for manufacturing, which is procured form reliable sources and get tested at various levels. Our quality control team monitors the quality check at every stage of manufacturing to ensure the flawless machines and equipments are manufactured.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nWe are primarily engaged in manufacturing and supplying Brewery Equipment, Large Scale Industrial Breweries, Micro Brewery Equipment, Mini Brewery Equipment and Pub Breweries. We are also an esteemed Service Provider of Brewery Expansions, Up Gradations \u0026amp; Automations.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       91],
      "assets/images/resized/0024/7907/247907v2-max-150x150.jpg"],
     [[250,
       152],
      "assets/images/resized/0024/7907/247907v2-max-250x250.jpg"],
     [[450,
       274],
      "assets/images/resized/0024/7907/247907v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}