{"name": "Taxi Driving Jobs UK",
 "permalink": "taxi-driving-jobs-uk",
 "crunchbase_url": "http://www.crunchbase.com/company/taxi-driving-jobs-uk",
 "homepage_url": "http://www.taxidrivingjobs.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2013,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "taxi, driving, jobs, telephonist, receptionist, administration, dispatcher, switchboard, regional, national, taxi-licensing",
 "alias_list": null,
 "email_address": "info@taxidrivingjobs.co.uk",
 "phone_number": "+44 (0)208 123 3373",
 "description": "Taxi Driver Jobs site",
 "created_at": "Tue May 14 10:04:19 UTC 2013",
 "updated_at": "Wed May 15 13:31:43 UTC 2013",
 "overview": "\u003Cp\u003EThe UK\u0026#8217;s first website dedicated to taxi driver and office staff recruitment. Link directly to your council for Hackney and Private Hire application forms.\u003C/p\u003E\n\n\u003Cp\u003ETAXI DRIVING JOBS UK was established to provide a professional, honest, effective and solutions-driven service to candidates and clients who operate within the taxi and private hire industry.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to be recognised as the informed choice of the taxi company recruitment community, influencing decisions today for the benefit of the industry tomorrow. We do this through offering a broad range of services aimed at informing, guiding and educating potential and existing drivers, office staff and industry suppliers / organisations about the taxi recruitment industry.\u003C/p\u003E\n\n\u003Cp\u003EA unique and quality driven service to suit every need in the taxi industry. To our advantage you are visiting the UK’s first website solely dedicated to taxi driver and office staff recruitment. Direct experience within this sector for a large company in the Southeast revealed a need in the market place for a tailored solution to recruitment needs. The ability to relate and understand the needs of the client has contributed greatly to the design and coverage of this site.\u003C/p\u003E\n\n\u003Cp\u003EThe unprecedented blend of growth, experience, corporate and private ownership in the UK has seen the industry soar. We aim to ensure this growth continues with a ONE-STOP-SHOP approach to the industry recruitment services. Our services are available to Hackney Carriage, Private Hire and Chauffeur driven limousine companies. While the industry is encouraging and moving forward by embracing technology, we emphasise the continued need for good old fashioned personalised service as this remains the top business winner.\u003C/p\u003E\n\n\u003Cp\u003EThis resource is to serve the ever growing needs of the taxi industry throughout the UK. Companies are not only set up to service a need, but to provide an income to company owner and drivers alike, in essence every taxi company wants to grow. How it works; using pre-determined fields, the employer fills out their particular requirements with an option for the applicant to upload a resume directly to them. A driver can browse the site to his desired region/s, seek available positions and apply online or upload a resume to a chosen company. You can link directly to your chosen council\u0026#8217;s taxi licensing department/officers and download the forms you require.\u003C/p\u003E\n\n\u003Cp\u003ECOMPANY SUCCESS: *Your call centre will make or break your business *Remember the customer has choices *Consider uniformed drivers as is not only cost effective but a guaranteed contract winner *Screen your drivers efficiently as they are the FACE of your company *Embrace technology or be left behind *Remember contracts are won by integrity, honesty, determination, tenacity and willingness to be competitive.\u003C/p\u003E\n\n\u003Cp\u003EDRIVER SUCCESS: *Honesty *Integrity *Reliability *Caring and cheerful personality *Respectful *Personal presentation *Up to date documentation *Knowledge of area of work *Ability to deal with confrontation diplomatically *Your car is your office, keep it clean *Remember the customer does have choices *Be diligent but responsible *Have good reason for refusing jobs, bread and butter jobs make up the takings.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       31],
      "assets/images/resized/0026/2082/262082v2-max-150x150.jpg"],
     [[250,
       52],
      "assets/images/resized/0026/2082/262082v2-max-250x250.jpg"],
     [[400,
       84],
      "assets/images/resized/0026/2082/262082v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Owner / Manager",
    "person":
     {"first_name": "Ricky",
      "last_name": "AUDAIN",
      "permalink": "ricky-audain",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "London",
    "address1": "Unit 8236",
    "address2": "P.O. Box 6945",
    "zip_code": "W1A 6US",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.5201867,
    "longitude": -0.135827}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        55],
       "assets/images/resized/0026/2081/262081v2-max-150x150.png"],
      [[250,
        92],
       "assets/images/resized/0026/2081/262081v2-max-250x250.png"],
      [[450,
        166],
       "assets/images/resized/0026/2081/262081v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}