{"name": "TCM Exim",
 "permalink": "tcm-exim",
 "crunchbase_url": "http://www.crunchbase.com/company/tcm-exim",
 "homepage_url": "http://www.indiamart.com/tcmexim/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "tcmexim@tradepassport.org",
 "phone_number": "08377801273",
 "description": "",
 "created_at": "Fri Apr 05 16:05:33 UTC 2013",
 "updated_at": "Fri Apr 05 16:05:38 UTC 2013",
 "overview": "\u003Cp\u003ETCM Exim Pvt. Ltd., is the leading industrial solution provider in India, specialized in Press Accessories, Press Automation Systems, Factory Automation Spares, Auto Brazing \u0026amp; Ultrasonic Welding Equipment etc. TCM Exim can provide a complete range of Press Accessories like Slide Indicators, Press Dual Solenoid Valves, Rotary Cam Switches, Disk Brake Motors, Hydraulic Over Load Protectors, QDC Systems, Press Tonnage Analyzers, Rotary Couplings, Photo Guards etc.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nWe are associated with some of the most renowned vendors of the industry, which enables us in offering high quality range of Press Accessories, Factory Automation Spares, Welding \u0026amp; Brazing Equipment, Press Automation Systems, Quick Die \u0026amp; Mould Change Systems. \u003C/p\u003E\n\n\u003Cp\u003EResearch and Development:\nWe have a separate research and development wing, which is well equipped with the modern facilities that ensures overall development of the product and as per the emerging market trends. This unit also assist us to add new features to the existing products for enhancing the functionality of our range at client\u0026#8217;s end.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\nAs a client centric organization, our every possible effort is to provide our clients optimum level of satisfaction. We ensure our clients that the products offered by us absolutely flawless and offer efficient performance at users end.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOwing to our client centric approach, we have developed a strong and cordial business relation with our esteemed clients. Our professionals give their best possible efforts to ensure that our clients get utmost satisfaction with our offered product range. \u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\nWe have emerged as a leading Importer, Exporter, Trader and Supplier of superior quality Press Accessories, Factory Automation Spares, Welding \u0026amp; Brazing Equipment, Press Automation Systems etc. Owing to our strong association with some of the major vendors of the market, we are able to fulfill the varied requirements of our valuable clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/8875/248875v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/8875/248875v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/8875/248875v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}