{"name": "Team Tershowski Realtors",
 "permalink": "team-tershowski-realtors",
 "crunchbase_url": "http://www.crunchbase.com/company/team-tershowski-realtors",
 "homepage_url": "http://www.TeamTRealtors.com",
 "blog_url": "http://www.teamtershowski.blogspot.com/",
 "blog_feed_url": "http://www.teamtershowski.blogspot.com/",
 "twitter_username": "TeamTershowski",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 1976,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "for-sale, homes-for-sale, selling-house, mortgage, real-estate, tampa, real-estate-investment, real-estate-in-tampa, florida-real-estate, fl-real-estate, real-estate-fl, buying-a-house, selling-a-house, real-estate-florida, real-estate-for-sale, search-re",
 "alias_list": null,
 "email_address": "Tershowski@TeamTRealtors.com",
 "phone_number": "8139640303",
 "description": "A Team of Realtors who walk you throu",
 "created_at": "Wed Sep 12 00:55:49 UTC 2012",
 "updated_at": "Tue Sep 18 17:06:50 UTC 2012",
 "overview": "\u003Cp\u003ETeam Tershowski is a mother and daughter team which strives to make every client feel as though they are part of the family. The team is deeply founded in their roots stemming from their founder, John Tershowski. John and his wife, Margaret built their business for over 30 years, conducting the business with honesty and integrity.\u003C/p\u003E\n\n\u003Cp\u003EMargaret Tershowski\u003C/p\u003E\n\n\u003Cp\u003EMargaret Tershowski has been a licensed broker associate for over 30 years. She originally began her Real Estate career in Charlotte, North Carolina in 1974. While obtaining her broker associate license, she met John Tershowski. The two had a similar passion for Real Estate, and a strong desire to help other families find houses they could call home. Margaret received her broker’s license in 1976, and shortly after her and John were married.\u003C/p\u003E\n\n\u003Cp\u003ELater the couple then moved to Tampa, Florida in 1977 where they made their home. Utilizing her experience of working in a Title Agency for 5 years, Margaret joined her husband to form their partnership in the Tampa Real Estate industry, the original Team Tershowski. She is still dedicated to the mission of serving homebuyers and homesellers with integrity and honesty and enjoys passing on her knowledge to her daughter, Kaia with whom she has formed the new generation of Team Tershowski.\u003C/p\u003E\n\n\u003Cp\u003EKaia Tershowski\u003C/p\u003E\n\n\u003Cp\u003EKaia Tershowski graduated from the University of Florida with her Bachelors’ in Science in Advertising and Business Administration in 2010, and received her Masters’ in Science in Business Management in May 2011.\u003C/p\u003E\n\n\u003Cp\u003EKaia developed her real estate experience in the Carrollwood area, where she helped Team Tershowski consult clients on buying and selling houses while home from college. She has developed a vast knowledge of the industry, as well as the Tampa Bay area throughout her lifetime and has the skills, knowledge, and determination to help her mother, Margaret, continue J.T.’s legacy.\u003C/p\u003E\n\n\u003Cp\u003ETeam Tershowski is deeply founded in their roots stemming from founder John Tershowski. John and his wife Margaret built their business for over 30 years, conducting the business with honesty and integrity.\u003C/p\u003E\n\n\u003Cp\u003EThis past June 2011, the Tershowski Team lost John after a lengthy battle with cancer. One of his greatest wishes was for his legacy to carry on. He left his mark by mentoring Team Tershowski daily rendering them as accomplished Realtors® in Tampa Bay.  To assist in carrying on his legacy, Team Tershowski is proud to introduce Kaia Tershowski, their daughter, to the team.\u003C/p\u003E\n\n\u003Cp\u003ETeam Tershowski is excited for their new venture into the second generation of their family business within the Tampa Bay area. With John\u0026#8217;s blessing, they are ready to welcome new clients into their extended family by catering to all their Real Estate needs with honesty and integrity.\u003C/p\u003E\n\n\u003Cp\u003EJohn Tershowski\u003C/p\u003E\n\n\u003Cp\u003EJohn Tershowski, better known as J.T., was one of the most honorable, respected, and successful Real Estate agents in the Tampa Bay area. If you had the opportunity for him to serve as your Tampa Bay Realtor®, whether buying or selling, there is no doubt that he delivered the job with the utmost professionalism. By introducing himself as, “J.T. at YOUR Service,” YOU knew that you were dealing with someone who would put you first.\u003C/p\u003E\n\n\u003Cp\u003EJ.T. was born and raised in Ottawa, Illinois. He graduated from Southern Illinois University in Carbondale, IL with a major in biological sciences and a minor in chemistry in 1972, and attended the University of Colorado in Boulder, Colorado for Pharmacy school.\u003C/p\u003E\n\n\u003Cp\u003EHe came to Tampa in 1979, and began building his name from the ground up. When he first came to Tampa, he joined Walk Brewer Realty in 1978, generating a sales volume of $1 million, and left in 1979. He then joined Sun Bay Realty in 1979 with a solid foundation in Real Estate sales and was chosen to represent Sun Bay Corporation in the Sales and Marketing Award Ceremony and the Oscar in sales and marketing. In 1985 Sun Bay joined ERA franchise, achieving 52nd in the nation in ERA.\u003C/p\u003E\n\n\u003Cp\u003EHe then participated in the sale of foreclosed properties for Freedom Federal during their ownership of Sun Bay Corporation. He built a sales volume from 1 million to 7 million before leaving Sunbay Corporation, and increased sales volume to 9.5 in 1993. In 1995, he joined Tam-Bay Realty to broaden his knowledge in the Real Estate profession and increased sales volume from 9.5 million to 15 million. He joined Coldwell Banker in 1995, and was induced into the International Presidents Elite (highest honors) with the top 9% worldwide in sales with Coldwell Banker in 2005.\u003C/p\u003E\n\n\u003Cp\u003EJ.T. lived by treating everyone with fairness, honesty, and respect in all encounters with people, whether it was giving to his community, his family, or in his business transactions. He loved his work, and most of all the people he worked with. He treated everyone as if they were million dollar buyers and sellers, because he truly cared about his customers. Not only was he “YOUR Professional Realtor® (His Commitment to You),” but he was a loving husband and father, and friend to many.\u003C/p\u003E\n\n\u003Cp\u003EJ.T.’s shoes can never be filled, but he passed the torch onto Team Tershowski to be the best real estate professionals in town, and we will deliver.\u003C/p\u003E\n\n\u003Cp\u003E– Our commitment to you!\u003C/p\u003E\n\n\u003Cp\u003EHome Selling Services\nGetting the most money in the least time is the goal of every seller. To accomplish this however takes a skilled and experienced REALTOR®. Many years ago you could place a sign in the yard, a lockbox on the door, and put the house in the MLS and have buyers coming through the doors and making offers left and right. That no longer is the case.\u003C/p\u003E\n\n\u003Cp\u003EThe old ways of marketing a property for sale are obsolete, and the biggest difference between how homeowners advertise their own properties for sale and how Team Tershowski with Coldwell Banker sells properties our marketing strategy. We use every means available to expose properties to the largest global audience of potential buyers.\u003C/p\u003E\n\n\u003Cp\u003EIf you list with Team Tershowski, we expose our listings on several high-traffic websites and search engines, including Yahoo!® Real Estate, FloridaMoves.com, ColdwellBanker.com, Trulia, Zillow®, NYTimes.com, and REALTOR.com®. Over 15 million buyers view our listings daily over 550 websites in search of the properties that fit their needs. If the visitor chooses, they will automatically receive an email when a new property is placed on the market. We have brought buyers and sellers together using our Buyer Watch tool.\u003C/p\u003E\n\n\u003Cp\u003EBringing the most buyers to your front door is critical to us. The more interested buyers, the better the price is for you. Take a look at our websites to see how Team Tershowski with Coldwell Banker Residential Real Estate does it better!\u003C/p\u003E\n\n\u003Cp\u003EIndustry Standard Services\nWe handle the so-called standard services \u0026#8211; open houses, printed materials, market analysis and more \u0026#8211;with uncommon expertise to generate better results for you. Only Team Tershowski with Coldwell Banker\u0026#8217;s reputation and resources can deliver expected services with such impressive results.\u003C/p\u003E\n\n\u003Cp\u003ETeam Tershowski’s Exclusive Services\nGoing beyond basic services, Team Tershowski will create your custom plan, taking your strategy to a higher level by drawing on the wide array of resources and vast worldwide audience of homebuyers onlyTeam Tershowski can deliver. Thousands of buyer inquiries are directed to our sales offices via the Internet and our relocation department. No other company makes it easier to give your home maximum online exposure to over 12 million potential homebuyers every day on 500+ high-traffic Websites.\u003C/p\u003E\n\n\u003Cp\u003EColdwellbanker.com \u0026#8211;The award-winning, nationally advertised Coldwell Banker Online promotes your home on the Internet to a worldwide audience of potential buyers.\nRealtor.com® \u0026#8211;The most visited website on the Internet and the official site of the National Association of Realtors®.\nFloridaMoves.com \u0026#8211; Strongly promoted in Florida, our website offers our statewide property listings, giving potential buyers access to any home, anytime, anywhere.\nWe put our relationships to work for you. Our search for the right buyer doesn’t stop locally. With our online resources and global referral network, we will search worldwide to find the buyer for your home.\u003C/p\u003E\n\n\u003Cp\u003EWe also showcase your property to millions of weekly readers by aggressively advertising in the region’s most widely read newspapers and magazines.\u003C/p\u003E\n\n\u003Cp\u003ECustomized Services\nYour home is unique, and so are your needs. A cookie cutter approach just can’t get you the best results. Instead, Team Tershowski will design a unique plan to market your home \u0026#8211; one that combines a personal wealth of experience, information, ideas, connections and creativity with the powerful resources of Coldwell Banker.\u003C/p\u003E\n\n\u003Cp\u003EWe are one of the TOP Real Estate offices in the Tampa Bay area. Whether we are in a buyer’s market or a seller’s market, each one presents a new set of challenges, opportunities, and obstacles. Having an experienced Real Estate Broker on your side with a staff of experienced Real Estate agents, such as Team Tershowski, is your best ammunition to getting your home sold, as quickly as possible for top dollar.\u003C/p\u003E\n\n\u003Cp\u003EHome Buying Services\u003C/p\u003E\n\n\u003Cp\u003EAlthough there are many good reasons for you to buy a home, wealth building ranks among the top on the list. Buying a home is the best \u0026#8220;accidential investment\u0026#8221; most people can make. However, when done right, home ownership becomes an \u0026#8220;intentional investment\u0026#8221; that builds the foundation for a life not only personal choice, but financial security. Matching that one perfect home to a buyer is not always an easy job, but have confidence, we can do just that. There are several financial reasons to support your decision to buy a home, such as value appreciation, equity buildup, and tax benefits.\u003C/p\u003E\n\n\u003Cp\u003EThe average Real Estate transaction involves many individuals, such as mortgage brokers and underwriters, inspectors, appraisers, bankers, title insurace agents, and as well as your Realtor®.\u003C/p\u003E\n\n\u003Cp\u003EAs your professional Realtors®, we help to educate you about your market, analyze your wants and needs, guide you to the home that fits your criteria, coordinate the work of other needed professionals, negotiate on your behalf, help you complete all the necessary paperwork involved in writing an offer, and be there at closing to answer your questions to make sure everything runs smoothly.\u003C/p\u003E\n\n\u003Cp\u003EWe Are With You Every Step of the Way\u003C/p\u003E\n\n\u003Cp\u003EWhen it’s time to buy your next Florida property, whether it’s a property for you to live in and call “home,” or an income or vacation property that you will use as an investment, Team Tershowski can help! We work with you as your professional Realtors®, focusing on “your” needs and how we can best help you to achieve them. One of the most important decisions in the purchase process is choosing an experienced Realtor® to safeguard your interests. In addition to helping you locate the perfect property, Team Tershowski of\nColdwell Banker offers buyers and sellers years of experience and knowledge to ensure that each Real Estate transaction is a smooth and stress-free as possible. We are with you every step of the way!\u003C/p\u003E\n\n\u003Cp\u003EExpect More, and We Will Deliver!\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Broker Associate",
    "person":
     {"first_name": "Margaret",
      "last_name": "Tershowski",
      "permalink": "margaret-tershowski",
      "image": null}},
   {"is_past": true,
    "title": "Realtor Associate",
    "person":
     {"first_name": "John",
      "last_name": "Tershowski",
      "permalink": "john-tershowski",
      "image": null}},
   {"is_past": true,
    "title": "Realtor Associate",
    "person":
     {"first_name": "Kaia",
      "last_name": "Tershowski",
      "permalink": "kaia-tershowski",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Coldwell Banker",
    "address1": "14502 North Dale Mabry Hwy. Ste. 100",
    "address2": "",
    "zip_code": "33618",
    "city": "Tampa",
    "state_code": "FL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.TeamTRealtors.com",
    "title": "Our Website"},
   {"external_url": "https://twitter.com/teamtershowski",
    "title": "Twitter Page"},
   {"external_url": "http://www.facebook.com/TeamTershowski",
    "title": "Facebook Page"}]}