{"name": "TechScour Systems",
 "permalink": "techscour-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/techscour-systems",
 "homepage_url": "http://www.techscour.com",
 "blog_url": "http://techscour.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "professional-publishing, internet-publishing-system, ask-answer-search",
 "alias_list": null,
 "email_address": "gmaney@techscour.com",
 "phone_number": "(415) 857-4736",
 "description": "Internet Professional Publishing System",
 "created_at": "Wed Jan 02 01:30:08 UTC 2013",
 "updated_at": "Thu Jan 03 05:31:21 UTC 2013",
 "overview": "\u003Cp\u003ETechScour Systems is a private equity funded venture that operates the first feely open Internet answer publishing system for professional, practical, technical, and scientific information of all kinds. \u003C/p\u003E\n\n\u003Cp\u003EThe TechScour Open Publishing System lets managers, professionals, specialists, and technicians easily search and share all the world’s smart useful answers published in plain practical English. These answers are assembled by TechScour’s Total Recall ask-answer search system across all available sources and subjects in order to provide complex solutions for challenging problems. The TechScour Treasury provides a central catalog, contents table, cross-reference, and concordance for all the answers available in the TechScour Open Publishing System.\u003C/p\u003E\n\n\u003Cp\u003ETechScour System’s software products include Answer Modeling, Answer Management, and Answer Machine products for captive or cloud hosted private answer publishing systems. TechScour’s Trustworthy answer assurance system provides multiple levels of answer publishing reliability and reputation management. \u003C/p\u003E\n\n\u003Cp\u003ETechScour Internet English uniquely enables freely open Internet answer publishing, it’s a master editorial framework for international practical English based on a century of highly successful systematic publishing prior art. This contrarian approach to freely open structured Internet information modeling is uniquely simple, smart, and scalable because it always exploits the full publishing and problem solving power of practical English. More than thirty thousand hours of expert editorial research and testing have been completed in order to ensure that TechScour Internet English is a solid and stable foundation for freely open Internet answer sharing and searching. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0022/7596/227596v2-max-150x150.jpg"],
     [[250,
       55],
      "assets/images/resized/0022/7596/227596v2-max-250x250.jpg"],
     [[450,
       100],
      "assets/images/resized/0022/7596/227596v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "TechScour System",
    "address1": "169 11th Street (at Natoma)",
    "address2": "",
    "zip_code": "94103",
    "city": "San Francisco",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.7735338,
    "longitude": -122.4159227}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}