{"name": "Techno Link",
 "permalink": "techno-link",
 "crunchbase_url": "http://www.crunchbase.com/company/techno-link",
 "homepage_url": "http://www.indiamart.com/technolinkconveyorsystems/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "technolinkconveyorsystems@tradepassport.org",
 "phone_number": "91)-(22)-28570853",
 "description": "manufacturing \u0026 exporting ",
 "created_at": "Fri Apr 05 09:15:08 UTC 2013",
 "updated_at": "Fri Apr 05 09:15:13 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1990, we, “Techno Link Conveyor Systems Pvt. Ltd.”, are engaged in manufacturing, supplying and exporting a wide range of Material Handling Conveyors, Rollers, and Valves. The range offered by us includes Z Bucket Conveyors, Apron Conveyors, Slat Conveyors, Roller Conveyors, Twin Screw Conveyors and Stainless Steel Screw Conveyors.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe strive hard to live up to our reputation through offering a quality assured range conveyors to our clients. Abiding by international standards, we make sure to manufacture each conveyor using high-grade raw material, which is sourced from the reliable vendors of the market. Apart from this, we have established a well-equipped quality control unit, which is managed by their respective professionals.\u003C/p\u003E\n\n\u003Cp\u003ETeam of Experts:\nWe a team of highly competent and skilled professionals, which assists us in serving the clients in the most efficient manner. Owing to their years of experience and requisite qualifications, we have been able to provide high quality range of Conveyors, Rollers, Belts and Valves.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructural Facilities:\nLocated in Mumbai, Maharashtra, India, we have developed a manufacturing unit, which is spread across a wide area of 20,000 square feet. This unit plays a very important role in manufacturing our entire range of Conveyors, Rollers, Belts and Valves. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nThe major aim of our organization is develop a long business relationship with our clients by attaining their complete satisfaction. For this, we a superb quality range of conveyors as per their requirements. We also offer these products in various specifications that can also be customized as per the requirements of our clients.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8471/248471v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8471/248471v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8471/248471v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}