{"name": "TechRatna",
 "permalink": "techratna",
 "crunchbase_url": "http://www.crunchbase.com/company/techratna",
 "homepage_url": "http://www.techratna.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 10,
 "founded_year": 2013,
 "founded_month": 4,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "webapp, wesites, e-commerce",
 "alias_list": null,
 "email_address": "info@techratna.com",
 "phone_number": "9028716298",
 "description": "IT Solutions",
 "created_at": "Sun Apr 07 14:08:33 UTC 2013",
 "updated_at": "Mon Apr 08 01:11:56 UTC 2013",
 "overview": "\u003Cp\u003EFrom personal interest websites to high-end commercial applications, TechRatna will create your website design, build your custom application, host your website, and perform search engine optimization to ensure your website is an accurate reflection of your business. \nWe are keenly aware that there are a lot of firms out there with talent. However, what we also know is that our team not only has the talent, but the ability, desire and integrity to become your trusted partner. You see, TechRatna is focused not just on building websites, but about helping clients achieve their goals. We care about your organization\u0026#8217;s success as much as your website, and will do what it takes to help you achieve it.\u003C/p\u003E\n\n\u003Cp\u003EWhile good service is often promised, unfortunately it is rarely delivered, and that is why we have made it our mission to be a company that does what it says. It seems so simple, but, as you can imagine, it makes all the difference. We answer emails promptly, return calls and finish projects on time. We\u0026#8217;ll be honest if we don\u0026#8217;t have the skills to perform a task and remedy errors, rather than make excuses. We have the team and skills to create a site that you will be proud to show off, but our relationship and service are what make us a company that you will love having as a partner.\u003C/p\u003E\n\n\u003Cp\u003ETechRatna was founded in 2013 and is a full-service website design company that specializes in custom web development, search engine optimization (SEO), online marketing social media and e-commerce solutions. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       124],
      "assets/images/resized/0024/9225/249225v2-max-150x150.png"],
     [[250,
       207],
      "assets/images/resized/0024/9225/249225v2-max-250x250.png"],
     [[256,
       212],
      "assets/images/resized/0024/9225/249225v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}