{"name": "Techvensys",
 "permalink": "techvensys",
 "crunchbase_url": "http://www.crunchbase.com/company/techvensys",
 "homepage_url": "http://www.techvensys.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "network_hosting",
 "number_of_employees": 24,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "unlimited-web-hosting, unlimited-web-space, unlimited-bandwidth, cheap-web-hosting, cheapest-reseller-hosting, master-reseller-hosting, best-web-hosting, unlimited-reseller-hosting, affordable-reseller-hosting, web-designing, cheap-affordable-hosting, sha",
 "alias_list": "",
 "email_address": "sales@techvensys.com",
 "phone_number": "9849877668",
 "description": "website hosting service",
 "created_at": "Mon May 11 02:49:22 UTC 2009",
 "updated_at": "Thu Jul 02 18:29:15 UTC 2009",
 "overview": "\u003Cp\u003ETechvensys Web Site hosting Service division is one of the most advantageous hosting platforms in India where state-of-the-art infrastructure meets the most crucial requirements for Web based enhancements that your enterprise cannot do without. Furthermore, we offer cheap/cost-effective Website hosting solutions, while combining high-level expertise with value-added services to propel your business to easy upgrade paths.\u003C/p\u003E\n\n\u003Cp\u003EWe are professionals who have delivered stellar projects to a large number of national and international clients. We service all business sectors at very competitive rates. Our areas of strength are our innovation, out-of-the-box thinking and commitment to quality. With our skillful management team as well as in-house Microsoft Certified web developers, we register a unique name for your organization, and thus open up a new world of web-based clients and services to you.\u003C/p\u003E\n\n\u003Cp\u003EAt Techvensys, we provide our customers with exclusive web hosting services at competitive prices. With our vast experience in web hosting and designing, we try to create an ideal balance between web design and web development of your website. However, many of our existing clients and general customers have asked us the reason behind our economical and low cost services. Essentially, we save costs on server rental, as we have our own servers. By using a large number of servers, we are able to maintain high uptime and are able to provide unlimited web space and bandwidth to our clients, thus resulting in lowered costs. Apart from this, we also save on by avoiding unnecessary large number of employees, unnecessary out going phone calls and expensive office space. As a result, our operational expenses are also low.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       83],
      "assets/images/resized/0004/3633/43633v4-max-150x150.jpg"],
     [[250,
       138],
      "assets/images/resized/0004/3633/43633v4-max-250x250.jpg"],
     [[359,
       199],
      "assets/images/resized/0004/3633/43633v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}