{"name": "TECOM Business Parks",
 "permalink": "tecom-business-parks-2",
 "crunchbase_url": "http://www.crunchbase.com/company/tecom-business-parks-2",
 "homepage_url": "http://www.tecombusinessparks.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "office-space-in-dubai, storage-in-dubai, dubai-properties, company-in-dubai, warehouses-in-dubai, land-in-dubai, retailers-in-dubai",
 "alias_list": null,
 "email_address": "submission@tecombusinessparks.com",
 "phone_number": "009714 - 3911111",
 "description": "Company in Dubai",
 "created_at": "Sat Nov 10 09:40:57 UTC 2012",
 "updated_at": "Wed Nov 14 04:43:37 UTC 2012",
 "overview": "\u003Cp\u003ESet-up your company in Dubai in any of the free zones under TECOM Business Parks (TBP), the leading destination for free zone companies in Dubai. TECOM Business Parks has developed 10.8 million sq.ft of commercial space in Dubai and supported the UAE business set-up of more than 4500 global, regional, and local businesses over the last 10 years in five knowledge-intensive industries: Information \u0026amp; Communication Technology (ICT), Media, Education, Sciences, and Manufacturing \u0026amp; Logistics. TECOM Business Parks (TBP) offers a broad range of commercial space in Dubai that can accommodate the requirements of businesses seeking office space in Dubai ranging from full buildings for large regional headquarters to serviced offices in Dubai for freelancers. TECOM Business Parks (TBP) also offers industry-specific commercial space in Dubai such as studios for film production companies in Dubai and campuses for universities in Dubai, labs in Dubai for companies in the sciences sector, industrial land in Dubai, storage space in Dubai and labour accommodation in Dubai for manufacturing and logistics. TECOM Business Parks’ (TBP) 10 business parks are strategically located with excellent links to major roadways, air and sea ports.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0021/9795/219795v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0021/9795/219795v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0021/9795/219795v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}