{"name": "Tecrea",
 "permalink": "tecrea",
 "crunchbase_url": "http://www.crunchbase.com/company/tecrea",
 "homepage_url": "http://www.tecrea.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "biotech",
 "number_of_employees": 4,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "transfection, plasmid, dna, sirna, rnai, gene-delivery, non-viral-delivery, nanoparticles, stem-cells",
 "alias_list": null,
 "email_address": "info@tecrea.co.uk",
 "phone_number": "",
 "description": "Biotechnology",
 "created_at": "Fri Apr 06 20:37:52 UTC 2012",
 "updated_at": "Wed Apr 11 21:34:58 UTC 2012",
 "overview": "\u003Cp\u003ETecrea Ltd is a UK registered company. We are located within the London Bioscience Innovation Centre (LBIC)\u003C/p\u003E\n\n\u003Cp\u003EWe are a small and independently owned biotechnology company. Our mission is to provide vastly improved cell delivery technology for research and the clinic.  We have developed a line of HappyFect products, which can be used to improve the delivery of a range of molecules into cells, including nucleic acids.   HappyFect  involves nanotechnology, which may sound complicated, but our methods make it easy. We believe strongly that cell delivery technology should be effectively non-toxic to ensure experimental integrity and enable clinical progression.  Tecrea is developing products that are uniquely non-toxic and effective for your transfection applications.\u003C/p\u003E\n\n\u003Cp\u003ETecrea Ltd is involved in basic research that results in transformative technologies for biomedicine.  We focus on creative ways to use nanotechnology to improve cell delivery of reagents and drugs.  We view cell delivery as a central problem in biological research and biomedicine, and improved delivery strategies can enable better application of many reagents and drugs.  By enabling improved delivery, Tecrea Ltd enables scientists to bring forward modern molecular medicines to the clinic. \u003C/p\u003E\n\n\u003Cp\u003ETecrea Ltd\n2 Royal College Street\u2028 London,\u2028 NW1 0NH,\u2028 United Kingdom\nTel: +44 (0) 20 7468 5272  \u2028Fax: +44 (0) 20 7468 5306\ninfo@tecrea.co.uk\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Tecrea Ltd",
    "address1": "2 Royal College Street",
    "address2": "",
    "zip_code": "NW1 0NH",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}