{"name": "TECZONE SYSTEMS  Restaurant POS Systems",
 "permalink": "teczone-systems-restaurant-pos-systems",
 "crunchbase_url": "http://www.crunchbase.com/company/teczone-systems-restaurant-pos-systems",
 "homepage_url": "http://www.teczonesystems.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 5,
 "founded_year": 1979,
 "founded_month": 12,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "restaurant-pos-systems, pos-systems, technical-support, hardware-reseller",
 "alias_list": null,
 "email_address": "tuncob@hotmail.com",
 "phone_number": "(718) 880 - 8036",
 "description": "Restaurant POS Systems",
 "created_at": "Tue Oct 25 14:22:22 UTC 2011",
 "updated_at": "Mon Oct 31 02:58:27 UTC 2011",
 "overview": "\u003Cp\u003ERestaurant POS Systems with Restaurant Point of Sale Software\u003C/p\u003E\n\n\u003Cp\u003EPOS Nation specializes in easy to use, fully customizable Point of Sale Systems and POS Software to meet the needs of any Restaurants. Our Point of Sale Systems and POS Software offerings are by far the most extensive listing of complete POS Systems and options available anywhere.\u003C/p\u003E\n\n\u003Cp\u003ERestaurant Manger provides the table service POS features and flexibility needed to help your establishment realize tremendous benefits.  No matter the type of service you provide, from fine and casual dining to bar service and take-out, Restaurant Manager can help decrease costs, improve efficiencies and increase revenue.\u003C/p\u003E\n\n\u003Cp\u003ESave servers time while meeting customer needs with easy check and item splitting.\nDraw in more customers more frequently with powerful promotion and coupon capabilities.\nTurn more tables and lower wait times by clearing tables as soon as customers leave but before the server has finalized payment with Send to Tabs functionality.\nImprove morale and target high-margin items for additional sales with Employee Contests.\nInstantly add an item from any POS workstation allowing for more accurate reporting and better insight to which specials to repeat with on-the-fly modifiers.\nCut costs with a variety of real-time alerts. Control overtime for example with alerts on employee hours worked.\nTABLE MANAGEMENT\u003C/p\u003E\n\n\u003Cp\u003EEfficient table management is so crucial to the success of dining operations. That\u0026#8217;s why every Restaurant Manager includes table management functionality. That capability can be complimented with an optional reservations module to create a total solution for managing service, waiting lists and reservations.\u003C/p\u003E\n\n\u003Cp\u003EMANAGEMENT REPORTING\u003C/p\u003E\n\n\u003Cp\u003EExtensive reporting and back office capabilities provide you with the information you need to reduce costs and increase profits at your table service establishment. Get information on voids, staff productivity, which menu items are performing well and a wide variety of other important operational information. You can even automate the end of day process and access your reports from anywhere via an internet browser or utilizing our mobility products and services.\u003C/p\u003E\n\n\u003Cp\u003EINVENTORY CONTROL\u003C/p\u003E\n\n\u003Cp\u003EEliminate theft and waste while understanding you consumption patterns with a powerful and robust Inventory Control module. You can also choose to use Restaurant Manager\u0026#8217;s Stock Counter functionality which is a simple and straightforward way to track specific menuand bar items without implementing full-blown inventory control.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}