{"name": "TeklifBorsasi.com   (translation: bidexchange.com)",
 "permalink": "teklifborsasi-com-translation-bidexchange-com",
 "crunchbase_url": "http://www.crunchbase.com/company/teklifborsasi-com-translation-bidexchange-com",
 "homepage_url": "http://www.teklifborsasi.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "TeklifBorsasi",
 "category_code": "other",
 "number_of_employees": 5,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "teklifborsasi-com, teklif, borsa, bidding, tender, service, turkey, internet-in-turkey, turkish-internet-market, turkish-internet-companies, remodelling, dekorasyon, boya, tadilat, badana, construction-in-turkey, construction, insaat, ihale, moda, insaat-",
 "alias_list": null,
 "email_address": "iletisim@teklifborsasi.com",
 "phone_number": "+905336503261",
 "description": "Onlinemarketplace for Service Professio.",
 "created_at": "Sat Dec 04 13:37:36 UTC 2010",
 "updated_at": "Sat Dec 11 08:42:43 UTC 2010",
 "overview": "\u003Cp\u003ETeklifBorsasi.com (translation: bidexchange.com) is an online marketplace in Turkey, where the people can find service professionals either by posting their job and requesting for tenders, or directly from the company profiles which placed in the directory. The professionals in the service industry can quote for the jobs and gain contracts. \u003C/p\u003E\n\n\u003Cp\u003EThe provided services in the TeklifBorsasi.com include remodeling, construction, roofing, painting, architecture, cleaning, babysitter, senior care, event planning, catering, house moving, private teachers, web programmers and all the other professions in the service industry. The services are free for the people who request for tenders. The companies and tradesman pay only a small monthly membership fee to be placed in the directory and to gain contracts by bidding.\u003C/p\u003E\n\n\u003Cp\u003EAfter having the job done, the customers can rate the quality of the job that the company did and write their oppinion. This way, the companies try to sattisfy the customers totaly, because the ratings that they receive are shown nationwide in their profile. The companies that satisfy the customers and receive the best ratings have a great chance to receive a lot of new customers. The advantage for the customers is that they can read the ratings and oppinions what the former customers wrote about the company and find the reliable service professionals.\u003C/p\u003E\n\n\u003Cp\u003ETeklifBorsasi.com was set up in 2010 and growing incredibly fast, just like the turkish internet market does.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       35],
      "assets/images/resized/0011/2851/112851v2-max-150x150.png"],
     [[250,
       58],
      "assets/images/resized/0011/2851/112851v2-max-250x250.png"],
     [[431,
       101],
      "assets/images/resized/0011/2851/112851v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}