{"name": "Tekvista",
 "permalink": "tekvista",
 "crunchbase_url": "http://www.crunchbase.com/company/tekvista",
 "homepage_url": "http://www.tekvista.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "tekvista",
 "category_code": "software",
 "number_of_employees": 38,
 "founded_year": 2006,
 "founded_month": 9,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@tekvista.com",
 "phone_number": "510-565-7717",
 "description": "Technology Point",
 "created_at": "Tue Jun 08 21:32:34 UTC 2010",
 "updated_at": "Thu Jun 10 18:50:46 UTC 2010",
 "overview": "\u003Cp\u003ETekVista was started with the philosophy of honesty in business, showing respect for all people and earning client trust - one client at a time. Today, the world of business information represents the realization of our collective efforts toward improving the future. Held only by the limits of our imagination, the business world is accelerating at an ever-increasing pace. Imagine a better way of doing business, of implementing the perfect software, of refining a practice or business integration, and it can be realized.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to help our clients manage change and transform their businesses through high-quality, cost-effective business information solutions. Our ability to evolve and be flexible to a dynamic business world is the reason why we\u0026#8217;ve been successful for so long. We provide comprehensive, web-enabled, end-to-end services from within our many service offerings.\u003C/p\u003E\n\n\u003Cp\u003EOur industry expertise mainly spans in small business line of products. Due to our broad technology expertise, product life cycle expertise and horizontal business process knowledge, our experience has successfully transcended multiple industries, such as retail, realestate, transportation and healthcare.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}