{"name": "Tenvera",
 "permalink": "tenvera",
 "crunchbase_url": "http://www.crunchbase.com/company/tenvera",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "(615) 224-9300",
 "description": "",
 "created_at": "Thu Feb 24 13:57:07 UTC 2011",
 "updated_at": "Fri Apr 01 01:20:07 UTC 2011",
 "overview": "\u003Cp\u003EBrent Ware and Tim Akers see the rise of bandwidth-eating technology as the basis of a company they believe can hit $1 billion in sales within five years.\nThe pair are set later this month to roll out Tenvera\u0026#8217;s System 5 Technology, which they describe as the first fiber optics system for inside the home. The first prototype house will be operational at the beginning of September in Tollgate Village in Franklin.\nTenvera provides a home or office with fiber throughout, filling the gap left vacant by carriers and other firms. Those companies lay fiber down city streets and up to homes and offices, but not throughout the structure. Inside the home, and occasionally outside, is copper that can\u0026#8217;t handle high-bandwidth applications.\n\u0026#8220;Intuitively, that doesn\u0026#8217;t make sense,\u0026#8221; CEO Ware says.\nEarlier this year, Tenvera lined up $4 million in funding from Clayton Associates, a Franklin-based venture capital firm that has backed companies such as Ardent Health Services, Censis Technologies and HCCA International.\nWith the financial infusion, Ware and Akers are laying the groundwork for a manufacturing firm that can put its products into the thousands of upscale homes built each year. Manufacturing of the system components is taking place locally, in Kentucky, Nevada and in China with its main test bed and laboratory in Franklin.\nWhile fiber optics inside the home wasn\u0026#8217;t a necessity in the past, Tenvera officials believe new technology products and consumer preferences require greater bandwidth that can\u0026#8217;t be serviced by copper wires and coaxial cables that became standard in most homes.\nWare says that only a handful of channels can be played in high definition to televisions in a single home without using compression technology that impairs the quality. Meanwhile video servers are now playing movies and programs to high definition television sets that require fiber-quality bandwidth, creating bottlenecks.\n\u0026#8220;Every time we increase the bandwidth to the users, applications are developed to take up that,\u0026#8221; says David Wise, general manager at ISDN-Net, a Nashville-based company providing Voice over Internet Protocol and connectivity to businesses. \u0026#8220;We\u0026#8217;ve seen it with dial up and broadband and T1 and fiber is going to be the same.\u0026#8221;\nWare and Akers hope to get the product into homes by aligning with home builders who are constructing homes with a value of at least $400,000. In those homes, fiber will be run during construction and set up for end users to easily attach their appliances for running.\n\u0026#8220;It is infinitely cheaper to do it when the walls are open than it come in three years alter and retrofit,\u0026#8221; Chief Operating Officer Akers says\u003C/p\u003E\n\n\u003Cp\u003ERead more: Tenvera bets on bandwidth hunger | Nashville Business Journal \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0012/8274/128274v2-max-150x150.png"],
     [[250,
       65],
      "assets/images/resized/0012/8274/128274v2-max-250x250.png"],
     [[250,
       65],
      "assets/images/resized/0012/8274/128274v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "274 Mallory Station Road ",
    "address2": "",
    "zip_code": "37067",
    "city": "Franklin",
    "state_code": "TN",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}