{"name": "Tesla Computers",
 "permalink": "tesla-computers",
 "crunchbase_url": "http://www.crunchbase.com/company/tesla-computers",
 "homepage_url": "http://teslacomputer.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "hardware",
 "number_of_employees": 8,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "green-computer, eco-friendly, pc, gaming-pc, itx, itx-server, itx-gaming-computer",
 "alias_list": null,
 "email_address": "info@teslacomputer.com",
 "phone_number": "",
 "description": "Green Mini Computers",
 "created_at": "Tue Mar 20 19:43:34 UTC 2012",
 "updated_at": "Tue Aug 28 09:39:24 UTC 2012",
 "overview": "\u003Cp\u003ETesla Computers, LLC produces the most energy- and cost-efficient computers in the United States. We manufacture our machines using eco-friendly, sustainable and ROHS certified components; our products are compact, speedy, and very affordable. We specialize in ITX form factor PC\u0026#8217;s for home and business, eco-friendly micro servers, industrial and digital signage. Tesla Computers is leading the way for PC efficiency.\u003C/p\u003E\n\n\u003Cp\u003EWe offer a model for everyone, from the Tesla Extreme (for entertainment buffs) to the Tesla Eco (for especially Earth-conscious consumers). We offer a customization service for government, businesses and organizations, working with you to build exactly what you need. Though our company is young, our ideas are innovative and we have very big plans.\u003C/p\u003E\n\n\u003Cp\u003EWhy We’re Green\u003C/p\u003E\n\n\u003Cp\u003EThe majority of computers on the market are excessively wasteful, from their production methods and materials to the energy they consume. Tesla computers are different. Our entire company is based on the idea that efficient is better, and that computers can waste less wattage and utilize more earth-friendly components without sacrificing speed, reliability, and affordability.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}