{"name": "The Q2 Group",
 "permalink": "the-q2-group",
 "crunchbase_url": "http://www.crunchbase.com/company/the-q2-group",
 "homepage_url": "http://www.theq2group.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "background-screening, international-background-checks",
 "alias_list": null,
 "email_address": "cgoh@theq2group.com",
 "phone_number": "+65-65360084",
 "description": "",
 "created_at": "Tue Mar 29 08:22:42 UTC 2011",
 "updated_at": "Fri Apr 08 23:51:35 UTC 2011",
 "overview": "\u003Cp\u003EIt was Hong Kong in 2000 when the Q2 team started their first background screening business named Quest Research. As that time there was virtually no background screening in Asia however we knew that it was a major business in the US and that many US multinationals already had substantial operations in Asia. We thought it was only a matter of time before they required their potential employees in Asia to be screened.\u003C/p\u003E\n\n\u003Cp\u003EFive years later we had around 500 people in 10 offices from Australia to Dubai calling up, faxing and visiting employers and universities to verify work histories and qualifications, generating millions of pieces of paper in the process. We sold the business to a listed US screening company in 2005 to concentrate on corporate due diligence, under our new company IntegraScreen.\u003C/p\u003E\n\n\u003Cp\u003EAgain we were able to rapidly grow this into a business screening tens of thousands of companies around the world with offices from Panama to Poland to Peking. In tandem with the IntegraScreen business we had also acquired a stake in Dataflow, a company that specializes in immigration and other specialist background checks for governments and licensing departments in Asia and the Middle East.\u003C/p\u003E\n\n\u003Cp\u003EIn 2008 we were approached by a number of companies interested in buying IntegraScreen. We decided to sell IntegraScreen and began to focus on Dataflow and in creating a number of technology and data platforms which we believe will help rapidly grow the background screening industry internationally.\u003C/p\u003E\n\n\u003Cp\u003EOur work over the past decade with governments and multinationals has led us to uncover many unique public record sources around the world which we have since aggregated into topic-specific areas of concern to our clients which are marketed under the CrossCheckâ„¢ brand. In fact over 500 man years of effort has gone into identifying, collating and then maintaining these systems.\u003C/p\u003E\n\n\u003Cp\u003EWe genuinely believe that Information is the key to a Safer World.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0012/9388/129388v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0012/9388/129388v2-max-250x250.jpg"],
     [[450,
       450],
      "assets/images/resized/0012/9388/129388v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "80 Marine Parade, Parkway Parade, #09-01,",
    "address2": "",
    "zip_code": "449269",
    "city": "Singapore",
    "state_code": null,
    "country_code": "SGP",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}