{"name": "The Ingenesist Project",
 "permalink": "the-ingenesist-project",
 "crunchbase_url": "http://www.crunchbase.com/company/the-ingenesist-project",
 "homepage_url": "http://ingenesist.com",
 "blog_url": "http://ingenesist.com",
 "blog_feed_url": "http://ingenesist.com/feed",
 "twitter_username": "ingenesist",
 "category_code": "consulting",
 "number_of_employees": 2,
 "founded_year": 1994,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "economic-paradigm, innovation-economics, innovation, economy, virtual-currency, rallod, innovation-bank, dan-robles, alternate-financial-system, social-capitalism, social-media, ingenesist",
 "alias_list": null,
 "email_address": "",
 "phone_number": "425 361-8499",
 "description": "Alternate Financial System",
 "created_at": "Thu Dec 17 06:19:52 UTC 2009",
 "updated_at": "Thu Dec 17 19:51:27 UTC 2009",
 "overview": "\u003Cp\u003EThe Ingenesist Project specifies a next economic paradigm; an innovation economy built on a structure of social media.  Yup, sounds like buzz word city but we actually designed a logically flawless construct for what may follow the knowledge economy out of the remnants of the industrial revolution.  It happened before, it will happen again.  \u003C/p\u003E\n\n\u003Cp\u003EOur specialty is to take whatever you have going on and run it through the filters of \u0026#8220;The Next Economic Paradigm; An Innovation Economy Built on a Platform of Social Media\u0026#8221; as specified by The Ingenesist Project. The result is\nalmost certainly a very different perspective.  This perspective is useful\nfor spotting disruption to exploit or evade in your original analysis.\u003C/p\u003E\n\n\u003Cp\u003EIt\u0026#8217;s really quite an effective and flexible add-on to many consulting products.  We are often just as surprised as the client to see what emerges! Our clients include industry leaders in Aerospace, Social Media, Marketing, and Higher Education, Library Sciences, and others.  \u003C/p\u003E\n\n\u003Cp\u003EVisit our site, watch the introductory video, flip through the specification document.  Or give us a call and test our thesis.  You may be very surprised with what you hear. \u003C/p\u003E\n\n\u003Cp\u003EOutside of consulting, we are hopeless idealists and really really think that there is an alternate financial system that can arise with a currency backed by productivity and not debt.  We believe that social capitalism is neither socialism nor capitalism - but something new which includes the biosphere as the biggest capitalist in the economy.  In spite of all the bad news, we are deeply optimistic that there is a much better way to go about traveling in circles on our little spaceship Earth.    \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Main Office",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Seattle",
    "state_code": "WA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}