{"name": "The Pinnacle Group Inc.India",
 "permalink": "the-pinnacle-group-inc-india",
 "crunchbase_url": "http://www.crunchbase.com/company/the-pinnacle-group-inc-india",
 "homepage_url": "http://www.thepinnaclegroup.in",
 "blog_url": "http://blogs.hostnetindia.com/",
 "blog_feed_url": "",
 "twitter_username": "hostnetindia",
 "category_code": "network_hosting",
 "number_of_employees": 50,
 "founded_year": 2007,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@thepinnaclegroup.in",
 "phone_number": "91-141-4113929",
 "description": "Web hosting Company",
 "created_at": "Mon Oct 15 09:20:12 UTC 2012",
 "updated_at": "Tue Oct 23 21:05:06 UTC 2012",
 "overview": "\u003Cp\u003EThe Pinnacle Group Inc.India provide the best solutions and consulting services in Enterprise Storage, Intelligent Networking, Enterprise Security, Secure Messaging and Application Solutions. Our success is centered on our capability to think beyond boundaries. Our ability to resolve customers\u0026#8217; business problems by providing simple and cost effective solutions. And our in-depth delivery approach that is helping over 400 transnational and Indian enterprises achieve their objectives effortlessly: Across various industry segments like Banking \u0026amp; Finance, Telecom, Service Providers, ITES / BPO, Software, Energy and Manufacturing.\u003C/p\u003E\n\n\u003Cp\u003EOrganizations that are dependent on IT to enable \u0026amp; enhance their business, often come across challenges in building responsive IT infrastructure that can adapt to the ever-changing business needs and support business. We at, The Pinnacle Group Inc.India work togther with our customers in overcoming these challenges.\nThe Pinnacle Group Inc.India has established itself as a leading Systems Integrator partner for the Enterprise Customer. Our focus on the Enterprise Customers with Enterprise Class solutions and Delivery Capabilities to cater to the high levels of SLA;s expected in the Enterprise computing space has helped us create a niche for ourselves in the Indian market. The Pinnacle Group Inc.India;s solutions impact the way enterprise information is consolidated, protected and shared seamlessly in a secure way across the organization. The Pinnacle Group Inc.India has a wealth of experience and expertise in integrating leading edge technologies for customers who are spread across vertical domains. Our continued focus on the Enterprise Segment and the computing needs of the Enterprise customers enables us to introduce new technologies into the Indian market ahead of other SI;s there by ensuring that our customers are at the forefront in adopting new technologies to drive scale and efficiencies.\u003C/p\u003E\n\n\u003Cp\u003EThe Pinnacle Group Inc.India believes in working with best of breed technologies to architect superior solutions. Over the years, it has developed an uncanny ability to evaluate and choose right technologies/products that succeed. The company has Strategic Alliances with market leaders, in different technology domains and has an enviable record of having introduced new technologies to the Indian Market.\u003C/p\u003E\n\n\u003Cp\u003EIn line with its strategy of aligning with best of breed technology vendors, The Pinnacle Group Inc.India has partnered with leading technology players in its chosen business space. Some of these relationships include Network Appliance, Hitachi Data Systems, EMC, Veritas (Symantec), Isilon, HP, InMage, Juniper, NetScaler (CITRIX), Fusion IO, Blade Network, Radware, Bluecoat.\u003C/p\u003E\n\n\u003Cp\u003EHaving built strong foundation in core infrastructure, The Pinnacle Group Inc.India has embarked on building productised services to meet the requirement of global markets. Considering huge market opportunity, The Pinnacle Group Inc.India has evolved a larger roadmap to build and deliver consulting practices in the areas of Enterprise Storage, Intelligent Networking, Enterprise Security, Secure Messaging and Application Solutions.\u003C/p\u003E\n\n\u003Cp\u003EOver the years The Pinnacle Group Inc.India has been quick to anticipate customer requirements arising out of handling complex Information management challenges. During 1995, company recognized significance of network attached storage technologies and was quick to offer solutions in the Indian market for data protection and storage consolidation. Consequently content delivery network solutions were added to the portfolio to ensure Information gets shared seamlessly across organization. The Pinnacle Group Inc.India recognized information security as a key business enabler and entered this market during 2000-2001. Currently it provides a whole range of solutions and services built around Information Life cycle. And in 2010, we are among the first SI;s to offer SSD based Storage Solutions as well as Virtualisation solutions at the Core switch level also. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO ",
    "person":
     {"first_name": "Kirk",
      "last_name": "Schreck",
      "permalink": "kirk-schreck",
      "image": null}},
   {"is_past": true,
    "title": "Mr.",
    "person":
     {"first_name": "Vipin",
      "last_name": "Pandey",
      "permalink": "vipin-pandey",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}