{"name": "The Canadian Rx Drugs",
 "permalink": "the-canadian-rx-drugs",
 "crunchbase_url": "http://www.crunchbase.com/company/the-canadian-rx-drugs",
 "homepage_url": "http://the-canadian-r-x-drugs.com/",
 "blog_url": "http://the-canadian-r-x-drugs.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 1991,
 "founded_month": 3,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "viagra, drugs, pharmacy, drugstore, cialis, levitra, generic",
 "alias_list": null,
 "email_address": "mail19@i.ua",
 "phone_number": "+1 (800) 998-7978.",
 "description": "The Canadian Rx Drugs",
 "created_at": "Mon Mar 28 22:28:06 UTC 2011",
 "updated_at": "Tue Apr 05 21:47:21 UTC 2011",
 "overview": "\u003Cp\u003EThe Canadian Rx Drugs has become recognized as one of the leading Online suppliers of pharmaceuticals to customers around the globe. At The Canadian Rx Drugs, our mission is to not only provide the most affordable healthcare products in the world, but to provide advise and guidance to our customers, while offering an easy-to-use and secure shopping environment.\u003C/p\u003E\n\n\u003Cp\u003EWe are also committed to excellence in the area of Customer Support, which explains why so many of our customers have made us their sole Online source for the medications they need. As a customer of The Canadian Rx Drugs, not only will you get the best quality products in the world, but you will also get the best service available on the Internet.\nThe Canadian Rx Drugs got into this busines because of the massive hole that was created when various legislative actions in the US, together with the policies of the largest pharmaceutical companies in the world, virtually assured that Americans would be forced to pay the highest premiums in the world for basic medications.\nAt The Canadian Rx Drugs, we realized immediately that these actions were outrageous and unnecessary. We knew that there were high quality medications available around the world at highly affordable prices and we had ready access to those medications. So, we decided to use our vast connections in the industry to bring needy customers the medications they required, at prices they could afford.\nWe assure you that we are connected with only the most trusted sources for pharmaceuticals in the world. As a result, you will get only the highest quality products available anywhere. At The Canadian Rx Drugs, our products are reasonably priced, so you don\u0026#8217;t have to look any further for a supplier for your medications.\nFor your full privacy and security, The Canadian Rx Drugs\u0026#8217;s order processing system operates over a secure transaction server, insuring that you never have to worry about the security of your personal and/or financial information. Your privacy and payment security are both guaranteed when you become a customer of Meds Leader.\nIt is also important for you to know that our suppliers guarantee full quality control for the medications they produce, in accordance with each medication\u0026#8217;s original formula.\nOur team of pharmacists and physicians focus on providing our customers with expert advice in a wide variety of topics from allergies, to diabetes, to weight loss and sexual performance. The Canadian Rx Drugs only hires the most highly qualified individuals to join our support staff.\nOur dedicated team includes highly respected professionals, who are knowledgeable in this field and capable of suggesting the best health practices to our customers. We closely monitor the quality of our support services and we pride ourselves in offering rapid response times for all inquires and questions.\nJoin The Canadian Rx Drugs today and let us show you what it means to be appreciated and taken care of. Today, we have thousands of satisfied customers around the world, who just like you, were seeking quality, affordable medications from a reputable and secure source. Let\u0026#8217;s work together to build and maintain your good health and wellness!\nWe have become a leader in our field because of our dedication to serving the needs of our customers and our commitment to operating within a strict code of ethics and business practices. We believe in the principal of the customer coming \u0026#8220;first\u0026#8221; and all else is secondary.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       130],
      "assets/images/resized/0012/8157/128157v2-max-150x150.jpg"],
     [[120,
       130],
      "assets/images/resized/0012/8157/128157v2-max-250x250.jpg"],
     [[120,
       130],
      "assets/images/resized/0012/8157/128157v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}