{"name": "The Black Sheep",
 "permalink": "the-black-sheep",
 "crunchbase_url": "http://www.crunchbase.com/company/the-black-sheep",
 "homepage_url": "http://www.theblacksheeponline.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "theblacksheep99",
 "category_code": "public_relations",
 "number_of_employees": 5,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "college, newspaper, media, mobile, humor",
 "alias_list": null,
 "email_address": "jimmy@theblacksheeponline.com",
 "phone_number": "217.390.1747",
 "description": "Revolutionizing College Media",
 "created_at": "Tue Aug 30 16:46:25 UTC 2011",
 "updated_at": "Fri Sep 02 13:13:44 UTC 2011",
 "overview": "\u003Cp\u003EThe Black Sheep is Black Card Media\u0026#8217;s collegiate media source that connect students with local, regional and national advertisers. Formed in three distinct branches, print, online and mobile, The Black Sheep provides painless access to the college demographic.\u003C/p\u003E\n\n\u003Cp\u003ETHE BLACK SHEEP NEWSPAPER\nThe Black Sheep is a print periodical written for students, by students. With a distribution in Fall of 2012 at 20 of the largest markets in the country and a monthly distribution of over 200,000, The Black Sheep is a regular source of entertainment for thousands of students. From magazine-style content to games, contests and prizes, there\u0026#8217;s something in The Black Sheep for every student. For clients looking to engage socially-active 18-25 year-olds, The Black Sheep is an essential tool for raising awareness of new products and services.\u003C/p\u003E\n\n\u003Cp\u003ETHE BLACK SHEEP ONLINE\nWith content found in the print version of The Black Sheep, plus additional web-only content from schools across the country, students are privy to our unique style of comedy whenever and wherever they choose. Clients have sponsorship and banner ads at their disposal on The Black Sheep Online, but be careful, that kind of reach has been known to kill.\u003C/p\u003E\n\n\u003Cp\u003ETHE BLACK SHEEP MOBILE\nIn the age of smartphones, few tech-savvy students spend time away from their easily-pocketed devices. With The Black Sheep Mobile, readers have the ability to consume content, view food and nightlife specials, and share their college experiences with one another like never before. For businesses, we can raise product awareness through push-through advertising and application sponsorship, while remaining on the forefront of a new age of media.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}