{"name": "The Law Offices Of Steven J. Pisani",
 "permalink": "the-law-offices-of-steven-j-pisani",
 "crunchbase_url": "http://www.crunchbase.com/company/the-law-offices-of-steven-j-pisani",
 "homepage_url": "http://www.pisanilaw.com",
 "blog_url": "http://pisanilaw.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "PisaniLaw",
 "category_code": "legal",
 "number_of_employees": 10,
 "founded_year": 2008,
 "founded_month": 2,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dui-lawyer, dwai-attorney, domestic-violence-defense",
 "alias_list": null,
 "email_address": "steven@pisanilaw.com",
 "phone_number": "303-635-6768",
 "description": "Denver DUI Lawyer and DWAI Attorney",
 "created_at": "Wed Mar 13 05:45:26 UTC 2013",
 "updated_at": "Wed May 22 21:17:21 UTC 2013",
 "overview": "\u003Cp\u003EWhether you are facing charges and need the best defense or you are falsely accused and need skilled representation to handle your case involving false arrest, false imprisonment, or similar circumstance, our firm can represent your best interests. We offer the most affordable rates in Denver for criminal representation; most cases can be settled for a flat rate. Our offices are located 1 block from the 16th Street Mall on Welton, near all public transportation. However, if you would like, we do make house-calls and can meet in the privacy and comfort of your own home.\u003C/p\u003E\n\n\u003Cp\u003EIt is very important that you contact a lawyer as quickly as possible when confronted with criminal charges. The sooner you act, the sooner your lawyer can prevent such hardships as: jail time, expensive court fines, a permanent conviction on your record, revocation of probation and possible loss of your driver’s license, student loans, your vehicle or your job.\u003C/p\u003E\n\n\u003Cp\u003EEstablished in 2008 - Criminal Attorney Steve Pisani began his own law firm by providing his services to those less fortunate. The criminal justice system does provide the Public Defender’s office for defendants who cannot afford an attorney and are looking at jail time as a punishment requested by the District Attorney. In some cases, the District Attorney’s specifically tell the court that no jail time will be sought; therefore some defendants were left without any means of defending their name.\u003C/p\u003E\n\n\u003Cp\u003ECriminal Attorney Steve Pisani took these cases and fought for those who would have otherwise been unrepresented. Mr. Pisani has refined his practice and while still a fighter for the downtrodden, also represents all defendants competently and effectively.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/2098/242098v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/2098/242098v2-max-250x250.jpg"],
     [[250,
       250],
      "assets/images/resized/0024/2098/242098v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}