{"name": "The Classical",
 "permalink": "the-classical",
 "crunchbase_url": "http://www.crunchbase.com/company/the-classical",
 "homepage_url": "http://theclassical.org",
 "blog_url": "http://theclassical.org",
 "blog_feed_url": "http://theclassical.org/rss/articles/all",
 "twitter_username": "classical",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sports, the-classical, longform, bethlehem-shoals, eric-freeman, blog",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Longform Sports Website",
 "created_at": "Thu Feb 14 01:13:03 UTC 2013",
 "updated_at": "Fri Feb 15 02:46:12 UTC 2013",
 "overview": "\u003Cp\u003EThe Classical is a sports website featuring long-form sports articles. Described as the sports equivalent of The Awl, the site was launched in December 2011 by several members of the basketball blog FreeDarko, including Bethlehem Shoals and Eric Freeman, and features other writers such as Eric Nusbaum, Tom Scharpling, Tim Marchman and Lang Whitaker.\u003C/p\u003E\n\n\u003Cp\u003EIn August 2011, it was announced that Shoals and others would be launching a sports website featuring a prominent collection of writers that had written for Sports Illustrated, ESPN, The New York Times, The Wall Street Journal, The Nation, Slate, Deadspin, GQ and other publications. A Kickstarter page was established by the site\u0026#8217;s founders, and $50,000 were raised to help maintain the site for its first year. The Classical launched in December 2011.\u003C/p\u003E\n\n\u003Cp\u003EThe site\u0026#8217;s approach to long-form sports writing instantly drew comparisons to Grantland, the ESPN-funded website that had been launched by Bill Simmons the year before.\u003C/p\u003E\n\n\u003Cp\u003EOn the site\u0026#8217;s Kickstarter page, the founders of The Classical wrote that the intention of the site was to create something completely original, stating: \u0026#8220;We will make no attempt to be comprehensive, or even to offer a reliable guide to the world of sport at a given moment. We will not try to be a smarter version of what you can find elsewhere. Instead, The Classical will be a running, wide-ranging conversation between us and our readers about baseball, basketball, soccer, football and fighting, and about things that aren\u0026#8217;t sports, too. Our model in this regard is The Awl, a site for which many of us have written and which all of us love.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003EThe name of the site is in reference to the first track of the 1982 album Hex Enduction Hour, by the English post-punk band The Fall. Pete Beatty, one of the site\u0026#8217;s founders, said the name was appropriate since \u0026#8220;it is probably fair to describe The Classical as post-punk sports journalism.\u0026#8221;\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       146],
      "assets/images/resized/0023/5769/235769v2-max-150x150.png"],
     [[250,
       244],
      "assets/images/resized/0023/5769/235769v2-max-250x250.png"],
     [[300,
       293],
      "assets/images/resized/0023/5769/235769v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}