{"name": "The Tax Club",
 "permalink": "the-tax-club",
 "crunchbase_url": "http://www.crunchbase.com/company/the-tax-club",
 "homepage_url": "http://www.thetaxclub.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "legal",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "tax-consultation, tax-preparation",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Personalized Tax Consultation",
 "created_at": "Tue Mar 30 21:23:46 UTC 2010",
 "updated_at": "Tue Mar 30 23:00:18 UTC 2010",
 "overview": "\u003Cp\u003EThe Tax Club is an innovative, technology driven, financial services firm that specializes in personalized tax plans for the individual and small business owner. We have positioned our firm as a leader in the tax preparation industry because we understand the critical nature of proactive and purposeful client service in addition to providing dedicated small business tax expertise. Our world class Tax Division is located on the 60th floor of the Empire State Building in the heart of  New York City  , the leading financial center in the world.\u003C/p\u003E\n\n\u003Cp\u003EUnlike other tax preparation firms, The Tax Club promotes constant dialogue between the client and the Personal Tax Advisor, without the hefty price tag. For a minimum monthly payment, our clients prosper from a better awareness and an unmatched education. Being able go online at any time for easy access to a bounty of tailored information or to pick up the phone and speak with a Personal Tax Advisor is a commodity we feel is essential to our clients\u0026#8217; success.\u003C/p\u003E\n\n\u003Cp\u003ETo further ensure our place in the industry, we have invested considerable time and money towards the development and implementation of a secure, online Tax Portal, created to dramatically enhance clients\u0026#8217; bookkeeping and documentation experience. With this fully encrypted Tax Portal, our clients can update all of their tax information electronically, so they are organized and within reach.\u003C/p\u003E\n\n\u003Cp\u003EOur clients are given access to our \u0026#8220;Members Only\u0026#8221; website, that is full of continually updated information that is useful both the tax novice and experienced owner. We keep our clients informed of the latest IRS adjustments to the tax codes and provide strategies that help businesses take advantage of these changes. Clients can initiate queries and obtain instant answers to questions that have plagued others in their industry, thus avoiding issues that may have otherwise gone unnoticed.\u003C/p\u003E\n\n\u003Cp\u003EThe Tax Club is finally making professional tax preparation and tax strategies affordable to the small business owner. It\u0026#8217;s the duty of the taxpayer to pay taxes on income generated and it\u0026#8217;s the duty of The Tax Club to make sure you don\u0026#8217;t pay a penny more than is necessary. It\u0026#8217;s our hope that every business owner who utilizes our service obtains a better understanding of the complexities of the tax code so they feel confident about the state of their business. Good business demands great knowledge. Join The Tax Club today to gain the knowledge you deserve.\u003C/p\u003E\n\n\u003Cp\u003ESincerely,\u003C/p\u003E\n\n\u003Cp\u003EThe Tax Club\u003C/p\u003E\n\n\u003Cp\u003EThank you for taking the time to view our presentation. At the Tax Club, we have assisted thousands of small business owners and other self-employed individuals keep more of what they earn. Please enjoy the presentation. If you would like to further discover how we might be able to help you, please take advantage of our free tax consultation, with no risk or obligation on your part.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0008/2459/82459v2-max-150x150.png"],
     [[220,
       58],
      "assets/images/resized/0008/2459/82459v2-max-250x250.png"],
     [[220,
       58],
      "assets/images/resized/0008/2459/82459v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "NY HQ",
    "address1": "350 Fifth Ave",
    "address2": "Suite #6015",
    "zip_code": "10118",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}