{"name": "The English Home Company",
 "permalink": "the-english-home-company",
 "crunchbase_url": "http://www.crunchbase.com/company/the-english-home-company",
 "homepage_url": "http://www.theenglishhomecompany.com/",
 "blog_url": "http://tehcindia.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "TEHC_India",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "the-english-home-company, home-furnishings-india, buy-furniture-online-india, home-furnishing-accessories, indian-wooden-furniture, home-furnishing-manufacturers-india, home-furnishing-exporters",
 "alias_list": null,
 "email_address": "info@theenglishhomecompany.com",
 "phone_number": "0172-4602722",
 "description": "Online Home Furnishing Shopping Store",
 "created_at": "Sat Dec 01 07:06:24 UTC 2012",
 "updated_at": "Wed Dec 12 08:04:14 UTC 2012",
 "overview": "\u003Cp\u003EWe are proud to announce the Launching of The English Home Company (a brand of Homescapes Europa Ltd) in India today.\u003C/p\u003E\n\n\u003Cp\u003EOn the 5th of November 2012, The English Home Company website has gone live. It\u0026#8217;s a historic day for us, as on this day, we have opened our doors to the great emerging Indian market. It\u0026#8217;s our honour and privilege to be one of the earliest British companies in the home furnishings segment to be serving the great people of India.\u003C/p\u003E\n\n\u003Cp\u003EAfter establishing ourselves as a well-respected distance seller of quality home products in the UK and continental Europe, Homescapes has launched its products and services in India under the brand name \u0026#8220;The English Home Company\u0026#8221;. We endeavour to bring the same standards of high quality products and service in India, for which we are well known in the UK.\u003C/p\u003E\n\n\u003Cp\u003EOur association with India is not new, as we have our factories in India for decades. We have been selling to customers worldwide from these factories in addition to our manufacturing in the UK and elsewhere. But it is for the first time, that we are making our products available for consumers in India.\u003C/p\u003E\n\n\u003Cp\u003EOur products are popular in the western markets, but they are also perfect for the Indian consumer. Through the interesting blend of history, language, globalisation and the internet, the meaning of fashion has changed completely. Our products have become even more relevant for the Indian household in the present context. In addition to our own house brands, we shall also be bringing popular British brands in the Home segment for India.\u003C/p\u003E\n\n\u003Cp\u003EThe orders will be fulfilled from our three fulfillment centres in India or directly from the European distribution centre in the UK.\u003C/p\u003E\n\n\u003Cp\u003EThe English Home Company, has very exciting plans of bringing high quality bed linen, soft furnishings and furniture into your bedroom, bathroom living and dining rooms. The concept of well-coordinated interiors will be addressed and built upon.\u003C/p\u003E\n\n\u003Cp\u003EThrough a simple message of consistent good quality and ethical service, we wish to win hearts in India. The English Home Company has come home to India….\u003C/p\u003E\n\n\u003Cp\u003EFor more information, please visit: http://www.theenglishhomecompany.com\u003C/p\u003E\n\n\u003Cp\u003EJai Hind!\u003C/p\u003E\n\n\u003Cp\u003EVikram Avasthi\u003C/p\u003E\n\n\u003Cp\u003EManaging Director\u003C/p\u003E\n\n\u003Cp\u003EHomescapes Europa Ltd.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "GLOBAL HQ",
    "address1": "HOMESCAPES EUROPA LTD. ",
    "address2": "ROBINS BUSINESS PARK, BAGNALL STREET",
    "zip_code": "DY4 7BS",
    "city": "GREAT BRIDGE, TIPTON, WEST MIDLANDS",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 52.5300143,
    "longitude": -2.0326837}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.1888pressrelease.com/homescapes-launched-as-the-english-home-company-in-india-pr-436866.html",
    "title": "Homescapes Launched as \"The English Home Company\" in India"}]}