{"name": "The Tradefinder",
 "permalink": "the-tradefinder",
 "crunchbase_url": "http://www.crunchbase.com/company/the-tradefinder",
 "homepage_url": "http://www.thetradefinder.co.uk",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "the-tradefinder, business-directory, online-business-directory, uk-business-directory",
 "alias_list": null,
 "email_address": "info@uniteldirect.co.uk",
 "phone_number": "08447 451111",
 "description": "Business Directory",
 "created_at": "Sat Jul 16 06:34:24 UTC 2011",
 "updated_at": "Mon Jul 18 18:37:45 UTC 2011",
 "overview": "\u003Cp\u003EThe Tradefinder is one of the most cherished, respected and looked up to business directories in the UK. It is one of the longest running internet businesses, and has been instrumental in helping online ventures grow and expand business operations on the internet over the years. Its basic operational structure, since times immemorial, has been to facilitate the search of any services provider sought by businesses. \u003C/p\u003E\n\n\u003Cp\u003ESo vast is the business directory that a search on any type of business can be taken towards fruition. Businesses can search for anything ranging from contractors to retailers, mill workers to dry cleaners and others as well. The Tradefinder has established itself over the years as the most trustworthy business directory of all available in the UK, being the ultimate refuge for all those businesses that wish to find something substantial that would benefit them. \u003C/p\u003E\n\n\u003Cp\u003EAll one does is Enter the name or type of a business and its location within the UK. The details when fed into the search bar and performed a search on will land the end user with the necessary results. Within no time, the user will be able to locate the business he looks for.\u003C/p\u003E\n\n\u003Cp\u003EThe Tradefinder is a premier business directory that has earned many plaudits with time. Every business that has benefitted through this has only had good things to say about it, and how for some it was a savior of sorts without which the business would never really have taken off. UK Businesses consider it a messiah, whose refuge has helped them explore the kind of option that would never have been possible knowing. \u003C/p\u003E\n\n\u003Cp\u003EUK Businesses operating in all verticals use this business directory. All sorts of searches, right from simplest to complex are possible on this. Business ventures rely on this with everything and have tremendous conviction in it. This is the reason why they frequently the directory all the time for their searches. There is hardly a business enterprise in the UK that cannot be searched for through this, vindicating its supremacy above the rest quite profoundly. \u003C/p\u003E\n\n\u003Cp\u003EIt is the home to all businesses and encompasses every enterprise within UK. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       45],
      "assets/images/resized/0014/4527/144527v2-max-150x150.jpg"],
     [[250,
       76],
      "assets/images/resized/0014/4527/144527v2-max-250x250.jpg"],
     [[347,
       106],
      "assets/images/resized/0014/4527/144527v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "DBH Business Centre",
    "address2": "Belasis Hall Technology Park, Coxwold Way",
    "zip_code": "TS23 4EA",
    "city": "Billingham",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}