{"name": "The Emporium",
 "permalink": "the-emporium",
 "crunchbase_url": "http://www.crunchbase.com/company/the-emporium",
 "homepage_url": "http://www.the-emporium.co.uk/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "08458 739273",
 "description": "Quality branded housewares",
 "created_at": "Thu Oct 06 12:10:28 UTC 2011",
 "updated_at": "Sun Nov 20 09:33:26 UTC 2011",
 "overview": "\u003Cp\u003EYour home is an important place. It is where you sleep, eat and relax most frequently and is somewhere where both comfort and practicality are essential. At the Emporium, they recognise the need for quality branded housewares to suit different tastes and lifestyles. They also realise that you will want value for money and great customer service, so we have made it our business to ensure that these needs are met!\u003C/p\u003E\n\n\u003Cp\u003EThe range of housewares encompasses cookware, food preparation equipment, storage solutions, laundry and cleaning products, tableware, drapery items, bathroom accessories and garden equipment. From pots and pans, kitchen appliances and utensils to rotary dryers and touch bins, there are numerous options for you to choose from. You\u0026#8217;ll find names such as Brabantia, Circulon, Tefal, Mason Cash, Goodgrips, Pyrex, Anolon and many more top homewares brands right here at the Emporium.\u003C/p\u003E\n\n\u003Cp\u003EHousewares suppliers are in abundance online, and though this can be useful it sometimes makes it hard to sort the wheat from the chaff in terms of quality and authenticity. So as a shopper it is vital that you choose a name which you can trust to deliver the products you want at a reasonable price and in a timely manner. Homewares from the Emporium are manufactured by well known, top quality brands for performance you can rely on.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0015/7023/157023v2-max-150x150.jpg"],
     [[250,
       60],
      "assets/images/resized/0015/7023/157023v2-max-250x250.jpg"],
     [[362,
       87],
      "assets/images/resized/0015/7023/157023v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}