{"name": "The Snow Law Firm",
 "permalink": "the-snow-law-firm",
 "crunchbase_url": "http://www.crunchbase.com/company/the-snow-law-firm",
 "homepage_url": "http://www.thesnowlawfirm.com/",
 "blog_url": "http://www.thesnowlawfirm.com/auto-accident-blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "legal",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Law office",
 "created_at": "Thu Jun 13 14:47:30 UTC 2013",
 "updated_at": "Thu Jun 13 18:37:31 UTC 2013",
 "overview": "\u003Cp\u003EExperience, focus, dedication and integrity in a caring atmosphere:\nThat’s what you can expect from the entire team at The Snow Law Firm. We pursue your case objectives with the attention they deserve, giving you top quality, professional representation from pre-suit through trial or settlement. The Snow Law Firm draws on the strength and experience of a team of attorneys and other legal experts to provide clients with reliable, caring and confidential advice and direction. We proudly serve with integrity and a strong sense of justice, ensuring a strong voice is serving you.\u003C/p\u003E\n\n\u003Cp\u003EFirm principal Corbin Snow, III is a graduate of St. Mary’s Law School in San Antonio, Texas and is Board Certified in Personal Injury Trial Law. Licensed to practice law since 1989, he also focuses on eminent domain and condemnation law. Corbin is an active member of the San Antonio Bar Association and is currently a Director of the San Antonio Bar Association. Corbin is a San Antonio native. He attended San Antonio Academy, Deerfield Academy in Deerfield, MA and majored in religious studies at Vanderbilt University, where he graduated with a Bachelor of Arts degree.\u003C/p\u003E\n\n\u003Cp\u003EUpon returning to San Antonio, he attended St. Mary’s University School of Law and received his Doctorate of Jurisprudence in 1988. While at St. Mary’s, Corbin served as Chairman of the Board of Advocates and was selected to the Order of Barristers.\u003C/p\u003E\n\n\u003Cp\u003ECorbin began his legal career with the firm of Plunkett, Gibson, and Allen, in the area of insurance defense. In 1991, he began representing injured individuals and landowners.\u003C/p\u003E\n\n\u003Cp\u003EA member of the American Board of Trial Advocates, Corbin is also a member of the San Antonio Bar Foundation and a Life Fellow of the Texas Bar Foundation. Corbin remains active in his church and in several non-profit organizations. He and his wife, Elizabeth, have four sons.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       69],
      "assets/images/resized/0027/4850/274850v2-max-150x150.jpg"],
     [[250,
       115],
      "assets/images/resized/0027/4850/274850v2-max-250x250.jpg"],
     [[267,
       123],
      "assets/images/resized/0027/4850/274850v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "The Snow Law Firm",
    "address1": "310 West Sunset",
    "address2": "",
    "zip_code": "78209",
    "city": "San Antonio",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}