{"name": "The StartUp Master Class",
 "permalink": "the-startup-master-class",
 "crunchbase_url": "http://www.crunchbase.com/company/the-startup-master-class",
 "homepage_url": "http://school.saeclub.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "school@saeclub.com",
 "phone_number": "",
 "description": "Program for Starting Startups",
 "created_at": "Fri Nov 23 20:08:07 UTC 2012",
 "updated_at": "Sat Dec 01 07:27:04 UTC 2012",
 "overview": "\u003Cp\u003EIdeas-to-IPO:The Startup Master Class is a comprehensive \u0026amp; concise 30 hrs. program covered in 6 days spread over two-weeks. This is the only such program offered in the USA in New York, Los Angeles, and New Jersey. \u003C/p\u003E\n\n\u003Cp\u003EStartup founders learn A to Z of how to start their dream venture and increase the chance of success. The program covers not only the nuts and bolts of a startup, but will dive into details of the dynamics, the players and how to prepare for all possibilities so the founder emerge a winner, in whatever situation he/she faces. The program incorporates the most current events from the startup space. It is tailored made for every class in order to cater to the ideas and business plans of the participants.\n• When do you take the advice of a VC and when do you stick to your guns?\n• How do you choose the right VC?\n• When do you want to keep control and when do you want to relinquish the reigns?\n• How do you make your company venture worthy, i.e.; fundable?\n• Who to align with your company? Are their goals the same for the company?\n• How do you target the VC\u0026#8217;s for funding?\nThis program answers these and many more questions and put the founders on the path to success.\u003C/p\u003E\n\n\u003Cp\u003EFacebook would have likely been sold to Yahoo for $1B without Sean Parker advising Mark Zuckerberg on how to keep control of his company. \u003C/p\u003E\n\n\u003Cp\u003EMost founders of successful companies only own between 5-10% of the company by the time of the first exit. Although there is no magic formula for success, one can certainly increase those odds greatly in favor of the founders by understanding the game. In some sense, how you play the game is more important than the product or service you offer. You need to prepare all the plays before the game begins and execute those plays to your end goal. Why is Friendster and MySpace an afterthought? They didn’t play the game right!\u003C/p\u003E\n\n\u003Cp\u003EGroup messaging startup, GroupMe, was sold to Skype for $68 million in just 370 days while many others with similar services withered and died. They knew how to play the game!\u003C/p\u003E\n\n\u003Cp\u003EMost of the time the outcome of your startup is decided by whom you have aligned with your company. Are you with the right investors? How do you meet these investors? The players and the dynamics are as important, if not more to decide the potential outcome of your startup. You need to know how to be part of this elite club of VCs and investors. \u003C/p\u003E\n\n\u003Cp\u003EUpon completing this course, the founders will be light-years ahead of other budding entrepreneurs. The founders will no longer be stuck in the beginning phase of their business. They will have a guidebook on how to proceed from Idea-To-IPO or whatever your end goal.\nCourse taught by Gyan Parida, Ph.D., MBA. Adjunct professor at Pepperdine University and Managing Partner at SAEC Venture Advisors.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       28],
      "assets/images/resized/0022/2429/222429v2-max-150x150.png"],
     [[216,
       41],
      "assets/images/resized/0022/2429/222429v2-max-250x250.png"],
     [[216,
       41],
      "assets/images/resized/0022/2429/222429v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Program Director",
    "person":
     {"first_name": "Gyan",
      "last_name": "Parida",
      "permalink": "gyan-parida",
      "image":
       {"available_sizes":
         [[[127,
            150],
           "assets/images/resized/0022/1881/221881v2-max-150x150.jpg"],
          [[212,
            250],
           "assets/images/resized/0022/1881/221881v2-max-250x250.jpg"],
          [[382,
            450],
           "assets/images/resized/0022/1881/221881v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[137,
        150],
       "assets/images/resized/0022/2430/222430v2-max-150x150.png"],
      [[229,
        250],
       "assets/images/resized/0022/2430/222430v2-max-250x250.png"],
      [[413,
        450],
       "assets/images/resized/0022/2430/222430v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}