{"name": "Things2Offer",
 "permalink": "things2offer",
 "crunchbase_url": "http://www.crunchbase.com/company/things2offer",
 "homepage_url": "http://www.things2offer.com",
 "blog_url": "http://things2offer.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "Things2Offer",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2009,
 "founded_month": 9,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "things-to-offer, things, offers, donate, lend, buy, sell",
 "alias_list": "",
 "email_address": "sannidhi.sr@things2offer.com",
 "phone_number": "+91-9848044077",
 "description": "C2C transaction portal",
 "created_at": "Wed Sep 16 18:10:14 UTC 2009",
 "updated_at": "Tue Oct 06 18:40:20 UTC 2009",
 "overview": "\u003Cp\u003EA website based on a C2C model which helps members to offer things and/or make request for things for free or otherwise.\u003C/p\u003E\n\n\u003Cp\u003EAbout\nNormally, when you want to donate or lend a thing you inform your contacts (friends, relatives etc\u0026#8230;) but, do you really inform EACH AND EVERY contact who might need that thing? Not all your contacts will want that thing so asking everybody is waste of time and energy. Also, you might miss one of your contacts who might have wanted what you have. Likewise, if you are looking for a thing to be donated or lent to you, you probably won\u0026#8217;t message all your contacts because chances are they won\u0026#8217;t have that thing. Also, you might miss to ask a contact who might have that thing and is willing to donate or lend.\u003C/p\u003E\n\n\u003Cp\u003EThings2Offer helps you to find things which are being offered either by your contacts (like friends or relatives) or other T2O members. If you want to donate or lend or sell things to your contacts or to any T2O member, T2O helps you do that. T2O also allows you to request for donation or request to lend or request to buy things from your contacts or any T2O member. Things2OfferTM helps you and other T2O members in matching your needs which is a win-win situation for both. \u003C/p\u003E\n\n\u003Cp\u003EHow it works?\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cp\u003ECreate a thing you own either to donate or to lend or to sell.\nFor instance: CDs, DVDs, mobiles, books, wrist watches, shoes, clothes, flats, cars, etc\u0026#8230; are all things. So, you can create ANY \u0026#8216;thing\u0026#8217;.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ECreate an offer for a thing and let others know.\nIn real world, you only make an offer when you own a thing, right? Likewise in the site, to create an offer, you must first create a thing. Then, while creating an offer for a thing, select offer type and select which contacts you want to let know. An offer can be categorized under:\u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EWISH TO DONATE\nWISH TO LEND\nWISH TO SELL\nREQUEST FOR DONATION\nREQUEST FOR LENDING\nWISH TO BUY\u003C/p\u003E\n\n\u003Cp\u003EFrom above, use first three options when you want to give away a thing and last three options when you want to own a thing. Also, you have to select the target members whom you want to let know about your offer. If you select your contacts, they will know automatically about your offer under \u0026#8220;Offers received\u0026#8221; link in their account. You can also select to let every T2O member know about your offer in which case the offer will not be listed under \u0026#8220;Offers received\u0026#8221; link for any T2O member but, can be searched by any T2O member.\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EReceive responses and/or send responses for offers.\nWhen you offer a thing, other T2O members can respond to your offer. Likewise, if you want to respond to offers made by others, you can do it.\u003C/li\u003E\n\u003C/ul\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0006/1655/61655v2-max-150x150.png"],
     [[250,
       62],
      "assets/images/resized/0006/1655/61655v2-max-250x250.png"],
     [[318,
       79],
      "assets/images/resized/0006/1655/61655v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Sannidhi",
      "last_name": "Srinivas",
      "permalink": "sannidhi-srinivas",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}