{"name": "ThirdGenerationResourcesPvtLtd",
 "permalink": "thirdgenerationresourcespvtltd",
 "crunchbase_url": "http://www.crunchbase.com/company/thirdgenerationresourcespvtltd",
 "homepage_url": "http://www.guaranteedseosolutions.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "guaranteedseo1",
 "category_code": "advertising",
 "number_of_employees": 50,
 "founded_year": 1990,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-service, seo-services-in-india, seo-packages, search-engine-optimization, website-marketing, search-engine-ranking, guaranteed-seo-packages, guaranteed-seo-services, seo-services-india, search-engine-marketing, seo, seo-company, web-site-promotion, so",
 "alias_list": null,
 "email_address": "info@guaranteedseosolutions.com",
 "phone_number": "+91 079 40063989",
 "description": "Guaranteed SEO Solutions - SEO India ",
 "created_at": "Tue Jun 12 04:18:26 UTC 2012",
 "updated_at": "Tue Jun 12 15:42:19 UTC 2012",
 "overview": "\u003Cp\u003EGuaranteedSEOSolutions renowned seo company in India, was launched about 7 years back and today it stands as one of the best internet marketing and search engine optimization company delivering competitive and top Search Engine Optimization Services to its Clients worldwide. We provide latest and result oriented range of Viral Marketing and Guaranteed SEO solutions for various industries. Our certified SEO professionals work dedicatedly to provide utmost level of services to help you achieve your goal in a short duration of time. \u003C/p\u003E\n\n\u003Cp\u003EGuaranteedSeoSolutions, each employee is driven by the maxim, \u0026#8220;Your vision is our target\u0026#8221; and with this in mind each individual strives hard and puts all the necessary efforts to achieve the dreams of clients. All the efforts are channelized towards the maximization of customer satisfaction and the result is premium quality service whether it is in case of SEO Friendly Domain Booking, Web Hosting, Web Designing, Web Development, Search Engine Marketing, Social Media Optimization, Link Building and SEO Consultancy or Guaranteed Google Search Engine Ranking Service. \u003C/p\u003E\n\n\u003Cp\u003EOur team of seo experts are adept in providing innovative solution to online search marketing techniques and go out of their way to devise such ROI strategies which are time proven and effective in today’s business world. Not only this, we at GuaranteedSEOSolutions aim at building a strong and significant global brand image of your business which helps you to stand amidst tough competition. \u003C/p\u003E\n\n\u003Cp\u003EEach search marketing technique is devised after a lot of research and hence enables your website to get optimized in all possible ways and promotes your visibility in the e-business. Our main objective is to provide a cost effective and affordable price seo services for your business and make your online presence felt globally. \u003C/p\u003E\n\n\u003Cp\u003EOur SEO Price and packages are customized and take utmost care of the clients’ requirements and not only that these have been evolved using acknowledged principles of business ethics and technical know-how which gives them uniqueness in the global market. Our highly qualified and professionally efficient team of Content Writers as well as Search Engine Optimizers aims at providing maximum benefit to the clients. \u003C/p\u003E\n\n\u003Cp\u003EWe, thus, stand apart from other SEO companies in rendering our services and also in building successful long-term business relationships by upholding the interests of the customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       81],
      "assets/images/resized/0019/5016/195016v2-max-150x150.jpg"],
     [[180,
       98],
      "assets/images/resized/0019/5016/195016v2-max-250x250.jpg"],
     [[180,
       98],
      "assets/images/resized/0019/5016/195016v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.guaranteedseosolutions.com",
    "title": "Guaranteed SEO Solutions"}]}