{"name": "Thomas Petrelli",
 "permalink": "thomas-petrelli",
 "crunchbase_url": "http://www.crunchbase.com/company/thomas-petrelli",
 "homepage_url": "http://www.petrellilaw.com",
 "blog_url": "http://www.petrellilaw.com/family-law-blog/feed/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "legal",
 "number_of_employees": 11,
 "founded_year": 2004,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "divorce-lawyer, family-lawyer, philadelphia-divorce-lawyer",
 "alias_list": null,
 "email_address": "info@petrellilaw.com",
 "phone_number": "(215) 523-6900",
 "description": "Philadelphia Divorce Lawyer",
 "created_at": "Fri Dec 14 05:16:25 UTC 2012",
 "updated_at": "Thu Dec 20 07:40:35 UTC 2012",
 "overview": "\u003Cp\u003EThomas J. Petrelli, Jr. is a principal at Sacks, Weston, Petrelli P.C., focusing on cases of divorce and related matters, support, custody, and parental rights. His goal is to help families of all shapes and sizes overcome the difficult legal matters that arise with divorce, child custody, premarital agreements, and domestic violence.  Whether it\u0026#8217;s the fair distribution of assets in a divorce or the legal means of protection for a victim of abuse, you can be sure that he will work tirelessly to find the right solution for the situation.\u003C/p\u003E\n\n\u003Cp\u003EMr. Petrelli brings a world of diverse experience to his law practice. Prior to joining Sacks, Weston, Petrelli, he founded Petrelli Law, P.C., and previously worked for a large Philadelphia based firm, practicing Environmental Litigation and Insurance Law (specifically, bad faith litigation), a mid-sized New Jersey based firm focusing on Real Estate and Environmental Litigation, and worked for the Clean Air Council developing helping shape environmental policy and regulations.  He has tried cases to verdict, appealed cases in State and Federal Court, and has brought many cases to conclusion through alternative forms of dispute resolution. After several years of litigation, helping people reach practical and creative solutions is a primary concern for Mr. Petrelli.\u003C/p\u003E\n\n\u003Cp\u003EMr. Petrelli holds a Juris Doctor from the Vermont Law School an LLM in Trial Advocacy from Temple University James E. Beasley School of Law, a Master\u0026#8217;s of Studies in Environmental Law from Vermont Law School, and a BBA from attending University of Kentucky and later Temple University.  He is a member of the American Bar Association, as an active member of the Family Law section, a member of the Pennsylvania Bar Association, as an active member of the Family Law and Real Estate sections, a member of the Philadelphia Bar Association, as an active member of the Family Law and Real Estate sections, and in New Jersey he is an active member of the New Jersey Bar Association - Family Law section, and a member of the Camden County Bar Association.\u003C/p\u003E\n\n\u003Cp\u003EDivorce lawyer Thomas Petrelli invites you to call our office and set up a free initial consultation, (215) 523-6900.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.sackswestonpetrelli.com",
    "title": "Sacks, Weston \u0026 Petrelli, LLC."},
   {"external_url": "http://www.petrellilaw.com",
    "title": "Divorce Lawyers in PA"},
   {"external_url": "http://hurricanesandyinsurancelawyers.com/",
    "title": "Hurricane Sandy Lawyers"},
   {"external_url": "http://life-insurance-law.com",
    "title": "Life Insurance Denials"}]}