{"name": "Tierra",
 "permalink": "tierra",
 "crunchbase_url": "http://www.crunchbase.com/company/tierra",
 "homepage_url": "http://www.indiamart.com/tierra/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "tierra@tradepassport.org",
 "phone_number": "8007080804",
 "description": "The leading brands in the field ,",
 "created_at": "Fri Apr 05 13:16:25 UTC 2013",
 "updated_at": "Fri Apr 05 13:16:30 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2009, our brand “TIERRA” has emerged as one of the prominent brands in manufacturing and supplying a quality-assured range of Industrial Packaging Products. In our range, we offer to our esteemed patrons PP Packaging Straps, HM and LD Liner Bags, LDPE and HDPE Tubing rolls. We also offer to our customers PVC Casing and Capping. Our products are widely appreciated by our esteemed customers for their high quality.\u003C/p\u003E\n\n\u003Cp\u003EAim / Vision / Mission:\nTo be one of the best brands in the field of Industrial Packaging Products, delivering quality products and enhancing customer experience. Meeting expectations of our clients as well as the people associated with us.\u003C/p\u003E\n\n\u003Cp\u003EManpower:\nOver the pace of time, we have been able to attain a position in this industry because of the constant and dedicated efforts of our diligent professionals. These professionals work in coordination with each other so as to ensure to complete their works within stipulated time frame. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nTo serve to the swift rate of production of goods, we have in-built a contemporary and sound infrastructure to facilitate this process. We have the latest technology and advanced equipment with us, in order to manufacture and supply this excellent range of products. These products are exclusively designed by our eminent team members keeping in view high quality and durability of these products. \u003C/p\u003E\n\n\u003Cp\u003EProduction Capacity:\nWe have the best of machinery in the field of industrial packaging products, which provides us an output in high quantities along with best quality. As on date we have a monthly production capacity of over 100 Tons and we intend to enhance our production capacity to produce over 250 Tons monthly. \u003C/p\u003E\n\n\u003Cp\u003EQuality Policy / Processes:\nEver since the time of establishment, our organization is known for delivering to our clients, a remarkable range of high-grade quality products manufactured using the best-in-class raw material. Our team ensure on the quality of these products by testing them in our contemporary quality-testing labs so as to deliver to our customers, a flawless range of products. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nPP Packaging Straps, HM and LD Liner Bags, LDPE and HDPE Tubing rolls. We also offer to our customers PVC Casing and Capping. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8682/248682v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8682/248682v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8682/248682v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}