{"name": "TiffinServices",
 "permalink": "tiffinservices",
 "crunchbase_url": "http://www.crunchbase.com/company/tiffinservices",
 "homepage_url": "http://www.tiffinservices.in/",
 "blog_url": "http://www.blog.homecurry.com/",
 "blog_feed_url": "http://blog.homecurry.com/feed/",
 "twitter_username": "homecurry",
 "category_code": "web",
 "number_of_employees": 50,
 "founded_year": 2011,
 "founded_month": 8,
 "founded_day": 9,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "catering-services-in-gurgaon, caterers-in-gurgaon, tiffin-service-providers-in-gurgaon, gurgaon-tiffin-service-providers, tiffin-service-providers-directory-in-gurgaon, tiffin-service-providers-in-gurgaon-city, tiffin-service-in-gurgaon, online-food-order",
 "alias_list": null,
 "email_address": "amitkansal.90@gmail.com",
 "phone_number": "8149734035",
 "description": "Individual and Group Lunches, Tiffin Ser",
 "created_at": "Mon Jun 04 15:35:23 UTC 2012",
 "updated_at": "Tue Jun 12 12:11:50 UTC 2012",
 "overview": "\u003Cp\u003EHomecurry.com provides a complete and flexible online platform to order your home cooked, healthy and tasty lunch from variety of menu options prepared by various Homechefs. We engage housewives as cooks through a well defined process including meals trials, kitchen hygiene \u0026amp; other factors. We decide the menus with them to ensure variety in taste \u0026amp; cuisines, and publish them under their own name along with the description on Homecurry. Our customers who are mainly from corporates can register on our site and choose the meal according to their taste and preferences. They need not to stick to only one particular cook and meal type as is with other existing conventional tiffin/meal services. Users are allowed to plan their meals and date preferences as per their choice and are not required to subscribe for the whole month. Besides they can modify or cancel their orders, and manage their complete account online. We support online, food coupons or COD mode of payment.\u003C/p\u003E\n\n\u003Cp\u003EHomecurry.com provides an opportunity for the Homemakers to earn and showcase their cooking talent from the comfort of their homes. We associate with Housewives, passionate for cooking, through initial discussions and food trials. The menu is worked out to avoid commonalty with other cooks’ menu on a particular day and is published for one whole month through mutual agreement on the website. We provide the housewives with the necessary vegetables/pulses at their home. Generally we source the curries that carry their unique taste, for their menu from them in the morning. The rest of the items (Chappati, Rice, Raita and Salad) in the meal are prepared at the Homecurry’s base kitchen to standardize the quality of the overall meal. The orders are taken online till predefined time in the morning, and packed and delivered within the lunch hour window.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[110,
       110],
      "assets/images/resized/0019/3817/193817v2-max-150x150.jpg"],
     [[110,
       110],
      "assets/images/resized/0019/3817/193817v2-max-250x250.jpg"],
     [[110,
       110],
      "assets/images/resized/0019/3817/193817v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}