{"name": "Ting Jin Investment Management Company",
 "permalink": "ting-jin-investment-management-company",
 "crunchbase_url": "http://www.crunchbase.com/company/ting-jin-investment-management-company",
 "homepage_url": "http://www.tjinvestgroup.cn",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 26,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 7,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "angel-investment-consultancy-investor-finance-market",
 "alias_list": null,
 "email_address": "crawford.tim@outlook.com",
 "phone_number": "+86 18217337614",
 "description": "Corporate Consultancy",
 "created_at": "Tue Mar 26 06:02:13 UTC 2013",
 "updated_at": "Fri Mar 29 08:29:28 UTC 2013",
 "overview": "\u003Cp\u003EShanghai Ting Jin Investment Management Company Ltd (Ting Jin Investments) dedicates itself  to offering excellent financial training, education, advice and analysis for investment opportunities to local and foreign investors. \u003C/p\u003E\n\n\u003Cp\u003ETing Jin Investments also offers corporate consultancy and advice for corporate investment and establishment into the Chinese Mainland. Ting Jin Investments has an International network of investors and corporate funding channels to help businesses find the funding they require.\u003C/p\u003E\n\n\u003Cp\u003ETing Jin Investments operates in two distinct and comprehensive business areas:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003E\u003Cp\u003EGuidance, analysis and advice for Investors looking for profitable ansd stable markets for investment.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003ECorporate consultancy for businesses looking to establish in the Chinese Market and those that require funding or investment networks in order to succeed in establishment.\u003C/p\u003E\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EThe first business area that Ting Jin offers is related to the Individual Investor/ Profit Seeking Trader, in relation to financial market education and financial resources for the major markets consisting of US Stock Market, the Hong Kong Stock Market and Foreign Exchange news and research. Our company has a large number of resources that the potential investor can use to better improve his or her success in investing on the international financial markets in terms of online courses, market news and views, analysis and expert advice that should really help in establishing a very profitable investment career or second income. Our resources are drawn from only well established and trustworthy sources bringing together a safe and minimal risk way in which to generate an outstanding profit by investing on liquid and financially stable markets. Our priority is to satisfy the needs of the clients, provide practical, easy to understand financial training and investment opportunity guidance.\u003C/p\u003E\n\n\u003Cp\u003EThe second business area Ting Jin focuses on is Corporate Consultancy and Project Management in regards to Foreign businesses hoping to establish in the ever growing, extremely profitable Chinese market. For corporations assessing entry into the Chinese market through business establishment our team has many years of experience in Corporate Consultancy and Project Management established through wisdom gained from working with and for many large multi-national businesses. We have long established relationships with many Chinese suppliers, companies and financiers that offer a broad range of services that many potential multi-national company start up\u0026#8217;s need inorder to successfully establish business in China. We will also help and guide companies through the legal regulatory requirements for establishment in China.  For many busineses trying to establish in China, they often encounter language and cultural barriers that can cause start up\u0026#8217;s to become too expensive and or run out of time as both parties struggle to comunicate and overcome cultural barriers. Ting Jin Investments will provide an advisory role for new business establishment from start to finish making sure that corporate ventures are successful and only the best quality and time efficient services are used in the establishment process.\u003C/p\u003E\n\n\u003Cp\u003ETing Jin Investment\u0026#8217;s provides a wide network of financial investors who are eager to learn about and invest in new domestic and international start up\u0026#8217;s to pre-IPO companies. We provide help and advice in attracting the correct investor(s) and provide a medium for creating great business relationships.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       28],
      "assets/images/resized/0024/6412/246412v2-max-150x150.png"],
     [[250,
       47],
      "assets/images/resized/0024/6412/246412v2-max-250x250.png"],
     [[450,
       85],
      "assets/images/resized/0024/6412/246412v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "XiangYu Tower, No. 999 NanSu Zhou Road, HuangPu District",
    "address2": "",
    "zip_code": "200003",
    "city": "Shanghai",
    "state_code": null,
    "country_code": "CHN",
    "latitude": 31.233187,
    "longitude": 121.4727543}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}