{"name": "Tipsense",
 "permalink": "tipsense",
 "crunchbase_url": "http://www.crunchbase.com/company/tipsense",
 "homepage_url": "http://appcrawlr.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Mon Apr 01 23:17:08 UTC 2013",
 "updated_at": "Wed Apr 03 18:02:03 UTC 2013",
 "overview": "\u003Cp\u003EThe TipSense solution is a next generation content discovery and knowledge extraction platform that offers breakthrough capabilities in content fingerprinting, readable topic models, feature extraction, and advanced statistical methods to extract value from unstructured content and offer value in guided discovery, content shaping and summarization, and semantic search. \u003C/p\u003E\n\n\u003Cp\u003EThe TipSense platform was engineered from the ground up and goes beyond the capabilities of existing data mining, big data analytics, and traditional Bayesian and LDA models. \u003C/p\u003E\n\n\u003Cp\u003ECentral to the platform are new core technologies such as conceptual entity recognition and content fingerprinting that boost the signal to a much higher level than previously possible. These systems are augmented with NLP, topic modeling, and other advanced statistical methods, resulting in a platform that is able to understand any type of unstructured content, and then transform it into new actionable \u0026#8216;first-class\u0026#8217; data. \u003C/p\u003E\n\n\u003Cp\u003EThe TipSense platform is able to associate content to concepts and topics in a user-facing manner. This format can provide unprecedented capabilities in enhancing and enriching existing content targeting models based on the actual underlying data. \u003C/p\u003E\n\n\u003Cp\u003EBy leveraging topics, concepts, sentiments, and highly contextualized content fingerprints trained against orthogonal domains to generate highly domain specific models, the TipSense platform improves the usefulness and relevance of search results. \u003C/p\u003E\n\n\u003Cp\u003EBy breaking away from the limitations of matching keywords and descriptions, the TipSense platform can transform vast amounts of unstructured and semi-structured content into a fully annotated conceptual model. \u003C/p\u003E\n\n\u003Cp\u003EThe TipSense platform powers appcrawlr.com and dishtip.com and can also be extended to other large content domains including social, retail, search, reviews and more.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}