{"name": "Toppan Printing",
 "permalink": "toppanprinting",
 "crunchbase_url": "http://www.crunchbase.com/company/toppanprinting",
 "homepage_url": "http://www.toppan.co.jp/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 1900,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "",
 "phone_number": "81 3 3835 5741",
 "description": "Printing solutions",
 "created_at": "Wed Nov 14 18:27:23 UTC 2007",
 "updated_at": "Thu Dec 01 07:35:45 UTC 2011",
 "overview": "\u003Cp\u003EToppan Printing Co., Ltd. provides commercial printing and related services worldwide. It operates in three segments: Information \u0026amp; Networks, Living Environment, and Electronics. The Information \u0026amp; Networks segment provides commercial printing services for posters, catalogs, pamphlets, flyers, calendars, pop materials, and gifts, as well as offers design and event services, sales promotion planning, multimedia related activities, and database and network system design and operation services; and publications printing services magazines and books, as well as CDROMs, DVDs, and other electronic publications. It also offers securities, such as stocks, bonds, gift certificates, and product coupons; cards comprising magnetic cards and prepaid cards; and develops and designs IC card systems, IC tag systems, and security management systems. This segment supplies various business form services, including direct mail, integrated slips, data print services, cards, envelopes, catalogs, and sales and maintenance of equipment. The Living Environment segment offers a range of packaging services, such as packaging planning, development, and production; development and production of packaging materials; design and production of packaging related system equipment; filling services; and packaging consulting. It also provides decorative paper/film, wallpaper, flooring materials, interior materials, and exterior materials. The Electronics segment offers display products that include color filters for LCDs, shadowmasks, screens for micro-display rear projection TVs, and functional films; and semiconductor products comprising photomasks, leadframes, printed wiring boards, substrates for semiconductor packages, design of printed wiring boards, LSI circuits, printed wiring, and performance assessment software. The company has a strategic alliance with AU Optronics Corp. Toppan Printing was founded in 1900 and is headquartered in Tokyo, Japan.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[129,
       21],
      "assets/images/resized/0006/6955/66955v1-max-150x150.png"],
     [[129,
       21],
      "assets/images/resized/0006/6955/66955v1-max-250x250.png"],
     [[129,
       21],
      "assets/images/resized/0006/6955/66955v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "1 Kanda Izumi-cho Chiyoda-ku",
    "address2": "",
    "zip_code": "101-0024",
    "city": "Tokyo",
    "state_code": null,
    "country_code": "JPN",
    "latitude": 37.09024,
    "longitude": -95.712891}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        116],
       "assets/images/resized/0006/6956/66956v1-max-150x150.jpg"],
      [[250,
        194],
       "assets/images/resized/0006/6956/66956v1-max-250x250.jpg"],
      [[450,
        350],
       "assets/images/resized/0006/6956/66956v1-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}