{"name": "Torian Group",
 "permalink": "torian-group",
 "crunchbase_url": "http://www.crunchbase.com/company/torian-group",
 "homepage_url": "http://www.toriangroup.com",
 "blog_url": "http://toriangroup.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 10,
 "founded_year": 1983,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "computer, network, web, visalia, hanford, exeter",
 "alias_list": null,
 "email_address": "sales@toriangroup.com",
 "phone_number": "559 733-1940",
 "description": "Technology with Integrity in Visalia",
 "created_at": "Thu Nov 08 13:50:17 UTC 2012",
 "updated_at": "Wed Dec 12 07:37:15 UTC 2012",
 "overview": "\u003Cp\u003ETorian Group is a computer networking consulting and service company, and an internet marketing and web design company. \u003C/p\u003E\n\n\u003Cp\u003EWe provide services to businesses in the Visalia Tulare Hanford Exeter, Ca. area (in the Central Valley).  We offer free seminars to local business persons on technology in cooperation with the Visalia Chamber of Commerce.\nWe can plan your network, specify equipment and software, evaluate technology to find the best fit for your needs, and prevent and/or solve problems. We believe in good design, preventative maintenance, and seek to establish long term relationships with our clients – “Technology with Integrity”. Please look at our web site for more information: www.toriangroup.com\u003C/p\u003E\n\n\u003Cp\u003EHome Computers – Virus removal, reinstall, home network setup, Hardware and software recommendations.\nHome Office – Remote access, Web sites and marketing, Backup, Email, Phone systems, Hardware and software recommendations, Improving your service and productivity.\nSmall Business – we can be your outsourced IT department, providing better, lower cost service than you could get by hiring your own staff. This includes network design and support, on-site and remote help desk, monitoring \u0026amp; maintenance, off-site backups, and helping with your Internet presence. More..\nIT Projects – We can help your IT department with projects requiring specialized expertise, or just more help. We can provide outsourced IT services such as design, implementation, rollouts, maintenance and monitoring, hosting, and off-site backup. We also work with companies on legal compliance and security. Our Website also has a number of articles and recommendations on best practices and new technology. Our goal is to start providing value even before we meet. More…\nInternet Presence – We can help your company leverage the internet by assisting with extending your brand to the web, including your domain, email, website, e-commerce site,  blog, newsletter, and social media.  We specialize in web development involving custom programming and database integration.  Here are some simple things you can do at little or no cost to improve your internet marketing.  More…\nSoftware Design and Support - We write custom software, and can often link together your existing programs to make your business more productive and responsive.\u003Cbr/\u003E\nHelp - We help you get more out of your software with onsite and remote support, and individualized training.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[145,
       150],
      "assets/images/resized/0021/9410/219410v2-max-150x150.png"],
     [[242,
       250],
      "assets/images/resized/0021/9410/219410v2-max-250x250.png"],
     [[336,
       346],
      "assets/images/resized/0021/9410/219410v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President",
    "person":
     {"first_name": "Tim",
      "last_name": "Torian",
      "permalink": "tim-torian",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Torian Group",
    "address1": "621 W. Willow Ave.",
    "address2": "",
    "zip_code": "93291",
    "city": "Visalia",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 36.3283419,
    "longitude": -119.2984205}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}