{"name": "Touchpaper",
 "permalink": "touchpaper",
 "crunchbase_url": "http://www.crunchbase.com/company/touchpaper",
 "homepage_url": "http://www.touchpaper.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2001,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "",
 "phone_number": "44 1483 744 400",
 "description": "Computer Software",
 "created_at": "Fri Mar 13 19:58:06 UTC 2009",
 "updated_at": "Fri Nov 20 11:01:14 UTC 2009",
 "overview": "\u003Cp\u003ETouchpaper Software plc provides information technology business management solutions in the United Kingdom, the United States, Europe, and the Asia Pacific. The company offers IT service management, customer service, and network and systems management solutions. Its solutions include Touchpaper ServiceDesk that enables business to provide support service to employees and customers; Touchpaper WebAnalyst, which provides an access to knowledge management functionality; and Touchpaper ResourceManager that enables analysts to assign tasks and appointments to individual analysts or analyst groups. The company also offers Touchpaper MobilePortal, which provides connection to Touchpaper systems from a PDA; Touchpaper ActiveKnowledge that provides information access based on knowledge centered support methodology; and Touchpaper SelfService, which provides information and knowledge to employees and customers. In addition, it offers Touchpaper ConfigurationManager, a central repository of information; Touchpaper ProcessManager that is used to automate and manage processes; Touchpaper ProcessApprover, which helps to approve or provide input into a process; and Touchpaper ManagementInformation, which helps business managers with the information to track performance. Further, the company offers Touchpaper ActiveAssistance, a network management application; Touchpaper DesktopManager that facilitates integration between the Touchpaper ITBM suite and a range of desktop management tools; Touchpaper NetworkManager, a network and infrastructure management tool; Touchpaper PassMe that automates the password reset function; LANDesk, a systems and security management solutions; and Touchpaper Customer ServiceDesk that helps to provide customer services. It serves IT and communications, public sector, not-for-profit, government, higher education, healthcare, legal, retail, and financial services industries. The company was founded in 2001 and is based in Woking, the United Kingdom.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       52],
      "assets/images/resized/0006/6963/66963v1-max-150x150.jpg"],
     [[250,
       88],
      "assets/images/resized/0006/6963/66963v1-max-250x250.jpg"],
     [[317,
       112],
      "assets/images/resized/0006/6963/66963v1-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "HQ",
    "address1": "Dukes Court Duke Street",
    "address2": "",
    "zip_code": "GU21 5RT",
    "city": "Woking",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        112],
       "assets/images/resized/0006/6964/66964v1-max-150x150.jpg"],
      [[250,
        187],
       "assets/images/resized/0006/6964/66964v1-max-250x250.jpg"],
      [[450,
        337],
       "assets/images/resized/0006/6964/66964v1-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}