{"name": "Trading Cradles",
 "permalink": "trading-cradles",
 "crunchbase_url": "http://www.crunchbase.com/company/trading-cradles",
 "homepage_url": "http://tradingcradles.com",
 "blog_url": "http://blog.tradingcradles.com",
 "blog_feed_url": "http://blog.tradingcradles.com/feed",
 "twitter_username": "tradingcradles",
 "category_code": "web",
 "number_of_employees": 5,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "classifieds, marketplace, community, parents, baby-gear, strollers, buy, sell",
 "alias_list": null,
 "email_address": "info@tradingcradles.com",
 "phone_number": "(888) 331-3834",
 "description": "Buy \u0026 sell gently used baby gear",
 "created_at": "Fri Jun 07 02:06:31 UTC 2013",
 "updated_at": "Fri Jun 07 17:18:15 UTC 2013",
 "overview": "\u003Cp\u003EA community where parents buy and sell baby gear as their little ones get bigger and bigger.\u003C/p\u003E\n\n\u003Cp\u003EIt\u0026#8217;s our mission to help parents save money \u0026amp; time, so they can give their kids the moon without breaking the bank or overfilling their house with stuff.\u003C/p\u003E\n\n\u003Cp\u003EIf you are a new parent in America, you will probably spend more than $6,000 on your baby in the first year alone. By the end of that year your baby will have probably outgrown everything three times. The stroller, the crib, the car seat, the wardrobe and much more will find their way into your closet and start to collect dust.\u003C/p\u003E\n\n\u003Cp\u003EWe built Trading Cradles to help parents sell or give away that great stuff. After all, it is worth thousands of dollars to somebody! Our service has three core pillars that will help parents and kids all over the world.\u003C/p\u003E\n\n\u003Cp\u003EMake it Easy: Selling stuff is fast and hassle free. Write a 250-character (Twitter-like) ad, post 1 image and in 30 seconds your stuff is ready to sell. Buying is easy. No registration, lightning fast browsing and immediate direct contact with the sellers.\u003C/p\u003E\n\n\u003Cp\u003EMake it Free: The site was designed to help parents save money by offering a great service! Parents can put ads on Tradingcradles.com for no cost. And, unlike other sites, we don’t charge parents when transactions occur. We simply connect buyers and sellers, in their cities.\u003C/p\u003E\n\n\u003Cp\u003EKeep it Safe: Safety is one of the most important characteristics of any site that deals with little ones. Our parental team approves every ad before making it available on the site.\u003C/p\u003E\n\n\u003Cp\u003ENo matter how much money you might have, every baby deserves a safe car seat, a comfy crib, and a happy new life! At Trading Cradles, it is our mission to make sure no babies are left behind.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       134],
      "assets/images/resized/0027/2512/272512v2-max-150x150.jpg"],
     [[201,
       180],
      "assets/images/resized/0027/2512/272512v2-max-250x250.jpg"],
     [[201,
       180],
      "assets/images/resized/0027/2512/272512v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.dailycandy.com/dallas/article/85086/TradingCradlescom-Online-Marketplace-Launches",
    "title": "One Mom's Trash Is Another Mom's Treasure"},
   {"external_url": "http://www.coolmompicks.com/2010/08/trading_cradles.php",
    "title": "It's like Twitter and Craigslist had a really well-behaved baby  Read more: http://www.coolmompicks.com/2010/08/trading_cradles.php#ixzz2VUZO7G1h"}]}