{"name": "TrafficbyKeyword.com",
 "permalink": "trafficbykeyword-com",
 "crunchbase_url": "http://www.crunchbase.com/company/trafficbykeyword-com",
 "homepage_url": "http://trafficbykeyword.com",
 "blog_url": "http://trafficbykeyword.com/blog",
 "blog_feed_url": "http://trafficbykeyword.com/blog/feed/",
 "twitter_username": "TrafficbyKey",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "cheap-seo-services, results-guaranteed, free-trial",
 "alias_list": null,
 "email_address": "seo@trafficbykeyword.com",
 "phone_number": "650.847.5485",
 "description": "cheap seo services.",
 "created_at": "Mon Jun 25 01:26:52 UTC 2012",
 "updated_at": "Mon Jun 25 20:48:30 UTC 2012",
 "overview": "\u003Cp\u003ETrafficbykeyword.com offers cheap seo services to the masses using techniques that were only available to people with very large budgets before. \u003C/p\u003E\n\n\u003Cp\u003EThere prices start at 40 dollars with their most expensive package only being 100 dollars. Traffic by Keyword was launched in 2010 from Toronto, Canada, by its founder and president. The website is driven by an amazing team of marketing and technical personnel, whose sole aim is to please its users. \u2028Traffic by Keyword aims to become a leader cheap search engine optimization services, appealing to users and developers across the world with its innovative methods, and live market research and improvement.\u003C/p\u003E\n\n\u003Cp\u003EAll interested clients are encouraged to register and see how simple and convenient it is to use Traffic by Keyword. We appreciate all participation in bringing Traffic by Keyword to the forefront of cheap seo services, and remind our users that with every moment that Traffic by Keyword grows and expands, they will reap the benefits.\u003C/p\u003E\n\n\u003Cp\u003ENot only does Traffic by Keyword help clients find the perfect keywords for their business, as indicated by visit responses, it ultimately helps them make more profit by giving them the best possible keywords for the amount of money they are willing to invest. The price starts at 40 dollars monthly, and then raises to 100 dollars monthly. For any business that is serious about appealing to the market of their choice, Traffic by Keyword is the site to use. \u003C/p\u003E\n\n\u003Cp\u003ETraffic by Keyword gives businesses the opportunity to find the best keywords, only on http://trafficbykeyword.com/ cheap seo services will be found with guaranteed results and a free trial.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[62,
       62],
      "assets/images/resized/0019/7034/197034v2-max-150x150.png"],
     [[62,
       62],
      "assets/images/resized/0019/7034/197034v2-max-250x250.png"],
     [[62,
       62],
      "assets/images/resized/0019/7034/197034v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}