{"name": "Trask Digital",
 "permalink": "trask-digital-2",
 "crunchbase_url": "http://www.crunchbase.com/company/trask-digital-2",
 "homepage_url": "http://www.traskdigital.co.uk",
 "blog_url": "http://traskdigital.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "traskdigital",
 "category_code": "ecommerce",
 "number_of_employees": 165,
 "founded_year": 2008,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo-reseller, reseller-seo, seo-reselling, seo-reseller-india, best-seo-reseller",
 "alias_list": null,
 "email_address": "traskdigital@gmail.com",
 "phone_number": "+91-120-4281040",
 "description": "Trask Digital - We make presence...",
 "created_at": "Mon Nov 07 07:48:56 UTC 2011",
 "updated_at": "Sat Nov 19 06:18:33 UTC 2011",
 "overview": "\u003Cp\u003ESearch Engine Optimization (SEO) is services of search engine as Google, Yahoo, Bing and etc. Nowadays, SEO services are booming in electronic business marketing. Optimization is very important for web site promotion and generates traffic. United Kingdom is the biggest outsourcing country where lots of niche company running in very large scale. The companies are looking Outsource SEO reseller services where desire man power allocates for their project and project proprietary can watch the work activity of project and take analysis report. Trask Digital is one of the best SEO reseller company in India that provide SEO Reseller Services and programs under your brand name and our  company can not display your brand name or logo on client site. Our company ethical work for your website marketing and central motive will be always improve you ranking and high generate traffic of site. We are providing service for many country likes united state, Australia, Canada and United Kingdom. If you are looking a best SEO reseller company in India where well atmosphere work culture and well infrastructure of company and client services available 24X7 hrs on working day. Our company is offering private label SEO, white label SEO and risk free SEO. You can find us site by clicking on instant SEO Reseller Program or find out us profile on facebook http://www.facebook.com/traskdigital.  \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/seoreseller",
    "title": "Trask Digital Facebook Pages"}]}