{"name": "Travis Jones Rush Properties",
 "permalink": "travis-jones-rush-properties",
 "crunchbase_url": "http://www.crunchbase.com/company/travis-jones-rush-properties",
 "homepage_url": "http://travisjonesrushpropertiesblog.com/",
 "blog_url": "http://www.facebook.com/TravisJonesRushProperties",
 "blog_feed_url": "",
 "twitter_username": "travisjonesrush",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1969,
 "founded_month": 1,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "travis-jones, travis-jones-rush-properties, rush-properties",
 "alias_list": null,
 "email_address": "travisjonesrushproperties@live.com",
 "phone_number": "(913)839-2345",
 "description": "Real estate foreclosures and remodeling",
 "created_at": "Sun May 26 11:52:46 UTC 2013",
 "updated_at": "Wed May 29 14:25:56 UTC 2013",
 "overview": "\u003Cp\u003ETravisJones, Rush Properties and Cherry Park Properties founder is a Johnson County, Kansas, businessman with expertise in real estate foreclosures and remodeling. Over the last 15 years, this experienced entrepreneur has assisted homeowners with their foreclosure needs by offering a diverse range of compensation options. As well, Travis Jones Rush Properties worked diligently to stimulate the Johnson County economic environment by increasing property values through responsible improvement projects.\u003C/p\u003E\n\n\u003Cp\u003ECurrently, Travis Jones, Rush Properties founder, is a partner in Cherry Park Properties. Cherry Park Properties works with homeowners in both Kansas and Missouri to immediately purchase and improve distressed properties for resale. Using the experience gained by Travis Jones Rush Properties, properties are purchased in Kansas using Purchase of Redemption Rights. In Missouri, Travis Jones, Rush Properties founder can purchase properties at any point during the foreclosure process. By acting as both investor and property improvement coordinator, Travis Jones of Rush Properties has the ability to relieve homeowners of property that is cosmetically or structurally outdated and defective.\u003C/p\u003E\n\n\u003Cp\u003EPrior to Cherry Park Properties, Travis Jones and the Rush Properties team served extensively in volunteer positions throughout the local community. Travis Jones and Rush Properties also assisted many fundraising events including charity walks for the City Union Mission and the Church of the Resurrection. As well, Travis Jones of Rush Properties volunteered for local schools at concession stands, fund-raising carnivals and activity nights and served as a youth basketball coach. Outside of work, Travis Jones Rush Properties was involved in numerous charity golf tournaments and served at local homeless shelters and inner-city churches serving meals to the homeless.\u003C/p\u003E\n\n\u003Cp\u003EAccording to Travis Jones, Rush Properties also spearheaded the development of a community outreach project named Project James 2:17. This program was initiated to make a difference in the Johnson County, Kansas, community by offering financial assistance to people in need of a hand up. Travis Jones Rush Properties worked to provide rent-free housing to disadvantaged families for a period of 12 months. Travis Jones Rush Properties organization James 2:17 helped families make a positive change in their lives and transition into permanent homes. Travis Jones Rush Properties and James 2:17 partnered with area businesses to raise the needed funds to help pay for utilities, transportation, and food cost for tenants.\u003C/p\u003E\n\n\u003Cp\u003ETravis Jones Rush Properties became known throughout Kansas as a leader in the real estate industry. Through the two companies, Travis Jones, the Rush Properties and Cherry Park Properties founder, sought to provide a hassle-free experience for clients facing financial crisis. Today, Cherry Park Properties assists clients with various mortgage issues. Travis Jones of Rush Properties and Cherry Park Properties has been recognized as offering a superior alternative to foreclosure for homeowners.\u003C/p\u003E\n\n\u003Cp\u003EOn a personal level, Travis Jones of Rush Properties and Cherry Park Properties enjoys gardening, landscaping, and boating with his wife and three children.\u003C/p\u003E\n\n\u003Cp\u003ETravisJones, Rush Properties and Cherry Park Properties founder, holds a Bachelor of Arts degree from Baker University. He additionally attended Kansas State University. Travis Jones of Rush Properties was a member of the Alpha Tau Omega fraternity.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0026/7178/267178v2-max-150x150.jpg"],
     [[160,
       160],
      "assets/images/resized/0026/7178/267178v2-max-250x250.jpg"],
     [[160,
       160],
      "assets/images/resized/0026/7178/267178v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Cobject width=\"430\" height=\"270\"\u003E\u003Cparam name=\"movie\" value=\"http://www.youtube.com/v/osbAMVkwHag?hl=en_US\u0026amp;version=3\u0026amp;rel=0\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"http://www.youtube.com/v/osbAMVkwHag?hl=en_US\u0026amp;version=3\u0026amp;rel=0\" type=\"application/x-shockwave-flash\" width=\"430\" height=\"270\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E",
    "description": "\u003Cp\u003ETravis Jones of Rush Properties Discusses Foreclosure Market for Buyers and Sellers\u003C/p\u003E"},
   {"embed_code": "\u003Cobject width=\"430\" height=\"270\"\u003E\u003Cparam name=\"movie\" value=\"http://www.youtube.com/v/87fD-icmdZQ?version=3\u0026amp;hl=en_US\u0026amp;rel=0\"\u003E\u003C/param\u003E\u003Cparam name=\"allowFullScreen\" value=\"true\"\u003E\u003C/param\u003E\u003Cparam name=\"allowscriptaccess\" value=\"always\"\u003E\u003C/param\u003E\u003Cembed src=\"http://www.youtube.com/v/87fD-icmdZQ?version=3\u0026amp;hl=en_US\u0026amp;rel=0\" type=\"application/x-shockwave-flash\" width=\"430\" height=\"270\" allowscriptaccess=\"always\" allowfullscreen=\"true\"\u003E\u003C/embed\u003E\u003C/object\u003E",
    "description": "\u003Cp\u003EForeclosure Expert Travis Jones of Rush Properties Has Encouraging News for Homeowners\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.merchantcircle.com/business/Travis.Jones.Rush.Properties.913-839-2345",
    "title": "Travis Jones Rush Properties"},
   {"external_url": "http://www.linkedin.com/company/travis-jones-rush-properties/",
    "title": "Travis Jones Rush Properties"},
   {"external_url": "https://twitter.com/travisjonesrush",
    "title": "Travis Jones Rush Properties"},
   {"external_url": "http://www.myspace.com/travisjonesrushproperties",
    "title": "Travis Jones Rush Properties"},
   {"external_url": "http://www.lookuppage.com/users/travisjonesrushproperties",
    "title": "Travis Jones Rush Properties"},
   {"external_url": "http://www.youtube.com/user/TravisJonesRush",
    "title": "Travis Jones Rush Properties"},
   {"external_url": "https://pinterest.com/travisjonesrush/",
    "title": "Travis Jones Rush Properties"}]}