{"name": "Travel and Tour World",
 "permalink": "travel",
 "crunchbase_url": "http://www.crunchbase.com/company/travel",
 "homepage_url": "htto://www.travelandtourworld.com",
 "blog_url": "http://travelntourworld.wordpress.com/",
 "blog_feed_url": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews",
 "twitter_username": "TTW_ezine",
 "category_code": "advertising",
 "number_of_employees": 100,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "travel-news, tourism-news, travel-guides, travel-tips, travel-and-tour-world, travel-destinations, b2b-travel-magazine, travel-information, hotel-guides, travel-industry-news, online-travel-magazine, tourism-industry-news, b2b-travel, travel-magazine",
 "alias_list": null,
 "email_address": "rana@travel2globe.com",
 "phone_number": "",
 "description": "Travel and Tour World, a travel trade me",
 "created_at": "Sat Apr 28 06:19:46 UTC 2012",
 "updated_at": "Thu May 24 00:49:23 UTC 2012",
 "overview": "\u003Cp\u003ETravel and Tour World, a travel trade media and an information platform, is an all-inclusive and far-reaching B2B travel magazine. It aspires to build a network of travel and tour professionals across the globe to mark its presence in this increasingly competitive market. In a very short span of time, our readership has augmented to 200,000 which include niche readers from travel and hospitality trade industry professionals like Tour Operators, Travel Agents, Destination Management Companies, MICE Planners and Luxury Planners.\u003C/p\u003E\n\n\u003Cp\u003ETravel trade shows are a prevalent meeting platform for all the decision makers and MICE leaders worldwide to generate revenue for the travel industry. Travel and Tour World promotes more than 50 travel trade shows in which, the magazine is being distributed physically to the decision makers and buyers of the global travel industry. This furnishes a great prospect to reach the unique travel B2B readers across the world and helps us to promote globally. It is not only a boost from the business outlook but also crafts a global Unique Readership.\u003C/p\u003E\n\n\u003Cp\u003ETravel and Tour World delves into the roots of tourism. It imparts travel professionals with an upright global outlook through profound coverage of all tourism sectors including prominent hotels and its reviews, airlines, destinations, cruises, meeting and convention centres and lots more. The magazine keeps one abreast with the avant-garde trends as well as the latest technological boons of the industry. From MICE destinations to awe-inspiring locations, Travel and Tour World wraps it all. It gets you an insight into the Highlights and Reviews of all the International trade fairs from around the globe. Travel and Tour World develops its brand identity through the online and offline readers of the magazine. This course of action reduces the percentage of the unattended clients around the globe, making the magazine’s reach directed and widespread.\u003C/p\u003E\n\n\u003Cp\u003EAlong with the I-pad and Android accessibility, delve into Travel and Tour World in a unique flip-book format, which is freely downloadable and readable online. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0018/6560/186560v2-max-150x150.jpg"],
     [[150,
       150],
      "assets/images/resized/0018/6560/186560v2-max-250x250.jpg"],
     [[150,
       150],
      "assets/images/resized/0018/6560/186560v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"1280\" height=\"720\" src=\"http://www.youtube.com/embed/EhmbDSgft2g\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E",
    "description": "\u003Cp\u003ETravel and Tour World, a travel trade media and an information platform, is an all-inclusive and far-reaching B2B travel magazine. It aspires to build a network of travel and tour professionals across the globe to mark its presence in this increasingly co\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}