{"name": "TrekTrac",
 "permalink": "trektrac",
 "crunchbase_url": "http://www.crunchbase.com/company/trektrac",
 "homepage_url": "http://www.traveltrac.com",
 "blog_url": "http://www.trektrac.com",
 "blog_feed_url": "",
 "twitter_username": null,
 "category_code": "web",
 "number_of_employees": 4,
 "founded_year": 2007,
 "founded_month": 11,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "travel-sharing, adventure, trips, camping, hiking, boating, sailing, racing, safari, climbing",
 "alias_list": null,
 "email_address": "jcnoller@traveltrac.com",
 "phone_number": "949-544-1268",
 "description": null,
 "created_at": "Mon Dec 01 17:52:36 UTC 2008",
 "updated_at": "Sat Dec 06 14:43:05 UTC 2008",
 "overview": "\u003Cp\u003ETravelTrac, a developer of travel and trip sharing domains, announces the pre-release of TrekTrac (www.trektrac.com) their premiere travel sharing application dedicated to land based exploration and adventure travel. \u003C/p\u003E\n\n\u003Cp\u003EAll TravelTrac domains - SailTrac, TrekTrac , and MotoTrac (coming soon) provides no cost service to the active traveler allowing them to share their global adventures in virtual real time, via the web, with friends and family back home, or fellow travel enthusiasts\u0026#8217; worldwide.  \u003C/p\u003E\n\n\u003Cp\u003EIntegrate custom Google maps of your route and current position, submit journal entries, upload and geotag photos, or even video files.  Import an address book of friends and the venue will automatically notify your contacts as you make updates to your travel adventures.  \u003C/p\u003E\n\n\u003Cp\u003EMore comprehensive than a blog page, TravelTrac domains incorporates remote access features that allows the active traveler to \u0026#8220;fall off the grid, but stay on the map.\u0026#8221; - even when direct Internet access is unavailable.  Using any remote wireless device with a data enabled service plan permits a user to send virtual real time updates to their travel adventures from anywhere on the globe as they happen. TravelTrac\u0026#8217;s travel sharing applications automatically upload, formats, and posts position reports to your own custom Google Map, integrates current weather conditions for that destination, accepts text, photo, and video attachments via remote or wireless e-mail and then notifies a traveler\u0026#8217;s address book of friends to participate in the journey in virtual real time via the web.  \u003C/p\u003E\n\n\u003Cp\u003EUsers can participate in TravelTrac Forums - an online field guide to Planet Earth and share their unique insights and travel tips for any destination.  Users can participate at their leisure or reseach new and unique travel destinations and adventures posted by others.\u003C/p\u003E\n\n\u003Cp\u003EIt is easy to document and share any travel adventure - past or present from TravelTrac\u0026#8217;s premiere domains:\u003C/p\u003E\n\n\u003Cp\u003ESailTrac - for on the water travel and trip sharing;\nTrekTrac - for land based expeditions and travel adventures; and\nMotoTrac - (coming soon) for sharing your motorized vehicle trips and adventures.\u003C/p\u003E\n\n\u003Cp\u003E-Create an account and profile \n-Import contacts\n-Add a Trip\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EDraw a route map, add position reports, journal entries, upload and geotag photos or video files all within minutes.  No need to know HTML or other programming languages.  TrekTrac does it all automatically so you can enjoy the journey and stay connected simply and easily.\u003C/p\u003E\n\n\u003Cp\u003ETo investigate our pre-release travel sharing web application please visit www.trektrac.com and from the \u0026#8220;coming soon\u0026#8221; page click on the TrekTrac logo.  Or you can visit a sample trip by at the following link:  http://www.trektrac.com/public.asp?TRIP_ID=616\u003C/p\u003E\n\n\u003Cp\u003EPlease share our services and features.  With the completion of our iPhone app (1Q 2009) one touch remote transmission of position reports, text, and photos sumission will be possible to any trip you create.  Currently remote e-mail submission from any data enabled wireless device provides similiar remote updating and notification of your contacts in virtual real time.  Check it out @ www.traveltrac.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       26],
      "assets/images/resized/0003/0790/30790v1-max-150x150.png"],
     [[250,
       44],
      "assets/images/resized/0003/0790/30790v1-max-250x250.png"],
     [[283,
       50],
      "assets/images/resized/0003/0790/30790v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "www.trektrac.com",
    "permalink": "www-trektrac-com-2",
    "image": null},
   {"name": "www.mototrac.com",
    "permalink": "www-mototrac-com",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "John",
      "last_name": "Noller",
      "permalink": "john-noller-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "15333 Culver Drive",
    "address2": "Suite 340-414",
    "zip_code": "92604",
    "city": "Irvine",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 33.696853,
    "longitude": -117.79967}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        120],
       "assets/images/resized/0003/0533/30533v2-max-150x150.png"],
      [[250,
        200],
       "assets/images/resized/0003/0533/30533v2-max-250x250.png"],
      [[450,
        361],
       "assets/images/resized/0003/0533/30533v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}