{"name": "Trek In Morocco",
 "permalink": "trek-in-morocco",
 "crunchbase_url": "http://www.crunchbase.com/company/trek-in-morocco",
 "homepage_url": "http://www.trekinmorocco.net",
 "blog_url": "http://www.trekinmorocco.net",
 "blog_feed_url": "",
 "twitter_username": "trekinmorocco1",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "climb-mt-toubkal, toubkal-treks, mgoun-treks, saghro-treks, day-excursions-from-marrakech, morocco-trekking, , imlil, ourika-treks, sirwa-trekking, marrakech-tours",
 "alias_list": null,
 "email_address": "atlasguidemorocco@yahoo.fr",
 "phone_number": "00212667491352",
 "description": "Morocco treks and desert tours",
 "created_at": "Fri Dec 21 10:50:49 UTC 2012",
 "updated_at": "Sun Dec 23 06:21:51 UTC 2012",
 "overview": "\u003Cp\u003ETrek In Morocco offers a wide range of excursions with incredible trekking destination including: the Atlas mountains Jebel Toubkal , Jabel M’goun, Jebel siroua and the Jbel Saghro. Depending on your fitness level, and season, you can trek, walk or ramble in different regions of Morocco. The Atlas Mountains host several 4,000m+ peaks and the mountain landscape is dramatic and beautiful, dotted with ancient small Berber villages and rushing melt water streams,\u003C/p\u003E\n\n\u003Cp\u003EFor those with a love of the great outdoors activities, there are some fantastic treks in the the Atlas Mountains, with deep valleys,Berber Villages and magnificent views. back Essaouira offers Atlantic rollers, fresh fish and relaxation, whilst the long journey to the Saharan sand dunes of Erg Chebbi is rewarded by a sunset camel trek and a night camping under the stars.\u003C/p\u003E\n\n\u003Cp\u003EFor culture lovers, it doesn’t get much better than the Morocco, a country brimming with Unesco World Heritage sites. There are some excellent mosaics, medersas and Roman ruins to be found in the Imperial cities of Fes, Meknes and Rabat. And then there is Marrakech, the jewel in Morocco’s crown. An intoxicating city, with lively souks and the unforgettable Djemma El Fna, complete with acrobats, story tellers and snake charmers.\u003C/p\u003E\n\n\u003Cp\u003EIf you have not found what you are looking for in our pre – planned itineraries, we are more than happy to put together a trip for you. Whether you are looking for individual or private  group tours,combined Sahara Desert and Atlas Mountain trips, or family trips we are here to help. We also arrange Atlas Mountain Ski trips (seasonally), Mountain Bike and 4×4 trips. Just fill out our Custom Booking Form, send us an email or give us a call with your ideas and we will work together to create your trip of a lifetime!\u003C/p\u003E\n\n\u003Cp\u003ETrek in Morocco:\n •Experiences are tailor-made to fit your needs and aspirations perfectly.\n •First-hand knowledge of what it takes to create a unique and memorable experience, and how to avoid mistakes.\n •We know our destinations inside out and we make an effort to know you well, providing real insight in creating your ideal trip\n •We will not offer a trip anywhere that we haven’t been to ourselves.\u003C/p\u003E\n\n\u003Cp\u003ETravel for as long or as short as you want.\n •Plans and organizes everything from A to Z\n •20 years of experience around Morocco and exotic destinations\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       80],
      "assets/images/resized/0022/6548/226548v2-max-150x150.png"],
     [[236,
       126],
      "assets/images/resized/0022/6548/226548v2-max-250x250.png"],
     [[236,
       126],
      "assets/images/resized/0022/6548/226548v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}