{"name": "TripMegaMart",
 "permalink": "tripmegamart",
 "crunchbase_url": "http://www.crunchbase.com/company/tripmegamart",
 "homepage_url": "http://www.tripmegamart.com",
 "blog_url": "http://tripmegamart.blogspot.in/",
 "blog_feed_url": "",
 "twitter_username": "tripmegamart",
 "category_code": "ecommerce",
 "number_of_employees": 10,
 "founded_year": 2012,
 "founded_month": 4,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "book-online, online-booking-in-india, car-booking, bus-booking, flight-booking, hotel-booking, hotel-booking-by-bidding",
 "alias_list": null,
 "email_address": "info@tripmegamart.com",
 "phone_number": "9031005501",
 "description": "search, compare,negotiate, book",
 "created_at": "Fri Sep 14 10:36:32 UTC 2012",
 "updated_at": "Thu Sep 20 22:28:43 UTC 2012",
 "overview": "\u003Cp\u003ETripMegaMart: online booking site - search, compare, negotiate….book!\nTripMegaMart is an Indian online travel website. We provide the facilities to book hotels, cars, buses, flights (domestic and international) and tour packages online through our website. We provide the detailed information to all traveler visiting our sites like description of our partners, pricing and other information.\nOur company Connecting Dot Pvt Ltd. is based in Kolkata, India, which is one of the metropolitan cities of India. We provide you all kinds of services related to travel. We have arrangement with more than 60 Airlines across nation and abroad for booking flight tickets online. We also have connection with more than 6000 Indian hotels for room booking at fixed price. We also have tie-up with 750 Luxury bus operators having more than 12,000 Luxury bus for online ticket booking.\nPresently, we are working on making arrangement with Indian hotels to book their unsold rooms at discount rates at last minute. This is the newest concept ever introduced on any online travel website. Most of the hotels have few unsold rooms almost each day (excluding peak-season). Hotels can book these unsold rooms by giving discounts as other brands/sector are doing since last many years. Almost all brands are selling their unsold items by giving discounts at the end of their year/season. Percentage of discounts will vary as per their unsold inventories. We are providing a platform through our website www.tripmegamart.com so that which Hotel can book their unsold rooms at discounts and travelers can book high priced rooms at discount. In this way, hotels can get a lot of travelers for their unsold room. This concept has not been introduced yet in India.\nWe are also looking for Car Rental agencies all over INDIA, through which traveler can avail the facility of online car booking. Not only this, we are also looking forward for tour operators for domestic as well as international tour package. We are also providing the platform for the travelers to book attractive tour packages for their favorite destination in India.\nWe provide easy to navigate and user friendly website with loads of features. We also provide easy communication through email and SMS. It provides the cheapest and best booking facility for national as well as international destinations. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0021/1328/211328v2-max-150x150.jpg"],
     [[250,
       73],
      "assets/images/resized/0021/1328/211328v2-max-250x250.jpg"],
     [[450,
       131],
      "assets/images/resized/0021/1328/211328v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}