{"name": "TripShaker",
 "permalink": "tripshaker",
 "crunchbase_url": "http://www.crunchbase.com/company/tripshaker",
 "homepage_url": "http://tripshaker.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 2,
 "founded_year": 2013,
 "founded_month": 3,
 "founded_day": 8,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "travel, plan-route, trip, trip-planning, sightseeing, places-of-interest",
 "alias_list": null,
 "email_address": "anna.slenzak@gmail.com",
 "phone_number": "+380687077290",
 "description": "web service on travelling",
 "created_at": "Tue May 28 11:08:37 UTC 2013",
 "updated_at": "Wed May 29 22:13:05 UTC 2013",
 "overview": "\u003Cp\u003ETripshaker.com is the only service which is optimized to search all the main sights nearby to the user’s trip route. From now on user can build routes with the goal to see the most interesting places exactly for him.\nWith more than 20 000 sightseeing places determined all over the world it is now much more easier to decide which places to visit. User can see the name, short description  and even photo  of the place of interest which are considered “worth watching”. \nThe main idea of the service is to provide an opportunity to plan trip routes which will be interesting from touristic point of view for each person. User will save a lot of time if he can see the detailed location of  any attraction in each country . It is now easy to plan vacation without surfing lots of websites with places of interest in each country.\n“We faced this problem while we were planning one of our vacations. We could not find any website or service that would show interesting places near to our route. In most cases there were some names of attractions in each country, but it was hard to  understand where those attractions are situated. So it was necessary to search them on map, calculate the distances etc.  Later on we’ve decided to provide such a route planner.”-says CEO of TripShaker.com. \nThe service is suitable for land transport especially for travelling by car. It is made on the base of google maps  and calculates distance, time needed for the trip and number of chosen places of interest. It is possible to enter up to ten cities that user wants to go to and accordingly to plan the most efficient route. User can share his travelling routes.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.the-village.ru/village/city/kiev-morning/126321-utro-v-gorode-23-maya?utm_source=facebook.com\u0026utm_medium=villagekv-fb-page\u0026utm_campaign=id",
    "title": ""}]}