{"name": "Trisha Agro",
 "permalink": "trisha-agro",
 "crunchbase_url": "http://www.crunchbase.com/company/trisha-agro",
 "homepage_url": "http://www.indiamart.com/trishaagro/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "trishaagro@tradepassport.org",
 "phone_number": "9558527347",
 "description": "supplier of green vegetables ,",
 "created_at": "Fri Apr 05 09:33:42 UTC 2013",
 "updated_at": "Fri Apr 05 09:33:50 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2012, we “Trisha Agro” are engaged in processing \u0026amp; supplying a premium quality and fresh vegetables such as Cucumber, Radish, Potatoes, Tomatoes, Green Peas, Cauliflower, Carrot, Capsicum and Onions. These fresh vegetables are sourced from reliable farmers based across the country to assure best quality. We further assure that our vendors follow organic methods of vegetable production and do not use any harmful chemicals or pesticides.\u003C/p\u003E\n\n\u003Cp\u003ECold Storage Facilities:\nIn our endeavor to offer fresh quality green vegetables to clients, we have developed state-of-the-art storage and packaging facilities at our premise at Dashada, Viramgam and also a branch office at Ahmedabad. These facilities include complete in-house pre-preparatory equipment for farming and picking fresh vegetable and fruits. The cold storage unit allows in keeping the vegetables at right temperature and thereby maintaining its nutritional value intact.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have state-of-the-art factory for processing, storing and packaging of our products. Other than our factory at Dashada, Viramgam.  we also have a branch office located at Ahmedabad. We have complete in-house pre-preparatory equipment for farming and picking fresh vegetable and fruits.\u003C/p\u003E\n\n\u003Cp\u003EWorkforce:\nOur efficient team of skilled and experienced workforce works with full dedication and efficiency. It is made sure that the Fresh Products are properly manufactured and packed so to increase its shelf-life. The manufactured and packed products are thoroughly checked by our quality analysts under various parameters.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a leading organization, we ensure that all our fresh vegetables are optimum in quality. Our quality controllers ensure that these are procured from reliable vendors \u0026amp; farmers. Besides, we ensure that they follow organic methods during farming and do not use any harmful chemicals or pesticides.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have been able to become the foremost choice of our clients owing to our quality assured fresh vegetables. Our professionals ensure that exact demands of our clients are fulfilled in a timely manner. Thus, we offer fresh green vegetables in bulk quantities and in a timely manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nCucumber, Radish, Potatoes, Tomatoes, Green Peas, Cauliflower, Carrot, Capsicum and Onions. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8487/248487v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8487/248487v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8487/248487v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}