{"name": "Trius Tech Support",
 "permalink": "trius-tech-support",
 "crunchbase_url": "http://www.crunchbase.com/company/trius-tech-support",
 "homepage_url": "http://www.triustechsupport.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 100,
 "founded_year": 2010,
 "founded_month": 7,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "computer-support, tech-support, virus-removal, windows-support, apple-support, spyware-removal, online-tech-support, email-setup, hp-tech-support, printer-tech-support, pc-optimization-support, software-support, laptop-tech-support",
 "alias_list": null,
 "email_address": "info@triustechsupport.com",
 "phone_number": "1-866-659-7866",
 "description": "",
 "created_at": "Thu Nov 22 17:04:40 UTC 2012",
 "updated_at": "Wed Dec 12 07:52:47 UTC 2012",
 "overview": "\u003Cp\u003ETrius Tech Support is a leading provider of tech support services to consumers and small businesses across a wide range of computing and communications devices and software. Trius Tech Support delivers support services to millions of customers globally and its services are available on a 24/7 basis, 365 days a year. With a growing global footprint, Trius Tech Support services are available in the United States, the United Kingdom \u0026amp; Canada.\u003C/p\u003E\n\n\u003Cp\u003EEver evolving technology has become intrinsic part of our day to day lives. We cannot even imagine our lives without computers. Though of much convenience, computers problems present challenges to laymen as well as most tech savvy folks. It is hard enough to figure out the simple use of the latest operating system let alone master it. That is where Trius Tech Support comes in! We provide comprehensive, computer technical support to our customers so that they can go on to focus on their lives and enjoy the benefits of this wonderful piece of technology instead of having to spend a lot of time and money mastering it.\u003C/p\u003E\n\n\u003Cp\u003ETrius Tech Support is a young upstart in the computer remote support industry. Our mantra is to stay agile and dynamic, to absorb latest technologies so that we can provide a single point solution to our customers. Our technicians can login remotely to the customers computer or laptop to solve whatever problems or issues that they might have; from configuring and installing printers, router, optimizing PCs for optimum performance, resolving all kinds of errors, removing viruses and malware to any other software related issue that one might have.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "2228N, Illinois St",
    "address2": "",
    "zip_code": "85225",
    "city": "Chandler",
    "state_code": "AZ",
    "country_code": "USA",
    "latitude": 33.3389707,
    "longitude": -111.8481024}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/triustech",
    "title": ""}]}