{"name": "Turrency",
 "permalink": "turrency",
 "crunchbase_url": "http://www.crunchbase.com/company/turrency",
 "homepage_url": "http://www.turrency.com",
 "blog_url": "http://turrency.tumblr.com",
 "blog_feed_url": "http://barterforfree.xanga.com/",
 "twitter_username": "barter4free",
 "category_code": "web",
 "number_of_employees": 1,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "barter, bartering, swap, swapping, trade, trading, barter-for, for-barter, trade-a, for-trade, trade-for, classifieds, exchange, barter-system",
 "alias_list": null,
 "email_address": "admin@turrency.com",
 "phone_number": "n/a",
 "description": "Barter and trade for free",
 "created_at": "Sat Sep 29 14:20:30 UTC 2012",
 "updated_at": "Mon Oct 22 02:39:52 UTC 2012",
 "overview": "\u003Cp\u003ETurrency.com is the future of bartering and trading!\u003C/p\u003E\n\n\u003Cp\u003ETurrency is a free global barter only classifieds platform provided for the masses by Social Media LLC.\u003C/p\u003E\n\n\u003Cp\u003EThe goal is to improve quality of life worldwide by providing a free bartering service to all in hopes unwanted items can find a great new owner!\u003C/p\u003E\n\n\u003Cp\u003EMost online bartering websites claim to assist in cashless exchanges for goods, while themselves charging cash to oversee the transaction. Feeling that that defeated the whole purpose of bartering, Turrency provides completely free classifieds to make up where competitors fall short. It is the philosophy of our company that we offer ads completely free, and give the ability for paid ad upgrades if users wish to enhance their ad above and beyond the standard post.\u003C/p\u003E\n\n\u003Cp\u003EBuilt by an avid bartering guru, Turrency has been tested and streamlined in every way so all the features prove easy to use. The site has a friendly and familiar feel, so even first time users have no problem navigating the site and using the enhanced features other classifieds sites envy.\u003C/p\u003E\n\n\u003Cp\u003EWhether it is a service or tangible goods you are looking to trade, Turrency is waiting to connect you with other like-minded people who value trading. The social and economic impact of bartering has been proven throughout the past, but has never had a resourceful tool to assist in the process such as this. The revolutionary features of Turrency will prove to evolve bartering onto the next step in it\u0026#8217;s natural progression.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [{"description": "Official Launch of Turrency.com",
    "stoned_year": 2012,
    "stoned_month": 10,
    "stoned_day": 15,
    "source_url": "http://www.prlog.org/11994364-barter-system-breakthrough-the-best-bartering-website-for-barter-deals.html",
    "source_text": null,
    "source_description": "A Barter System Breakthrough – The Best Bartering Website for Barter Deals!",
    "stoneable_type": "Company",
    "stoned_value": null,
    "stoned_value_type": null,
    "stoned_acquirer": null,
    "stoneable":
     {"name": "Turrency",
      "permalink": "turrency"}}],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}