{"name": "tuuth",
 "permalink": "tuuth",
 "crunchbase_url": "http://www.crunchbase.com/company/tuuth",
 "homepage_url": "http://www.tuuth.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "tuuth",
 "category_code": "software",
 "number_of_employees": 3,
 "founded_year": 2013,
 "founded_month": 2,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "dental-clinic, tooth, dentist",
 "alias_list": null,
 "email_address": "tuuth@tuuth.com",
 "phone_number": "",
 "description": "dental clinic on the cloud",
 "created_at": "Fri Apr 12 20:58:51 UTC 2013",
 "updated_at": "Fri Apr 12 20:58:57 UTC 2013",
 "overview": "\u003Cp\u003Etuuth is a dental clinic management system on the cloud.\u003C/p\u003E\n\n\u003Cp\u003EWork from anywhere\nImprove accessibility. You have access anytime, anywhere, making your life so much easier!\nAs long as your employees have internet access, they can work from anywhere. This flexibility positively affects work-life balance and productivity. tuuth also increases collaboration by allowing all employees – wherever they are – to sync up and check on appointments and patients details, and follow colleagues and records to receive critical updates in real time.\u003C/p\u003E\n\n\u003Cp\u003ESecure\nWith tuuth you don’t need to worry about your information, we´re on the cloud and everything is safely stored, encrypted and protected up there. We run with the latest worldwide security protocols so you won´t experience any data loss!\u003C/p\u003E\n\n\u003Cp\u003ESimple \nMaintain easy access to your information with minimal upfront spending.\u003C/p\u003E\n\n\u003Cp\u003EEconomy \nBy using tuuth you reduce capital costs for your clinic. There’s no need to spend big money on hardware, software or licensing fees. Just pay monthly or yearly as you use the software. This also means you won’t see major upfront software license fees or annual software upgrade fees.\u003C/p\u003E\n\n\u003Cp\u003EStatistics\nWith your tuuth plan you get a whole section where to check your account details and statistics, such as number of patients, appointments and general stats. Data centralization is really important for your business, it also leads to data consistency, better information sharing, and saves a lot of time too.\u003C/p\u003E\n\n\u003Cp\u003EOrganization \nKeep all your data in one single location and access to it at any time. See the digital history of your patients, save it in PDF format and you can print it too. You’ll be able to access to all the clinical information from everywhere and most importantly when you need it.\u003C/p\u003E\n\n\u003Cp\u003EBusiness Page\nTogether with your tuuth plan, you get your personalized business website for free. This allows  current customers and most importantly new ones to easily find your clinic on the internet at all times. Personalize your details, get your own url, twitter feed and display your location on Google Maps.\u003C/p\u003E\n\n\u003Cp\u003ENo Software\nMinimize licensing new software. Stretch and grow without the need to buy expensive software licenses or programs. And it gets better ! tuuth installs upgrades automatically which means, no disruption to the office and most importantly no lost productivity. Log in, and you get instantly the latest and greatest functionality. You also don\u0026#8217;t pay extra for the upgrades.\u003C/p\u003E\n\n\u003Cp\u003EMultiplatform\nDo you have a laptop, mobile, tablet and personal computer? With tuuth you’ll be able to work on all of them, no matter the platform (iOS, Windows, Linux), you just need an internet connection. Are you worried about where the data is stored? Well, because it’s in the cloud your information is synchronized at all times. No more copying to / from USB drives, printing, etc\u0026#8230; All the information is ready for you to use it !\u003C/p\u003E\n\n\u003Cp\u003EEnvironmentally friendly\nBy using tuuth cloud computing services your company will only use the server space you need, which decreases your carbon footprint. Using the cloud results in at least 30% less energy consumption and carbon emissions than using on-site servers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0025/1107/251107v2-max-150x150.png"],
     [[250,
       95],
      "assets/images/resized/0025/1107/251107v2-max-250x250.png"],
     [[383,
       146],
      "assets/images/resized/0025/1107/251107v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Co-Founder / CMO",
    "person":
     {"first_name": "Alex",
      "last_name": "Callejon",
      "permalink": "alex-callejon",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder / CTO",
    "person":
     {"first_name": "Jose",
      "last_name": "A Tizon",
      "permalink": "jose-a-tizon",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder / COO",
    "person":
     {"first_name": "Albert",
      "last_name": "Zaragoza",
      "permalink": "albert-zaragoza",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "London",
    "address1": "145 - 157 St John St",
    "address2": "",
    "zip_code": "EC1V 4PW",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}