{"name": "TVALB",
 "permalink": "tvalb",
 "crunchbase_url": "http://www.crunchbase.com/company/tvalb",
 "homepage_url": "http://www.tvalb.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "tvalb, albanian-tv, kanale-shqiptare-ne-internet, albanian-channels, tv-kanale-shqip, rtk-live, klantv, tv-tring, top-channel-shqip, telegrafi, muzik-shqip, radijo-marimanga, radio-marimanga, stupcat-humor-shqip",
 "alias_list": null,
 "email_address": "support@tvalb.com",
 "phone_number": "(718)-213-4282",
 "description": "50+ Albanian TV Channles",
 "created_at": "Mon Dec 24 07:11:15 UTC 2012",
 "updated_at": "Fri Dec 28 16:19:35 UTC 2012",
 "overview": "\u003Cp\u003ETVALB – INFORMACION TË BOLLSHËM, KULTURË DHE KËNAQËSI INTELEKTUALE\u003C/p\u003E\n\n\u003Cp\u003ETVALB është nën ombrellën e kompanisë së parë shqiptaro-amerikane për shërbime të IPTV-së \u0026#8220;FTAMARKET\u0026#8217; që filloi punën më 2002. Ajo mbështet në teknologjinë moderne të shek. XXI dhe i ofron komunitetit shqiptar sherbim bashkëkohor mediak.\u003C/p\u003E\n\n\u003Cp\u003ETVALB që nga viti 2006 ofron shërbime në IPTV për shqiptarët e Amerikës dhe të Kanadës. Së shpejti ky sherbim do te shtrihet edhe ne Europë, Australi dhe vende të tjera.\u003C/p\u003E\n\n\u003Cp\u003ETVALB ka një statues shërbimi profesional, cilësor dhe udhëhiqet nga parimi i vënies së teleshikuesit në vend të parë. TVALB jo vetëm është ne ballë të transmetimeve telvizive , por shquhet për ndershmëri në marrëdhënie me abonimentët, shërbim dhe gadishmëri teknike të lartë.\u003C/p\u003E\n\n\u003Cp\u003ETVALB përbëhet nga një staf të rinjsh shqiptarë të talentuar në Nju Jork SITI, që kanë kryer studimet universitare në SHBA.Ata janë të sjellshëm dhe të gatshëm për të ndihmuar abonimentët në porsitje të shërbimeve dhe në ndihmë teknike.\u003C/p\u003E\n\n\u003Cp\u003ETVALB , me transmetimet e veta cilesore, është bërë një mjet lehtësues për dëgjuesit shqiptarë ne Amerikë dhe Kanada, që të mos harrojnë gjuhën kombëtare, gjuhën shqipe, sidomos fë mijtë e tyre. Po ashtu , nëpërmjet programeve të larmishme ata fitojnë jo vetëm kenaqësi intelektuale, por edhe ruajne e mbajnë gjallë traditat e tyre kombëtare. Qendra administrative-teknike e TVALB e vendosur në një sallë vezulluese ne Artur Avenue gjallëron nga teleshikuesit e shpeshte qe vijnë për porosi, këshillime dhe diskutime programesh. Abonohuni menjeherë te TVALB, që u sjell informacion të bollshëm, kulturë dhe kenaqësi intelektuale !\u003C/p\u003E\n\n\u003Cp\u003ELejoni TVALB që t\u0026#8217;ju bëj të ndiheni \u0026#8220;Më afër vendlindjes\u0026#8221;!\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       50],
      "assets/images/resized/0022/6800/226800v2-max-150x150.jpg"],
     [[233,
       79],
      "assets/images/resized/0022/6800/226800v2-max-250x250.jpg"],
     [[233,
       79],
      "assets/images/resized/0022/6800/226800v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.tvalb.com/",
    "title": "Albanian TV Channels"}]}