{"name": "Tweet Dynamics",
 "permalink": "tweet-dynamics",
 "crunchbase_url": "http://www.crunchbase.com/company/tweet-dynamics",
 "homepage_url": "http://www.tweetdynamics.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 4,
 "founded_day": 26,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "twitter, map, tweets, trends, tweet-topics, tweet-category, tweet-analysis",
 "alias_list": null,
 "email_address": "support@querydynamics.com",
 "phone_number": "704-641-3588",
 "description": "Tweet topic analysis",
 "created_at": "Thu Apr 28 14:59:30 UTC 2011",
 "updated_at": "Thu Oct 27 22:34:54 UTC 2011",
 "overview": "\u003Cp\u003ETweet Dynamics categorizes tweets from users all over the world into topics.\u003C/p\u003E\n\n\u003Cp\u003EThe tweet topics are displayed on a Map Page and a Directory Page.\u003C/p\u003E\n\n\u003Cp\u003EMap Page \u003C/p\u003E\n\n\u003Cp\u003EThe topics into which the tweets fall are displayed on the map based on the location from which the tweet was sent. The darker and larger topics contain a greater number of tweets compared to the lighter and smaller topics. A topic can be clicked to view the tweets for that topic. The tweets are sorted based on when they were sent with the most recent tweet on top. Since a tweet can belong to multiple topics you might see tweets that are shared across various topics. You can zoom in/out the map and also focus on your region of interest by \nmoving the map on any direction. You can also select a topic from the \u0026#8216;select topic\u0026#8217; menu to view only that topic on the map.\u003C/p\u003E\n\n\u003Cp\u003EDirectory Page \u003C/p\u003E\n\n\u003Cp\u003EThe directory page provides a directory of topics on the left. Any topic can be clicked in the directory tree to get a list of tweets belonging to that topic. Since a tweet can belong to multiple topics you might see tweets that are shared across various topics.\u003C/p\u003E\n\n\u003Cp\u003ETweet Dynamics displays broad topics like sports and politics and specific topics like cell phones and baseball players.\u003C/p\u003E\n\n\u003Cp\u003EUnlike other websites that find tweet topics, Tweet Dyamics uses technology provided by Query Dynamics to find topics that are not based on keyword matches alone. For example for the topic cell phone Tweet Dynamics finds the following tweets:\u003C/p\u003E\n\n\u003Cp\u003Ea. MY friend just tried to convince me that iphones were cool\u0026#8230;smh ha!\u003C/p\u003E\n\n\u003Cp\u003Eb. BLACKBERRY 9800 TORCH T-MOBILE \u003Cem\u003EBOXED WITH CHARGER\u003C/em\u003E http://bit.ly/eBq97i\u003C/p\u003E\n\n\u003Cp\u003Ec. New post Nokia n900 flashed successfully http://www.cellphonetop.info/?p=10155\u003C/p\u003E\n\n\u003Cp\u003EThis is because the keywords \u0026#8216;iphones\u0026#8217;, \u0026#8216;BLACKBERRY 9800 TORCH\u0026#8217; and \u0026#8216;Nokia n900\u0026#8217; are names of cell phones. Other websites will not be able to able to display the same results since they just look for the keyword \u0026#8216;cell phone\u0026#8217; in the tweets.\u003C/p\u003E\n\n\u003Cp\u003ESimilarly, for the topic baseball Tweet Dynamics finds the following tweets:\u003C/p\u003E\n\n\u003Cp\u003Ea. Lets see whether Mariners hitters can continue building on their luck http://bit.ly/l51Wce\u003C/p\u003E\n\n\u003Cp\u003Eb. I\u0026#8217;m in Istanbul but I support Phillies,does it count? I\u0026#8217;m on your side man ;)\u003C/p\u003E\n\n\u003Cp\u003Ec. The Randy Johnson just for men beard dye commercial is the apex of modern advertising.\u003C/p\u003E\n\n\u003Cp\u003EThis is because the keywords Mariners and Phillies are baseball teams and Randy Johnson is a baseball player. As per the reasons stated above other websites will not be able to able to display the same results for the topic baseball.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       43],
      "assets/images/resized/0013/2401/132401v2-max-150x150.jpg"],
     [[250,
       71],
      "assets/images/resized/0013/2401/132401v2-max-250x250.jpg"],
     [[268,
       77],
      "assets/images/resized/0013/2401/132401v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Tweet Categorization Software",
    "permalink": "tweet-categorization-software",
    "image": null}],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}