{"name": "TwojaChmura",
 "permalink": "twojachmura",
 "crunchbase_url": "http://www.crunchbase.com/company/twojachmura",
 "homepage_url": "http://twojachmura.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "twojachmuracom",
 "category_code": "web",
 "number_of_employees": 3,
 "founded_year": 2013,
 "founded_month": 4,
 "founded_day": 22,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web, humor, funny, pictures, videos, texts, profiles, social, network",
 "alias_list": null,
 "email_address": "redakcja@twojachmura.com",
 "phone_number": "",
 "description": "TwojaChmura web service",
 "created_at": "Mon Apr 29 09:24:09 UTC 2013",
 "updated_at": "Mon Apr 29 22:02:03 UTC 2013",
 "overview": "\u003Cp\u003ETwojaChmura.com is the best site on the internet - researchers from Zimbabwe have no doubt. Respectable group of scientists at the University of Bulawayo, after hundreds of hours spent on comparisons, analysis, research and introwizjach established just such a verdict. As argued that a fact? Let us vote Mazinga Mugabe, President of the research team.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;TwojaChmura.com is more than a website. Think of it as a virtual, interactive city in the clouds, where every cloud is SEPARATELY attractions and other district.\u0026#8217;ll Find here cloud that will leave you in tears, it will be the best club of the stand-up comedy. Apart inspiration as a multi-art gallery, where a mix of styles of modern, classic, original, and street art. cloud full of beautiful women, where you feel like you just walked the beaches of Acapulco. place for car enthusiasts, sports, film , music, word - everyone will find their place.\nWhat\u0026#8217;s more, an interactive city allows you not only to the tour, but also the co. Introducing the TwojaChmura.com get your own private cloud, which you can utilize as you just like it. Can u you will find the most beautiful women in the world, best art, funniest photos - is up to you. Create your own cloud, a place to which he wanted to go, a place where you can show off to friends and friends. This diverse entertainment and creative community where you can meet many extraordinary people and learn new horizons. All decorated in a modern graphics that as soon as I see it I want to take a picture of your Polaroid. I, Mazinga Mugabe recommend this service, even though those TwojaChmura.com paralyzing the work of our university for weeks. \u0026#8221;\nAs a service TwojaChmura.com authors are too modest to comment on the positive feedback. However, the word scientist, famous for the entire Zimbabwean authority, has its meaning, we dare not argue with them. See for yourself whether they are true. Share photos, videos, music, open up to new possibilities, new people, new perspectives.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0025/5851/255851v2-max-150x150.png"],
     [[200,
       50],
      "assets/images/resized/0025/5851/255851v2-max-250x250.png"],
     [[200,
       50],
      "assets/images/resized/0025/5851/255851v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        150],
       "assets/images/resized/0025/5850/255850v2-max-150x150.png"],
      [[250,
        250],
       "assets/images/resized/0025/5850/255850v2-max-250x250.png"],
      [[450,
        450],
       "assets/images/resized/0025/5850/255850v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://twojachmura.com",
    "title": "Homepage"},
   {"external_url": "https://www.facebook.com/pages/Twojachmuracom/443655145729528?ref=tn_tnmn",
    "title": "Facebook"}]}