{"name": "TYGAMER",
 "permalink": "tygamer",
 "crunchbase_url": "http://www.crunchbase.com/company/tygamer",
 "homepage_url": "http://www.myhot16.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "games_video",
 "number_of_employees": 3,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "myhot16, pocket-pad-studio, new",
 "alias_list": null,
 "email_address": "TychicusJ@gmail.com",
 "phone_number": "901-734-0069",
 "description": "Pocket Pad Studio",
 "created_at": "Tue Oct 23 07:54:11 UTC 2012",
 "updated_at": "Fri Oct 26 18:38:52 UTC 2012",
 "overview": "\u003Cp\u003ETYGAMER creates all levels and categories in the App world.\u003C/p\u003E\n\n\u003Cp\u003EGet in the driver’s seat, because now you can be the “Producer” of your own project! Using an ipod or iphone, you can make beats, musical ensembles, and even drop multitrack vocals.\u003C/p\u003E\n\n\u003Cp\u003EGetting to the studio has never been easier, just put your musical ideas together with the Pocket Pad Studio and you’re ready for the world stage!\u003C/p\u003E\n\n\u003Cp\u003EThe Pocket Pad Studio powered by myhot16 is an innovative, yet powerful solution for singers, performers, creators, musicians, and anyone like yourself wanting to express themselves professionally with creating Mixed tapes and Masters.\u003C/p\u003E\n\n\u003Cp\u003EWITH THIS APP YOU CAN EVEN WRITE \u0026amp; COMPOSE SHEET MUSIC!!\u003C/p\u003E\n\n\u003Cp\u003EMaster Your Product\u003C/p\u003E\n\n\u003Cp\u003EWith the Pocket Pad Studio’s crisp clean high quality sound in post, you can add your vocals tracks into your device and prepare for professional distribution.\u003C/p\u003E\n\n\u003Cp\u003EShare Your Music\u003C/p\u003E\n\n\u003Cp\u003EWhats really cool is that you can do this on any ipad, iphone, ipod, or android mobile phone device. The sound quality will astound your friends on the networks, i.e. YouTube; Facebook; Twitter; and more \u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EExpansion\u003C/p\u003E\n\n\u003Cp\u003EExpand your real time high quality production and recording experience with the Pocket Pad Studio Expansion PAKS. These PAKS have been created using professional high quality 96k studio samples. The Pocket Pad Studio Expansion PAKS are unique sound bank packages carefully selected by some of the industry’s top producers. The Pocket Pad Studio Expansion PAKS currently come in five distinctive genres: Hip Hop Beats, Pop Tunes, R\u0026amp;B Sounds, Piano Licks, and Wind Instruments.\u003C/p\u003E\n\n\u003Cp\u003EFeatures that make the Pocket Pad Studio Special:\u003C/p\u003E\n\n\u003Cp\u003E•Super simple to operate without having to use a manual, making it Fun for a novice to create a high end studio quality tune.\n•Premium master quality sounds used in multi-platinum, Grammy awarded hit songs provides that sounds professionals expect to hear in high-end studio hardware equipment.\n•Pre-programmed functions cuts out a lot of work making it simple and fun to produce a professional sounding production.\n•Import \u0026amp; export midi \u0026amp; wave via Dropbox \u0026amp; CPU\n•Full 72 keys capabilities on keyboard synthesizer\n•Link \u0026amp; upload recorded material to a professional studio\n• Link devices to share in the creation of a beat\n•Write pad- composer can create music on a standard staff music sheet using only a finger tap\n• Print \u0026amp; email capabilities\n•Upload to social world with just a touch of a button\n•MAGIC button: auto-quantized all recorded material to produce perfect timed playback production with the touch of a Button.\n•Sound PAKS frequently releases keeps you updated with the latest sounds created by your favorite Super-Producers.\n•EASY import of New Sounds PAKS\n• Hip Stylish Clean Look, not cluttered with a lot of buttons and knobs never used\n•Has all the most important qualities that your known branded keyboards, Mpc, guitars and microphones have.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       106],
      "assets/images/resized/0021/6778/216778v2-max-150x150.jpg"],
     [[250,
       178],
      "assets/images/resized/0021/6778/216778v2-max-250x250.jpg"],
     [[450,
       320],
      "assets/images/resized/0021/6778/216778v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}