{"name": "U.S. Small Business Administration",
 "permalink": "u-s-small-business-administration",
 "crunchbase_url": "http://www.crunchbase.com/company/u-s-small-business-administration",
 "homepage_url": "http://www.sba.gov/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "sbagov",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1953,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "small-business, us-government-agency, small-business-protection",
 "alias_list": "USSBA, Small-Business-Administration, SBA",
 "email_address": "answerdesk@sba.gov",
 "phone_number": "1-800-827-5722",
 "description": "U.S. Government Agency",
 "created_at": "Fri Dec 17 06:23:19 UTC 2010",
 "updated_at": "Fri Dec 17 06:23:17 UTC 2010",
 "overview": "\u003Cp\u003EThe U.S. Small Business Administration (SBA) was created in 1953 as an independent agency of the federal government to aid, counsel, assist and protect the interests of small business concerns, to preserve free competitive enterprise and to maintain and strengthen the overall economy of our nation. We recognize that small business is critical to our economic recovery and strength, to building America\u0026#8217;s future, and to helping the United States compete in today\u0026#8217;s global marketplace. Although SBA has grown and evolved in the years since it was established in 1953, the bottom line mission remains the same. The SBA helps Americans start, build and grow businesses. Through an extensive network of field offices and partnerships with public and private organizations, SBA delivers its services to people throughout the United States, Puerto Rico, the U. S. Virgin Islands and Guam.\u003C/p\u003E\n\n\u003Cp\u003EOverview \u0026amp; History\u003C/p\u003E\n\n\u003Cp\u003ESince its founding on July 30, 1953, the U.S. Small Business Administration has delivered millions of loans, loan guarantees, contracts, counseling sessions and other forms of assistance to small businesses.\u003C/p\u003E\n\n\u003Cp\u003EThe SBA was officially established in 1953, but its philosophy and mission began to take shape years earlier in a number of predecessor agencies, largely as a response to the pressures of the Great Depression and World War II.\u003C/p\u003E\n\n\u003Cp\u003EThe Reconstruction Finance Corporation (RFC), created by President Herbert Hoover in 1932 to alleviate the financial crisis of the Great Depression, was SBA\u0026#8217;s grandparent.  The RFC was basically a federal lending program for all businesses hurt by the Depression, large and small.  It was adopted as the personal project of Hoover\u0026#8217;s successor, President Franklin D. Roosevelt, and was staffed by some of Roosevelt\u0026#8217;s most capable and dedicated workers.\u003C/p\u003E\n\n\u003Cp\u003EConcern for small business intensified during World War II, when large industries beefed up production to accommodate wartime defense contracts and smaller businesses were left unable to compete.  To help small business participate in war production and give them financial viability, Congress created the Smaller War Plants Corporation (SWPC) in 1942.  The SWPC provided direct loans to private entrepreneurs, encouraged large financial institutions to make credit available to small enterprises, and advocated small business interests to federal procurement agencies and big businesses.\u003C/p\u003E\n\n\u003Cp\u003EThe SWPC was dissolved after the war, and its lending and contract powers were handed over to the RFC.  At this time, the Office of Small Business (OSB) in the Department of Commerce also assumed some responsibilities that would later become characteristic duties of the SBA. Its services were primarily educational.  Believing that a lack of information and expertise was the main cause of small business failure, the OSB produced brochures and conducted management counseling for individual entrepreneurs.\u003C/p\u003E\n\n\u003Cp\u003ECongress created another wartime organization to handle small business concerns during the Korean War, this time called the Small Defense Plants Administration (SDPA).  Its functions were similar to those of the SWPC, except that ultimate lending authority was retained by the RFC. The SDPA certified small businesses to the RFC when it had determined the businesses to be competent to perform the work of government contracts.\u003C/p\u003E\n\n\u003Cp\u003EBy 1952, a move was on to abolish the RFC. To continue the important functions of the earlier agencies, President Dwight Eisenhower proposed creation of a new small business agency \u0026#8211; the Small Business Administration (SBA).\u003C/p\u003E\n\n\u003Cp\u003EIn the Small Business Act of July 30, 1953, Congress created the Small Business Administration, whose function was to \u0026#8220;aid, counsel, assist and protect, insofar as is possible, the interests of small business concerns.\u0026#8221; The charter also stipulated that the SBA would ensure small businesses a \u0026#8220;fair proportion\u0026#8221; of government contracts and sales of surplus property.\u003C/p\u003E\n\n\u003Cp\u003EBy 1954, SBA already was making direct business loans and guaranteeing bank loans to small businesses, as well as making loans to victims of natural disasters, working to get government procurement contracts for small businesses and helping business owners with management and technical assistance and business training.\u003C/p\u003E\n\n\u003Cp\u003EThe Investment Company Act of 1958 established the Small Business Investment Company (SBIC) Program, under which SBA licensed, regulated and helped provide funds for privately owned and operated venture capital investment firms. They specialized in providing long-term debt and equity investments to high-risk small businesses. Its creation was the result of a Federal Reserve study that discovered, in the simplest terms, that small businesses could not get the credit they needed to keep pace with technological advancement.\u003C/p\u003E\n\n\u003Cp\u003EIn 1964, SBA began to attack poverty through the Equal Opportunity Loan (EOL) Program. The EOL Program relaxed the credit and collateral requirements for applicants living below the poverty level in an effort to encourage new businesses that had been unable to attract financial backing, but were nevertheless sound commercial initiatives.\u003C/p\u003E\n\n\u003Cp\u003ESBA has grown in terms of total assistance provided and its array of programs tailored to encourage small enterprises in all areas.  SBA\u0026#8217;s programs now include financial and federal contract procurement assistance, management assistance, and specialized outreach to women, minorities and armed forces veterans. The SBA also provides loans to victims of natural disasters and specialized advice and assistance in international trade.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[140,
       60],
      "assets/images/resized/0011/4419/114419v1-max-150x150.png"],
     [[140,
       60],
      "assets/images/resized/0011/4419/114419v1-max-250x250.png"],
     [[140,
       60],
      "assets/images/resized/0011/4419/114419v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Chief of Staff",
    "person":
     {"first_name": "Ana",
      "last_name": "M. Ma",
      "permalink": "ana-m-ma",
      "image": null}},
   {"is_past": false,
    "title": "Administrator",
    "person":
     {"first_name": "Karen",
      "last_name": "G. Mills",
      "permalink": "karen-g-mills",
      "image": null}},
   {"is_past": false,
    "title": "COO",
    "person":
     {"first_name": "Eileen",
      "last_name": "Harrington",
      "permalink": "eileen-harrington",
      "image": null}},
   {"is_past": false,
    "title": "Deputy Administrator",
    "person":
     {"first_name": "Marie",
      "last_name": "C. Johns",
      "permalink": "marie-c-johns",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [{"funding_round":
     {"round_code": "unattributed",
      "source_url": "http://www.marketwire.com/press-release/Zonit-Structured-Solutions-Receives-a-Half-Million-Dollars-in-Financing-From-SBA-1413111.htm",
      "source_description": "Zonit Structured Solutions Receives a Half Million Dollars in Financing From SBA",
      "raised_amount": 500000.0,
      "raised_currency_code": "USD",
      "funded_year": 2011,
      "funded_month": 3,
      "funded_day": 17,
      "company":
       {"name": "Zonit Structured Solutions",
        "permalink": "zonit-structured-solutions",
        "image":
         {"available_sizes":
           [[[150,
              36],
             "assets/images/resized/0012/6664/126664v1-max-150x150.jpg"],
            [[250,
              61],
             "assets/images/resized/0012/6664/126664v1-max-250x250.jpg"],
            [[281,
              69],
             "assets/images/resized/0012/6664/126664v1-max-450x450.jpg"]],
          "attribution": null}}}}],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "409 3rd Street, SW",
    "address2": "",
    "zip_code": "20416",
    "city": "Washington",
    "state_code": "DC",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.facebook.com/SBAgov",
    "title": "Facebook Page"},
   {"external_url": "http://www.youtube.com/sba",
    "title": "YouTube Page"},
   {"external_url": "http://en.wikipedia.org/wiki/Small_Business_Administration",
    "title": "Wiki Page"}]}