{"name": "Ubuy",
 "permalink": "ubuy",
 "crunchbase_url": "http://www.crunchbase.com/company/ubuy",
 "homepage_url": "http://www.ubuy.com.kw",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "ubuykw",
 "category_code": "ecommerce",
 "number_of_employees": 30,
 "founded_year": 2012,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "ecommerce, shopping-online-kuwait, kuwait-online-store, online-store, ubuy, ubuy-kuwait",
 "alias_list": null,
 "email_address": "info@ubuy.com.kw",
 "phone_number": "+96524745456",
 "description": "Online Shopping Kuwait",
 "created_at": "Mon May 27 14:10:39 UTC 2013",
 "updated_at": "Tue May 28 14:59:25 UTC 2013",
 "overview": "\u003Cp\u003EUbuy is not your usual e-commerce website, we provide excellent variety to customers in products while maintaining a great network with vendors. Today shoppers want more in a shorter time period, and let\u0026#8217;s not forget the easy purchase methods and delivery to make it worth their while. Based in Kuwait, Ubuy provides its shoppers with product categories that keeps them coming back. So isn\u0026#8217;t it time you consider window shopping from where you are?\u003Cbr/\u003E\nUbuy Core Values: \nAs we grew, it became more important to state and define our core values, in which we develop our brand and business strategy. These are our values that we live by:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EDeliver the Supercalifragilisticexpialidocious Philosophy.\u003C/li\u003E\n\u003Cli\u003EDrive Change\u003C/li\u003E\n\u003Cli\u003EBe Creative\u003C/li\u003E\n\u003Cli\u003EBe Passionate\u003C/li\u003E\n\u003Cli\u003EPursue Growth\u003C/li\u003E\n\u003Cli\u003EDo More With Less\u003C/li\u003E\n\u003Cli\u003ECustomer Service Isn\u0026#8217;t Just A Department! \nWe have been asked how we’ve grown so quickly, the answer is simple. We have positioned the organization in providing the best and cheapest products and to provide the best customer service possible through technology. Internally, we call this our Supercalifragilisticexpialidocious. (Longest word in English. Look up its meaning) philosophy.\nSupercalifragilisticexpialidocious encompasses a lot of things. You must differentiate yourself, which means doing something a little unconventional and innovative. You must do something that\u0026#8217;s above and beyond what\u0026#8217;s expected.\nWe must all learn not only to not fear change, but to also embrace it enthusiastically, and perhaps even more importantly, to encourage and drive it. We must always plan for and be prepared for constant change.\nNever accept or be too comfortable with the status quo because, historically, the companies that get into trouble are the ones that aren\u0026#8217;t able to respond quickly enough and adapt to change.\nWe value passion, determination, perseverance, and the sense of urgency.\nWe are inspired because we believe in what we are doing. We don\u0026#8217;t take \u0026#8220;no\u0026#8221; or \u0026#8220;that\u0026#8217;ll never work\u0026#8221; for an answer.\nPassion and determination are contagious. We believe in having a positive and optimistic but realistic attitude about everything we do because we realize that this inspires others to have the same attitude.\nWe believe in operational excellence and realize that there is always room for improvement in everything we do. This means that our work is never done. In order to stay ahead of the competition (or would-be competition), we need to continuously innovate as well as make incremental improvements to our operations, always striving to make ourselves more efficient, always trying to figure out how to do something better. We use mistakes as learning opportunities. \nWe understand that this is unheard of in Kuwait. We would like to welcome to a new breed of company in Kuwait.\u003C/li\u003E\n\u003C/ol\u003E",
 "image":
  {"available_sizes":
    [[[103,
       90],
      "assets/images/resized/0026/7598/267598v2-max-150x150.png"],
     [[103,
       90],
      "assets/images/resized/0026/7598/267598v2-max-250x250.png"],
     [[103,
       90],
      "assets/images/resized/0026/7598/267598v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarter",
    "address1": "Block 3, Street 30",
    "address2": "Building 1140-1141, Office 1-A.",
    "zip_code": "13020",
    "city": "Al Rai",
    "state_code": null,
    "country_code": "KWT",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        101],
       "assets/images/resized/0026/7597/267597v2-max-150x150.png"],
      [[250,
        169],
       "assets/images/resized/0026/7597/267597v2-max-250x250.png"],
      [[450,
        305],
       "assets/images/resized/0026/7597/267597v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.ubuy.com.kw",
    "title": "Ubuy"}]}