{"name": "ulink",
 "permalink": "ulink",
 "crunchbase_url": "http://www.crunchbase.com/company/ulink",
 "homepage_url": "http://www.ulinkx.com",
 "blog_url": "http://blog.ulinkx.com",
 "blog_feed_url": "http://blog.ulinkx.com/xml/rss/feed.xml",
 "twitter_username": null,
 "category_code": "games_video",
 "number_of_employees": 7,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social, bookmarking, search-engine, video",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": null,
 "created_at": "Thu Feb 28 18:25:35 UTC 2008",
 "updated_at": "Fri Jan 04 21:49:25 UTC 2013",
 "overview": "\u003Cp\u003E\u0026#8220;uLinkx\u0026#8217;s new Customizable All In One Video page feature provides access to popular videos from many top video sharing web sites like YouTube, Google videos, MySpace, Metacafe, Reuters, Yahoo, Revver, Grouper, iFilm, Dailymotion, Veoh and many more sites on a single page. It provides videos under different categories like news, sports, entertainment, music and movies. Users can customize All In One Video page by reordering the video channels using the drag and drop feature.\u003C/p\u003E\n\n\u003Cp\u003EUsers can select uLinkx popular videos based on today, week, month and all time. uLinkx video search results have been enhanced to allow users to sort search results based on relevance and date. uLinkx new Family Filter feature allow users to filter out videos based on family preferences. uLinkx added support to index current news videos. Users can now view current news videos at a single location. uLinkx had also added an easy way to import YouTube user\u0026#8217;s videos.\u003C/p\u003E\n\n\u003Cp\u003EuLinkx added video search API to allow partners to take advantage of uLinkx video search technology. Partners can use the API to enable video search and play videos on their web site. \u003C/p\u003E\n\n\u003Cp\u003EuLinkx, a video search engine for people to search and watch web videos, today opened its service to the masses. Apart from video search, it provides video bookmarking and platform for organizing, socializing and video syndication.\u003C/p\u003E\n\n\u003Cp\u003EuLinkx collects videos from many video sharing web sites, like Youtube, Google videos, MySpace, Metacafe, Yahoo, Revver, Grouper, iFilm, Dailymotion and many more. uLinkx video search engine is self learning as it keeps looking for the relevant videos based on user search and watch patterns. Users can bookmark any video they find on internet using uLinkx bookmarklet, which automatically collects relevant video metadata from popular video hosting websites.\u003C/p\u003E\n\n\u003Cp\u003EUsers can do quick local video search on uLinkx and live video search on Youtube, Google, Myspace, Metacafe, Yahoo, Revver and Grouper by clicking on the tabs.\u003C/p\u003E\n\n\u003Cp\u003EuLinkx provides top videos from the web(Youtube, Google, Myspace, Metacafe, Yahoo, Revver) at its home page. Users can also browse through videos based on popularity, popular tags, most recently added and most recently watched videos. uLinkx supports tagging both by letting users associate a set of keywords with the videos/playlist and browse through their tags.\u003C/p\u003E\n\n\u003Cp\u003EBy registering, users can share videos, save their favorites, create playlist, comment on the videos/playlist. uLinkx allows users to collect their videos in playlist with different view options- (List, Grid, Show). Users can elect to broadcast their playlist publicly or share them privately with friends and family. uLinkx is building a community that is highly motivated to watch and share videos. At uLinkx user can add other users as friends and find out what their friends are watching. uLinkx provides support for Quicklist and History.\u003C/p\u003E\n\n\u003Cp\u003EuLinkx supports video embedding, which allows users to insert a video clip into myspace, blogs, or other web sites where anyone can watch them. The video clips are not hosted by uLinkx but user can play it on uLinkx using the embedded code from the video source site.\u003C/p\u003E\n\n\u003Cp\u003EAt uLinkx users can earn money by providing Google adsense information. uLinkx will show Google ads using their adsense id on playlist and videos collected by them.\u003C/p\u003E\n\n\u003Cp\u003EuLinkx lets user quickly post the video to these bookmarking services like digg, reddit, newsvine, blinklist, delicious, google bookmark and yahoo myweb.\u003C/p\u003E\n\n\u003Cp\u003EuLinkx supports video syndication using widgets and Google gadgets. Users can place uLinkx playlist and search plug-in on their web page or Google personalized page. uLinkx provides comprehensive media RSS feeds which can be used by developers as an API.\u0026#8221;\u003C/p\u003E\n\n\u003Cp\u003E(Source: uLinkx)\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       38],
      "assets/images/resized/0003/8226/38226v1-max-150x150.png"],
     [[223,
       57],
      "assets/images/resized/0003/8226/38226v1-max-250x250.png"],
     [[223,
       57],
      "assets/images/resized/0003/8226/38226v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": null,
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Fremont",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 37.548615,
    "longitude": -121.988479}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        95],
       "assets/images/resized/0003/8227/38227v1-max-150x150.png"],
      [[250,
        159],
       "assets/images/resized/0003/8227/38227v1-max-250x250.png"],
      [[450,
        287],
       "assets/images/resized/0003/8227/38227v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.ulinkx.com",
    "title": ""}]}