{"name": "Ultimo Fashions",
 "permalink": "ultimo-fashions",
 "crunchbase_url": "http://www.crunchbase.com/company/ultimo-fashions",
 "homepage_url": "http://www.ultimofashions.co.uk/",
 "blog_url": "http://www.ultimofashions.co.uk/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 45,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "jackets, replica-jackets, movie-jackets, easy-rider-jacket",
 "alias_list": null,
 "email_address": "sophiajacob8@gmail.com",
 "phone_number": "",
 "description": "You can buy easily online jackets.",
 "created_at": "Wed Sep 19 13:58:13 UTC 2012",
 "updated_at": "Mon Sep 24 21:37:09 UTC 2012",
 "overview": "\u003Cp\u003EWhat Ultimo Fashions has for you?\u003C/p\u003E\n\n\u003Cp\u003E“You deserve a better apparel” that is what Ultimo Fashions is acquainted with when it relates to our valued customers. We are familiar with your taste and understand the need of your outfit to be synchronized with your persona. We have the finest range of leather fabrics waiting to associate worth to your individuality transmitting the sensation of prominence in your body. Our satisfied customers enable us to present innovative styles and introduce more revolutionary designs that meet the required fashion statement with the ability to assure quality and originality, in accordance with the market trends.\u003C/p\u003E\n\n\u003Cp\u003EUltimo Fashions is equipped with the diverse collection of Leather jackets that are highly demanded in all over the world that includes replica jackets, Motorcycle jackets, Movie jackets, Celebrity jackets, Halloween jackets, Slim fit jackets, Bomber jackets, Women jackets, Faux jackets, Michael Jackson jackets, Mission impossible jackets, Matrix coat, Fight club jackets, X men jackets, Supernatural jackets,  Easy rider jackets, Ironman jackets, Wanted jackets, Superman jackets, Transformer jackets, Alex mercer jackets, Layer Cake jackets, 17 Again jackets, Honda motorcycle jacket, Kawasaki motorcycle jacket, Yamaha motorcycle jacket, Suzuki motorcycle jacket, Easter Special, Justin Bieber Jackets and there is a lot more to come.\u003C/p\u003E\n\n\u003Cp\u003EUltimo Fashion has a team that has the capability to design and tailor the state of the art Leather Jacket that’s eye catching and can grab the attention of any glimpse that has the wisdom to judge a fine quality Leather fabric. We make Jackets that are a result of the most outstanding articulated symphony persuading our customers complying with excellence and admirable work of art.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[133,
       125],
      "assets/images/resized/0021/2048/212048v2-max-150x150.jpg"],
     [[133,
       125],
      "assets/images/resized/0021/2048/212048v2-max-250x250.jpg"],
     [[133,
       125],
      "assets/images/resized/0021/2048/212048v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0021/2047/212047v2-max-150x150.jpg"],
      [[250,
        156],
       "assets/images/resized/0021/2047/212047v2-max-250x250.jpg"],
      [[450,
        281],
       "assets/images/resized/0021/2047/212047v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}