{"name": "UMS Tech Labs",
 "permalink": "ums-tech-labs",
 "crunchbase_url": "http://www.crunchbase.com/company/ums-tech-labs",
 "homepage_url": "http://www.umstechlabs.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "computer-software-solution-providers, google-apps-integrators, email-solution-providers, corporate-email-solution-providers, product-development-cloud-computing, cloud-products, mobile-products, web-products, computer-software-developers-for-internet, pyt",
 "alias_list": null,
 "email_address": "contact@umstechlabs.com",
 "phone_number": "+919881472930",
 "description": "",
 "created_at": "Tue Feb 26 15:31:19 UTC 2013",
 "updated_at": "Thu Apr 04 10:38:40 UTC 2013",
 "overview": "\u003Cp\u003EUMS Tech Labs is the Product Development division of UMS Consultants, a Google Apps Authorized Reseller and Google Apps Implementation and Migration Specialists. UMS works with small and medium businesses, schools, colleges and universities to help them move on the Cloud. We give our clients a competitive advantage – functional, reliable and flexible computing through on-demand software (SaaS) with significant cost-savings.\u003C/p\u003E\n\n\u003Cp\u003EUMS focuses on  developing Cloud Apps, Google Apps for Education, Google Apps for Business, Next Gen Technology Consultancy, Mobile Apps, Single Sign On, Bulk Users Provisioning, Automatic Email Routing, Email Security, Bulk Email Marketing Product, Custom SSO Login Page for Google Apps.\u003C/p\u003E\n\n\u003Cp\u003EOur client list is spread across the globe and includes major clients like BITS Pilani University (Dubai, Goa, Hyderabad and Pilani). We actively operate in UK, Dubai, Singapore and India.  We are an Agile Company and strongly believe in Innovation, Synchronization and Perfection.\u003C/p\u003E\n\n\u003Cp\u003EWe have worked with very large scale implementations of Google Apps (largest being 35,000+ users). We have our own data center facility as well: clouddatanet.com and a more youth oriented brand for the same: arrabaap.com\u003C/p\u003E\n\n\u003Cp\u003EFor more details please visit our website www.umstechlabs.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/7815/247815v2-max-150x150.png"],
     [[180,
       180],
      "assets/images/resized/0024/7815/247815v2-max-250x250.png"],
     [[180,
       180],
      "assets/images/resized/0024/7815/247815v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}