{"name": "Uni Solutions Inc",
 "permalink": "uni-solutions-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/uni-solutions-inc",
 "homepage_url": "http://uneesolutions.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "pradeep@uni-solutions.net",
 "phone_number": "",
 "description": "",
 "created_at": "Fri Feb 01 21:44:00 UTC 2013",
 "updated_at": "Sun Feb 03 06:53:12 UTC 2013",
 "overview": "\u003Cp\u003ELead to Market provides fully comprehensive lead generation and complimentary outbound and inbound call services according to a unique cost efficient operational model. It is our aim to simplify the lives of clients and their customers. We provide innovative practices and strategies, tailored to meet our clients’ very specific requirements, so they can focus on their core business.\u003C/p\u003E\n\n\u003Cp\u003EWe have corporate locations in Houston, Bangalore and Tel-Aviv, Israel.  Most of our dedicated staff is based in one of our two Bangalore offices, providing lead generation and other complimentary services to the US, Canada, UK, Israel, Germany, Australia, South Africa and India.\u003C/p\u003E\n\n\u003Cp\u003EThe company was founded in 2006 with the vision that higher value services could be delivered from the outsourcing capital of the world – Bangalore, India. Our boutique sales services firm breaks the traditional cultural barriers when off-shoring key business functions. We believe in doing honest, high quality business while ensuring that each and every one of our customers profits from our services.\u003C/p\u003E\n\n\u003Cp\u003Ere you a startup that is looking to bring your product to the US market but are not yet ready to pay the high costs of bringing on a US sales representative? Maybe you would like to conduct a few sales meetings on your own first with qualified prospects in order to get a feel for the target customer.\u003C/p\u003E\n\n\u003Cp\u003EIs your sales team not bringing in an adequate number of new prospects into the pipeline and therefore you would like to boost their productivity? Would you be able to better leverage your very expensive sales team if each sales rep had an additional 10-20 sales meetings a month with new accounts?\u003C/p\u003E\n\n\u003Cp\u003EAre you in a situation where you know that an inside sales team could help boost revenue but you cannot take the risk of paying the high salaries associated with a US inside sales team up front – not to mention the challenges around hiring and managing the team?\u003C/p\u003E\n\n\u003Cp\u003EHave your marketing activities not managed to open the sales pipeline and bring in as much activity as you had hoped? Have you spent thousands of dollars on advertising and with all of the visits to your website, you are still not receiving anything that your sales team can work with?\u003C/p\u003E\n\n\u003Cp\u003EIf you are a company who is trying to target the US market and do not have the knowledge and expertise of “how to get your foot in the door” of the US Fortune 2000 or small and medium businesses, we can help you access the market at a fraction of the cost of all other services.\u003C/p\u003E\n\n\u003Cp\u003EWhy Lead to Market? We  provide you with the most professional and cost effective lead generation solutions to increase B2B transactions.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}