{"name": "Unique Enterprises",
 "permalink": "unique-enterprises",
 "crunchbase_url": "http://www.crunchbase.com/company/unique-enterprises",
 "homepage_url": "http://www.indiamart.com/uniqueenterprises-fort/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "uniqueenterprises-fort@tradepassport.org",
 "phone_number": "9821050464",
 "description": "Manufacturing and Exporting",
 "created_at": "Thu Apr 04 12:25:17 UTC 2013",
 "updated_at": "Thu Apr 04 12:25:19 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2006, we, “Unique Enterprises, Mumbai”, are considered as one of the acclaimed organizations engaged in the field of Manufacturing, Supplying Importing, Trading, Wholesaling and Exporting an excellent range of Energy Conservation and Solar Water Heating Products. Under the offered range, we provide Energy Conservation Products, Solar Products, Emergency Lights, Special Application Products, Wires and Solar Water Heating System.\u003C/p\u003E\n\n\u003Cp\u003EOur Aim:\nOur Company\u0026#8217;s aim is to provide best quality products to clients at competitive rates and within the scheduled time period. For this, highest priority is given to new product development comprising optimum quality.\u003C/p\u003E\n\n\u003Cp\u003EMission:\nThe prime objective of our organization has been to attain full customer satisfaction not only till buying but also provide post sales support. We have always kept our promise to deliver best products with incorporation of latest trends. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur team appointed by us have been providing valuable and very genuine services for the perfect manufacturing process with our sincere goal to manufacture only the best. Owing to their hard work and endeavors, we have garnered satisfaction level of our clients in an efficient manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nbacked by our well-organized infrastructure that sprawling across a large area, we have been able to meet the diversified needs of our clients by offering them an excellent range of Energy Conservation and Solar Water Heating Products in an effective manner.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nFrom the very beginning, quality assurance has been priority of focus followed by which we have been established our organization as one of the leading one in the field. Also, we appoint experienced quality controllers who keep a strict vigil of the manufacturing process of these Energy Conservation and Solar Water Heating Products.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe have been implementing all our business activities in strict compliance with higher satisfaction level of our clients. We offer our esteemed clients with qualitative range of Energy Conservation and Solar Water Heating Products, that is prepared with the use by optimum-grade material and other components. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7894/247894v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7894/247894v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7894/247894v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}