{"name": "Unique Electrocreators",
 "permalink": "unique-electrocreators",
 "crunchbase_url": "http://www.crunchbase.com/company/unique-electrocreators",
 "homepage_url": "http://www.indiamart.com/uniqueelectrocreators/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "uniqueelectrocreators@tradepassport.org",
 "phone_number": "08377801099",
 "description": "manufacturer, trader and supplier",
 "created_at": "Fri Apr 05 13:23:26 UTC 2013",
 "updated_at": "Fri Apr 05 13:23:31 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2010, at New Delhi (Delhi, India), we, “Unique Electrocreators Private Limited” are an “ISO 9001:2008” certified organization engaged in manufacturing, trading and supplying a qualitative assortment of CFL, RO Systems, Ceiling Fans, Exhausts, GEC and Pedestal Fans, Induction Lamps, Industrial Exhaust, Tube Axial Fans.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality\nWe offer our valuable clients a high quality array of products that is manufactured using high grade raw material and advanced technology in our well-developed fabrication unit. At our organization, the entire production process is strictly monitored by our expert team of quality inspectors, who have an in-depth knowledge in this domain. With the support of our in-house testing lab, our entire product range is inspected on different parameters of quality to eradicate all the flaws from the assortment.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe are supported with a sophisticated infrastructural facility that is sprawled over a large area of land and assists us in the manufacturing of a wide range of products. In addition to this, we have segregated our large infrastructural base into various departments such as production, quality control, sales \u0026amp; marketing, etc., in order to work smoothly. These departments are equipped with the latest machinery and superior technology that are operated by our professionals. Further, we regularly upgrade our infrastructural facility to carry out smooth production process.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe consider our team as one of the strongest pillars of our company. Our talented and competent team of professionals works in close coordination to fulfill the varied organizational goals. We have employed engineers, well trained technicians, quality controllers and sales \u0026amp; marketing personnel. They are committed to assigned tasks and work with full determination to meet the specific needs and requirements of the customers.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nIn order to supply our clients a wide range of superior quality products, we have formed strong business relations with eminent vendors of the industry. These vendors are selected with the help of our sourcing agents with an extensive market research.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?:\n    Affluent distribution network\n    Skilled \u0026amp; Veteran labor force\n    Stress free transactions\n    Timely delivery of consignment.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/8688/248688v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8688/248688v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/8688/248688v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}