{"name": "United Patent Research",
 "permalink": "united-patent-research",
 "crunchbase_url": "http://www.crunchbase.com/company/united-patent-research",
 "homepage_url": "http://unitedpatentresearchltd.net/",
 "blog_url": "http://unitedpatentresearchltd.tumblr.com/",
 "blog_feed_url": "http://unitedpatentresearchltd.tumblr.com/rss",
 "twitter_username": "UnitedPatentRsr",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "united-patent-research, united-patent-resources-ltd",
 "alias_list": null,
 "email_address": "",
 "phone_number": "888-997-7113\t",
 "description": "Product Development/Patent Assistance",
 "created_at": "Mon Apr 22 04:01:53 UTC 2013",
 "updated_at": "Mon Apr 29 15:18:02 UTC 2013",
 "overview": "\u003Cp\u003EProduct development company United Patent Research, LTD, guides clients through every step of the process, from concept, to patenting and licensing, to marketing and manufacture. UPR utilizes a thorough confidentiality agreement and non-disclosure agreement in order to safeguard the unique ideas of its clients until adequate patenting, and trademarking can cover the product.\u003C/p\u003E\n\n\u003Cp\u003EUnderstanding that some people need a little extra help coming up with the perfect invention and bringing it to market, United Patent Research supplies prospective clients with a two-page Nine Simple Invention Criteria \u0026amp; Frequently Asked Questions (FAQs) document in its free introductory inventorâ\u0080\u0099s kit. These nine steps are designed to help aspiring inventors dream up a product idea that will ultimately prove profitable. The experienced professionals at United Patent Research believe that the first step should be to cultivate an attitude of critical objectiveness when it comes to a project. Many people become deeply emotionally invested in their ideas, and this attachment can cause them to make unwise decisions during the development process. UPRâ\u0080\u0099s technical team can assist a client with this step by offering impartial advice and feedback early in the development of the product.\u003C/p\u003E\n\n\u003Cp\u003EThe second important step in United Patent Researchâ\u0080\u0099s guide to successful invention development involves detailed marketing planning. In order to achieve long-term profitability, inventors must carefully think through the ways in which their products will appeal to consumers and consider with which existing products they may have to compete. UPR staffs professionals who can guide clients through this process. The next series of steps apply to qualities of the potential product: United Patent Research recommends that products be patentable, physically simple, cost productive, and made of common materials, and the company also advises that inventors conceive ways in which their products might capitalize on repeat or add-on sales. Finally, United Patent Research\u0026#8217;s Licensing Affiliate, Universal Licensing, assists clients with licensing negotiations and effective product pricing, the two final steps in developing an invention.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0025/3628/253628v2-max-150x150.jpg"],
     [[155,
       38],
      "assets/images/resized/0025/3628/253628v2-max-250x250.jpg"],
     [[155,
       38],
      "assets/images/resized/0025/3628/253628v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://unitedpatentresearchltd.wordpress.com/",
    "title": "Check Out United Patent Research on Wordpress"},
   {"external_url": "http://www.lookuppage.com/users/unitedpatentresearchltd/",
    "title": "United Patent Research - LookupPage"},
   {"external_url": "http://www.nexport.com/us/md/olney/united-patent-research/a/",
    "title": "See United Patent Research at Nexport"}]}