{"name": "Universal Music Group",
 "permalink": "universal-music-group",
 "crunchbase_url": "http://www.crunchbase.com/company/universal-music-group",
 "homepage_url": "http://new.umusic.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "UMG",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 1981,
 "founded_month": 2,
 "founded_day": 28,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "music",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Tue Apr 29 17:54:17 UTC 2008",
 "updated_at": "Mon Jun 03 21:59:52 UTC 2013",
 "overview": "\u003Cp\u003EUniversal Music Group (UMG) is the world\u0026#8217;s leading music company and is comprised of two core businesses: recorded music and music publishing. It is currently one of the \u0026#8220;big four\u0026#8221; music companies.\u003C/p\u003E\n\n\u003Cp\u003EThe company discovers, develops, markets and distributes recorded music through a network of subsidiaries, joint ventures and licensees in 77 countries, representing 98% of the music market. UMG also sells and distributes music video and DVD products, and licenses recordings, encouraging the legal distribution of music online and over cellular, cable and satellite networks. UMG includes Universal Music Latin Entertainment, the world\u0026#8217;s leading Latin music company.  UMG\u0026#8217;s publishing company, Universal Music Publishing Group, is the world\u0026#8217;s leading publishing business; it owns and acquires rights to musical compositions and licenses them for use in recordings and related uses, such as films and advertisements. UMG also includes Bravado, its merchandising company, and Twenty-First Artists, its full service management division; and Helter Skelter, its live music agency.\u003C/p\u003E\n\n\u003Cp\u003EUniversal Music Group International is the division that manages UMG\u0026#8217;s businesses in countries outside of North America.\u003C/p\u003E\n\n\u003Cp\u003ERecord Labels\u003C/p\u003E\n\n\u003Cp\u003EUMG owns a number of smaller labels that operate independently including: A\u0026amp;M/Octone, Barclay, Decca, Deutsche Grammophon, Disa, ECM, Emarcy, Fonovisa, Interscope Geffen A\u0026amp;M Records, Island Def Jam Music Group, Machete Music, Mercury Records, Philips, Polydor Records, Universal Motown Republic Group, Universal Music Latino, Universal Music Group Nashville (which includes Lost Highway, MCA Nashville and Mercury Nashville), Universal Records South, and Verve Music Group.  \u003C/p\u003E\n\n\u003Cp\u003EArtist Roster\u003C/p\u003E\n\n\u003Cp\u003EUMG\u0026#8217;s roster is comprised of artists covering music around the world.  Artists signed to UMG throughout the world include:\u003C/p\u003E\n\n\u003Cp\u003ENorth America: Akon, Beck, Black Eyed Peas, Mary J. Blige, Bon Jovi, Busta Rhymes, Colbie Caillat, Mariah Carey, Sheryl Crow, Daddy Yankee, Dr. Dre, Eminem, Melissa Etheridge, Eve, Fall Out Boy, Fergie, 50 Cent, Nelly Furtado, The Game, Vince Gill, Godsmack, Hinder, India.Arie, Jack Johnson, Jay-Z, The Killers, Diana Krall, Lil Wayne, Ludacris, Maroon 5, Nelly, Ne-Yo, OneRepublic, Pussycat Dolls, Lionel Richie, Rihanna, Snoop Dogg, Gwen Stefani, George Strait, Sugarland, Robin Thicke, Timbaland, Shania Twain, Josh Turner, Stevie Wonder, Sting, 3 Doors Down, and Kanye West.\u003C/p\u003E\n\n\u003Cp\u003EEurope: Bryan Adams, Bjork (outside North America), Marco Borsato, Calogero, Sergio Dalma, Duffy, Mylene Farmer, Feist, Gianna Nannini, Girls Aloud, Elton John, Jovanotti, Juli, Kaiser Chiefs, Keane, Ronan Keating, Amy Macdonald, Michael McDonald, Metallica (outside North America), Mika, Noir Désir, Orson, Florent Pagny, Paco de Lucia, Rammstein, Rolling Stones, Rosenstolz, Andre Rieu, Michel Sardou, Scissor Sisters, Snow Patrol, Sugababes, Take That, Tamara, Tokio Hotel, U2, Vitaa, Amy Winehouse, Zazie, and Zucchero.\u003C/p\u003E\n\n\u003Cp\u003ELatin America: Axel, Babasonicos, Belanova, Bersuit, David Bisbal, Bersuit, Café Tacuba, Antonio Carmona, Christian Castro, Coti, Don Omar, Pedro Fernandez, Luis Fonsi, Enrique Iglesias, Juanes, Luney Tunes, Molotov, Zeca Pagodinho, Paulina Rubio, Sandy \u0026amp; Junior, Ivete Sangalo, Caetano Veloso, Alicia Villarreal, and Wisin y Yandel.\u003C/p\u003E\n\n\u003Cp\u003EAsia Pacific: AI, Vanessa Amorosi, Thelma Aoyama, Avalanches, Kate Ceberano, Sarah Blasko, Chage \u0026amp; Aska, Eason Chan, Jacky Cheung, Kelly Chen, Cut Copy, Sa Dingding, Dreams Come True, Energy, Bernard Fanning, Masaharu Fukuyama, the Grates, GreeeeN, Dao Lang, Hacken Lee, Naotaro Moriyama, Wilbur Pan, Powderfinger, SamSonS, Kou Shibasaki, Spitz, Alan Tam, Utada, WaT, Wolfmother, Masayoshi Yamazaki, and mihimaru GT.\u003C/p\u003E\n\n\u003Cp\u003EClassical \u0026amp; Jazz Repertoire\u003C/p\u003E\n\n\u003Cp\u003EUMG is the market leader in today\u0026#8217;s highly competitive classical music market.\u003C/p\u003E\n\n\u003Cp\u003EUniversal Music\u0026#8217;s classical labels includes the world\u0026#8217;s longest-standing recording company and market leader, Deutsche Grammophon; the legendary Decca Records, which owns and controls the greatest opera catalog in the world; and the Philips, Emarcy, and ECM labels.\u003C/p\u003E\n\n\u003Cp\u003EAmong the distinguished artists represented on these labels are Claudio Abbado, Cecilia Bartoli, Leonard Bernstein, Andrea Bocelli, Pierre Boulez, Alfred Brendel, Elvis Costello, Renée Fleming, Juan Diego Florez, Valery Gergiev, Hélène Grimaud, Hilary Hahn, Lang Lang,  James Levine, Anne-Sophie Mutter, Anna Netrebko, Jessye Norman, Luciano Pavarotti, Maria João Pires, André Previn, Sir Georg Solti, Bryn Terfel, Herbert von Karajan, Rolando Villazon, Russell Watson, Hayley Westenra, and Krystian Zimerman.\u003C/p\u003E\n\n\u003Cp\u003EUniversal Music includes the world\u0026#8217;s leading Broadway catalog and contemporary recordings under the Decca Broadway label with such titles as Wicked, Mamma Mia!, Spring Awakening, The Boy From Oz, Cats, Evita, Les Miserables, Man From La Mancha, Phantom of the Opera, Spamalot, and Sunset Boulevard. Universal Music is also responsible for the success of numerous original Soundtracks including The Aviator, Gladiator, King Kong and Mamma Mia! as well as such Oscar-winning scores as Elliot Goldenthal\u0026#8217;s Frida, and James Horner\u0026#8217;s Braveheart.\u003C/p\u003E\n\n\u003Cp\u003EUMG owns the world\u0026#8217;s largest jazz recording company. The Verve Music Group includes the premier jazz label Verve, focusing on traditional jazz; adult music label Verve Forecast; contemporary jazz label GRP; and Impulse!, which focuses on reissues of its famed catalog. The group\u0026#8217;s unparalleled roster of current and catalog artists include Louis Armstrong, Count Basie, Brazilian Girls, Michael Brecker, John Coltrane, Jamie Cullum, Ella Fitzgerald, Charlie Haden, Herbie Hancock, Billie Holiday, Diana Krall, Queen Latifah, Ledisi, Loreena McKennitt, Wayne Shorter, Nina Simone, Susan Tedeschi, and Lizz Wright.\u003C/p\u003E\n\n\u003Cp\u003EUMG has also entered the burgeoning business of classical artist management and production with Universal Music Classical Management and Productions (UMCMP). The company develops careers, creates distinctive live events and builds long-lasting brands within the classical music field.\u003C/p\u003E\n\n\u003Cp\u003EMusic Catalog\u003C/p\u003E\n\n\u003Cp\u003ERepresenting some of the most influential and legendary recording artists of this century, UMG has the most extensive catalog of music in the industry including: ABBA, Louis Armstrong, Chuck Berry, James Brown, The Carpenters, Eric Clapton, Patsy Cline, John Coltrane, The Commodores, Bing Crosby, Count Basie, Bo Diddley, Bill Evans, Ella Fitzgerald, The Four Tops, Judy Garland, Marvin Gaye, Jimi Hendrix, Billie Holiday, Buddy Holly, The Jackson Five, The Mamas \u0026amp; The Papas, Bob Marley, Nirvana, The Police, Smokey Robinson, Cat Stevens, Rod Stewart, Sublime, The Supremes, The Temptations, Conway Twitty, Muddy Waters, Hank Williams, and The Who.\u003C/p\u003E\n\n\u003Cp\u003EMusic Catalog Management\u003C/p\u003E\n\n\u003Cp\u003EUniversal Music Enterprises (UMe) is the centralized U.S. catalog and special markets entity for UMG.  Working in concert with all of the company\u0026#8217;s record labels, UMe provides a frontline approach to catalog management, a concentration of resources, a greater emphasis on strategic marketing initiatives and opportunities in new technologies.  UMe is comprised of several business units and record labels: Universal Chronicles, the unit that manages and markets UMG\u0026#8217;s extensive catalog through retail channels; UTV Records, the television marketing unit; Hip-O Records, its independent label that releases CDs and DVDs from outside sources; New Door Records, a label dedicated to producing new music from historically significant recording artists whose catalog is controlled by UMG labels; UMe Digital, the first all digital label from a major music company; Universal Music Media, a company that produces infomercials and long form music programming; Universal Music Special Markets; and Universal Film \u0026amp; Television Music. UMe\u0026#8217;s Strategic Marketing unit supports all five areas and is designed to aggressively develop a cohesive and strategic approach to maximizing catalog repertoire by initiating and implementing integrated marketing campaigns, direct to consumer programs, brand management initiatives and strategic partnerships.\u003C/p\u003E\n\n\u003Cp\u003EOutside North America, the Universal Strategic Marketing division of Universal Music Group International works to maximize the profile and value of UMG\u0026#8217;s catalogue in international markets. It acts as a service centre adding value through marketing initiatives and coordination of commercial issues through local and international markets.\u003C/p\u003E\n\n\u003Cp\u003EMusic Publishing\u003C/p\u003E\n\n\u003Cp\u003EWith 47 offices in 41 countries, Universal Music Publishing Group (UMPG) is the industry\u0026#8217;s largest global music publishing operation. UMPG represents music in every genre from some of the world\u0026#8217;s hottest songwriters and catalogs including U2, Elton John, Bernie Taupin, 50 Cent, Mariah Carey, R. Kelly, Coldplay, Nelly, Ciara, Dave Grohl, Prince, Diana Krall, Justin Timberlake, Maroon 5, Britney Spears, Godsmack, Mary J. Blige, Jill Scott, No Doubt, 3 Doors Down, Beastie Boys, Anastacia, Robbie Williams, Gloria and Emilio Estefan, Paul Simon, Henry Mancini, Christina Aguilera and Linkin Park, among many others. UMPG is also a global leader in the areas of Production Music, Christian and Classical Music.  For more information please visit www.umusicpub.com.\u003C/p\u003E\n\n\u003Cp\u003ENew Technologies and Distribution Platforms\u003C/p\u003E\n\n\u003Cp\u003EeLabs, a division of UMG, is responsible for handling the company\u0026#8217;s electronic commerce initiatives, Internet exploitation, and new technology business opportunities worldwide. eLabs\u0026#8217; business development and business affairs staff supports all of UMG\u0026#8217;s e-business initiatives, including digital download, subscription, webcasting, interactive radio and pay-per-play through all digital channels of purchase.  eLabs works closely with and supports all UMG\u0026#8217;s record labels and other businesses to enhance opportunities for music driven by new technologies, while protecting the value of recorded music.\u003C/p\u003E\n\n\u003Cp\u003EBravado\u003C/p\u003E\n\n\u003Cp\u003EBravado, the only global, 360º full service merchandise company, develops and markets high-quality licensed merchandise to a worldwide audience. The company works closely with new \u0026amp; established entertainment clients, creating innovative products carefully tailored to each artist or brand. Product is sold on live tours, via selected retail outlets and through web-based stores. Bravado also licenses rights to an extensive network of third party licensees around the world. The company maintains offices in London, Los Angeles, New York, San Francisco and Stockholm, and partner companies in Berlin, Paris, Japan, Australia and South America.  Now under the Universal Music Group umbrella, Bravado is able to leverage a global sales and distribution network from the world\u0026#8217;s largest record company, as well as the group\u0026#8217;s significant marketing strength.  Bravado artists include Kanye West, Gwen Stefani, Beyonce, Elton John, Guns \u0026#8216;N Roses, Metallica, Led Zeppelin, Tina Turner, Iron Maiden, Alicia Keys, NKOTB, Nine Inch Nails, Dolly Parton and The Killers, among many others.\u003C/p\u003E\n\n\u003Cp\u003EArtist Services\u003C/p\u003E\n\n\u003Cp\u003EUniversal Music Group also includes some of the world\u0026#8217;s leading full-service artist management businesses, including Twenty-First Artists, Trinifold and 5B. Its live music and event production divisions, responsible for booking and presenting talent throughout the world, include Helter Skelter and All the Worlds.\u003C/p\u003E\n\n\u003Cp\u003EDistribution\u003C/p\u003E\n\n\u003Cp\u003EIn the U.S., Universal Music Group Distribution has been the industry market share leader for the past ten years and consists of four major divisions: Universal Music Distribution (UMD), Fontana, Vivendi Entertainment (VE), and UMGD Digital. UMD handles distribution and sales for UMG\u0026#8217;s diverse roster of labels as well as a wide variety of associated labels. Fontana is the company\u0026#8217;s independent sales, marketing and distribution arm, VE is its theatrical and home entertainment distribution division, and UMGD Digital manages and distributes all of Universal Music Group\u0026#8217;s digital assets including mobile.  \u003C/p\u003E\n\n\u003Cp\u003EIn some markets outside the U.S., UMG companies handle their own distribution and sales. In other markets UMG companies have sub-contracted services to third parties or entered into distribution join ventures with other record companies. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       66],
      "assets/images/resized/0009/7312/97312v4-max-150x150.png"],
     [[250,
       111],
      "assets/images/resized/0009/7312/97312v4-max-250x250.png"],
     [[450,
       200],
      "assets/images/resized/0009/7312/97312v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [{"name": "CD",
    "permalink": "cd",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Vice Chairman, CFO",
    "person":
     {"first_name": "Marinus N. (Nick)",
      "last_name": "Henny",
      "permalink": "nick-henny",
      "image":
       {"available_sizes":
         [[[70,
            70],
           "assets/images/resized/0003/3774/33774v1-max-150x150.jpg"],
          [[70,
            70],
           "assets/images/resized/0003/3774/33774v1-max-250x250.jpg"],
          [[70,
            70],
           "assets/images/resized/0003/3774/33774v1-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003E\u003Ca href=\"http://www.evanta.com/CIO/summit/archive.php?i=NYC\u0026amp;eveID=36\u0026amp;type=agenda\" title=\"Evanta\" rel=\"nofollow\"\u003EEvanta\u003C/a\u003E\u003C/p\u003E"}}},
   {"is_past": false,
    "title": "Chairman \u0026 CEO",
    "person":
     {"first_name": "Douglas",
      "last_name": "(Doug) Morris",
      "permalink": "douglas-doug-morris",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0003/3776/33776v1-max-150x150.png"],
          [[175,
            175],
           "assets/images/resized/0003/3776/33776v1-max-250x250.png"],
          [[175,
            175],
           "assets/images/resized/0003/3776/33776v1-max-450x450.png"]],
        "attribution": "\u003Cp\u003E\u003Ca href=\"http://www.billboard.biz/bbbiz/content_display/industry/e3i69c4daba6cf2b7e5a5f5625a22b13b30\" title=\"Anthony Saint James/Billboard\" rel=\"nofollow\"\u003EAnthony Saint James/Billboard\u003C/a\u003E\u003C/p\u003E"}}},
   {"is_past": false,
    "title": "SVP, Business Development, Global Digitial Initiatives",
    "person":
     {"first_name": "Jeff",
      "last_name": "Bronikowski",
      "permalink": "jeff-bronikowski",
      "image":
       {"available_sizes":
         [[[150,
            150],
           "assets/images/resized/0003/3762/33762v2-max-150x150.jpg"],
          [[200,
            200],
           "assets/images/resized/0003/3762/33762v2-max-250x250.jpg"],
          [[200,
            200],
           "assets/images/resized/0003/3762/33762v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "President \u0026 COO",
    "person":
     {"first_name": "Zach",
      "last_name": "Horowitz",
      "permalink": "zach-horowitz",
      "image":
       {"available_sizes":
         [[[150,
            129],
           "assets/images/resized/0003/3772/33772v1-max-150x150.png"],
          [[211,
            182],
           "assets/images/resized/0003/3772/33772v1-max-250x250.png"],
          [[211,
            182],
           "assets/images/resized/0003/3772/33772v1-max-450x450.png"]],
        "attribution": "\u003Cp\u003EPhoto by Lester Cohen/WireImage.com\u003C/p\u003E"}}},
   {"is_past": false,
    "title": "Global Head of Digital Accounts",
    "person":
     {"first_name": "Amanda",
      "last_name": "Marks",
      "permalink": "amanda-marks",
      "image": null}},
   {"is_past": true,
    "title": "Chief Operating Officer",
    "person":
     {"first_name": "Matthew",
      "last_name": "Burns",
      "permalink": "matthew-burns",
      "image": null}},
   {"is_past": true,
    "title": "EVP \u0026 CIO",
    "person":
     {"first_name": "Scott",
      "last_name": "Belmont",
      "permalink": "scott-belmont",
      "image":
       {"available_sizes":
         [[[70,
            70],
           "assets/images/resized/0003/3775/33775v1-max-150x150.jpg"],
          [[70,
            70],
           "assets/images/resized/0003/3775/33775v1-max-250x250.jpg"],
          [[70,
            70],
           "assets/images/resized/0003/3775/33775v1-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003E\u003Ca href=\"http://www.evanta.com/CIO/summit/archive.php?i=NYC\u0026amp;eveID=36\u0026amp;type=agenda\" title=\"Evanta\" rel=\"nofollow\"\u003EEvanta\u003C/a\u003E\u003C/p\u003E"}}},
   {"is_past": true,
    "title": "Senior Vice President, Global Brand Partnership \u0026 Strategic Market",
    "person":
     {"first_name": "Dominic",
      "last_name": "Sandifer",
      "permalink": "dominic-sandifer",
      "image":
       {"available_sizes":
         [[[100,
            100],
           "assets/images/resized/0026/4802/264802v1-max-150x150.jpg"],
          [[100,
            100],
           "assets/images/resized/0026/4802/264802v1-max-250x250.jpg"],
          [[100,
            100],
           "assets/images/resized/0026/4802/264802v1-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Senior Vice President \u0026 Group Information Officer, I.T., North America",
    "person":
     {"first_name": "Scott",
      "last_name": "Belmont",
      "permalink": "scott-belmont",
      "image":
       {"available_sizes":
         [[[70,
            70],
           "assets/images/resized/0003/3775/33775v1-max-150x150.jpg"],
          [[70,
            70],
           "assets/images/resized/0003/3775/33775v1-max-250x250.jpg"],
          [[70,
            70],
           "assets/images/resized/0003/3775/33775v1-max-450x450.jpg"]],
        "attribution": "\u003Cp\u003E\u003Ca href=\"http://www.evanta.com/CIO/summit/archive.php?i=NYC\u0026amp;eveID=36\u0026amp;type=agenda\" title=\"Evanta\" rel=\"nofollow\"\u003EEvanta\u003C/a\u003E\u003C/p\u003E"}}},
   {"is_past": true,
    "title": "EVP of eLabs",
    "person":
     {"first_name": "Rio",
      "last_name": "Caraeff",
      "permalink": "rio-caraeff",
      "image":
       {"available_sizes":
         [[[112,
            150],
           "assets/images/resized/0007/6156/76156v2-max-150x150.jpg"],
          [[187,
            250],
           "assets/images/resized/0007/6156/76156v2-max-250x250.jpg"],
          [[337,
            450],
           "assets/images/resized/0007/6156/76156v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Director of Marketing",
    "person":
     {"first_name": "Kevin",
      "last_name": "Nakao",
      "permalink": "kevin-nakao",
      "image":
       {"available_sizes":
         [[[111,
            150],
           "assets/images/resized/0006/2768/62768v2-max-150x150.jpg"],
          [[185,
            250],
           "assets/images/resized/0006/2768/62768v2-max-250x250.jpg"],
          [[333,
            450],
           "assets/images/resized/0006/2768/62768v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Sales Analysis Intern",
    "person":
     {"first_name": "John",
      "last_name": "Bixby",
      "permalink": "john-bixby",
      "image": null}},
   {"is_past": true,
    "title": "Senior Web Developer",
    "person":
     {"first_name": "Ken",
      "last_name": "Chung",
      "permalink": "ken-chung-2",
      "image":
       {"available_sizes":
         [[[96,
            96],
           "assets/images/resized/0025/8818/258818v1-max-150x150.jpg"],
          [[96,
            96],
           "assets/images/resized/0025/8818/258818v1-max-250x250.jpg"],
          [[96,
            96],
           "assets/images/resized/0025/8818/258818v1-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Director of A\u0026R",
    "person":
     {"first_name": "Cindy",
      "last_name": "Carr",
      "permalink": "cindy-carr",
      "image": null}},
   {"is_past": true,
    "title": "Executive Vice President of Digital Logistics",
    "person":
     {"first_name": "Vincent",
      "last_name": "Freda",
      "permalink": "vincent-freda",
      "image": null}},
   {"is_past": true,
    "title": "Project Lead, Universal Music Store",
    "person":
     {"first_name": "Mitch",
      "last_name": "McAlister",
      "permalink": "mitch-mcalister",
      "image":
       {"available_sizes":
         [[[112,
            150],
           "assets/images/resized/0006/3938/63938v2-max-150x150.jpg"],
          [[187,
            250],
           "assets/images/resized/0006/3938/63938v2-max-250x250.jpg"],
          [[337,
            450],
           "assets/images/resized/0006/3938/63938v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Publicist",
    "person":
     {"first_name": "Taylor",
      "last_name": "Simons",
      "permalink": "taylor-simons",
      "image":
       {"available_sizes":
         [[[150,
            148],
           "assets/images/resized/0023/7983/237983v2-max-150x150.png"],
          [[197,
            195],
           "assets/images/resized/0023/7983/237983v2-max-250x250.png"],
          [[197,
            195],
           "assets/images/resized/0023/7983/237983v2-max-450x450.png"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Various leadership roles",
    "person":
     {"first_name": "Tracy",
      "last_name": "Terrill",
      "permalink": "tracy-terrill-2",
      "image":
       {"available_sizes":
         [[[150,
            112],
           "assets/images/resized/0022/2594/222594v2-max-150x150.jpg"],
          [[250,
            187],
           "assets/images/resized/0022/2594/222594v2-max-250x250.jpg"],
          [[450,
            337],
           "assets/images/resized/0022/2594/222594v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "",
    "person":
     {"first_name": "Antoine",
      "last_name": "Theysset",
      "permalink": "antoine-theysset",
      "image":
       {"available_sizes":
         [[[150,
            107],
           "assets/images/resized/0026/3971/263971v1-max-150x150.jpg"],
          [[250,
            179],
           "assets/images/resized/0026/3971/263971v1-max-250x250.jpg"],
          [[264,
            190],
           "assets/images/resized/0026/3971/263971v1-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Intern",
    "person":
     {"first_name": "Kristopher",
      "last_name": "Martin",
      "permalink": "kristopher-martin",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [{"funding_round":
     {"round_code": "a",
      "source_url": "",
      "source_description": "",
      "raised_amount": 2800000.0,
      "raised_currency_code": "USD",
      "funded_year": 2008,
      "funded_month": 4,
      "funded_day": 29,
      "company":
       {"name": "MOG",
        "permalink": "mog",
        "image":
         {"available_sizes":
           [[[95,
              44],
             "assets/images/resized/0001/2512/12512v2-max-150x150.png"],
            [[95,
              44],
             "assets/images/resized/0001/2512/12512v2-max-250x250.png"],
            [[95,
              44],
             "assets/images/resized/0001/2512/12512v2-max-450x450.png"]],
          "attribution": null}}}},
   {"funding_round":
     {"round_code": "b",
      "source_url": "http://www.paidcontent.org/entry/419-discovery-invests-in-sassas-web-publishing-firm-ubercom-umg-other-inves/",
      "source_description": "Discovery Invests in Sassaâ€™s Web Publishing Firm Uber.com; UMG Other Investor",
      "raised_amount": 7600000.0,
      "raised_currency_code": "USD",
      "funded_year": 2008,
      "funded_month": 5,
      "funded_day": 26,
      "company":
       {"name": "uber platform",
        "permalink": "uber-platform",
        "image": null}}},
   {"funding_round":
     {"round_code": "b",
      "source_url": "http://www.thealarmclock.com/mt/archives/2008/04/buzznet_socnet.html",
      "source_description": "Buzznet SocNet Buys Stereogum Blog",
      "raised_amount": 25000000.0,
      "raised_currency_code": "USD",
      "funded_year": 2008,
      "funded_month": 4,
      "funded_day": 7,
      "company":
       {"name": "BUZZ MEDIA",
        "permalink": "buzz-media-2",
        "image":
         {"available_sizes":
           [[[120,
              120],
             "assets/images/resized/0000/1777/1777v11-max-150x150.jpg"],
            [[120,
              120],
             "assets/images/resized/0000/1777/1777v11-max-250x250.jpg"],
            [[120,
              120],
             "assets/images/resized/0000/1777/1777v11-max-450x450.jpg"]],
          "attribution": null}}}},
   {"funding_round":
     {"round_code": "e",
      "source_url": "http://venturebeat.com/2007/03/21/ampd-mobile-raises-whopping-107m-fifth-round-of-financing/",
      "source_description": "VentureBeat",
      "raised_amount": 107000000.0,
      "raised_currency_code": "USD",
      "funded_year": 2007,
      "funded_month": 3,
      "funded_day": 21,
      "company":
       {"name": "Ampâ€™d Mobile",
        "permalink": "ampd-mobile",
        "image": null}}}],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Universal Music Group",
    "address1": "2200 Colorado Ave",
    "address2": "",
    "zip_code": "90404-3571",
    "city": "Santa Monica",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0004/7893/47893v1-max-150x150.png"],
      [[250,
        156],
       "assets/images/resized/0004/7893/47893v1-max-250x250.png"],
      [[450,
        281],
       "assets/images/resized/0004/7893/47893v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}