{"name": "UNLI FM",
 "permalink": "unli-fm",
 "crunchbase_url": "http://www.crunchbase.com/company/unli-fm",
 "homepage_url": "http://www.unli.fm",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "unlifm",
 "category_code": "games_video",
 "number_of_employees": 2,
 "founded_year": 2012,
 "founded_month": 5,
 "founded_day": 22,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "music, artist, asia, asain-music, cover-music",
 "alias_list": null,
 "email_address": "ceobitch@unnli.fm",
 "phone_number": "639322196083",
 "description": "Unlimited music discoveries",
 "created_at": "Mon Sep 17 09:01:22 UTC 2012",
 "updated_at": "Mon Sep 24 17:17:50 UTC 2012",
 "overview": "\u003Cp\u003EThis site unleashes a new and brighter way to music artistry. Unli FM is a web-based system for buffering and finding popular tunes and songs from the East. It concentrates on circulating favorite tunes and serves as portal to get information on brand-new gigs from international and Asian scene. Much more, Unli FM is an easy way for music followers to link with their favorite musicians and performers. For this reason, every music fan in the world can get a closer look on what’s new and the latest updates about their kind of tunes and popular artists.\u003C/p\u003E\n\n\u003Cp\u003EWhat makes Unli FM different? Its goal is to become a widely known and better way to stream music. Now is the time to get rid of music labels and not be bothered about getting permission to promote local music everywhere. At the same time, there is an extra benefit that Unli FM has to offer! Music lovers and fanatics will now be given special prizes just by listening to their favorite tunes. The prize involves picture-taking with popular performers, autograph signing as well as free entrance to their concerts and gigs. Best of all, users of Unli FM will have the chance to mingle and interact with their most favored artist\u003C/p\u003E\n\n\u003Cp\u003EUnli FM shall come up with more promising and exciting promotions! Subsequently, the company’s plan is to develop an online music system with international scope accessible in various countries. Now, listening to your favorite music and getting updates about popular artist becomes very easy with just a click. You no longer have to browse through different sites to get updates, news feeds, and listen to popular tunes. Now, only one site caters all your needs for listening pleasure. Unli FM is probably the best music and entertainment site ever created!\u003C/p\u003E\n\n\u003Cp\u003EThis is big breakthrough for the international music scene and for followers of contemporary music. More and more people can now connect with their favorite music artists as well as get more updates about upcoming hits. At the same time, Unli FM is an excellent way to channel all your favorite songs and music genres, to name a few. Unli FM is probably among the best of its kind and everyone can give a lot of credits to those who are behind the concept of creating such a site. This is a milestone for the global music industry because every single fan from every country can now tap into one site that gives all the information and features needed. Everyone can listen to their favorite music, read updates about their favorite artists and know more about upcoming events they expect.\u003C/p\u003E\n\n\u003Cp\u003Ehttp://webgeek.ph/startups/unli-fm-a-new-and-brighter-approach-to-music-artistry/\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "",
    "person":
     {"first_name": "Jossy",
      "last_name": "Onwude",
      "permalink": "jossy-onwude-2",
      "image": null}},
   {"is_past": false,
    "title": "",
    "person":
     {"first_name": "Midori",
      "last_name": "Oca",
      "permalink": "midori-oca",
      "image": null}},
   {"is_past": true,
    "title": "CEO",
    "person":
     {"first_name": "Briton",
      "last_name": "Rabe",
      "permalink": "briton-rabe",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://webgeek.ph/startups/unli-fm-a-new-and-brighter-approach-to-music-artistry/",
    "title": "Unli FM: Philippines Spotify, A Brighter Approach to Music Artistry (Teaser)"},
   {"external_url": "http://ph.news.yahoo.com/unli-fm-calls-local-filipino-081527733.html",
    "title": "Unli FM Calls On Local Filipino Musicians to Join the Fun"}]}