{"name": "Upspring Social",
 "permalink": "upspring-social",
 "crunchbase_url": "http://www.crunchbase.com/company/upspring-social",
 "homepage_url": "http://www.upspring.com",
 "blog_url": "http://blog.upspring.com",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-media, marketing, advertising, facebook-marketing, local-marketing, cloud-based, apps, small-business, social-network",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Small Business Social Media Platform",
 "created_at": "Sat Mar 10 01:08:28 UTC 2012",
 "updated_at": "Tue Apr 03 00:31:11 UTC 2012",
 "overview": "\u003Cp\u003EUpspring is a social media platform that leverages Facebook, Google+, Twitter and websites to help businesses attract, grow, engage, and monetize fans, prospects and customers.\u003C/p\u003E\n\n\u003Cp\u003EUpspring simplifies marketing by making it easy and cost-effective for businesses to build and expand relationships with new and existing customers. Businesses can create searchable and content-rich presence on the web, reaching millions of people. Our Essential Business Profile enables local businesses to display logo, hours of operation, email, web site address, and contact information, while increasing visibility in search engines. Businesses always have complete control of their online business information.\u003C/p\u003E\n\n\u003Cp\u003EUpspring makes it easy for anyone to reach out to you or your business, ask questions, engage in conversations, exchange knowledge, and learn about you, your profession or business.\u003C/p\u003E\n\n\u003Cp\u003EUpspring provides businesses with the tools to view conversations and updates from their contacts on Facebook and Twitter, and reply or broadcast short messages directly from a single interface. It\u0026#8217;s simple to keep up with your customers and contacts! \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}