{"name": "UR Manufacturers",
 "permalink": "ur-manufacturers",
 "crunchbase_url": "http://www.crunchbase.com/company/ur-manufacturers",
 "homepage_url": "http://www.indiamart.com/urmanufacturers-exporters/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we-are-recognized-as-an-affluent-manufacturer-and-supplier-of-cricket-helmet-and-other-cricket-accessories-",
 "alias_list": null,
 "email_address": "urmanufacturers-exporter@tradepassport.org",
 "phone_number": "9899335801",
 "description": "",
 "created_at": "Wed Apr 03 15:15:37 UTC 2013",
 "updated_at": "Wed Apr 03 19:02:21 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 1986, at Delhi (India), we, “U \u0026amp; R Manufacturers \u0026amp; Exporters”, are recognized as the trustworthy Manufacturer, Exporter and Supplier of a qualitative assortment of Cricket Helmet, Hockey Helmet, Abdominal Guard, Plastic Cricket Set, Cricket Umpires Counter, Horse Riding Helmet, Bowler\u0026#8217;s Mark, Boundary Flag, Cricket Leg Guard and Cricket Products. These are manufactured using the best grade raw material and sophisticated technology. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOur major emphasis is to satisfy clients with our brilliant quality products and other client oriented policies. Also, our workforce carefully manufactures these products to make sure that these suitably serve their diverse needs. Every possible step is taken by us to ensure that only the ordered products are delivered within the promised time frame at the clients’ end. In addition to this, customized range, affordable pricing, transparent dealings and ethical business policies have been instrumental in winning over the hearts of our valuable customers.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nOur quality centric approach has helped us in maintaining total quality in all our business operations. In adherence with stringent quality control norms and procedures, we are able to offer high quality products in adherence to the universal norms. We have a modern quality control unit, which is installed with advanced testing tools and equipment that allow us to test the entire range on well-defined parameters. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWith the support of our committed and hard-working team members, we are offering a flawless range of products that is known for its reliable performance and durability. Our team comprises highly sincere and devoted staff members, who possess sufficient skills and talent in their respective areas. Also, our team comprises engineers, market analysts, quality controllers and other staff members. We are competent to meet with the varied requirements of clients and clear all the paper works within the promised time.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nState-of-the-art infrastructural base available with us strengthens our abilities of manufacturing products of premium quality. Latest technical equipment and machinery available with us enables us in making production process easier and flawless. We have installed advanced machinery in our manufacturing unit that ensures easy execution of tasks and produce accessories and goods in bulk to meet demands of various clients across the world.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7394/247394v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7394/247394v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7394/247394v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}