{"name": "UrbanGlasses.com",
 "permalink": "urbanglasses-com",
 "crunchbase_url": "http://www.crunchbase.com/company/urbanglasses-com",
 "homepage_url": "http://www.urbanglasses.com/",
 "blog_url": "http://www.urbanglasses.com/blog/",
 "blog_feed_url": "http://www.urbanglasses.com/blog/rss/index/store_id/1/",
 "twitter_username": "urbanglasses",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": 5,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "urbanglasses, urban-glasses, eyewear, eyecare, eyeglasses, sunglasses, prescription-glasses",
 "alias_list": null,
 "email_address": "nash@urbanglasses.com",
 "phone_number": "4242565302",
 "description": "The Best Eyeglasses Online",
 "created_at": "Tue Mar 26 06:02:11 UTC 2013",
 "updated_at": "Tue Mar 26 06:02:17 UTC 2013",
 "overview": "\u003Cp\u003EUrbanGlasses is the leading providers of prescription sunglasses and optical eyeglasses in USA and Canada. They offer the most competitive prices in the whole optical industry. They sell their products directly to their customers worldwide through the website; which enables them to offer you the latest and fashionable eyeglasses at the most affordable prices. They provide prescription eyeglasses, retro eyeglasses, men’s sunglasses, rimless glasses and more online. \u003C/p\u003E\n\n\u003Cp\u003EUrbanGlasses was created to provide high quality, colorful and stylish eyewear at affordable prices. With their wide collection of rx glasses, you can express your lifestyle, individuality and attitude. They are dedicated to delivering high quality eyewear products at the lowest prices in sight. \u003C/p\u003E\n\n\u003Cp\u003EAt UrbanGlasses, you will find a wide range of prescription eyeglasses and sunglasses for both men and women. They are providing a variety of glasses online in USA and Canada. In USA, they are offering free shipping facility on 2 pairs of eyeglasses along with free anti-scratch, UV protective, anti-reflective coating and glasses case \u0026amp; cloth. They have most stylish collection of cheap prescription glasses, prescription sunglasses, rimless glasses and other eyewear accessories at their online store. \u003C/p\u003E\n\n\u003Cp\u003ENash Deckard, Director of UrbanGlasses proudly said “We promise to deliver high quality eyewear products at the lowest price in sight.” They sell directly to their customers worldwide through their website, which allows them to offer latest and fashionable eyeglasses for men and women at the most affordable prices.\u003C/p\u003E\n\n\u003Cp\u003EUrbanGlasses is a leading prescription eyeglasses retailer online. They offer the most competitive prices in the whole optical industry. They have top quality control process in their production lab and ensure each and every glass formed meet high quality optical standards. They offer a large range of prescription eyeglasses and prescription sunglasses for both men’s and women’s.\u003C/p\u003E\n\n\u003Cp\u003EUrbanGlasses assure you to provide:\u003C/p\u003E\n\n\u003Cp\u003E• High quality manufacture\n• Lowest prices on the web\n• Fast delivery worldwide\n• Shipping within U.S.A. from $5.95\n• Worldwide shipping from $12.95\u003C/p\u003E\n\n\u003Cp\u003EBuy prescription eyeglasses from UrbanGlasses and save up\nto 80%. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0024/5543/245543v2-max-150x150.png"],
     [[220,
       54],
      "assets/images/resized/0024/5543/245543v2-max-250x250.png"],
     [[220,
       54],
      "assets/images/resized/0024/5543/245543v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Nash",
      "last_name": "Deckard",
      "permalink": "nash-deckard",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        120],
       "assets/images/resized/0024/5542/245542v2-max-150x150.png"],
      [[250,
        201],
       "assets/images/resized/0024/5542/245542v2-max-250x250.png"],
      [[450,
        361],
       "assets/images/resized/0024/5542/245542v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}