{"name": "usavisanow",
 "permalink": "usavisanow",
 "crunchbase_url": "http://www.crunchbase.com/company/usavisanow",
 "homepage_url": "http://www.usavisanow.com/",
 "blog_url": "http://www.usavisanow.com/immigration-news-and-views/",
 "blog_feed_url": "http://www.usavisanow.com/feed/",
 "twitter_username": "usavisanow",
 "category_code": "legal",
 "number_of_employees": 5,
 "founded_year": 2000,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "immigration, visa, green-card, h1b, k1, tn-e3, perm, marriage, fiance",
 "alias_list": null,
 "email_address": "info@usavisanow.com",
 "phone_number": "888-645-6272",
 "description": "Immigration Law",
 "created_at": "Sat Oct 13 01:56:48 UTC 2012",
 "updated_at": "Wed Dec 12 07:07:17 UTC 2012",
 "overview": "\u003Cp\u003EWe are a full-service immigration law firm located in New York, NY. We work with clients in all 50 States and abroad.\u003C/p\u003E\n\n\u003Cp\u003EOur experienced team handles all phases of immigration including permanent residence, corporate immigration, family immigration, permanent residence petitions, employment visas, and citizenship applications.  We are committed to providing exceptional legal services.\u003C/p\u003E\n\n\u003Cp\u003EOur interactive computer-based software helps to facilitate the legal processes for our clients and enable us to prepare complex immigration cases regardless of where our clients reside.  We cater to both corporate and individual clients living throughout the US and internationally.\u003C/p\u003E\n\n\u003Cp\u003EOur office is culturally diverse, with half our staff being first generation immigrants with roots from all over the globe.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to provide personalized attention that you are unlikely to receive from other larger firms.  You can always count on responsive service and regular updates on your case.\u003C/p\u003E\n\n\u003Cp\u003EWe serve clients from many different sectors including healthcare, education and technology.  We deliver first-class client satisfaction to all our clients whether they are a hospital, university, mid-size company, not for profit, or a start-up.\u003C/p\u003E\n\n\u003Cp\u003EIn addition, we also have extensive experience in reuniting families and married/engaged couples.  We understand and appreciate that your quality of life, in many cases, is dependent on your eventual visa approval, which we work hard to obtain.\u003C/p\u003E\n\n\u003Cp\u003EWe exclusively practice business and family immigration law.  We help employers obtain foreign employees and individualsachieve the American Dream.\u003C/p\u003E\n\n\u003Cp\u003EWe are confident in our depth of knowledge, attention to detail and responsiveness in solving the most challenging immigration issues.\u003C/p\u003E\n\n\u003Cp\u003EWhat We Do:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EExclusively practice business and family immigration law.\nWe offer a proprietary and state-of-the-art case management program to our clients that allows easy access to their own case status on our secure website.\nOur specially created software allows for clients to upload their supporting documents directly.\nOffer quick turnaround time (most petitions are prepared with seven (7) working days).\nMuch of our business come from referrals from former or existing satisfied clients.\nWe offer direct communication with an attorney or our knowledgeable staff.\nOur staff is experienced in preparing all immigrant and non-immigrant petitions and USDOL (PERM) labor certifications.\n\u003C/code\u003E\u003C/pre\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "New York Office",
    "address1": "200 W. 4th Street",
    "address2": "Suite 200",
    "zip_code": "10014",
    "city": "New York",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": 40.7332848,
    "longitude": -74.0025242}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}