{"name": "UTrade",
 "permalink": "utrade",
 "crunchbase_url": "http://www.crunchbase.com/company/utrade",
 "homepage_url": "http://www.utrade.co",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "UTrade",
 "category_code": "other",
 "number_of_employees": 50,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "trade-facilitation, supply-chain-management, business-process-rationalization, automation-and-it-solutions, customs-and-vat-consultancy",
 "alias_list": null,
 "email_address": "utradeteam@utrade.com.pk",
 "phone_number": "+92515731974",
 "description": "Trade facilitation at its best!",
 "created_at": "Thu May 02 07:23:46 UTC 2013",
 "updated_at": "Mon May 06 06:08:25 UTC 2013",
 "overview": "\u003Cp\u003EU Trade Pvt. Ltd. is a part of U Trade FZC international. We are a global chain engaged in providing facilitations and solutions to businesses in order to enable them to accurately forecast and plan their supply chain management and improve their overall management practices. For accurate planning, there is a need for accurate information including current duties, taxes and government regulations as well as multidimensional trade statistics. We offer specialized customs clearance and updated information regarding importation, exportation, taxation and clearance procedures.\u003C/p\u003E\n\n\u003Cp\u003EOur broad range of modern, innovative and multidimensional capabilities includes local, tax, logistics and industrial process control solutions. The objectives of these solutions are designed to eliminate redundancies \u0026amp; standardize processes, improve business performance and customer experience. With the consultancy of our in-depth and knowledgeable professionals, we deliver expertise in all business and trade sectors that would make them more robust and efficient.\nU Trade’s website brings to you the first of its kind application which provides traders to access complete information regarding end to end import/export requirements as well as applicable duties and taxes.\u003C/p\u003E\n\n\u003Cp\u003EEach day, new ideas, technologies, opportunities and challenges continuously present themselves, bringing faster, cheaper, more efficient ways of managing and running businesses. Every decision that you take sets you on a course, the choice to improve, change, adapt can either keep your business at the cutting edge of competition or make you redundant. Therefore, we aim to provide agile industry expertise and innovative solutions to promote and progress your businesses operating in the most dynamic markets. We help you to attract potential customers and adapt to their ever changing demands. Help you to improve your visibility to the customers by integrating advertising and promotional programs.\u003C/p\u003E\n\n\u003Cp\u003EUTrade is your partner of choice. We excel in tuning your business to continue to operate at the most optimal level, whether you require continuous updated information, need to adopt latest management techniques, technology solutions, and legal or tax consultation.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       54],
      "assets/images/resized/0025/7350/257350v2-max-150x150.jpg"],
     [[250,
       90],
      "assets/images/resized/0025/7350/257350v2-max-250x250.jpg"],
     [[252,
       91],
      "assets/images/resized/0025/7350/257350v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}