{"name": "UWCCorp Training",
 "permalink": "uwccorp-training",
 "crunchbase_url": "http://www.crunchbase.com/company/uwccorp-training",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Tue Jul 31 07:22:06 UTC 2012",
 "updated_at": "Sat Aug 04 13:41:53 UTC 2012",
 "overview": "\u003Cp\u003EUWCCorp.com provides effective, high-performance e-training for online marketers and entrepreneurs. The online business market is booming. But without the right knowledge and training, online marketers and businesspeople are missing out.\u003C/p\u003E\n\n\u003Cp\u003EExperience Counts\u003C/p\u003E\n\n\u003Cp\u003EUWCCorp.com is comprised of experienced professionals from multiple industries. Professionals include Internet marketing experts, web page designers, programmers, and educators. \u003C/p\u003E\n\n\u003Cp\u003EThe team has worked hard to collaborate and develop their online training plan with one goal in mind: to help their clients attain the highest degree of success possible.\u003C/p\u003E\n\n\u003Cp\u003EHigh-Impact Training\u003C/p\u003E\n\n\u003Cp\u003EUWCCorp.com’s online training program helps users achieve two fundamental goals:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ELearn how to build the best website for the products or services you’re offering.\u003C/li\u003E\n\u003Cli\u003ELearn the best online marketing techniques and strategies to maximize your web visibility.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EThe training program’s model allows users to learn at their own pace and comfort level. With our Online Training Center, you’ll find useful articles, forums, and other informational tools to quickly teach you how to succeed with your online business.\u003C/p\u003E\n\n\u003Cp\u003ETopics in our Online Training Center include the following:\u003C/p\u003E\n\n\u003Cp\u003E Getting started with website design and HMTL\n Effective social media marketing\n Making money with Pay-Per-Click (PPC) advertising\n How to rank your site highly with Search Engine Optimization (SEO)\n \u0026#8230; and many more\u003C/p\u003E\n\n\u003Cp\u003EFor UWCCorp.com clients who are more visual learners, we also offer a series of video tutorials from our Video Learning Collection. These tutorials and lessons will show you exactly what to do, step-by-step, to build and market yourself on the Internet. It’s learn and earn with our program’s proven methods.\u003C/p\u003E\n\n\u003Cp\u003ETake the Next Step to Your Business’s Future\u003C/p\u003E\n\n\u003Cp\u003EFor those of you who are thinking about getting started with your own online business, sign up for UWCCorp.com today. The program will quickly teach you everything you’ll need to start succeeding in your own e-commerce venture.\u003C/p\u003E\n\n\u003Cp\u003ESo stop waiting and start succeeding! UWCCorp.com is the way to go for online business and marketing success.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0020/3633/203633v2-max-150x150.png"],
     [[250,
       153],
      "assets/images/resized/0020/3633/203633v2-max-250x250.png"],
     [[260,
       160],
      "assets/images/resized/0020/3633/203633v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}