{"name": "UWCCorpcom",
 "permalink": "uwccorpcom",
 "crunchbase_url": "http://www.crunchbase.com/company/uwccorpcom",
 "homepage_url": "",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "network_hosting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "comuwccorp@yahoo.com",
 "phone_number": "",
 "description": "UWCCorp",
 "created_at": "Wed Aug 29 09:33:53 UTC 2012",
 "updated_at": "Tue Sep 04 13:02:28 UTC 2012",
 "overview": "\u003Cp\u003EUWCCorp.com: Online Marketing Education for the Future\u003C/p\u003E\n\n\u003Cp\u003EUWCCorp.com was created with business owners in mind. In today\u0026#8217;s business climate business owners have to consider their online marketing presence.  This can be time consuming as well as confusing to some who are just getting started - that\u0026#8217;s where we come in.\u003C/p\u003E\n\n\u003Cp\u003EUniversalWebConsulting.com was created by a team of professionals who have a vast bank of knowledge that business owners need to begin marketing their business effectively online.  With a team of educators that are experienced in every area of the online business world, such as social media marketing, search engine optimization techniques, HTML, development, programming, and web design, UWCCorp is ready to help take your business\u0026#8217;s marketing capabilities to the next level.  \u003C/p\u003E\n\n\u003Cp\u003EBy designing curriculums with each business owner\u0026#8217;s specific needs in mind, learning the skills needed to succeed becomes easier and more effective than ever.  UWCCorp.com knows that not every business owner has the same needs when it comes to online marketing, and that\u0026#8217;s what makes their programs different. In addition to individual customer service, students are also granted access to their online learning center which houses a vast amount of information in the form of easy to read articles and video training seminars.\u003C/p\u003E\n\n\u003Cp\u003ENo matter what your educational needs are, United Web Consulting can help you gain the knowledge and experience you need to successfully market your business online.  By combining years of practical experience with up to the moment technology and trends, UWCCorp.com can help you expand your business potential and growth in the online market.\u003C/p\u003E\n\n\u003Cp\u003EThe professional team of education specialists provide top of the line customer service along with highly recognized experience in all aspects of online marketing to allow their students the best possible options for starting or expanding their business. Contact UWCCorp.com today and start gaining the information you need to successfully market your business online.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0020/8655/208655v2-max-150x150.png"],
     [[250,
       153],
      "assets/images/resized/0020/8655/208655v2-max-250x250.png"],
     [[260,
       160],
      "assets/images/resized/0020/8655/208655v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}