{"name": "VA Group Deals",
 "permalink": "va-group-deals",
 "crunchbase_url": "http://www.crunchbase.com/company/va-group-deals",
 "homepage_url": "http://www.vagroupdeals.com.au",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "group-deals",
 "alias_list": null,
 "email_address": "contact@vagroupdeals.com.au",
 "phone_number": "0280066889",
 "description": "Online Group Deals for Property and Cars",
 "created_at": "Mon Dec 03 06:46:54 UTC 2012",
 "updated_at": "Wed Dec 05 08:15:30 UTC 2012",
 "overview": "\u003Cp\u003EInnovative Group Deals Website Takes An Exciting New Direction!\u003C/p\u003E\n\n\u003Cp\u003EGroupon and Living Social changed the world when they introduced the concept of group deals to the market. Consumers were able to get themselves genuine bargains, with no hidden catch. It seemed really too good to be true, and for the small ticket purchases offered, it saved happy customers a lot of money. Sellers were happy too as they attracted more foot traffic to their business, and group deals websites made money from commissions, or for simply featuring the deals on their website: a win-win-win situation was accomplished for all concerned.\u003C/p\u003E\n\n\u003Cp\u003EMany other copycat companies were quick to follow suit and now there are hundreds of group deals websites, all offering great discounts and offers to customers, leveraging the power of collective buying.\u003C/p\u003E\n\n\u003Cp\u003EUntil now such propositions have been limited to relatively small purchases – a meal in a restaurant, a purchase of a spa day experience or a discount on concert tickets. But now VA Group Deals has emerged to change the dynamic of the group deals industry forever.\u003C/p\u003E\n\n\u003Cp\u003EVA Group Deals is remarkable because it has drawn on its extensive ties in the real estate and car dealership industries to bring deals to consumers on big ticket items like homes and cars. The first group deals business of its kind in Australia, VA Group Deals offers the amazing opportunity of anything between 5% to 50% off the normal purchase price of a new home or car. No other company in Australia has tried to achieve what VA Group Deal is now accomplishing. \u003C/p\u003E\n\n\u003Cp\u003EGroup buying companies are truly big business. Everyone likes to feel that they are getting a bargain when they shop, and never more so than when they shop for larger purchases such as a new home or a new car. Groupon’s success can be attributed to this, and in fact, in 2010 Forbes described Groupon as the “fastest growing company ever. By 2009 it already had 1.7 million subscribers, but by 2010 it had grown this number to a phenomenal 44 million – in just one year! A couple of years on from this, Groupon’s huge success shows no sign of diminishing, and industry trend analysts have reported that the group deals genre shows no signs of slowing up any time soon.\u003C/p\u003E\n\n\u003Cp\u003EThere really seems no limit to the boundaries that group deals websites are pushing, and VA Group Deals is poised to benefit from this. But it is not just VA Group Deals that will benefit, of course. Just like all the other group deals based business models, beneficiaries will also be the happy buyers of brand new homes and shiny new cars. \u003C/p\u003E\n\n\u003Cp\u003EWe are about to experience a revolution in buying and VA Group Deals is truly out in front leading the way. Savvy shoppers that are in the know will not miss out on the chance to snap up great deals in cars and property, and smart dealers will relish the opportunity to close the deal, and fast. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       92],
      "assets/images/resized/0022/3482/223482v2-max-150x150.png"],
     [[250,
       154],
      "assets/images/resized/0022/3482/223482v2-max-250x250.png"],
     [[450,
       278],
      "assets/images/resized/0022/3482/223482v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}