{"name": "Valvola Corporation",
 "permalink": "valvola-corporation",
 "crunchbase_url": "http://www.crunchbase.com/company/valvola-corporation",
 "homepage_url": "http://www.indiamart.com/valvolacorporation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 24,
 "founded_year": 2003,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "floating-type-three-piece-design, floating-type-two-piece-design, trunnion-type-two-piece-design",
 "alias_list": null,
 "email_address": "valvolacorporation@tradepassport.org",
 "phone_number": "9920900311",
 "description": "supplying a remarkable range of Valves",
 "created_at": "Thu Apr 04 07:13:52 UTC 2013",
 "updated_at": "Thu Apr 04 07:13:57 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nWe, Valvola Corporation, are a prominent organization engaged in manufacturing and supplying a remarkable range of Valves. This range is widely appreciated for its longer service life, efficiency and resistance against corrosion.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nA team of competent professionals fosters us to tackle emerging challenges in this discipline. With their support we have been able to present our clients with the best range of Valves. Our team precisely manufactures the entire range in tune with the defined parameters of the industry after comprehending prevailing markets demands.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWith an aim to accomplish entire business related activities in a streamline manner, we have developed systematized infrastructure setup at Thane, Mumbai, Maharashtra, India Our setup is segregated in different divisions such as.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWe have been able to acquire a reputed stature in this discipline, owing to our qualitative range of Valves. To ensure utmost-quality of products, we strictly practice stringent quality control program during each stage of production process.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\no successfully cater to the growing demands of the clients for availing world class products, we have established strong association with some of the distinguished vendors of the nation. Selected after rigorous market surveys and researches, these vendors aid us in offering incomparable products that are manufactured in compliance with industry laid norms and standards.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe endeavor to derive complete clients’ satisfaction with our holistic business practices. To meet expectations of the clients, we have made available such product-gamut which is fabricated by making use of supreme quality required basic material in line with their requirements. Available in different specifications, this offered range can also be customized as per the requirement. In addition to this, we execute entire business related activities on the grounds of professionalism so as to ensure accountability and transparency. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       109],
      "assets/images/resized/0024/7615/247615v2-max-150x150.jpg"],
     [[250,
       183],
      "assets/images/resized/0024/7615/247615v2-max-250x250.jpg"],
     [[250,
       183],
      "assets/images/resized/0024/7615/247615v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}