{"name": "Vamoro",
 "permalink": "vamoro",
 "crunchbase_url": "http://www.crunchbase.com/company/vamoro",
 "homepage_url": "htttp://www.vamoro.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "vamoro, travel, season, hotels, concerts, sport-events, tickets, austria, argentina, switzerland",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Where and When to travel",
 "created_at": "Tue Nov 20 14:20:17 UTC 2012",
 "updated_at": "Wed Nov 21 08:33:46 UTC 2012",
 "overview": "\u003Cp\u003EVamoro is a new travel platform that was lunched at the very end of 2012. Vamoro was developed in order to fill the gaps travelers feel when they are trying to plan their trips. Vamoro enables intelligence solution and offers content with breakdown by month for all the places around the word. In addition it ranks each month on each place for several topics as Skiing, Weather, Music Concerts, Sport Events, Beach vacations and much more. This feature enables the travel to filter his own travel preference and get recommendations about where he/she should go.\u003C/p\u003E\n\n\u003Cp\u003EVamoro offers monthly breakdown for each country and popular city, so if you were thinking of going to a specific place, but you were not sure when you should go there you problem has been solved, you will be able to see what each one of the month of the year has to offer at that specific time in aspects of weather, top attractions, Music concerts Sport, Ski resorts, Top Beaches, and more.\u003C/p\u003E\n\n\u003Cp\u003EVamoro will allow you to travel through your friends eyes, and get to know places from your friend’s tips. This feature is enables from Facebook integration. Once you’ll log in to your FB account you’ll be able to see your entire friends list who travelled to the place you are exploring, watch their photos, and ask them for tips. You would be able to see there have they checked in, who lives there and enrich your travel from this value.\u003C/p\u003E\n\n\u003Cp\u003EVamoro interface is very friendly and was designed in a way that you’ll find it easy to navigate and consume content. Navigation threw different pages is being enable threw maps, menu bars while navigation on each page is enabled by a smart topics bar that will stay with you through the whole page.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       34],
      "assets/images/resized/0022/1269/221269v2-max-150x150.png"],
     [[250,
       57],
      "assets/images/resized/0022/1269/221269v2-max-250x250.png"],
     [[283,
       65],
      "assets/images/resized/0022/1269/221269v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}