{"name": "VEDASTROLOGY",
 "permalink": "vedastrology",
 "crunchbase_url": "http://www.crunchbase.com/company/vedastrology",
 "homepage_url": "http://www.vedastrology.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": 20,
 "founded_year": 2000,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "vedastrology, vedic-astrology, paranormal, metaphysics, cosmology, ontology, synastry, interfaith, star-phantasy, cosmic-correspondence, timing-of-events, prophesies, spsce-odyssey, psychic-prognosis, occultism, locational-adjustment, esoteric-studies, de",
 "alias_list": null,
 "email_address": "vedastrology@hotmail.com",
 "phone_number": "9899090121",
 "description": "Astrological Services",
 "created_at": "Sun Oct 14 09:11:02 UTC 2012",
 "updated_at": "Mon Oct 22 19:32:01 UTC 2012",
 "overview": "\u003Cp\u003EDr. Ved Prakash who was conferred greatest astrologer of the world award\u003Cbr/\u003E\nfrom a large international group of u.n.o. affiliate universities is available to like-minded enthusiasts for\nfree voluntary presentations in world countries of all continents.\nI Ved Prakash, Ph. D. (Astrological Science) with 35 years experience will personally conduct presentations, for organized forums, conferences, seminars, institutes, universities, ashrams and philanthropic organizations.\u003C/p\u003E\n\n\u003Cp\u003EAlready i did about 100 such presentations in U S A and India, including about 27 on the same dais of international UNO Educational conferences and workshops. \u003C/p\u003E\n\n\u003Cp\u003Ea) To astrologically answer personal questions of the audiences giving broad time-attuned prospects to their cherished dreams, plans, projects, target lifetime goals with guidance for their specific life-time career.\nb) To teach freely the important thumb rules of the predictive applied \nastrology \nc) I also answer about doubts on the efficacy of Para-sciences, spirituality,\n hidden regime of the cosmos, Vedanta, and the relationship between modern sciences and these occult ancient Para-sciences.\u003Cbr/\u003E\nd) The voluntary presentation proposal is on no-profit basis for disseminating of these important areas of our transcendental life for the benefit of masses.\u003C/p\u003E\n\n\u003Cp\u003EDr. Ved Prakash: Ph. D. (Astrological Science)\nNew Delhi. India.\nMail to: vedastrology@hotmail.com\n              mail@vedastrology.com\nWebsite: www.vedastrology.com\nPhone:  91-11-28546404. 45535416\u003Cbr/\u003E\nCell-phone: 9899090121. 9899090205.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[114,
       150],
      "assets/images/resized/0021/5468/215468v2-max-150x150.jpg"],
     [[191,
       250],
      "assets/images/resized/0021/5468/215468v2-max-250x250.jpg"],
     [[224,
       293],
      "assets/images/resized/0021/5468/215468v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}