{"name": "Velan Info Services",
 "permalink": "velan-info-services",
 "crunchbase_url": "http://www.crunchbase.com/company/velan-info-services",
 "homepage_url": "http://www.velaninfo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "network_hosting",
 "number_of_employees": 450,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "remote-it-support, windows, linux, cloud, amazon, tech-support, accounting, bookkeeping, billing-and-coding, data-processing, contact-center, call-center",
 "alias_list": null,
 "email_address": "mark@velaninfo.com",
 "phone_number": "",
 "description": "IT support and Web Development",
 "created_at": "Fri Oct 26 10:43:47 UTC 2012",
 "updated_at": "Tue Oct 30 20:27:48 UTC 2012",
 "overview": "\u003Cp\u003EVelan is a successful offshore outsourcing service provider with multiple strategic business units offering services to various industry segments including healthcare, manufacturing, IT, hospitality and publishing.\u003C/p\u003E\n\n\u003Cp\u003EManaged services unit offers remote IT infrastructure management services that include monitoring and managing clients\u0026#8217; servers, desktops, and networks worldwide. Our offshore infrastructure management services are designed to assist ISPs, data centers, web hosting companies, and corporates to increase operational efficiency and relieve pressure on their existing IT resources. Velan\u0026#8217;s services include server administration / monitoring, application maintenance, email configuration, traffic analysis, and security management. Velan offers technical support services for various OS platforms including Linux, FreeBSD and Windows. Velan also has expertise in migrating and managing applications on cloud computing environment like Amazon EC2 \u0026amp; S3.\u003C/p\u003E\n\n\u003Cp\u003EFinancial services division delivers remote accounting / bookkeeping services to clients across various industries. Our outsourced accounting / bookkeeping services include recording, classifying, summarizing and the interpretation of financial statements.\u003C/p\u003E\n\n\u003Cp\u003EHealthcare revenue cycle outsourcing services is offered by Velan\u0026#8217;s healthcare division to the providers in the US. Velan\u0026#8217;s offshore medical billing services range from patient enrolment, verification, charge entry, payment posting to denial management.\u003C/p\u003E\n\n\u003Cp\u003EIT services division delivers end-to-end solutions to corporates worldwide. Velan\u0026#8217;s offshore services offer cutting-edge IT solutions across a range of industry and technology segments to Enterprises and independent software vendors.\u003C/p\u003E\n\n\u003Cp\u003EEngineering services division of Velan offers CAD/CAM services to the printed circuit board and manufacturing industries. Velan also offers testing services for the PCB manufacturers.\u003C/p\u003E\n\n\u003Cp\u003EProcess outsourcing services division offers back-office support services like offshore transaction processing services starting from data entry to data analysis to report generation, inbound/outbound contact center, internet research, inventory transcription and other business process outsourcing (BPO) services. Velan delivers its services from its offshore center in Coimbatore, India.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President \u0026 CEO",
    "person":
     {"first_name": "Ravi",
      "last_name": "Ponnusamy",
      "permalink": "ravi-ponnusamy",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}