{"name": "Veneto",
 "permalink": "veneto",
 "crunchbase_url": "http://www.crunchbase.com/company/veneto",
 "homepage_url": "http://www.fitcustomshirts.com/",
 "blog_url": "http://fitcustomshirts.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 150,
 "founded_year": 2001,
 "founded_month": 10,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "custom-dress-shirts, custom-tailored-shirts, mens-custom-dress-shirts, best-custom-shirts, custom-dress-shirt, custom-made-dress-shirts, custom-made-shirts, bespoke-shirt, custom-shirt, made-to-measure-shirt, custom-shirts, slim-fit-dress-shirts, tailored",
 "alias_list": null,
 "email_address": "jkfitcustomshirts4@gmail.com",
 "phone_number": "(630) 524-2818",
 "description": "We offer the Custom Dress Shirts, Custom",
 "created_at": "Sat Nov 12 13:58:18 UTC 2011",
 "updated_at": "Thu May 30 12:51:33 UTC 2013",
 "overview": "\u003Cp\u003EWhat dress shirt collars are in style?\u003C/p\u003E\n\n\u003Cp\u003EDress shirt is the most significant piece in men\u0026#8217;s life. So it is very important for men to choose an appropriate dress shirt. Here you can learn about the styles of custom dress shirts that are in fashion. It will help you demonstrate your personality up to date and more stylish.\u003C/p\u003E\n\n\u003Cp\u003EPopular Collar Styles for Men\u0026#8217;s Custom Dress Shirts\u003C/p\u003E\n\n\u003Cp\u003EClassic Turn-down Collar\u003C/p\u003E\n\n\u003Cp\u003EThis is the most common of all styles shirt. This is a classic design that fits for business, formal and leisure, and can be worn with or without a tie. In this style there are variations of the different spread collar styles, the width between each collar angle. Usually, the wider the spread the larger of a tie knot, you should wear. In addition, the spread collar must fit your face. For example: A man with a shorter or larger neck should wear a widely disseminated shirt collar, and a man with a long neck and elongated face is much better to wear a medium to narrow spread collar dress shirt. Finally, there are different variations of cuff styles, shirt placket, yoke styles, and customization options such as monograms and pocket styles.\u003C/p\u003E\n\n\u003Cp\u003EThe Button down Collar\u003C/p\u003E\n\n\u003Cp\u003EThis style of collar is the most relaxed of the four discussed. The collar should always be buttoned - regardless of whether or not you select to wear a tie. Most button down collared custom dress shirts are made from a linen-like fabric known as Oxford cloth. Because button down collar looks like a British appearance, we prefer to match these custom dress shirts with a timeless Four in Hand knot and classic regimental ties.\u003C/p\u003E\n\n\u003Cp\u003EThe most common is the classic white button-collared custom dress shirt, followed by light blue, black and gray. Classic shades are the most common and bright colors are almost never originated for button down custom collared dress shirt. Also they are common dress shirts with thin and fine pattern of stripes, light blue and white being the most common design.\u003C/p\u003E\n\n\u003Cp\u003EFormal Wing-Tip Tuxedo Shirts\u003C/p\u003E\n\n\u003Cp\u003EThis formal custom tuxedo shirt is almost exclusively reticent for white and black tie events. The most common is the black bow or white with this type of custom dress shirt collars, but the formal ascot is an acceptable alternative. The formal wingtip custom tuxedo shirt collar comes in many variants: pleated fronts vs. non-pleated, barrel or french cuffs, and placket hiding buttons or decorative button studs.\u003C/p\u003E\n\n\u003Cp\u003EAlthough black tie functions provide options for different user styles folder, it is white tie dress code that consents a wing tip collar paired with a white bow tie, a tailcoat jacket and a white waistcoat.\u003C/p\u003E\n\n\u003Cp\u003EOriental Mandarin Collar\u003C/p\u003E\n\n\u003Cp\u003EThis oriental style custom dress shirt is the least common of the four in Western society. There is however a formal style of dress shirt that can, if accompanied by properly worn formal black tie functions. Mandarin collar dress shirt is never worn with a tie, but can be worn with a decorative button stud. The front of the formal wearing dress shirt is always closed with decorative studs instead of buttons and as well as pleated.\u003C/p\u003E\n\n\u003Cp\u003EThe mandarin collared custom dress shirt is usually associated with a mandarin jacket - a lapel less high buttoned jacket.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       19],
      "assets/images/resized/0016/3633/163633v2-max-150x150.jpg"],
     [[243,
       32],
      "assets/images/resized/0016/3633/163633v2-max-250x250.jpg"],
     [[243,
       32],
      "assets/images/resized/0016/3633/163633v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "1600 Aimco Blvd",
    "address2": "",
    "zip_code": "",
    "city": "Ontario ",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        92],
       "assets/images/resized/0016/3634/163634v1-max-150x150.png"],
      [[250,
        153],
       "assets/images/resized/0016/3634/163634v1-max-250x250.png"],
      [[450,
        276],
       "assets/images/resized/0016/3634/163634v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}