{"name": "Vengeo",
 "permalink": "vengeo",
 "crunchbase_url": "http://www.crunchbase.com/company/vengeo",
 "homepage_url": "http://www.vengeo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 13,
 "founded_year": 2008,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "epublishing, create, easy, fast, free, presentations, portfolio, newsletters, catalogs, distribute, socialnetwork, personalprofile, nohtml, website, communication",
 "alias_list": null,
 "email_address": "anna@vengeo.com",
 "phone_number": "416.657.2000",
 "description": "",
 "created_at": "Mon Oct 06 21:58:24 UTC 2008",
 "updated_at": "Tue Aug 28 23:26:59 UTC 2012",
 "overview": "\u003Cp\u003EVengeo ( www.Vengeo.com ) is 4 year old tech start-up in Toronto, we’ve received just over $1.1m.  Vengeo is a social-media-enhancement suite of integrated marketing tools including, Web Page publishing, Email Blasting, Surveys/Forms, BlogCommenting \u0026amp; Chatting, Calendars, Subscriptions, File Transfer, and Content collaboration, with many unique advantages, compared to any other online tools.   Our one-price ‘one-stop-shop’ model competes against other entrenched one-product models, such as for Web Pages the competitors might be:  Squarespace, Sitemasher, WordPress, Joomla, Vista, Webstarts, Weebly, and while others may offer some overlap in web page production, unfortunately they are missing many of the other tools, as is the case for our many other  proprietary communication tools that are similar to Mail Chimp, iContact or Constant Contact, Survey Monkey, Form Maker, DropBox/YouSendIt, Google Calendar, EventBrite, PowerPoint, etc, all have singular capabilities.  \u003C/p\u003E\n\n\u003Cp\u003EWe’re like the Swiss Army knife of social media tools.  Our pricing is all-inclusive, with unified data on secure Canadian Servers away from prying eyes, unified login, unified accounts payable, and equivalent to just ONE third-party tool, for the entire year!\u003C/p\u003E\n\n\u003Cp\u003EAnd because we can deliver most of our tools as web links, or embedded into our proprietary web page publishing tools, or supplied as HTML iFrame Plugins, our clients can deliver content in places and ways they couldn’t before, while organically increasing their SEO results without added costs - our clients tell us we cannot be beat!!!\u003C/p\u003E\n\n\u003Cp\u003ENow, we are starting to aggregate 3rd-party tools including Web Hosting (draft agreement with Canadian Web Hosting), e-Commerce, Teleconferencing, CRM, Hiring Tools, and looking to build APIs for several others.\u003C/p\u003E\n\n\u003Cp\u003EWe also have a ‘Sharepoint’ style hierarchical community management system (multi managers-subordinates) that permits ‘super members’ to create virtual Projects/Communities to collaborate/approve on all their sub members’ content.  \u003C/p\u003E\n\n\u003Cp\u003EOur system can be used as a standalone ‘total access’ tool-suite, or as a broader ‘baby’ Content Management Solution (CMS) for companies that can’t afford the big price but need the basics, and as a ‘baby’ Learning Management Solution (LMS) for education, competing against much larger systems. …we can drop-in Vengeo as an enterprise solution. \u003C/p\u003E\n\n\u003Cp\u003EOur primary focus is Small Business, NFPs, and Education where schools will pay a different pricing model for an enterprise solution.  The typical Small Business plan is priced at $588 to $1188 per year, compared to the same cost for ONE single competing tool.  All the tools are blended into each member’s account to give any organization a low-cost high-value suite of tools, at ready access without the client’s extra time for research,  expense.  \u003C/p\u003E\n\n\u003Cp\u003EWe have over 900 beta free users but recently went into revenue March 2012, very quickly selling 2 dozen SMBs, with over 60 in the funnel. In addition, we’re starting to scale, now in discussion with a few business communities as well as with education pilots in 3 Ontario colleges and the entire country of El Salvador’s Ministry of Education. \u003C/p\u003E\n\n\u003Cp\u003EVisit our website www.vengeo.com or check out our product comparisons and features \u003C/p\u003E\n\n\u003Cp\u003Ewww.vengeo.com/vortex-view/Vengeo_Inc/VengeoProductCompetitors\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.vengeo.com/html5/Vengeo\u003Cem\u003EInc/Brochure\u003C/em\u003EMain\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[140,
       65],
      "assets/images/resized/0002/6255/26255v2-max-150x150.jpg"],
     [[140,
       65],
      "assets/images/resized/0002/6255/26255v2-max-250x250.jpg"],
     [[140,
       65],
      "assets/images/resized/0002/6255/26255v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "PiPE",
    "permalink": "pipe",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "President \u0026 CEO",
    "person":
     {"first_name": "Vic",
      "last_name": "Cauchi",
      "permalink": "vic-cauchi",
      "image": null}},
   {"is_past": false,
    "title": "Manager, Ops \u0026 Bus Dvlpmt",
    "person":
     {"first_name": "Anna",
      "last_name": "Nguyen",
      "permalink": "anna-nguyen",
      "image": null}},
   {"is_past": true,
    "title": "Manager, Marketing \u0026 Creative",
    "person":
     {"first_name": "Brian",
      "last_name": "Umali",
      "permalink": "brian-umali",
      "image": null}},
   {"is_past": true,
    "title": "Business Development",
    "person":
     {"first_name": "Jennifer",
      "last_name": "Kim",
      "permalink": "jennifer-kim",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Toronto Office",
    "address1": "1061 St. Clair Ave. West",
    "address2": "Unit 2",
    "zip_code": "M6E1A6",
    "city": "Toronto",
    "state_code": null,
    "country_code": "CAN",
    "latitude": 43.678782,
    "longitude": -79.439315}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        93],
       "assets/images/resized/0002/6254/26254v2-max-150x150.jpg"],
      [[250,
        155],
       "assets/images/resized/0002/6254/26254v2-max-250x250.jpg"],
      [[450,
        279],
       "assets/images/resized/0002/6254/26254v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.metronews.ca/toronto/Live/article/115527",
    "title": "Metro News Toronto writes about Vengeo's contest!"}]}