{"name": "VerifiedMD",
 "permalink": "verifiedmd",
 "crunchbase_url": "http://www.crunchbase.com/company/verifiedmd",
 "homepage_url": "http://www.verified.md",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "verifiedmd",
 "category_code": "web",
 "number_of_employees": 8,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "doctor, physician, rating, marketing, seo, social-media, medical, verified, doctors",
 "alias_list": null,
 "email_address": "support@verified.md",
 "phone_number": "",
 "description": "Doctor Marketing",
 "created_at": "Sun Aug 19 11:34:44 UTC 2012",
 "updated_at": "Wed Aug 22 09:53:33 UTC 2012",
 "overview": "\u003Cp\u003EWhat is VerifiedMD\u003C/p\u003E\n\n\u003Cp\u003EPhysicians face a myriad of issues when it comes to information that is published about them on the Internet. The only real way to ensure the accuracy of information that is published about you on the Internet is to “self-publish”. This is where VerifiedMD comes in. At VerifiedMD we believe that patients receive the most benefit by giving them the most accurate information; information that the physicians themselves publish.\u003C/p\u003E\n\n\u003Cp\u003EVerifiedMD is a next generation physician directory and fully managed Medical Marketing Platform (MMP) designed to help physicians take control of their web reputation as well as market and promote their practice. VerifiedMD provides physicians all the tools to self-publish information on the Internet. Physicians can post ads, events, articles, photos, and videos all designed to increase visibility, showcase their practice, and provide current and prospective patients with accurate and up to date information. Coupled with Next-Level Search Engine Optimization (SEO) physicians have the confidence that their VerifiedMD listing will be among the top positions.\u003C/p\u003E\n\n\u003Cp\u003EVerifiedMD custom listings are managed entirely by You the physician. Using the member interface, physicians can make unlimited changes to their listings whenever needed, providing physicians complete control 24 hours a day 7 days a week.\u003C/p\u003E\n\n\u003Cp\u003EVerifiedMD is a Mobile Ready site providing patients easy access to physicians listings from any mobile phone web browser.\u003C/p\u003E\n\n\u003Cp\u003EVerifiedMD also provides physician website trust marks so patients can browse physician listings with confidence. Patients know that a VerifiedMD physician listing, and physician websites with the VerifiedMD trust mark, confirms the relationship between physicians and their listings.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       89],
      "assets/images/resized/0020/6847/206847v2-max-150x150.jpg"],
     [[250,
       148],
      "assets/images/resized/0020/6847/206847v2-max-250x250.jpg"],
     [[450,
       267],
      "assets/images/resized/0020/6847/206847v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}