{"name": "Veribo",
 "permalink": "veribo",
 "crunchbase_url": "http://www.crunchbase.com/company/veribo",
 "homepage_url": "http://www.veribo.com/",
 "blog_url": "http://www.veribo.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "veribo_com",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-reputation-management, online-visibility, corporate-reputation-management, reputation-protection, reputation-management-services",
 "alias_list": null,
 "email_address": "sales@veribo.com",
 "phone_number": "+44(0)20-8123-3262",
 "description": "Online Reputation Management",
 "created_at": "Wed Jan 25 15:54:34 UTC 2012",
 "updated_at": "Fri May 10 04:21:20 UTC 2013",
 "overview": "\u003Cp\u003EVeribo’s Online Reputation Management  Services\u003C/p\u003E\n\n\u003Cp\u003EVeribo is a global leader in online reputation management and reputation protection with clients in more than 20 countries worldwide. Veribo not only strives for online reputation protection but also for the management and promotion of a positive online reputation as a significant stimulant for clients’ future success.  .\u003C/p\u003E\n\n\u003Cp\u003EThe Importance of Reputation Protection and Online Reputation Management \u003C/p\u003E\n\n\u003Cp\u003EThe reputation and success of a company or individual can easily be tarnished by negative content including slander by a competitor, unfavorable customer reviews, the advertisement of unwanted personal information, and so forth.  Unfortunately, due to freedom of speech regulations this information cannot be easily removed from internet.  Online reputation management is the business of generating and promoting desired content so that it will rank highly on search engines results, thereby pushing negative content lower on the search results. A positive online reputation and a controlled online presence ensure credibility and online visibility. In turn, these factors provide companies and individuals with greater business opportunities, a greater platform for promoting their agenda, security in the face of future internet results, and the possibility to increase their customer base.\u003C/p\u003E\n\n\u003Cp\u003EVeribo’s Services\u003C/p\u003E\n\n\u003Cp\u003ESince its founding in 2007, Veribo has developed technologies and methodologies to manage its clients’ online reputation.   Veribo is at the technological forefront of online reputation management and constantly strives to further perfect and upgrade its services.  Veribo utilizes two general steps in its approach to online reputation management:   Foremost, it proactively pushes down negative results linked to the client’s name in Google by uploading positive, truthful content. Furthermore, Veribo promotes the visibility of a client’s positive online presence by means of website optimization, social media presence on sites including Facebook, Linkedin, and Twitter, the production and placement of articles or comments related to the client in various review sites and blogs, and more. In essence, Veribo’s approach to online reputation management and reputation protection is to create and uphold an online presence that portrays the client’s strengths.  \u003C/p\u003E\n\n\u003Cp\u003EVeribo builds long-term relationships with clients based on mutual respect and is committed to providing clients with premium quality services and products.  At Veribo, each client receives individualized treatment.  Each client is allocated a personal project manager and a custom-made project strategy.  All means are exerted and no shortcuts are taken when it comes to reaching a client’s online reputation goals.  Once a client’s online reputation is assessed, Veribo’s online reputation experts, including SEO professionals, reputation analysts, engineers, and content writers, create a personalized strategy to decrease unwanted online search results.  This approach ensures that each client’s specific needs are met.  \u003C/p\u003E\n\n\u003Cp\u003EVeribo’s efficient strategy for online reputation management and reputation protection guarantees the comprehensive analysis of clients’ online image, effective tools for managing and protecting their reputation, and fast results.  Veribo’s dedication to proactive, exceptional, and fair management of clients’ online reputation and maximization of their positive online presence offers clients peace of mind and greater confidence in their reputation.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       60],
      "assets/images/resized/0017/1646/171646v4-max-150x150.jpg"],
     [[250,
       100],
      "assets/images/resized/0017/1646/171646v4-max-250x250.jpg"],
     [[450,
       180],
      "assets/images/resized/0017/1646/171646v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.veribo.net/",
    "title": "Veribo's Lookuppage"},
   {"external_url": "https://www.facebook.com/Veribo.Reputation",
    "title": "Veribo Facebook Page"},
   {"external_url": "https://twitter.com/Veribo_com",
    "title": "Veribo Twitter Page"},
   {"external_url": "https://plus.google.com/114969279374879154797/",
    "title": "Veribo Google Plus"}]}