{"name": "Via Digital",
 "permalink": "via-digital",
 "crunchbase_url": "http://www.crunchbase.com/company/via-digital",
 "homepage_url": "http://www.viadigital.in/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Viadigitall",
 "category_code": "search",
 "number_of_employees": 10,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "digital-marketing-agency, digital-marketing-services, search-engine-optimization, internet-marketing, paid-advertising, branding, web-apps, digital-strategy, mobile-sites--apps, social-media-enagagement",
 "alias_list": null,
 "email_address": "info@viadigital.in",
 "phone_number": "8750902706",
 "description": "A full service digital marketing agency ",
 "created_at": "Mon Dec 31 11:28:39 UTC 2012",
 "updated_at": "Wed Jan 23 23:21:54 UTC 2013",
 "overview": "\u003Cp\u003E**Via Digital: SEO, PPC, Social Media and Conversion Rate\nOptimisation Specialists**\u003C/p\u003E\n\n\u003Cp\u003EVia Digital is a full service digital marketing agency with a very simple objective: to drive the right kind of visitors to your website. And to help you convert those visits into customers, sales and bottom line profits.\u003C/p\u003E\n\n\u003Cp\u003EVia Digital specialises in maximising the visibility of your website through paid and optimised search services. And, having attracted new visitors, in converting more of them into targeted and relevant enquries or sales.\u003C/p\u003E\n\n\u003Cp\u003EAs more and more of your potential customers search, shop and make purchase decisions online,effective digital marketing solutions represent one of the most important investments you can make for your business.\u003C/p\u003E\n\n\u003Cp\u003ETo do that, we deploy our own sophisticated, proven tools that enhance existing Search Engine Optimisation (SEO), Pay Per Click Management (PPC), Social Media Marketing (SMM) and Conversion Rate Optimisation (CRO) techniques.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EProducts and Services:-\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003E1. Search Engine Optimisation: Increasing sales by increasing your visibility online.\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cp\u003ESEO is the starting point for any integrated digital marketing campaign. It\u0026#8217;s where we work to research and anticipate customer behavior, targeting key words and content to ensure your site appears at or close to the top of search results and delivering outstanding ROI for your business.\nThe difference a successful SEO strategy can make to sales and profits is phenomenal:Higher rankings mean more visits. More visits mean more sales. And more sales mean increased\nprofitability.Staying at the top of the search listings, however, requires constant management of your SEO\nstrategy. As search engines evolve and new ways to organise the world\u0026#8217;s data emerge, so the techniques we use must change and develop with them.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003E2. Paid Search Advertising: Maximising search effectiveness with PPC management.\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cp\u003EPPC provides a cost-effective way to guarantee a prominent, sponsored listing in search results. By paying to optimise key words and search phrases, it allows you to achieve almost instant, high profile coverage across your market while driving down the cost of your internet marketing campaign.Because you pay only when people click on your listing to visit your site, PPC is an investment\nin high quality leads that have already demonstrated an interest in your company and a propensity to buy.\u003C/p\u003E\n\n\u003Cp\u003E**3.Social Media Marketing: Social Media Marketing puts\nyou at the centre of customer conversations online.**\u003C/p\u003E\n\n\u003Cp\u003EThe power of social media represents an almost unlimited opportunity to raise awareness of your business and increase visits to your website. And all for a fraction of the cost of traditional marketing media channels.In recent years, the rise of sites such as Facebook, Twitter and YouTube has completely transformed the relationship between business and the consumer. Today, it\u0026#8217;s not what you say about yourself that matters, but what thousands of potential customers are saying about you online.By creating and managing that all-important \u0026#8216;buzz\u0026#8217;, our social media specialists will ensure your brand is at the centre of the conversation among your target audience.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003E4. Conversion Rate Optimisation: Transform website visitors into leads and sales\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cp\u003EYour website is a potential shop window for your business on every laptop and PC screen in the world.And just like a shop window, it has to attract the interest of passing customers and encourage them inside if it\u0026#8217;s to justify the money you\u0026#8217;ve invested in it.CRO is the principle of testing the performance of your website and making incremental adjustments in its content, format and presentation to improve customer engagement and sales.It\u0026#8217;s a precise discipline that uses sophisticated, custom designed software to test and measure the effects of optimisation techniques.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0022/7471/227471v2-max-150x150.png"],
     [[250,
       95],
      "assets/images/resized/0022/7471/227471v2-max-250x250.png"],
     [[280,
       107],
      "assets/images/resized/0022/7471/227471v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Head of Marketing",
    "person":
     {"first_name": "deepak",
      "last_name": "sharma",
      "permalink": "deepak-sharma-5",
      "image":
       {"available_sizes":
         [[[150,
            100],
           "assets/images/resized/0021/0271/210271v2-max-150x150.jpg"],
          [[250,
            166],
           "assets/images/resized/0021/0271/210271v2-max-250x250.jpg"],
          [[450,
            300],
           "assets/images/resized/0021/0271/210271v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": true,
    "title": "Founder \u0026 CEO",
    "person":
     {"first_name": "Monu",
      "last_name": "Rohila",
      "permalink": "monu-rohila-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}