{"name": "Victory Industrial",
 "permalink": "victory-industrial",
 "crunchbase_url": "http://www.crunchbase.com/company/victory-industrial",
 "homepage_url": "http://www.indiamart.com/victoryindustrialhydraulics/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "victoryindustrialhydraulics@tradepassport.org",
 "phone_number": "9944952341",
 "description": "Manufacturing, exporting and supplying ,",
 "created_at": "Fri Apr 05 07:04:01 UTC 2013",
 "updated_at": "Fri Apr 05 07:04:05 UTC 2013",
 "overview": "\u003Cp\u003EVictory Industrial Hydraulics is a partnership organization, came into existence in the year 2007 as a manufacturer, exporter and supplier of a comprehensive range of Coir Machine, Hydraulic Power Pack, Hydraulic Cylinder, Hydraulic Press, Pipe Bending Machine, Manifold Block, Test Rig, Special Purpose Machine, Interlock Brick Machine, Log Splitter, Coco Product and Coir Product. \u003C/p\u003E\n\n\u003Cp\u003EOur Vendor Base:\nOur company procures range from the reliable and authorized vendors of the industry, who possess vast knowledge about this field. We have selected our vendors after a stringent market research conducted by our experienced professionals, in which their market credibility, prompt delivery schedule and quality is strictly examined.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur company has developed a sophisticated infrastructure, equipped with all requisite and advanced business amenities. It consists of various departments, which enables us in executing hassle free operations. Production procedure that has been undertaken by us is in compliance to the international quality standards and guidelines. \u003C/p\u003E\n\n\u003Cp\u003EOur Clients:\nOur company has enlarged its base of client from all across the country by consistently providing desired and quality approved solutions at affordable prices. We ensure clients that products we supplied them are in strict conformation to the prescribed guidelines of the industry. After sales support are also provided by us to our valuable clientele.\u003C/p\u003E\n\n\u003Cp\u003EProducts \u0026amp; Services:\nCoir Machine, Hydraulic Power Pack, Hydraulic Cylinder, Hydraulic Press, Pipe Bending Machine, Manifold Block, Test Rig, Special Purpose Machine, Interlock Brick Machine, Log Splitter, Coco Product and Coir Product. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8361/248361v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8361/248361v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8361/248361v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}