{"name": "Videolog.tv",
 "permalink": "videolog-tv",
 "crunchbase_url": "http://www.crunchbase.com/company/videolog-tv",
 "homepage_url": null,
 "blog_url": null,
 "blog_feed_url": null,
 "twitter_username": null,
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": null,
 "phone_number": null,
 "description": null,
 "created_at": "Fri Jun 29 15:07:40 UTC 2012",
 "updated_at": "Tue Jun 11 22:41:00 UTC 2013",
 "overview": "\u003Cp\u003EO Videolog.tv é um portal brasileiro pioneiro no compartilhamento de vídeos e uma mídia social que reúne a maior comunidade de produtores de vídeo independentes do Brasil. Fundado em maio de 2004, o site se tornou um dos maiores do gênero no país.\u003C/p\u003E\n\n\u003Cp\u003EDesenvolvido com tecnologia 100% brasileira, o portal foi um dos primeiros empreendimentos a despontar, de maneira independente, em um ainda emergente cenário de startups nacional.\u003C/p\u003E\n\n\u003Cp\u003EFocado em oferecer visibilidade a projetos editoriais, videologgers e empresas locais, o Videolog.tv é o principal produto da Videolog INC, empresa criada a partir da experiência dos sócios adquirida com o portal, e cuja principal missão é desenvolver plataformas de vídeo que possibilitem que qualquer pessoa crie, gerencie e monetize facilmente os seus vídeos na Internet, dispositivos móveis e TVs conectadas\u003C/p\u003E\n\n\u003Cp\u003EHistórico\u003C/p\u003E\n\n\u003Cp\u003EEm maio de 2004, o Videolog.tv entra no ar, em caráter experimental, como uma plataforma online para facilitar o processo de logística e aprovação de conteúdos em vídeo\u003C/p\u003E\n\n\u003Cp\u003EA partir de 2005, o site começa a ganhar popularidade e destaque na mídia, sendo apontado como um dos únicos sites na Internet para hospedagem de vídeos próprios, num formato audiovisual correspondente ao dos blogs, fenômeno editorial da época.\u003C/p\u003E\n\n\u003Cp\u003EEm 2006, o Videolog.tv estabelece uma parceria com o UOL, o quinto maior site em volume de tráfego do Brasil e centésimo do mundo, de acordo com o ranking do Alexa. A associação entre as duas empresas segue até novembro de 2010, quando o Videolog.tv se une ao portal de notícias brasileiro R7, do Grupo Record, numa parceria que dura até hoje.\u003C/p\u003E\n\n\u003Cp\u003EHoje, em 2013, o site figura na posição 541 no Brasil e 14049 no mundo.\u003C/p\u003E\n\n\u003Cp\u003EInvestimentos\u003C/p\u003E\n\n\u003Cp\u003EA Videolog INC é uma empresa com capital nacional, erguida por meio de bootstrapping, e que permanece independente até hoje.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Edson",
      "last_name": "Mackeenzy",
      "permalink": "edson-mackeenzy",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}