{"name": "Vidyuth Instrumentation Technology",
 "permalink": "vidyuth-instrumentation-technology",
 "crunchbase_url": "http://www.crunchbase.com/company/vidyuth-instrumentation-technology",
 "homepage_url": "http://www.indiamart.com/vidyuthinstrumentationtechnology/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "crane-panels, dcs-panels, automation-panels, panel-containers, control-consoles",
 "alias_list": null,
 "email_address": "vidyuthinstrumentationtechnology@tradepassport.org",
 "phone_number": "9986675659",
 "description": "We are into manufacturing and supplying ",
 "created_at": "Fri Apr 05 11:45:51 UTC 2013",
 "updated_at": "Fri Apr 05 11:45:54 UTC 2013",
 "overview": "\u003Cp\u003EVidyuth Instrumentation Technology is a partnership venture that started its business operations in the year 2007 at Bengaluru, Karnataka in India. Established as a partnership business venture, we have emerged as one of the leading names involved in manufacturing and supplying extensive range of Electrical Products. Under the efficient guidance and support of Mr. H. Manohar Shetty, our Managing Director, we are able to expand our product range suiting client demands and specifications.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nVidyuth Instrumentation Technology has a total built up area of 30,000 sqft located in Peenya, Bangalore with all necessary modern facilities for Assembly of all types of electric control panels. It is sectioned into varied units including Research and Development, quality monitoring, manufacturing and warehousing and packaging. All these units are installed with latest machine, tools and basic amenities required to carry out varied business processes. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nSince our establishment, we are a client-oriented organization that is involved in offering exclusive range of Electrical Products in the market. To develop our range finest grade components and material are used to develop our range. Finished products are put across stringent quality testing to ensure that the range offered is flawless in nature and as per set industrial standards. By offering quality-assured products, we are accredited by ISO 9001 : 2008 Certifications. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe have recruited a pool of experienced and highly dedicated professionals that enable us to carry varied business processes in a smooth and timely executed manner. Recruited as per their domain expertise and prolonged experience, our professionals work as a single unit to ensure that finest grade Electrical products are offered in the market. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nMaking our client immensely satisfied in the key to our success and growth. We offer widespread range of Electrical products that are in accordance with set industrial trends. We follow proper pricing policy that enables us to offer our products at market leading rates. Our association with reputed distribution network, we are able to ensure safe and timed dispatched in the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nConsoles\nBreaker Panels\nProgrammable Logic Controllers\nDrive Panels\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       101],
      "assets/images/resized/0024/8597/248597v2-max-150x150.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8597/248597v2-max-250x250.jpg"],
     [[230,
       156],
      "assets/images/resized/0024/8597/248597v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}