{"name": "Vijay Ganapathi",
 "permalink": "vijay-ganapathi",
 "crunchbase_url": "http://www.crunchbase.com/company/vijay-ganapathi",
 "homepage_url": "http://www.indiamart.com/vijayganapathi/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "vijayganapathi@tradepassport.org",
 "phone_number": "09953363410",
 "description": "manufacturer and supplier of Industrial ",
 "created_at": "Fri Apr 05 12:24:11 UTC 2013",
 "updated_at": "Fri Apr 05 12:24:22 UTC 2013",
 "overview": "\u003Cp\u003EIncepted in the year 2010 at Hyderabad, Vijay Ganapathi Engg. Systems, has become one of the most sought-after manufacturer and supplier of Belts Conveyors and All type of Conveyors, as per customer’s demands and requirements. Owing to the industrial expertise of our highly skilled professionals, we have developed a consortium of products and services that are in conformation with the industry standards.\u003C/p\u003E\n\n\u003Cp\u003EOur Warehouse:\nWe have a spacious warehouse that sprawls over a large area and is segmented into various sections to support streamlined storage of our products as well as the raw material. Moreover, we have installed advanced equipment in our warehousing facility to maintain high storage standards and ensure quick processing of the bulk orders with ease. Our warehouse is connected to all the major highways thereby ensuring safe and timed dispatch in the market. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a sophisticated facility that enables us to manufacture products of exceptional quality as par set industry standards. Moreover, our infrastructure facilitates us to quickly process bulk orders with utmost ease. We have with us a high production capacity that is installed with efficient machinery and cutting-edge tools. We have segregated our facility into various departments like manufacturing unit, warehousing facilities, sales and marketing etc. to ensure effective functioning and timed execution.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality assurance is the hallmark of our company. Stringent quality measures are carried out at every step right from the procurement of raw material, manufacturing of products to the ensuring the final delivery. Our product range is durable and developed using advanced tools and cutting-edge technology, setting high quality standards in the industry.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us? / Our Strengths:\nWe are a quality-focused company that has achieved a remarkable position in the industry in a very short period of time. Furthermore, we follow transparent business policies and ensure that our range is safely delivered across the major markets of the nation, thereby winning the trust and confidence of the customers. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8646/248646v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8646/248646v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8646/248646v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}