{"name": "Vijay Flooring Solutions",
 "permalink": "vijay-flooring-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/vijay-flooring-solutions",
 "homepage_url": "http://www.indiamart.com/vijayflooringsolutions/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "vijayflooringsolutions@tradepassport.org",
 "phone_number": "+(91)-(22)-65612115",
 "description": "trader and supplier",
 "created_at": "Thu Apr 04 08:18:47 UTC 2013",
 "updated_at": "Thu Apr 04 08:18:51 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2002, we, “Vijay Flooring Solutions”, are one of the most prominent names of the industry engaged in trading and supplying a superior quality range of Carpets, Hardwood, Engineering \u0026amp; Laminated Floorings, Decking Wood and Carpet Tiles. In our range, we offer Wall To Wall Carpets, Carpet Tiles, Hardwood Flooring, Engineered Flooring, Laminated Flooring and Decking Wood in different designs, finishes, patterns and other specifications. The entire range is designed as per the exact requirements of the clients as well as by considering the trends prevailing in home furnishing \u0026amp; interior designing sectors. These products are ideally suited to enhance the decor of various commercial as well as residential establishments.\u003C/p\u003E\n\n\u003Cp\u003EProduct Portfolio:\u003C/p\u003E\n\n\u003Cp\u003Esuperior quality range of Carpets, Hardwood, Engineering \u0026amp; Laminated Floorings, Decking Wood and Carpet Tiles. In our range, we offer Wall To Wall Carpets, Carpet Tiles, Hardwood Flooring, Engineered Flooring, Laminated Flooring and Decking Wood in different designs, finishes, patterns and other specifications.\u003C/p\u003E\n\n\u003Cp\u003EThe Creative Experts:\u003C/p\u003E\n\n\u003Cp\u003EWe have a team of creative experts, which has contributed in our fame and success in the market. These professionals have inherent artistic skills, which helps us in offering an elegant range of Carpets, Hardwood, Engineering \u0026amp; Laminated Floorings, Decking Wood and Carpet Tiles in the market.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\u003C/p\u003E\n\n\u003Cp\u003EWe pay utmost attention to maintain highest level of quality in the range of Carpets, Hardwood, Engineering \u0026amp; Laminated Floorings, Decking Wood and Carpet Tiles offered by us.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\u003C/p\u003E\n\n\u003Cp\u003EBeing customer centric organization, we always endeavor to maintain long term relationships with our esteemed customers. Further we strive to improve our production efficiency and client base by catering to the new clients with unmatched products besides maintaining good relation with the old ones.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\u003C/p\u003E\n\n\u003Cp\u003EWith the support of our procuring agents, we have been able to offer an excellent range of Carpets, Hardwood, Engineering \u0026amp; Laminated Floorings, Decking Wood and Carpet Tiles in the market. These procuring agents select the most trusted vendors of the market to procure the products. We understand the exact needs of the clients and procure the products accordingly.\u003C/p\u003E\n\n\u003Cp\u003EClientele:\u003C/p\u003E\n\n\u003Cp\u003EWe have been widely known as a customer-centric organization, thus, we put in all our efforts to satisfy the exact needs of the clients efficiently. Our workforce understands the clients\u0026#8217; preferences and offer an excellent range of Carpets, Hardwood, Engineering \u0026amp; Laminated Floorings, Decking Wood and Carpet Tiles to the customers accordingly\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7673/247673v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7673/247673v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7673/247673v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}