{"name": "Vikas Awnings",
 "permalink": "vikas-awnings",
 "crunchbase_url": "http://www.crunchbase.com/company/vikas-awnings",
 "homepage_url": "http://www.indiamart.com/vikasawnings/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "vikasawnings@tradepassport.org",
 "phone_number": "9322762101",
 "description": "Manufacturer, supplier and exporter ,",
 "created_at": "Fri Apr 05 16:05:03 UTC 2013",
 "updated_at": "Fri Apr 05 16:05:07 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2007, we, “Vikas Awnings”, are involved in manufacturing and supplying an extensive range of Awnings and Canopies. Our range of products encompasses Roof Awnings, Metal Curved Awnings, Joint Awnings, House Awnings, Garden Awnings, Gallery Awnings, Plastic Shade Awnings, Fiberglass Awnings and Fiber Canopies. Also, we offer UV Protected Canopies, Round Canopies, Outdoor Canopies, Fix Canopies, Fiber Canopies, Canopies, Camp Awnings and Beach Canopies. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nThe competent team of professionals employed by us greatly support us in all the trade activities. The dedicated, sincere and hardworking experts working with us are are masters of their respective fields of specialization. All our employees employ their rich experience of the industry and in-depth knowledge to successfully accomplish the assigned tasks. \u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe have established a state-of-the-art infrastructure facility at our premises for executing the business processes in a streamlined manner. Sprawling across an extensive area, this facility is installed with latest machines \u0026amp; advanced technology that enable us to utilize the resources in judicious manner.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality:\nBeing a quality conscious organization, we strive to maintain high quality standards in our products \u0026amp; policies. The range offered by us is manufactured using excellent quality material that is sourced from vendors of high repute after scouring the market. Latest machines and advanced technology are employed in the manufacturing process following industry set guidelines. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a patron-based firm, we aim to maximize the contentment level of our esteemed patrons in the best possible manner. For this reason, we make sure that quality-approved products are offered to them at market-leading prices. All our offered products are manufactured using finest quality material so that these are in tandem with international quality standards. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nPlastic Shade Awnings, Fiberglass Awnings and Fiber Canopies. Also, we offer UV Protected Canopies, Round Canopies, Outdoor Canopies, Fix Canopies, Fiber Canopies, Canopies, Camp Awnings and Beach Canopies. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       93],
      "assets/images/resized/0024/8874/248874v2-max-150x150.jpg"],
     [[125,
       93],
      "assets/images/resized/0024/8874/248874v2-max-250x250.jpg"],
     [[125,
       93],
      "assets/images/resized/0024/8874/248874v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}