{"name": "Vinayak Impex",
 "permalink": "vinayak-impex",
 "crunchbase_url": "http://www.crunchbase.com/company/vinayak-impex",
 "homepage_url": "http://www.indiamart.com/vinayakimpex/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "vinayakimpex@tradepassport.org",
 "phone_number": "9660058383",
 "description": "manufacturing, supplying and exporting",
 "created_at": "Thu Apr 04 16:14:40 UTC 2013",
 "updated_at": "Thu Apr 04 16:14:45 UTC 2013",
 "overview": "\u003Cp\u003EVinayak Impex, a Sole Proprietorship business venture that started its business operations in the year 2006 at Jaipur, Rajasthan in India. Since our inception, we have become one of the established names involved in manufacturing, supplying and exporting comprehensive range of Ladies Trousers, Quilted Jackets, Ladies Shirts, Ladies Capris, Ladies Short Pants and Party Wear Gowns. With the untiring efforts and constant support of Mr. Bharat Sharma, we have established ourselves well in the market. Strong industrial acumen and thorough market knowledge of Mr. Mohan Sharma has enabled us to transform our product range as per existing fashion trends. Our product range primarily includes Ladies Cargo Pants, Bell Bottom Trousers, Cotton Capris, Party Wear Gowns, Jeans Capris, Formal Trousers, Printed Capris, Ladies Jeans Short Pants, Cotton Short Pants, Ladies Plain Shirt, Ladies Quilted Jackets and Ladies Cotton Shirt.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe tirelessly work hard to manufacture, exporting and supply finest range of Ladies Garments in the market. Our internationally acclaimed range of products is offered at pocket-friendly rates through easy payment modes. Our association with extensive supply chain network and widespread distribution network, we are able to timely dispatch bulk demands with utmost ease. Our ability to customize has enabled us to render complete customer satisfaction. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nSkilled and qualified team of experts forms the basis of our success and growth. Professionals recruited by us carry immense expertise in their domain and have clear idea about existing fashion trends and Apparel Industry. Our professionals are considered as the masters in their area of specialization and locale from varied backgrounds. Although diverse, our professionals work in a synchronized environment to execute varied processes within the constraints of quality and time. Their hard work, dedication and constant support has helped us to establish ourselves across the major markets of the nation. \u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nVinayak Impex boasts of modernized infrastructural facility that spreads throughout an extensive land area. To carry out all our business operations in smooth and effective manner, we have strategically partitioned our infrastructure into specified units. These units are inter-connected and are operational with modernized tools, cutting edge machines and requisite amenities. These machines and tools are effectively utilized and timely serviced to ensure streamlined production process. \u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nQuality assured production is the key to customer retention and satisfaction. Quality monitoring revolves around varied stages of production and dispatch. We have recruited skilled quality monitoring professionals, who cautiously examine the production process to ensure its accordance with international quality norms. However these professionals make effective use of installed tools and equipment to stringently check the finished products to ensure its flawlessness and reliability. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0024/8073/248073v2-max-150x150.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8073/248073v2-max-250x250.jpg"],
     [[200,
       200],
      "assets/images/resized/0024/8073/248073v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}