{"name": "Viraltrend",
 "permalink": "viraltrend",
 "crunchbase_url": "http://www.crunchbase.com/company/viraltrend",
 "homepage_url": "http://viraltrend.com",
 "blog_url": "http://viraltrend.com/blog",
 "blog_feed_url": "",
 "twitter_username": "viraltrendcom",
 "category_code": "ecommerce",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fashion, social-network, e-commerce",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "fashion, style, social",
 "created_at": "Fri Feb 15 17:37:24 UTC 2013",
 "updated_at": "Wed Feb 20 06:40:22 UTC 2013",
 "overview": "\u003Cp\u003EThere is a passion for fashion and a creative spirit in each of us; this is reflected in the ways we purchase clothes, shoes and jewelry from different stores and combine them in different styles. Maintaining and developing this creativity and passion is possible through exploring, following and sharing.\u003C/p\u003E\n\n\u003Cp\u003EViraltrend is a social platform where people save and share their fashion discoveries. Online stores are increasing day by day and it becomes harder to find exciting items among the variety of all items in these stores. Viraltrend serves you the most attractive products discovered by its users. With viraltrend bookmarklet and add-ons, users can save items they like from online stores and share with their followers. You can also create lists and categorize your fashion discoveries..\u003C/p\u003E\n\n\u003Cp\u003EThe viral feed, photos that can be voted and tagged are other important features viraltrend has. You can save your photos, videos, attractive links on your wall and share with your followers. Your photos are voted and commented by other users. The most liked photos are selected as the photo of the day and placed in the style archive. If you also want to be a trend setter and inspire other viraltrend users, you can share your photos which represent your style with your followers.\u003C/p\u003E\n\n\u003Cp\u003ETo get style advice, interviews, combinations, contests and news from brands and celebrities, blended with information, research and a bit of amusement, we advise you to join viraltrend.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "founder",
    "person":
     {"first_name": "onur",
      "last_name": "onat",
      "permalink": "onur-onat",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}