{"name": "VirtuallyMagic",
 "permalink": "virtuallymagic",
 "crunchbase_url": "http://www.crunchbase.com/company/virtuallymagic",
 "homepage_url": "http://www.virtuallymagic.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "wisdomwizard",
 "category_code": "web",
 "number_of_employees": 10,
 "founded_year": 2011,
 "founded_month": 11,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-apps, user-experience, tune-ups, mobile-apps, security, apps-setup, user-training, personal-technology, online-safety, online-security, cloud-computing, data-backup, encryption, online-reputation-management, business-cloud-solutions, employee-producti",
 "alias_list": null,
 "email_address": "lstone@virtuallymagic.com",
 "phone_number": "6503084711",
 "description": "User Experience Solutions",
 "created_at": "Fri Aug 17 19:22:01 UTC 2012",
 "updated_at": "Thu Oct 25 00:19:45 UTC 2012",
 "overview": "\u003Cp\u003EAt VirtuallyMagic, We make all of the technology and Apps in your life work for you the way you want them to!!\u003C/p\u003E\n\n\u003Cp\u003E“Your User Experience - We Take IT Personal”\u003C/p\u003E\n\n\u003Cp\u003EWe Don’t Fix Computers \u0026amp; Technology… We Improve Your Experience Using Them.\u003C/p\u003E\n\n\u003Cp\u003EWeb/Mobile Apps User Experience Tune Ups, Mobile \u0026amp; Web Apps Setup \u0026amp; User Training, Personal Technology Experience Enrichment, Personal Online Safety \u0026amp; Security Solutions, Cloud \u0026amp; Local Data Backup \u0026amp; Encryption, Online Reputation Management, \u003C/p\u003E\n\n\u003Cp\u003EBusiness Cloud Based Software Solutions, Employee Productivity, BI Analytics \u0026amp; Applications, Collaboration \u0026amp; Communications Improvements, Business \u0026amp; Personal Social Networking \u0026amp; Social Media Success. \u003C/p\u003E\n\n\u003Cp\u003EIn Person Customer Care PERIOD!\u003C/p\u003E\n\n\u003Cp\u003EWe believe all the free apps in the world don’t make for a great user experience. Because these apps are free… YOU ARE THE PRODUCT NOT THE CUSTOMER!! Your personal information is being sold to advertisers to monetize these SO CALLED FREE applications.\u003C/p\u003E\n\n\u003Cp\u003ENOTHING IN THE WORLD IS FREE….\u003C/p\u003E\n\n\u003Cp\u003EYou sort through 1,000,000+ web \u0026amp; mobile apps to find which of them may be right for you, your family, or business. You sign up for and/or you download the apps and services, you try to use them your way to fit your life, but quickly find out they come with no support, no one to call, no training, and not much flexibility to customize them to your individual lifestyle and needs. When you can customize them it\u0026#8217;s confusing and frustrating. Then you just stop using them at all.\u003C/p\u003E\n\n\u003Cp\u003EGo ahead. Try to call Facebook, Google, or Twitter etc….. They don’t have phone support to help you. They are too busy selling your information to advertisers to help you be successful using their apps. Gotta please all those investors you know. Show me the money! We think no… SHOW US THE SUPPORT!! Show us a GREAT User Experience!!\u003C/p\u003E\n\n\u003Cp\u003EVirtuallyMagic can help.\u003C/p\u003E\n\n\u003Cp\u003EWe have an American Army of Digital Natives. People who grew up with this technology. Agents who are trained, certified, and ready to help you improve your user experience with your digital lifestyle or business needs. In person, at your service. Not remotely from another country. Using people who are available only over the phone, or remotely via the web like most large companies today who are using outsourcing/off-shoring to India, China, and the Philippines to save them money, increase their profits and at the cost American jobs.\u003C/p\u003E\n\n\u003Cp\u003EAt VirtuallyMagic, We take your user experience with your information and technology very personal. \u003C/p\u003E\n\n\u003Cp\u003EThe web and mobile world today is a big and scary place filled with self serving companies, deceptive advertisers, spies, hackers, scammers, bullies, pedophiles, and identity thieves. Today you need to take care of you, your family’s, and your business\u0026#8217;s digital lives the same way you take care of your car, your home, and your healthcare with regular check ups, tune ups, preventative maintenance, and insurance from someone you can trust. Your Independent Digital Agent. This is just what VirtuallyMagic provides for you. Trust, Safety, Security, Monitoring, and peace of mind in the 21st century.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       69],
      "assets/images/resized/0020/6647/206647v2-max-150x150.png"],
     [[250,
       115],
      "assets/images/resized/0020/6647/206647v2-max-250x250.png"],
     [[450,
       207],
      "assets/images/resized/0020/6647/206647v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "President \u0026 CEO",
    "person":
     {"first_name": "Larry",
      "last_name": "Stone",
      "permalink": "larry-stone-2",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "555 Bryant St. #594",
    "address2": "",
    "zip_code": "94301",
    "city": "Palo Alto",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}