{"name": "Visa Europe",
 "permalink": "visa-europe",
 "crunchbase_url": "http://www.crunchbase.com/company/visa-europe",
 "homepage_url": "http://www.visaeurope.com",
 "blog_url": "http://www.visaeurope.com/en/viewpoints.aspx",
 "blog_feed_url": "http://www.visaeurope.com/feeds/blogs.aspx",
 "twitter_username": "VisaEuropeNews",
 "category_code": "ecommerce",
 "number_of_employees": 2000,
 "founded_year": 2004,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "payments, cards, wallet, nfc, mobile, debit, p2p-payments",
 "alias_list": null,
 "email_address": "",
 "phone_number": "+44 (0)20 7795 5777 ",
 "description": "Payments Technology",
 "created_at": "Wed Mar 27 11:31:30 UTC 2013",
 "updated_at": "Wed Mar 27 11:31:35 UTC 2013",
 "overview": "\u003Cp\u003EVisa Europe is a payments technology business owned and operated by member banks and other payment service providers from 36 countries across Europe.  \u003C/p\u003E\n\n\u003Cp\u003EVisa Europe works at the forefront of technology to create the services and infrastructure which enable millions of European consumers, businesses and governments to make electronic payments. Its members are responsible for issuing cards, signing up retailers and deciding cardholder and retailer fees.\u003C/p\u003E\n\n\u003Cp\u003EVisa Europe operates a high volume, low cost business model that provides services to its members.  Its surplus is reinvested into the business and used to improve capital and reserves.\u003C/p\u003E\n\n\u003Cp\u003EThere are 466m Visa cards in Europe while €1 in every €6.75 spent in Europe is on a Visa card. Almost 80% of Visa Europe\u0026#8217;s business is on debit cards and, in the year to September 2012, over €1 trillion (€1.02tr) was spent on Visa debit cards. Despite the challenging economic climate, total spend by Visa cardholders grew by 8.0% to €1.3 trillion. Annual online spending on Visa cards in Europe topped €200 billion (€202bn) for the first time in this period and now accounts for more than 20% of Visa Europe’s processed business. \u003C/p\u003E\n\n\u003Cp\u003EVisa Europe employs 1,700 people on a permanent basis and we make a concerted effort to attract, inspire and develop capable, committed people from a wide variety of backgrounds to our business. We also invest in higher apprenticeships – equivalent to 2% of our workforce – because we believe they are the right way for our business to capture and develop entry level talent.\u003C/p\u003E\n\n\u003Cp\u003ESince 2004, Visa Europe has been independent of Visa Inc. and incorporated in the UK, with an exclusive, irrevocable and perpetual licence in Europe.  Both companies work in partnership to enable global Visa payments. As a dedicated European payment system Visa Europe is able to respond quickly to the specific market needs of European banks and their customers - cardholders and retailers - and to meet the European Commission’s objective to create a true internal market for payments.\u003C/p\u003E\n\n\u003Cp\u003EImportance of security\u003C/p\u003E\n\n\u003Cp\u003EEnsuring payment security is one of Visa’s highest priorities. Over €1billion has been invested in technology and infrastructure over the past six years, building a robust and secure European payments platform from which to deliver the next generation of payment technologies. All Visa transactions are based on the international EMV chip standard which provides the most advanced and widely adopted cryptographic security for payments today. \u003C/p\u003E\n\n\u003Cp\u003EWe continue to deliver unparalleled payments safety for consumers, merchants and retailers. Visa has a robust multi-layered approach to security which is proving highly successful in driving down fraud levels. Fraud losses on Visa cards are at an all-time low for the second year running (Europe-wide: 0.04%).\u003C/p\u003E\n\n\u003Cp\u003EBenefits for all\u003C/p\u003E\n\n\u003Cp\u003ESuccessful payment services bring tangible benefits to both consumers and retailers:\u003C/p\u003E\n\n\u003Cp\u003E• Consumers (speed, control, convenience and security): consumers enjoy a quick, easy checkout experience, with no fumbling for notes or coins, and no need to wait for change. \u003C/p\u003E\n\n\u003Cp\u003E• Retailers (happier customers, increased sales, new efficiencies): retailers can see that their investments in new payments innovations will automatically enable them to benefit. With a quicker, slicker sales experience, customer satisfaction can be increased, queuing times reduced, and resources saved – and with fewer notes and coins, the costs and complexities of cash handling can be effectively addressed.\u003C/p\u003E\n\n\u003Cp\u003E• Member financial institutions: consumers see the service as innovative, it meets clearly identified needs – giving members an opportunity to differentiate their brands, strengthen existing relationships and attract the attention of potential customers.\u003C/p\u003E\n\n\u003Cp\u003EFor more information, please visit www.visaeurope.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[89,
       29],
      "assets/images/resized/0024/5894/245894v2-max-150x150.jpg"],
     [[89,
       29],
      "assets/images/resized/0024/5894/245894v2-max-250x250.jpg"],
     [[89,
       29],
      "assets/images/resized/0024/5894/245894v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}