{"name": "Vishal Industrial",
 "permalink": "vishal-industrial",
 "crunchbase_url": "http://www.crunchbase.com/company/vishal-industrial",
 "homepage_url": "http://www.indiamart.com/vishalindustrialcorporation/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1982,
 "founded_month": 2,
 "founded_day": 19,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "we-are-the-manufacturer-and-supplier-of-a-comprehensive-assortment-of-brass",
 "alias_list": null,
 "email_address": "",
 "phone_number": "9999988027",
 "description": "",
 "created_at": "Wed Apr 03 13:04:09 UTC 2013",
 "updated_at": "Wed Apr 03 18:53:41 UTC 2013",
 "overview": "\u003Cp\u003EInaugurated in the year 1982, at Delhi (India), we, “Vishal Industrial Corporation”, are occupied in manufacturing and supplying a qualitative assortment of Wall Mixer Piston Assembly, Tipton For Wall Mixer Spout, Tipton For Concealed Diverter, Sanitary Fitting Turned Component, Nipple For Sink Cock, Brass Dowel Nut, Self Closing High Flow Tipton and Brass Pendulums. These are manufactured using the finest grade raw material and sophisticated technology at our hi-tech manufacturing unit. Apart from this, our offered assortment is widely appreciated among our esteemed clients due to their easy installation, low maintenance, sturdiness, high durability, excellent finish and corrosion resistance.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nOur infrastructural facility covers a large area of land and is divided into various specialized units like manufacturing, quality testing, research \u0026amp; development, sales and marketing, etc. Our production division is hi-tech and is installed with latest requisite machines that are necessary for manufacturing high quality products within the specified time frame. Due to our well-organized infrastructure, we have been able to meet the varied expectations and requirements of our valuable customers.\u003C/p\u003E\n\n\u003Cp\u003EOur Customers:\nWe have developed a loyal client base in the national market backed by our ability to meet their requirements promptly. Our customers have shown enormous faith on us and have placed constant orders appreciating our efforts to meet their expectations.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nWe make our best efforts to provide high quality of products to our customers. A strict process of testing is followed and the goods are checked at every step.All the finished goods are water tested before dispatch.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nAt Vishal Industrial Corporation, quality is the result of high goal, honest effort and practiced implementation. Our policy aims at improving all the aspects of our activities to ensure that our offered products satisfy customer’s expectations.\u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nTipton For Concealed Diverter\nSanitary Fitting Turned Component\nSelf Closing High Flow Tipton\nBrass Pendulums\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7351/247351v2-max-150x150.jpg"],
     [[250,
       147],
      "assets/images/resized/0024/7351/247351v2-max-250x250.jpg"],
     [[450,
       266],
      "assets/images/resized/0024/7351/247351v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}