{"name": "Vision Collection",
 "permalink": "vision-collection",
 "crunchbase_url": "http://www.crunchbase.com/company/vision-collection",
 "homepage_url": "http://www.indiamart.com/visioncollection/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "visioncollection@tradepassport.org",
 "phone_number": "9829029591",
 "description": "manufacturing, exporting, trading",
 "created_at": "Thu Apr 04 09:17:38 UTC 2013",
 "updated_at": "Thu Apr 04 09:17:40 UTC 2013",
 "overview": "\u003Cp\u003EVision Collection is a sole proprietorship company as well as commenced its business operations in the year 2009. Since then, we are engaged in manufacturing, supplying, exporting and trading a wide assortment of Bed Sheet, Customized Curtain, Hanging Lampshade, Mosquito Net and many more.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nFor efficient and systematic execution of entire business operations, we have developed state-of-the-art infrastructural facility. It encompasses all required amenities, machinery as well as equipment, which enable us to carry out efficient and smooth operations.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nHighly experienced and creative team of professionals is working in our organization, which successfully enable us to meet the diversified needs of our respectable clientele. To maintain healthy working environment, all our employees perform entire operations in close coordination with one another. \u003C/p\u003E\n\n\u003Cp\u003EQuality:\nQuality has been paid utmost importance since the establishment of our company. We strictly follow quality guiding principles and standards, which are suggested by the industry to ensure that supplied range is free from error or any kind of flaw. A highly sophisticated quality control laboratory has developed to carry out best operations.\u003C/p\u003E\n\n\u003Cp\u003EVendor Base:\nIn order to offer our esteemed clients with quality products, we have built alliances with a vast and authentic vendor base. Our vendors are known to use quality ingredients and processing techniques while developing the range. We choose our vendors on the basis of their market position and credibility.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us? / Our Strengths:\nWe have carved niche for ourselves in the industry by endlessly supplying qualitative and desired products range at industry leading prices. Known for their unmatched quality and features, our products are largely appreciated by huge clientele and in turns we get repeated orders from them.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7743/247743v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7743/247743v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7743/247743v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}