{"name": "Visualhero",
 "permalink": "visualhero",
 "crunchbase_url": "http://www.crunchbase.com/company/visualhero",
 "homepage_url": "http://visualhero.com",
 "blog_url": "http://visualhero.com/blog",
 "blog_feed_url": "http://www.visualhero.com/blog/feed/",
 "twitter_username": "visualhero",
 "category_code": "other",
 "number_of_employees": 15,
 "founded_year": 2004,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "research, graphic-recording, data-visualization, brand-identity, graphic-design, interface-design, information-architecture, user-experience, customer-experience, hcd, logos, websites, app-interface, design, mobile, embedded, interfaces",
 "alias_list": null,
 "email_address": "hello@visualhero.com",
 "phone_number": "6163348744",
 "description": "Design Explore Engage Interact",
 "created_at": "Sun Jan 27 23:30:26 UTC 2013",
 "updated_at": "Mon Jan 28 06:31:25 UTC 2013",
 "overview": "\u003Cp\u003EVisualhero is a uniquely talented multi-disciplined group \nwho design how people explore, engage and interact.\u003C/p\u003E\n\n\u003Cp\u003EWe’re not just designers. We’re opportunity catalysts.\nA brief glance around our studio shows evidence of creativity and work being accomplished. Our tools—gadgets, Sharpies, paper, white boards—are everywhere. Designers mill about, critiquing work, talking, discussing, debating and making.\u003C/p\u003E\n\n\u003Cp\u003EEvery member of our team has a unique skill set, and we use this to your advantage. In fact, we collaborate the same way with our clients as we do among ourselves, allowing you to fuel the design process.\u003C/p\u003E\n\n\u003Cp\u003EOur work takes many forms to visually tell the story of your product, service or brand. These are the methods in which we deliver your vision. We shape your vision, present it through graphics or a demo and make it a reality through crafting a design and guiding delivery.\u003C/p\u003E\n\n\u003Cp\u003EWe believe good design has three parts. It needs meaning, must take a form and has to function. Without even one of these aspects, the true value of design falls apart. \u003C/p\u003E\n\n\u003Cp\u003EAs designers we are in a great position to not only think strategically (design thinking), but to translate your vision by making (design doing). We start by exploring and researching every facet of your product, service or brand. What do your users need? What is the voice and messaging? How can people engage and interact clearly, concisely and definitively? When we have the answers to these questions, we make something to prove it. Our visual stories throughout the process identify opportunities for your vision to take shape.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[73,
       73],
      "assets/images/resized/0023/1913/231913v2-max-150x150.png"],
     [[73,
       73],
      "assets/images/resized/0023/1913/231913v2-max-250x250.png"],
     [[73,
       73],
      "assets/images/resized/0023/1913/231913v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Visualhero Design Co.",
    "address1": "560 5th Street",
    "address2": "Suite 302",
    "zip_code": "49504",
    "city": "Grand Rapids",
    "state_code": "MI",
    "country_code": "USA",
    "latitude": 42.97594,
    "longitude": -85.6805221}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}