{"name": "Vivakor",
 "permalink": "vivakor",
 "crunchbase_url": "http://www.crunchbase.com/company/vivakor",
 "homepage_url": "http://vivakor.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "info@vivakor.com",
 "phone_number": "(949) 281-2606",
 "description": "",
 "created_at": "Wed May 29 04:52:49 UTC 2013",
 "updated_at": "Wed May 29 04:52:49 UTC 2013",
 "overview": "\u003Cp\u003EVivakor, Inc., a transdisciplinary biomedical company, engages in the discovery, development, and commercialization of a range of medical devices and pharmaceuticals to improve human health. The company also performs contract research services and development in molecular biology and devices engineering. Product Research Divisions Molecular Medicine: This division centers on the development of biologically relevant molecules, tests and methods and their application in the practice of medicine. The company is translating systems biology (genomics, proteomics, metabalomics) insights of the molecular and cellular basis of disease into commercializable theranostic (diagnostic/therapeutic) products. Electro-Optics: This division focuses on the development of biomedical and related consumer products that incorporate optical and electronic engineering. The company designs, builds, and tests various new electro-optic devices to reach previously un-served or underserved areas of the biomedical device market. Products being developed in this area include VivaSight- a digital photorefractor that is intended to modernize child vision screening; a label free multiplexed clinical biomolecular sensor (CBS) for the detection and diagnosis of human conditions (cancer, infectious diseases, cardiovascular disease, metabolic disorders, auto immune, and inflammatory diseases); multi-spectral imaging devices to examine burn degree and cutaneous melanoma; and an optic technology platform to identify or indicate the potential of a middle ear infection. Biological Handling: The company is developing commercial products for cryogengenic preservation, and storage through its VivaThermic Cryovials. Natural and Formulary Products: This division developed two bioactive beverages in the nutraceutical/supplement space, VivaBlend and VivaBoost. In 2009, Vivakor entered into an agreement with Regeneca International, Inc. giving Regeneca the rights to distribute VivaBoost in the direct-to-consumer market (VivaBoost is to be distributed by Regeneca its RegeneBlend product). Contract Research Services The company performs contract research and development. This includes contracts to perform several studies to investigate and validate topical product claims. Products Clinical Biomolecular Sensor (CBS) Technology: The company’s CBS technology design is based on the ability to enable clinicians and scientists to detect biological molecules (DNA, RNA, protein) simultaneously and in parallel. SLICES: The company’s acquisition of HealthAmerica’s SLICES technology would provide a technology platform for optimization and adaptation by its scientists. VivaSight (Digital PhotoRefractor or DPR): The company has developed a device that it would modernize screening of pre-verbal and pre-literate children for ocular disorders. This type of screening is increasingly required by state governments prior to enrollment in the public school system. Its scientists are collaborating with physicians and clinicians at University of Iowa Hospitals \u0026amp; Clinics Department of Ophthalmology \u0026amp; Visual Sciences to develop a clinic-ready device. VivaThermic CryoVial Technology: The company develops the technologies required for the cryopreservation of biological samples with improved recovery of viable cells post-cryopreservation. Cryopsy Device. The company’s Cryopsy would freeze the tissue specimens to cryogenic temperature below minus 132 degrees Celsius immediately after tumor excision and then transfer the tissue specimens directly to the specimen holder embedded in the freezing chamber. This product is in Phase I of the development process. VivaBlend: The company’s balanced blend of approximately 18 different sources of phytochemical extracts from antioxidant bioactive fruits and vegetables tested by the USDA that can be added to various consumer foods, drinks, and nutraceuticals as a daily source of antioxidants and other critical bioactive phytochemicals. VivaBoost: VivaBoost is a nutraceutical, bioactive beverage enriched with phytochemicals and antioxidants. VivaGastroProtect: This is a proprietary brand of dietary supplements to be used for the protection of the digestive system, as well as for the prevention of infection and associated gastric ulcers. This product is in Phase I of the development process. VivAuris: This is a device able to detect possible ear infection and transmit results of an improving or diminishing condition. This product is in Phase II of the development process. VivaGlobin: This device enables a researcher or clinician to measure and track skin redness for anemia and cutaneous hemoglobin detection. This product is in Phase II of the development process. VivaGrow: Vivakor is developing a vegetation health monitor. This product is in Phase I of the development process. History Vivakor, Inc. was founded in 2006\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       51],
      "assets/images/resized/0026/8402/268402v1-max-150x150.png"],
     [[218,
       75],
      "assets/images/resized/0026/8402/268402v1-max-250x250.png"],
     [[218,
       75],
      "assets/images/resized/0026/8402/268402v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$677k",
 "funding_rounds":
  [{"round_code": "debt_round",
    "source_url": "http://www.sec.gov/Archives/edgar/data/1450704/000145070413000001/xslFormDX01/primary_doc.xml",
    "source_description": "SEC",
    "raised_amount": 677000.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 4,
    "funded_day": 26,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "7700 Irvine Center Drive",
    "address2": "Suite 800",
    "zip_code": "92618",
    "city": "Irvine",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        95],
       "assets/images/resized/0026/8401/268401v1-max-150x150.png"],
      [[250,
        159],
       "assets/images/resized/0026/8401/268401v1-max-250x250.png"],
      [[450,
        286],
       "assets/images/resized/0026/8401/268401v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}