{"name": "Vivix Credit Solutions",
 "permalink": "vivix-credit-solutions",
 "crunchbase_url": "http://www.crunchbase.com/company/vivix-credit-solutions",
 "homepage_url": "http://www.vivixcreditsolutions.com",
 "blog_url": "http://www.vivixcreditsolutions.com/category/blog",
 "blog_feed_url": "",
 "twitter_username": "vivixcredit",
 "category_code": "consulting",
 "number_of_employees": 12,
 "founded_year": 2006,
 "founded_month": 7,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "bad-credit-we-fix-it-fast",
 "alias_list": null,
 "email_address": "support@vivixcreditsolutions.com",
 "phone_number": "702-434-4414",
 "description": "Las Vegas Credit Repair",
 "created_at": "Mon Feb 21 01:09:40 UTC 2011",
 "updated_at": "Tue Oct 02 23:56:19 UTC 2012",
 "overview": "\u003Cp\u003EVivix Credit Solutions in Las Vegas is a reputable Credit Repair company and has been in business since 2006. We have Four Business Licenses from Clark County Nevada and have our Government NAIC Code: 523930 and a SIC Code: 628203. In addition, we are Accredited with the Better Business Bureau of Southern Nevada: with an A+ Rating and are a member of the Las Vegas Chamber of Commerce. Furthermore, we have membership with the Ethical Credit Repair Alliance (ECRA) and we have not incurred any formal complaints to date. Vivix Credit Solutions in Las Vegas will enhance your overall credit profile by Correcting or Deleting Inaccurate, Questionable, Unverifiable and Obsolete Credit Lines from all three major Credit Bureaus! \u0026#8220;I filed BK about 2 years ago and began rebuilding my credit by buying a car, but because of my recent BK and my Bad Credit, the interest rate was outrageously high! My husband called this company and we went in to hear what they had to offer. We left the initial meeting contemplating our alternative choices: 1. Fix my credit myself 2. Wait 7-10 years for the BK to expire or 3. Just go on having Bad Credit. Well, we decided to sign up with VCS. I am VERY satisfied with the results they offered! I have been able to get a new car and take advantage of a low interest rate package from the dealership that I had purchased from before. Fixing my credit has and will continue to save me thousands over the years to come just in interest alone! AND I couldn\u0026#8217;t have done it on my own. I am signing up my husband as we speak, and you only refer the ones you love to people that you TRUST! \u0026#8221;\nRealtor\u0026#8217;s Wife \u0026#8220;It is my pleasure to recommend Vivix Management \u0026amp; Marketing DBA Vivix Credit Solutions to everyone. During the past few years, our company has worked directly with Gabriel Brown, CEO of Vivix Credit Solutions. Vivix Credit Solutions offers top-notch quality and exceptional customer service. Across the board, we are always pleased to work with their clients to help them achieve their credit goals. Vivix Credit Solutions always refer their clients to us to help reestablish their credit and we truly appreciate their business. They are always involved to make sure their clients receive the best service possible. Please consider Vivix Credit Solutions for all your credit needs\u0026#8221;\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0012/3127/123127v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0012/3127/123127v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0012/3127/123127v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [{"title": "Credit Law",
    "is_past": false,
    "provider":
     {"name": "Craig Perry Esq. \u0026 Associates",
      "permalink": "craig-perry-esq-associates",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Las Vegas Office",
    "address1": "7795 West Sahara Ave",
    "address2": "Ste 101 A",
    "zip_code": "89117",
    "city": "Las Vegas",
    "state_code": "NV",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.free-press-release.com/news-vivix-credit-solutions-reviews-better-business-bureau-member-bad-credit-we-fix-it-fast-702-434-4414-1294695741.html",
    "title": "Vivix Credit Solutions Reviews"}]}