{"name": "VMO Technologies",
 "permalink": "vmo-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/vmo-technologies",
 "homepage_url": "http://www.vmotechnologies.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 50,
 "founded_year": 2009,
 "founded_month": 6,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sales@vmo.co.in",
 "phone_number": "91-9811727502",
 "description": "Offshore Outsourcing Company",
 "created_at": "Thu Aug 27 02:19:58 UTC 2009",
 "updated_at": "Sat Dec 19 07:54:02 UTC 2009",
 "overview": "\u003Cp\u003EVMO Technologies is a Software Outsourcing company in India promises to provide highly qualitative and cost effective Custom Software Application Development, Desktop Development, E-Commerce, Custom Forum/Blog Development, Mobile Application Development Outsourcing and Web Software Development Outsourcing services to its clients globally. To become successful and gain the full benefits of software outsourcing, you need to choose the right offshore software development partner. One that will best complement your own in-house IT skills and protect your intellectual property while at the same time meeting your budget and deliverable offshore development goals. We at VMO Technologies promises you to provide highly qualitative and cost effective services with Intellectual Rights. We help your businesses succeed and gain competitive advantage through effective use of information technology \u003C/p\u003E\n\n\u003Cp\u003EAt VMO Technologies we focus on Offshore Application Development, Maintenance, Management, and Re-engineering competencies using Commerical and Open Source technologies. We complement your strategy with skills and support. We can help enhance your business outcomes with an experienced team of skilled solution architects, technology specialists, and certified project management professionals. \u003C/p\u003E\n\n\u003Cp\u003EOur services fall into these categories:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003ECustom Software Development \u003C/li\u003E\n\u003Cli\u003EWeb Development \u003C/li\u003E\n\u003Cli\u003EMobile Software Development \u003C/li\u003E\n\u003Cli\u003EOutsourcing \u003C/li\u003E\n\u003Cli\u003ESoftware Testing \u003C/li\u003E\n\u003Cli\u003ESaaS (Software as a Service) \u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EAcross those three categories our expertise and focus is on web technologies and their application to enhance business processes, performance and overall competitiveness. \u003C/p\u003E\n\n\u003Cp\u003EOur headquarters \u0026amp; Development Center is located in New Delhi, India, where we leverage the exceptional software talent at affordable budget \u003C/p\u003E\n\n\u003Cp\u003EFounded in 2009, our growing client base of typically mid-sized companies look to outsourcing for a strategic advantage, and they know first-hand the challenges outsourcing poses with communication, control, and maintaining overall effectiveness. Our experience, expertise and talented professionals enables us to deliver them solutions faster, better and more cost-effectively than both traditional software consultancy firms and in-house resources can. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[120,
       60],
      "assets/images/resized/0005/7834/57834v2-max-150x150.jpg"],
     [[120,
       60],
      "assets/images/resized/0005/7834/57834v2-max-250x250.jpg"],
     [[120,
       60],
      "assets/images/resized/0005/7834/57834v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "VMO Techonologies",
    "address1": "D- 151 , peera ghari chowk ",
    "address2": "",
    "zip_code": "",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}