{"name": "VMX Creative Studios",
 "permalink": "vmx-creative-studios",
 "crunchbase_url": "http://www.crunchbase.com/company/vmx-creative-studios",
 "homepage_url": "http://www.vmx-me.com/",
 "blog_url": "http://www.vmx-me.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "VMXStudio",
 "category_code": "other",
 "number_of_employees": 15,
 "founded_year": 1993,
 "founded_month": 1,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "creative-photo-retouching, digital-image-retouching, digital-painting, 3d-modeling, creative-studio-dubai, 2d-illustration-dubai, digital-photo-retouching, matte-painting, 3d-rendering-in-dubai",
 "alias_list": null,
 "email_address": "info@vmx-me.com",
 "phone_number": "+971 4 452 5825",
 "description": "Creative Photo Retouching company",
 "created_at": "Sat May 11 12:15:58 UTC 2013",
 "updated_at": "Mon May 13 19:43:55 UTC 2013",
 "overview": "\u003Cp\u003EVMX creative studios provides Creative Photo Retouching ,3D modeling,Matte Painting,Creative Illustration,Creative Imagery,digital photo retouching,2D Illustrator,Digital painting in dubai and etc\u0026#8230;.\u003C/p\u003E\n\n\u003Cp\u003EVisual Experts _Vmx Creative Photo Studio in Dubai\u003C/p\u003E\n\n\u003Cp\u003EThe Studio\u003C/p\u003E\n\n\u003Cp\u003EToday, you can walk into a store and pick up a laptop that\u0026#8217;s faster than the machines they made Jurassic Park on. The advances in technology are pushing the limits of what imagination and talent can achieve. Perfectly poised at the forefront of these exciting possibilities, VMX Creative Studio is just the kind of partner you need to bring your path-breaking ideas to life.\u003C/p\u003E\n\n\u003Cp\u003EThe X Factor\u003C/p\u003E\n\n\u003Cp\u003EAt VMX, we believe nothing should stop a great idea from getting the creative execution it deserves. A first of its kind specialized enterprise in the region, VMX offers cutting-edge creative solutions to multiply possibilities of visual imaging. With a team of highly professionals who have worked on some of the world\u0026#8217;s biggest brands with leading creative houses across the region.\u003C/p\u003E\n\n\u003Cp\u003EThe Possibilities\u003C/p\u003E\n\n\u003Cp\u003EAre you looking to bring something that only exists in the realms of imagination to life? Do you seek details and possibilities beyond the limits of photography? Do your ideas and scripts demand artistic expressions of a specific style? VMX Creative Studio boasts an accomplished team of CGI specialists, Modeling experts, Digital Imaging virtuosos, versatile artists and others. It\u0026#8217;s the region\u0026#8217;s first studio to offer such a broad range of world-class specialities under a single roof.\u003C/p\u003E\n\n\u003Cp\u003EWORLD CLASS CGI \u0026amp; RETOUCHING SOLUTIONS in Dubai\u003C/p\u003E\n\n\u003Cp\u003EWe Represent some of Most sought talent in the world of photo retouching..we encourage each artisits of individual style giving u a wide variety of specialized,dedicated creative talent\u003C/p\u003E\n\n\u003Cp\u003EChoose our creative retoucher who suits your projects and work one-on-one from the beginning to end\u0026#8230;Browse our retouchers individual portfolios and let us know who will you like to work with..\u003C/p\u003E\n\n\u003Cp\u003EWe have more than 10 years commerical level Photo Retouching experience working in advertising and editorial sectors..Available for projects large and small working with photographers,advertising agencies,magazines and individuals.My retouching skills and creative illustration. In to addition,we also offers a wide range of complimentary graphic and 3D modeling servies\u003C/p\u003E\n\n\u003Cp\u003EPlease use the menu to navigate for a particular area of interest and to take time to view my extended photographic retouching portfolio and i did love to hear your feedback so drop me a line if u want to quote\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[81,
       91],
      "assets/images/resized/0026/1249/261249v2-max-150x150.png"],
     [[81,
       91],
      "assets/images/resized/0026/1249/261249v2-max-250x250.png"],
     [[81,
       91],
      "assets/images/resized/0026/1249/261249v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}