{"name": "VoiceMailTel",
 "permalink": "voicemailtel",
 "crunchbase_url": "http://www.crunchbase.com/company/voicemailtel",
 "homepage_url": "http://www.voicemailtel.com/index.html",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": 25,
 "founded_year": 2005,
 "founded_month": 5,
 "founded_day": 25,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sales@voicemailtel.com",
 "phone_number": "866-686-4236",
 "description": "Business Phone System",
 "created_at": "Tue Jun 22 15:51:56 UTC 2010",
 "updated_at": "Wed Jun 23 13:14:31 UTC 2010",
 "overview": "\u003Cp\u003EVoiceMailTel is a high tech innovator and service provider of a unified telecommunication solution which effectively integrates PSTN, VoIP, cellular, voicemail into an all-inclusive package.\u003C/p\u003E\n\n\u003Cp\u003EVoiceMailTel services radically improve productivity for business subscribers and their callers.\u003C/p\u003E\n\n\u003Cp\u003EOur offers vary from simple 800 or local number voice mail to complex IVR systems including 800 Voice Mail, Virtual Office, Unified Messaging, hosted PBX and Integrated IVR.\u003C/p\u003E\n\n\u003Cp\u003EVoiceMailTel is designed for entrepreneurs and busy professionals - thinkers who take matters into their own hands. That\u0026#8217;s why we believe that if you had the tools to easily and affordably control your company\u0026#8217;s communications, you\u0026#8217;d do it.\u003C/p\u003E\n\n\u003Cp\u003EAll VoiceMailTel plans include these great features:\u003C/p\u003E\n\n\u003Cp\u003EToll Free Number\nChoose a toll free number that\u0026#8217;s right for you: Regular toll free (866, 877, etc.), or a true 1-800 or vanity number (e.g., 866-CALLHIM).\u003C/p\u003E\n\n\u003Cp\u003ELocal Number\nYou can live and work in one city and get a local number in another. Choose the area codes(s) that makes sense for your business. Find out how you can save on inbound voice calls.\u003C/p\u003E\n\n\u003Cp\u003EVirtual Extensions\nCreate the impression of a single office, regardless of whether you and your employees work from different geographical locations.\u003C/p\u003E\n\n\u003Cp\u003EMusic on Hold\nReflect your business image through the music you play to callers-on-hold while also giving them a small incentive to hang on. And while you have their attention, why not make a service announcement?\u003C/p\u003E\n\n\u003Cp\u003ECall Transfer\nEnable your incoming calls to be transferred away from your office so that you are more accessible and your business line is available for other incoming business calls.\u003C/p\u003E\n\n\u003Cp\u003EVoicemail\nYou get professional greetings, multiple delivery options. Pick up voicemail in emails or in your on-line account and play over your PC - or pick up by phone. \u003C/p\u003E\n\n\u003Cp\u003ECall Forward\nCallers who dialed your toll-free or local number are routed to your phones - for instance, you can direct them to your cell, home, and office phones. \u003C/p\u003E\n\n\u003Cp\u003ECall Waiting\nAvoid the busy signal, Call Waiting is a service that allows you to put one call on hold while you answer a second call and alternate between the two.\u003C/p\u003E\n\n\u003Cp\u003ECustom Greeting\nGet your own custom greetings and music-on-hold professionally recorded, and then upload the recordings to your account. We\u0026#8217;ve even partnered with a voicemail production service to help you with your professional recording needs.\u003C/p\u003E\n\n\u003Cp\u003ECalling Card \u0026amp; Call Back\nConvenient, safe, and inexpensive: Use your local or toll free phone number to place calls from any phone, just like a calling card.\u003C/p\u003E\n\n\u003Cp\u003ECaller ID\nHow would you like to know the name and number displayed are those associated with the line from which the call is made?\u003C/p\u003E\n\n\u003Cp\u003EMessage Notification\nGet text messages on your cell phone or PDA alerting you about new voicemail messages. Never miss an important message. \u003C/p\u003E\n\n\u003Cp\u003ENo Hardware/Software Required\nUnlike traditional phone systems, VoiceMailTel\u0026#8217;s services are totally virtual. You\u0026#8217;ll be able to access the system from any phone, be it cell or regular touch pad phone.\u003C/p\u003E\n\n\u003Cp\u003ECall History\nA record of your calls is stored in your Web-based account. You\u0026#8217;ll see who called, the phone number, and the date, time, length, and result of the transaction. \u003C/p\u003E\n\n\u003Cp\u003EVoiceMailTel Portal\nAccess the main system set-up options, live call forwarding numbers, call reports, account history, billing, support center and other administration tools instantly via the web.\u003C/p\u003E\n\n\u003Cp\u003EDirectory by Name\nImprove your big business image with a company dial-by-name directory. Auto-generated, the directory provides a list of departments and employees to callers, who can dial by first or last name. \u003C/p\u003E\n\n\u003Cp\u003EVoicemail Web Interface\nThe Voicemail Web Interface will give you full control over your voice messages. This tool is invaluable for productivity.\u003C/p\u003E\n\n\u003Cp\u003EVoiceMailTel Virtual Phone System Advantages:\u003C/p\u003E\n\n\u003Cp\u003EProfessional sound and image\u003C/p\u003E\n\n\u003Cp\u003Eget a toll free number easy to remember \ncustomize auto attendant and voice mail messages \ncall your clients using only your business number \nMulti-offices and virtual extensions\u003C/p\u003E\n\n\u003Cp\u003Econnect your offices at no cost \nbe available outside of office with virtual extension \nforward incoming calls to cell, or voicemail \nget notified about new voice messages by email \nSave money and time\u003C/p\u003E\n\n\u003Cp\u003Eno equipment to purchase or maintain \nno long-term contracts to sign \nmake long distance calls at low rates \nwe allow number portability \n30 days free trial \n**Contact us for details at 1-866-6VOICEM (86-4236), 1-(416)-548-7388 or visit our website www.voicemailtel.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0009/1368/91368v2-max-150x150.png"],
     [[221,
       49],
      "assets/images/resized/0009/1368/91368v2-max-250x250.png"],
     [[221,
       49],
      "assets/images/resized/0009/1368/91368v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}