{"name": "Voodoodance",
 "permalink": "voodoodance",
 "crunchbase_url": "http://www.crunchbase.com/company/voodoodance",
 "homepage_url": "http://www.voodoodance.pl",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "letsvoodoodance",
 "category_code": "games_video",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile, gaming, multiscreen",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "mobile, gaming, multiscreen",
 "created_at": "Thu Nov 22 14:37:30 UTC 2012",
 "updated_at": "Wed Dec 12 07:52:35 UTC 2012",
 "overview": "\u003Cp\u003EVoodooDance is a gaming and converged media company with a combination of creative and technical skills. Our mission is to build a new engaging game layer that will go far beyond awarding badges and will bridge virtual and real worlds effectively blurring the distinction between the two. This will create monetization opportunities in e-commerce and digital advertising. \u003C/p\u003E\n\n\u003Cp\u003EThe tool to execute the mission is a gaming engine in which we separated the logic of the game from the presentation layer. Using our engine we can deploy massive multiplayer games playable across websites, Facebook, and most importantly - mobile channel, through mobile apps, SMS and MMS. \u003C/p\u003E\n\n\u003Cp\u003EOur first game utilizing the engine – working title FAME - will have real-time mechanisms to connect the real and virtual worlds that have not been used before. These mechanisms and the script of the game offer monetization opportunities related to in-game advertising and location of the players as well as their purchasing decisions. \u003C/p\u003E\n\n\u003Cp\u003EThe gaming engine have been tested in real environment when it was used as a back-end solution for our second screen application developed for the Polish National Television (TVP) for EURO 2012 and the Olympics. \u003C/p\u003E\n\n\u003Cp\u003EAs a result of the project, the second screen application is now VoodooDance\u0026#8217;s standard product. It is being commercialized through advertising industry partners, mobile operators and TV broadcasters.\u003C/p\u003E\n\n\u003Cp\u003EThe third product of VoodooDance is an online service that aggregates news stories and their social media popularity in such a way that the result is a de facto snapshot of the most popular news items across the internet in a given moment, in a given market.  \u003C/p\u003E\n\n\u003Cp\u003EVoodooDance is funded with love money only, the company is building a solid portfolio of products that spans across hot market segments: gaming, second screen, real-time big data in the online media sector. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Poland office",
    "address1": "Broniewskiego 5 m. 45",
    "address2": "",
    "zip_code": "05120",
    "city": "Legionowo",
    "state_code": null,
    "country_code": "POL",
    "latitude": 52.3988062,
    "longitude": 20.927692}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}