{"name": "Voofie",
 "permalink": "voofie",
 "crunchbase_url": "http://www.crunchbase.com/company/voofie",
 "homepage_url": "http://www.voofie.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": 2,
 "founded_year": 2009,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "knowledge, bookmarking, qa, article-publishing, forum, semantic-web",
 "alias_list": null,
 "email_address": "admin@voofie.com",
 "phone_number": "",
 "description": "",
 "created_at": "Tue Jun 29 04:50:20 UTC 2010",
 "updated_at": "Mon Jul 05 16:29:36 UTC 2010",
 "overview": "\u003Cp\u003EVoofie is a knowledge platform with Bookmarking, Q\u0026amp;A, Discussion and Article Publishing functions.  It use semantic tags to organize posts and features a unique Impact Factor system to reflect your expertise in different areas.\u003C/p\u003E\n\n\u003Cp\u003EIts semantic tags facilitate the organization of posts so you can find what you want more easily.  As oppose to the traditional keyword search, it use Wikipedia article titles as concept tags so that you can use unambiguous concepts defined by millions of users on Wikipedia to describe your posts.  Besides, it also have attribute tags to further describe your posts so other Voofiers can search by specific content, genre and/or format very easily and accurately.  By bookmarking resources on Voofie, you organize the Internet semantically and make searching easier for both you and other users.\u003C/p\u003E\n\n\u003Cp\u003EIt recognize your competency in various fields.  Voofie\u0026#8217;s unique Impact Factor system gives every Voofier a score in each subject area as measurements of your achievements and reputation.  By referring to the Impact Factors, you can tell whether others posts are reliable and of high quality.  In any other ordinary websites, everyone have one equal vote when we talk about ratings.  But Voofie promote a brand new voting system.  If you are more expert in one field, then you have more say and your rates on that field weight more.  Having a high impact score signifies your achievements in a field helps you, your comments and your posts stand out from the others.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "Squidoo",
      "permalink": "squidoo",
      "image":
       {"available_sizes":
         [[[150,
            48],
           "assets/images/resized/0000/2698/2698v1-max-150x150.png"],
          [[184,
            59],
           "assets/images/resized/0000/2698/2698v1-max-250x250.png"],
          [[184,
            59],
           "assets/images/resized/0000/2698/2698v1-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}