{"name": "Voolgo",
 "permalink": "voolgo",
 "crunchbase_url": "http://www.crunchbase.com/company/voolgo",
 "homepage_url": "http://www.voolgo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "voolgo",
 "category_code": "enterprise",
 "number_of_employees": 3,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@voolgo.com",
 "phone_number": "",
 "description": "",
 "created_at": "Thu Oct 06 11:35:44 UTC 2011",
 "updated_at": "Tue May 07 04:06:21 UTC 2013",
 "overview": "\u003Cp\u003EVoolgo’s revolutionary product allows companies to get an instant reflection of how specific content is perceived after it has been published on any Social Network. \u003C/p\u003E\n\n\u003Cp\u003ECompanies can always spend time and resources tracking, monitoring and recording conversations and data but in a high-speed communication market that goes viral, Voolgo gives a fast and simple tool that allows companies to tactically understand the Social Network reaction of your audience. Voolgo focuses on your content level and identifies granular insight.\u003C/p\u003E\n\n\u003Cp\u003EVoolgo Dashboard\u003C/p\u003E\n\n\u003Cp\u003EIn only few steps you can connect your Social Networks to the Voolgo Dashboard and either include already posted communication or create your new promotion or communication campaign. Fast and efficient, Voolgo is all of that as it collects the relevant insight for you and saves you time. \u003C/p\u003E\n\n\u003Cp\u003EVoolgo Analytics and Insight\u003C/p\u003E\n\n\u003Cp\u003EMeasuring the level of activities around your content and your communications is only the starting point. If you’re struggling with scanning and understanding Facebook insight or how \u003C/p\u003E\n\n\u003Cp\u003ETwitter manages retweets, check out Voolgo Analytics and print or download your infograph! You will get instant information about your viral reach, demographics, geographics, languages, top posts and content, and much more.\u003C/p\u003E\n\n\u003Cp\u003EVoolgo Reports \u003C/p\u003E\n\n\u003Cp\u003EFor social media agencies and for experts Voolgo offers detailed full reports that can be exported and interfaced to any other data source. Voolgo reports focus on 3 main areas: \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cp\u003EContent driven communication focuses on quality messages and posts and reveals how they are perceived by your audience. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EPeople or user report is your people finder. The Voolgo people report reveals who’s following you and who is reacting (or not!) to your content driven communication. \u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EChannel reports reflect your connected Social Networks and how they perform. Having 1 million users linked to your Facebook page does not guarantee high reaction or participation of your fans and followers. The Voolgo channel report reveals the individual performance of your Social Networks/Channels including their viral reach, structure and communities. \u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E",
 "image":
  {"available_sizes":
    [[[150,
       36],
      "assets/images/resized/0015/7018/157018v4-max-150x150.png"],
     [[250,
       60],
      "assets/images/resized/0015/7018/157018v4-max-250x250.png"],
     [[450,
       109],
      "assets/images/resized/0015/7018/157018v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CTO",
    "person":
     {"first_name": "Mauro",
      "last_name": "Sala",
      "permalink": "mauro-sala",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": null,
    "raised_currency_code": null,
    "funded_year": 2011,
    "funded_month": 1,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}