{"name": "vosing",
 "permalink": "vosing",
 "crunchbase_url": "http://www.crunchbase.com/company/vosing",
 "homepage_url": "http://vosing.com",
 "blog_url": "http://vosing.wordpress.com",
 "blog_feed_url": "",
 "twitter_username": "vosingapp",
 "category_code": "software",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "talent-acquisition, talent-management",
 "alias_list": null,
 "email_address": "jeremiah.fellows@vosing.com",
 "phone_number": "",
 "description": "Talent Acquisition and Management",
 "created_at": "Tue Jan 03 03:45:46 UTC 2012",
 "updated_at": "Wed Jan 11 06:50:33 UTC 2012",
 "overview": "\u003Cp\u003EVosing is more than a software product, we are a movement. We make the world better by putting the right people in the right place. \u003C/p\u003E\n\n\u003Cp\u003EWe in the start of of a new economic revolution, and it is not one we are prepared to profit from. The talent management revolution is a response to the increased connectedness, interdependency, and competition of the 21st century. The current age is defined by complex and ambiguous problems (titled x-problems by Adam Richardson), companies with the ability to solve such problems are poised to lead in this new era. Only companies with the ability to build teams with a diversity of skills and experience and then effectively deploy and manage these teams to solve x-problems will thrive. The current method of posting generic job descriptions, soliciting generic resumes, and hoping for a dynamic applicant is not going to enable and organization to develop such teams. Speed and agility are keys to success when attempting to solve x-problems, and identifying both the obvious and hidden strengths of team members is critical to realizing the opportunity buried in the tangle of these complex problems.  \u003C/p\u003E\n\n\u003Cp\u003EThe numbers are not on our side. The U.S. does not have the population for every company to assemble a team of A-List engineers in response to each new challenge, nor is this the best way to face this new world. We have to work smarter, taking advantage of the strengths and complementing the weaknesses of every potential team member. We must expand our definition of the optimal team member and include populations outside of traditional innovation centers like New York, Silicon Valley, and Chicago to capture the overlooked intellectual capital in rural and inner city communities. Building these new teams requires a transformational shift in thinking, moving from managing talent based on individual resumes and job descriptions and towards maximizing skills and talents based on teams. If we cannot move past the resume and learn to assess candidates on a more holistic level that includes formal training, life experiences, culture, and personality we will fail.  \u003C/p\u003E\n\n\u003Cp\u003EThe concept of what a person is a slippery thing to nail down. In order to better present a person vosing is creating new kind of candidate view based on the premise that HOW you come up with the answer is as important as coming up with the RIGHT answer. Each candidate creates a project portfolio with a bio of the key projects and experiences in the candidates life and tags them with the skills that best helped them succeed in that specific circumstance. With this view of the candidate we can see behaviors that are indicators of creativity, tenacity, innovation, and grit; far better predictors of future success than a litany of titles and  accomplishments devoid of context. We will be able to not just better identify the right team members for the right x-problem but we will be able to identify those skills that are not the obvious flashy skills of the business rock star but fill gaps on teams.  Any person can add value in the right circumstances when utilized correctly, we just never had a way to efficiently identify those less appreciated skills until now.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0016/8520/168520v2-max-150x150.jpg"],
     [[250,
       79],
      "assets/images/resized/0016/8520/168520v2-max-250x250.jpg"],
     [[450,
       142],
      "assets/images/resized/0016/8520/168520v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Skills Genome",
    "permalink": "skills-genome",
    "image": null},
   {"name": "Education Genome",
    "permalink": "education-genome",
    "image": null},
   {"name": "Career Genome",
    "permalink": "career-genome",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Adam",
      "last_name": "Roderick",
      "permalink": "adam-roderick",
      "image": null}},
   {"is_past": false,
    "title": "Co-Founder",
    "person":
     {"first_name": "Jeremiah",
      "last_name": "Fellows",
      "permalink": "jeremiah-fellows",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "6000 Greenwood Plaza Boulevard Suite 110",
    "address2": "",
    "zip_code": "80111",
    "city": "Greenwood Village",
    "state_code": "CO",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}