{"name": "Vpolitics.com",
 "permalink": "vpolitics-com",
 "crunchbase_url": "http://www.crunchbase.com/company/vpolitics-com",
 "homepage_url": "http://www.vpolitics.com",
 "blog_url": "http://www.blogs.vpolitics.com",
 "blog_feed_url": "",
 "twitter_username": "Vpoliticscom",
 "category_code": "other",
 "number_of_employees": 5,
 "founded_year": 2010,
 "founded_month": 7,
 "founded_day": 4,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "info@vpolitics.com",
 "phone_number": "731-298-1112",
 "description": "Virtual Government Platform",
 "created_at": "Tue Jul 31 17:14:42 UTC 2012",
 "updated_at": "Sat Aug 04 13:58:11 UTC 2012",
 "overview": "\u003Cp\u003EVpolitics.com is a virtual government platform where any citizen has the opportunity to run for the virtual office of their choice. Candidates will campaign on Facebook, Twitter, and YouTube. The candidate with the most combined followers and viewers wins the virtual position. Registration is free! Must be 18 and a U.S. citizen to campaign.\u003C/p\u003E\n\n\u003Cp\u003EVpolitics.com uses multiple-social networking sites for its voting infrastructure to ensure maximum exposure of the virtual candidate. We understand the importance maintaining a presence on multiple sites, and we recognize that many functions and audiences are site-specific. Our cross platform voting infrastructure is unconventional, but it is also innovative and informative. By monitoring the feedback from multiple sites, the virtual candidate can better optimize their campaign and rally the maximum number of votes. One friend or colleague can vote for their candidate three times by utilizing this method. In addition, vote integrity is better secured because Vpolitics.com benefits from the extremely robust and secure servers comprising the multiple-social networking vote infrastructure. If voting data is corrupted from one site, that data can be suspended enabling the campaign to continue on the remaining sites.\u003C/p\u003E\n\n\u003Cp\u003EMany revolutionary ideas have come from the most unlikely of places. It is for this reason that any citizen, regardless of background, race or affiliation has the ability to campaign for the virtual office of their choice. We believe these virtual campaigns will uncover genuine concerns and practical solutions to solving everyday problems. The virtual government platform is also an innovative tool for citizens to rally votes for real up-coming elections. Vpolitics.com believes in everyone’s voice, and we understand the influential power that everyday citizens wield. In the near future, real elections will be won on the endorsement of virtual politicians.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       134],
      "assets/images/resized/0020/3748/203748v2-max-150x150.jpg"],
     [[250,
       223],
      "assets/images/resized/0020/3748/203748v2-max-250x250.jpg"],
     [[363,
       325],
      "assets/images/resized/0020/3748/203748v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        134],
       "assets/images/resized/0020/3747/203747v2-max-150x150.jpg"],
      [[250,
        223],
       "assets/images/resized/0020/3747/203747v2-max-250x250.jpg"],
      [[363,
        325],
       "assets/images/resized/0020/3747/203747v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}