{"name": "w3csolutions",
 "permalink": "w3csolutions",
 "crunchbase_url": "http://www.crunchbase.com/company/w3csolutions",
 "homepage_url": "http://www.w3csolutions.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "w3csolutions",
 "category_code": "web",
 "number_of_employees": 150,
 "founded_year": 2003,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design-company, web-development-company, web-development-services, web-development-india, web-development-delhi, web-design-services, web-design-services-india, web-design-delhi",
 "alias_list": null,
 "email_address": "harryfall4@gmail.com",
 "phone_number": "",
 "description": "W3C Solutions has been providing Website",
 "created_at": "Mon Aug 20 07:57:29 UTC 2012",
 "updated_at": "Thu Aug 23 19:06:36 UTC 2012",
 "overview": "\u003Cp\u003EW3C Solutions has been providing Website solutions to thousands of business and personal web sites since 2003.W3C Solutions works with strategy that enhances the quality of work, touch of creativeness, easy to use, and fast to deliver, which can surely help you to generate the revenue comparatively faster. W3C Solutions offers a premium service at an affordable price and comes up with the best result for our clients.\u003C/p\u003E\n\n\u003Cp\u003EWe specialize in best-in-class website design, web development, PHP development, Flash multimedia designing, logo designing and thus in ultimate Corporate Identity. W3C Solutions offers an edge to your products and services in the globally competitive market.\u003C/p\u003E\n\n\u003Cp\u003EWe serve according to your convenience and time frames, using our vast technical expertise pool in India with quality control methods enforced at every level in our organization. Our internet solution packages help businesses and individuals get high-powered service at a fraction of the cost. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "tisindia",
      "permalink": "tisindia",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}