{"name": "WachyWachy",
 "permalink": "wachywachy",
 "crunchbase_url": "http://www.crunchbase.com/company/wachywachy",
 "homepage_url": "http://www.wachywachy.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "foreign, language, conversation, learning, native, speacker, skype, spanish, french, chinese",
 "alias_list": null,
 "email_address": "info@wachywachy.com",
 "phone_number": "",
 "description": "conversation in foreign languages",
 "created_at": "Fri Mar 30 15:46:45 UTC 2012",
 "updated_at": "Fri Mar 30 16:34:23 UTC 2012",
 "overview": "\u003Cp\u003EThe best way to master a language is by practicing with native tutors.\nWachyWachy.com uses technology to let you do it comfortably from home at any time, without appointments or reservations, paying anything in advance and devoting the time you want.\u003C/p\u003E\n\n\u003Cp\u003EIn WachyWachy, a new languages learning start-up, you can find at any time of day, hundreds of native tutors online to practice conversation in foreign languages at an affordable price, without reservations or appointments, without paying anything in advance, from anywhere, dedicating the time you want, with people of different accents that you can choose with the help of the other user’s evaluation.\u003C/p\u003E\n\n\u003Cp\u003EThe best way to learn a foreign language is by practicing with native speakers. You never get to learn a language only by studying and only practice ensures achieve an adequate mastering that allows you to use the language in a real environment.\u003C/p\u003E\n\n\u003Cp\u003EWhile practicing the conversation you learn to use language correctly quickly, in a fun way, almost without realizing it.\u003C/p\u003E\n\n\u003Cp\u003EWachyWachy.com offers practice languages using conversational tutoring online; allowing you to get in your own home a language immersion experience that otherwise could only experience traveling abroad.\u003C/p\u003E\n\n\u003Cp\u003EWachyWachy.com solution is based on the belief that to learn a language you have to get real people engage in real conversation, and so the tutoring that are conducted on this platform are conversational practice, not the classical language classes.\u003C/p\u003E\n\n\u003Cp\u003EWachyWachy.com allows the students choosing among hundreds of native tutors with whom to practice the conversation in many languages, available at any time of day without an appointment for you to practice with them as long as you want for affordable money.\u003C/p\u003E\n\n\u003Cp\u003EA search engine allows you to choose a tutor among those who are online in terms of language, nationality, price or rating and start a conversation with him via Skype.\u003C/p\u003E\n\n\u003Cp\u003EThe audio or video chat via Skype, the leader in Internet communications, ensures an interactive experience, completed with the ability to answer questions about writing through chat or exchange teaching materials.\u003C/p\u003E\n\n\u003Cp\u003E\u0026#8220;How many hours we pass along our life studying a language through traditional courses and we never master it. How much grammar or vocabulary learn and forget because we never use it in a real environment. And after all that effort and money, when we face a simple conversation with a native speaker we realize that what we studied did not resemble the actual language.\u003C/p\u003E\n\n\u003Cp\u003EWe want to offer people the chance to talk to people around the world, from different countries, cultures and accents so they can improve their language skills in real. And all this in an easy and comfortable way, at home and at a reasonable cost to practice for many hours,\n\u0026#8220;says Ester del Monte, the co-founder of WachyWachy.\u003C/p\u003E\n\n\u003Cp\u003EOne of the advantages of WachyWachy is the possibility to practice any language at any time, without appointment, without paying in advance, since it has a system that allows the student to contact a tutor when he is online, agree with him the details of the conversation and pay\nonly for the effective time of tutoring.\u003C/p\u003E\n\n\u003Cp\u003EMoreover, WachyWachy offers to tutors the possibility of offering its service to users all around the world and earn money from home and with flexible hours.\u003C/p\u003E\n\n\u003Cp\u003EWachyWachy founders believe it is a good way to use technology for allows anyone to offer their services without boundaries, something more interesting even for people living in developing countries or countries with high unemployment rates, since they can obtain a means of increasing their income through flexible work no matter what country they live.\u003C/p\u003E\n\n\u003Cp\u003EAccording to its founders, the spirit of WachyWachy.com is to allow any student to practice many hours of languages, in an easy, comfortable and affordable way, and allow any tutor receive in return of their service an income that can become in some cases their main\nsource of livelihood.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        95],
       "assets/images/resized/0018/1905/181905v2-max-150x150.jpg"],
      [[250,
        158],
       "assets/images/resized/0018/1905/181905v2-max-250x250.jpg"],
      [[450,
        285],
       "assets/images/resized/0018/1905/181905v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}