{"name": "Walton Exports",
 "permalink": "walton-exports",
 "crunchbase_url": "http://www.crunchbase.com/company/walton-exports",
 "homepage_url": "http://www.indiamart.com/waltonexports/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "waltonexports@tradepassport.org",
 "phone_number": "9869422170",
 "description": " exporter of several Indian ,",
 "created_at": "Fri Apr 05 05:51:59 UTC 2013",
 "updated_at": "Fri Apr 05 05:52:03 UTC 2013",
 "overview": "\u003Cp\u003EIn 1991, Captain Vishnu Singh, (Gallantry Award Winner Veteran of Indian Navy) the present Chairman and Managing Director of the Company, had the vision to foresee the coming together of South Asian Countries for a Regional Free Trade Agreement. Thus, Walton was launched on 29th March 1991, with the aim of establishing seamless trade between the SAARC member countries and rest of the world, thereby, reaching out to the World with products of unique and rich heritage of SAARC countries and bringing closer the vast humanity through trade. Later, in 1995 Walton established its office in Sri Lanka to enhance the product list with Local Sri Lankan products.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nEfficient human resource serves as the backbone to an organization. Henceforth, we have employed a deft team of expert professionals, which assists us in catering to the variegated demands of the customers in an organized and effective manner. These professionals make judicious use of the available resources to develop a quality-approved range of products.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have developed a high-tech infrastructure at Mumbai, Maharashtra, India, which is spread over a large area. For the ease and flexibility of business operation, we have segregated the infrastructure into various departments. \u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nWalton Exports Private Limited never accepts any compromises in terms of quality. We provide the customers with a quality-approved range of Fabric \u0026amp; Garment, Floor Covering, Brass Fitting, Spices, Chemical \u0026amp; Dye and Electrical \u0026amp; Engineering Item. \u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nBeing a client-centric organization, our prime objective is to attain the utmost satisfaction of the customers by providing a quality-approved range of Fabric \u0026amp; Garment, Floor Covering, Brass Fitting, Spices, Chemical \u0026amp; Dye and Electrical \u0026amp; Engineering Item. Further, for the ease of the customers, we offer customization of the range as per their specific requirements. Moreover, we follow ethical trade practices, fair business deals and provide the patrons with flexible transaction options.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/8287/248287v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8287/248287v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/8287/248287v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}