{"name": "WannaGoYo",
 "permalink": "wannagoyo",
 "crunchbase_url": "http://www.crunchbase.com/company/wannagoyo",
 "homepage_url": "http://www.wannagoyo.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 9,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "social-networking, local-advertising, non-profit, smart-phones",
 "alias_list": null,
 "email_address": "michael@wannagoyo.com",
 "phone_number": "254-424-2024",
 "description": "Revolutionizing Local Advertising! ",
 "created_at": "Fri Jan 13 21:27:55 UTC 2012",
 "updated_at": "Mon Jan 16 23:17:46 UTC 2012",
 "overview": "\u003Cp\u003EWannaGoYo is all about \u0026#8220;seize the day\u0026#8221; and turning everyday into an adventure. It is a social network that rewards its users for spontaneously visiting local business and/or volunteering with non-profit organizations to give back to their community! The main difference between WannaGoYo and its competitors such as traditional daily deal sites is that WannaGoYo allows local business to receive foot traffic and acquire new customers everyday without those businesses having to diminish the cost of their products AT ALL! \u003C/p\u003E\n\n\u003Cp\u003EWannaGoYo combines the best of what has revolutionized networking, retail, and the multiple types of online experiences that people have on a daily basis. However, it’s not just a website to say what you’ve done and see what others are doing, or a website to purchase the deal of the day; it’s a website that encourages you to do and encourages you to encourage others to do, creating a never-ending cycle of exciting experiences for the everyday person, while efficiently using the most effective formats of advertising, social, precision, and limited advertising, for the businesses that support this site.\u003C/p\u003E\n\n\u003Cp\u003EWannaGoYo is the future and true power of social networking, combined with a redesigned and more business-friendly version of a daily deal site and mobile app. Our product will take the most effective parts of online networking and advertising, and provide an edge in this growing market that will require sites like it to keep step by exciting users to get out from behind “posting statuses”, that will help businesses reach new customers without having to diminish the value of their products and services, and that will also inspire a wave of social awareness in a way that no other site/app is doing through partnering with non-profit organizations and volunteer programs.\u003C/p\u003E\n\n\u003Cp\u003EWannaGoYo will provide its users with a social network that is actually focused on being social by giving them access to deals, events, and attractions to be used any and every day of the year at a moment’s notice. What seems like a daily deal site with a twist, goes an important step forward by bringing users back with the incentive of a point and level system that makes getting out of the house important, exciting, and competitive! These points are then used in the WannaGoYo Shop for discounts and even complete purchases of exciting events and activities that our users may never have even dreamed of doing before! \u003C/p\u003E\n\n\u003Cp\u003EWannaGoYo empowers businesses with the most powerful and most current form of word-of-mouth advertising, social advertising, while also taking on a more innovative forms of advertising, precision and limited advertising. These three forms of advertising create the perfect marriage between customers and businesses by partnering “ready sellers” with “ready buyers”, generating even more business when friends share deals with one another, and brings customers back by giving them incentive points for every event they participate in. WannaGoYo is founded on the principle of not taking credit and profit for goods or services that businesses offer after we get customers through their doors. Our business model does not leach off of a company that is looking to expand its customer base. Our business is driving customers to businesses.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       115],
      "assets/images/resized/0017/0090/170090v2-max-150x150.jpg"],
     [[250,
       193],
      "assets/images/resized/0017/0090/170090v2-max-250x250.jpg"],
     [[450,
       347],
      "assets/images/resized/0017/0090/170090v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Michael",
      "last_name": "Brassfield",
      "permalink": "michael-brassfield",
      "image": null}},
   {"is_past": false,
    "title": "COO",
    "person":
     {"first_name": "Micah",
      "last_name": "Brassfield",
      "permalink": "micah-brassfield",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "Groupon",
      "permalink": "groupon",
      "image":
       {"available_sizes":
         [[[150,
            66],
           "assets/images/resized/0002/5604/25604v10-max-150x150.png"],
          [[231,
            102],
           "assets/images/resized/0002/5604/25604v10-max-250x250.png"],
          [[231,
            102],
           "assets/images/resized/0002/5604/25604v10-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "12407 E. Hwy. 290",
    "address2": "",
    "zip_code": "78653",
    "city": "Manor",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}