{"name": "Water Damage San Francisco",
 "permalink": "water-damage-san-francisco",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-san-francisco",
 "homepage_url": "http://waterdamage-sanfrancisco.org",
 "blog_url": "http://waterdamagesanfrancisco.weebly.com",
 "blog_feed_url": "http://waterdamagesanfrancisco.xanga.com",
 "twitter_username": "H2OSanFrancisco",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-damage-company-san-francisco, water-damage-services-san-francisco-ca, water-restoration-services-san-francisco, water-leaks-san-francisco, water-damage-repair-san-francisco, flood-damage-repair-san-francisco-ca, flood-cleanup-services-san-francisco,",
 "alias_list": null,
 "email_address": "SylviaKeyes675@gmail.com",
 "phone_number": "(415) 480-0223",
 "description": "Water Damage Repair Company ",
 "created_at": "Tue Jan 29 00:27:21 UTC 2013",
 "updated_at": "Fri Feb 01 16:59:07 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage Company San Francisco\nWelcome to Water Damage San Francisco where we specialize inwater damage repair, flood damage repair, flood cleanup, mold removal, mold remediation, fire damage repair and smoke damage repair. We have been providing damage restoration solutions for many years. Whether it’s residential or commercial, if your property experiences damage, call us immediately as time matters a lot in these types of situations. We’ll act fast and reach you within 30 minutes after your initial call to us.\u003C/p\u003E\n\n\u003Cp\u003EInitially, it seems to be very easy to deal with the damage and clean up of the affected area, but in reality it’s different. Property restoration doesn’t only mean to remove the water, mold stains, odor or fire stains and smell; it’s much more. It’s about proper cleaning, drying, odor removal, decontamination, re-assessment and many other small and large level procedures. So don’t just trust anyone, hand over your property to safe and reliable hands like Water Damage San Francisco.\u003C/p\u003E\n\n\u003Cp\u003EWe provide you with a broad range of damage restoration services in California that are most frequently ordered by our clients:\n• Evaluation of Damage\n• Documentation of Damage through Paper, Video and Photographs\n• Cleanup and Debris Removal\n• Structural Drying and Water Extraction\n• Stain and Odor Removal\n• Sanitation\n• Air Quality Control and Air Scrubbing\n• Mold Testing and Mold Remediation\n• Fire, Smoke and Soot Cleanup\u003C/p\u003E\n\n\u003Cp\u003EWater Damage San Francisco offers all its smoke, fire, mold, flood and water damage services at reasonable prices. We never add extra fees to your final bill or to the pre-decided amount as we want our business to be neat, clean and free of unethical pricing. We value your time and money and that is why we offer you the freedom to know the price before we start the restoration process. If the restoration estimate suits your budget then we will move ahead and begin the restoring development.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Restoration Smoke \u0026amp; Fire Damage Indoor Air Quality Testing Mold Removal Property Renovations Flood Restoration Kitchen Renovations Full Interior Home Renovations \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       59],
      "assets/images/resized/0023/2212/232212v2-max-150x150.png"],
     [[250,
       98],
      "assets/images/resized/0023/2212/232212v2-max-250x250.png"],
     [[331,
       131],
      "assets/images/resized/0023/2212/232212v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}