{"name": "Water Damage Daly City",
 "permalink": "water-damage-daly-city",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-daly-city",
 "homepage_url": "http://waterdamagedalycity.org",
 "blog_url": "http://waterdamagedalycity.weebly.com",
 "blog_feed_url": "http://waterdamagedalycity.xanga.com",
 "twitter_username": "WaterDalyCity",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-damage-company-daly-city, water-damage-services-daly-city-ca, water-restoration-services-daly-city, water-leaks-daly-city, water-damage-repair-daly-city, flood-damage-repair-daly-city-ca, flood-cleanup-services-daly-city, mold-removal-daly-city, mol",
 "alias_list": null,
 "email_address": "BlancheBall786@gmail.com",
 "phone_number": "(650) 887-5605",
 "description": "Water Damage Repair Company",
 "created_at": "Tue Feb 05 00:09:09 UTC 2013",
 "updated_at": "Thu Feb 07 17:32:45 UTC 2013",
 "overview": "\u003Cp\u003EAre you a California resident or business owner looking for a professional damage restoration company who specializes in water damage repair, flood damage repair, flood cleanup, mold removal, mold remediation, fire damage repair or smoke removal? If so, then Water Damage Daly City is the one and only reliable damage restoration company you can count on. We offer the most effective and enduring damage restoration solutions at the lowest and most affordable prices. Our team of experts will clean, repair and restore your property after any kind of disaster such as water damage, flood damage, mold damage, fire and smoke damage.\u003C/p\u003E\n\n\u003Cp\u003EOur expert contractors are specially trained to ensure you receive the service you deserve. At Water Damage Daly City e are committed to assisting you with any water damage, flood damage, mold removal, fire damage and smoke removal. All of our emergency restoration experts are available 24/7 to restore your damaged property and make it look brand new. You can rely on Water Damage Daly City for all your simple and complex damage restoration needs. \u003C/p\u003E\n\n\u003Cp\u003EHere at Water Damage Daly City, our professionals listen to your requirements carefully and then adapt them into their water, flood, mold, fire and smoke services. We understand how stressful you might feel after such damages occur to your property. Whether the damage is minor or major, our damage restoration crew members will guide and lead you through our safe, secure and hassle free damage restoration services. They will explain and make everything crystal clear to you right from the assessment and documentation of the damage to the final sanitation and decontamination procedure.\u003C/p\u003E\n\n\u003Cp\u003EA few of the restoration steps that have to be carried out are:\n•Assessment and Record Maintenance of the Actual Damage\n•Audio, Video and Photographic Recording of the Damage for Future Reference. (At the time of billing and insurance claims)\n•Water Removal and Structural Drying \n•Damage Cleanup and Debris Removal\n•Sanitation and Odor Control\n•Mold Testing and Removal\n•Decontamination to avoid Mold Growth\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       80],
      "assets/images/resized/0023/3627/233627v2-max-150x150.png"],
     [[250,
       134],
      "assets/images/resized/0023/3627/233627v2-max-250x250.png"],
     [[326,
       175],
      "assets/images/resized/0023/3627/233627v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}