{"name": "Water Damage Lighthouse Point",
 "permalink": "water-damage-lighthouse-point",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-lighthouse-point",
 "homepage_url": "http://waterdamagelighthousepoint.com",
 "blog_url": "http://waterdamagelighthousepoint.weebly.com",
 "blog_feed_url": "http://waterdamagelighthousepoint.xanga.com/",
 "twitter_username": "H2OLighthouseP",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-damage-lighthouse-point, water-restoration-lighthouse-point, water-extraction-lighthouse-point, water-removal-lighthouse-point, water-damage-company-lighthouse-point, water-leak-lighthouse-point, water-extraction-company-lighthouse-point, water-dama",
 "alias_list": null,
 "email_address": "HelenCarney786@gmail.com",
 "phone_number": "(954) 727-3041",
 "description": "Water damage restoration ",
 "created_at": "Tue Jan 08 20:30:34 UTC 2013",
 "updated_at": "Sun Jan 13 21:43:32 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage Restoration Company Lighthouse Point\nWater Damage Lighthouse Point is a revolutionary water damage restoration company. We\u0026#8217;re here constantly, to provide total peace of mind amidst the disruption of water damage (and other disasters). Our local service has a team of highly trained staff, all of whom are trained, equipped, and ready to restore your home after any disaster. This could be anything from water in the basement, to fire and smoke damage in the kitchen. \u003C/p\u003E\n\n\u003Cp\u003EWe’ll dry and clean everything that has been affected; from documents, to carpets - to help you avoid mold problems later on down the line. We handle jobs as large as your entire home, or as small as a single room; it\u0026#8217;s not a problem. \u003C/p\u003E\n\n\u003Cp\u003EWater Damage Lighthouse Point performs a faster water damage restoration emergency process, plus: \u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EWater and Fire Damage Restoration Certification.\u003C/li\u003E\n\u003Cli\u003EExpert Project Management Services gives you one point of contact for the entire water restoration project.\u003C/li\u003E\n\u003Cli\u003EEstablished relationships with Professional Insurance Companies, for easy restoration claims processing.\u003C/li\u003E\n\u003Cli\u003EOnline Project Center allows customer and insurance agents to track restoration progress 24/7.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EWe can solve residential disasters quickly and effectively, whether the problem is water, fire, smoke, or an unforgiving combination of all three. Rely on us from start to finish, even for special services such as fine art restoration projects.\u003C/p\u003E\n\n\u003Cp\u003EThe water restoration service providers at Water Damage Lighthouse Point will solve your flood damage problems as quick and painlessly as possible. Whether you are suffering from something as simple as a leaky pipe or roof, or something more serious such as burst pipes, sewage backup, or flash flood damage - our specialist technicians offer the water extraction services you need.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to water restoration, our expert providers also specialize in flood damage repair and water cleanup. For all of your water extraction needs, you should definitely contact Water Damage Lighthouse Point.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Lighthouse Point\nwaterdamagelighthousepoint.com\nLighthouse Point, FL 33064\n(954) 727-3041\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       145],
      "assets/images/resized/0022/8708/228708v2-max-150x150.png"],
     [[250,
       242],
      "assets/images/resized/0022/8708/228708v2-max-250x250.png"],
     [[450,
       436],
      "assets/images/resized/0022/8708/228708v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}