{"name": "Water Damage South San Francisco",
 "permalink": "water-damage-south-san-francisco",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-south-san-francisco",
 "homepage_url": "http://waterdamagesouthsanfrancisco.org/index.html",
 "blog_url": "http://waterdamagesouthsanfrancisco.weebly.com",
 "blog_feed_url": "http://waterdamagesouthsanfrancis.xanga.com/",
 "twitter_username": "FloodSouthSF",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-damage-company-south-san-francisco, water-damage-services-south-san-francisco-ca, water-restoration-services-south-san-francisco, water-leaks-south-san-francisco, water-damage-repair-south-san-francisco, flood-damage-repair-south-san-francisco-ca, f",
 "alias_list": null,
 "email_address": "MittieMahler786@gmail.com",
 "phone_number": "(415) 223-7606",
 "description": "Water Damage Repair/Restoration ",
 "created_at": "Wed Jan 30 18:03:25 UTC 2013",
 "updated_at": "Sat Feb 02 22:07:29 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage and Restoration Company South San Francisco\nWater Damage South San Francisco is acknowledged by California as the leader in property damage restoration services. We are a local damage restoration company in California operating through several centers across the state. Water Damage South San Francisco is the foremost damage restoration company in California that offers restoration services, such as: water damage repair, food damage repair, flood cleanup, mildew removal, mildew remediation, damage repair, smoke damage repair and many other services. We have been restoring residential and commercial clients with all their damage restoring needs for generations. The Water Damage South Francisco experts can restore any damage whether the damage is occurred by flooding, water overflow, mold, fire or smoke accidents. They have mastered all the ways to restore any damage and will make sure that your home or office gets restored to perfect state. Our damage restoration specialists are devoted and concentrated to restore your damages supreme and most resourceful damage restoring methods in South San Francisco. When disaster hits, have faith on Water Damage South San Francisco as your damage restoration experts, California.\u003C/p\u003E\n\n\u003Cp\u003EBesides our regular damage restoration services, we perform:\n• Complete assessment for damage\n• Water Removal and clean up\n• Structural drying along with content drying\n• Debris removal\n• Stain removal and odor removal\n• Decontamination and final assessment\n• Billing to insurance companies\n• Claim settlement with the insurance providers for the damaged property\n• Damage restoration services at the lowest prices in the industry\n• Crystal clear communication and pricing\u003C/p\u003E\n\n\u003Cp\u003EWater Damage South San Francisco has a passion to help the people suffering from disastrous damages. During emergency situations we provide temporary relocation services and storage, while we clean up, decontaminate, and restore your property. We are obtainable 24/7 and geared up to assist you at any time on any day. Give us a phone call and we will react immediately with timely and well-organized assistance and help you out in your devastating disaster. We will take every protection procedures to put off potential property damages.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[141,
       150],
      "assets/images/resized/0023/2621/232621v2-max-150x150.png"],
     [[235,
       250],
      "assets/images/resized/0023/2621/232621v2-max-250x250.png"],
     [[350,
       372],
      "assets/images/resized/0023/2621/232621v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}