{"name": "Water Damage Miami Gardens",
 "permalink": "water-damage-miami-gardens",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-miami-gardens",
 "homepage_url": "http://waterdamagemiamigardens.com",
 "blog_url": "http://waterdamagemiamigardens.weebly.com",
 "blog_feed_url": "http://waterdamagemiamigardens.xanga.com",
 "twitter_username": "H2OMiamiGardens",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "miami-gardens, water-extraction-miami-gardens, water-damage-repair-miami-gardens, water-removal-miami-gardens, water-damage-miami-gardens, water-restoration-miami-gardens, water-damage-restoration-miami-gardens, water-leak-miami-gardens, water-damage-remo",
 "alias_list": null,
 "email_address": "MamieBender786@gmail.com",
 "phone_number": "(305) 809-8022",
 "description": "Water Damage Repair/Restoration",
 "created_at": "Wed Jan 09 20:09:58 UTC 2013",
 "updated_at": "Sun Jan 13 21:56:08 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage Repair \u0026amp; Restoration Miami Gardens\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Miami Gardens is a dedicated team of water damage restoration experts; the most reliable and experienced within the Miami Gardens area. We are certified, licensed and insured for all restoration needs, including (but not limited too); fire damage, smoke damage, water damage, sewage cleanup, mold removal and even air duct cleaning.\u003C/p\u003E\n\n\u003Cp\u003EThe team specializes in extremely quick response to all of your disaster needs within Miami Gardens and surrounding areas. In the case of national emergencies, we are willing to send a catastrophe team anywhere in the continental United States, we’re that dedicated!\u003C/p\u003E\n\n\u003Cp\u003EOur expert team provide 24 hour emergency service, and are crews are ready and willing to come to your rescue in the worst of situations, including; storms, hurricanes, and all disaster situations. We will provide top notch water removal and mold removal services, for any disaster. \u003C/p\u003E\n\n\u003Cp\u003EAll of our team members are experienced in both residential and commercial water damage restoration. We only hire contractors with the expertise and certifications you deserve in your time of need and peril. When you experience a disaster, you need the services of a company that offers a complete restoration package, and specialist that can meet the highest standards of the industry. \u003C/p\u003E\n\n\u003Cp\u003EOur services include water removal, damage cleanup, fire and water damage repair, soot and dirt cleanup, smoke removal, mold prevention, carpet cleaning, rug cleaning, carpet re-stretching, carpet repair and restructuring, insurance claims and much, much more. \u003C/p\u003E\n\n\u003Cp\u003EFor Free Estimate Call Us at: (305) 809-8022 \u003C/p\u003E\n\n\u003Cp\u003EWater Damage Miami Gardens\nwaterdamagemiamigardens.com\nMiami Gardens, FL 33056\n(305) 809-8022\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[135,
       150],
      "assets/images/resized/0022/8903/228903v3-max-150x150.png"],
     [[225,
       250],
      "assets/images/resized/0022/8903/228903v3-max-250x250.png"],
     [[406,
       450],
      "assets/images/resized/0022/8903/228903v3-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}