{"name": "Water Damage Greenacres",
 "permalink": "water-damage-greenacres",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-greenacres",
 "homepage_url": "http://waterdamagegreenacres.com",
 "blog_url": "http://waterdamagegreenacres.weebly.com",
 "blog_feed_url": "http://waterdamagegreenacres.tumblr.com/",
 "twitter_username": "WaterGreenacres",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "greenacres, water-damage-greenacres, water-restoration-greenacres, water-damage-restoration-greenacres, water-leak-greenacres, water-extraction-greenacres, water-damage-repair-greenacres, water-removal-greenacres, mold-greenacres, mold-removal-greenacres,",
 "alias_list": null,
 "email_address": "MaryCornwell786@gmail.com",
 "phone_number": "(561) 952-2434",
 "description": "Water Damage Restoration Company",
 "created_at": "Fri Dec 28 19:58:10 UTC 2012",
 "updated_at": "Sun Dec 30 04:52:03 UTC 2012",
 "overview": "\u003Cp\u003EWater Damage Restoration Company Greenacres\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Greenacres is always available 24 hours a day, 7 days a week. This is because emergencies don’t just happen from “9:00 to 5:00”. No matter when you need us, no matter what the time; we will be there!!\u003C/p\u003E\n\n\u003Cp\u003EWhen you have the misfortune of experiencing water or fire emergency, the damage to your commercial or residential property can be minimized massively through quick, and efficient, response and repair. Our company is a licensed and insured company that has twelve years of experience in the water damage restoration industry. \u003C/p\u003E\n\n\u003Cp\u003EOur skilled experts are available 24 hours a day, 7 days a week and we respond immediately to your emergency, usually in one hour or less. Water Damage Greenacres offers completely free estimates and work directly with your insurance company, so as to save you time.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Greenacres has a vast amount of experience in the remediation, restoration and construction fields. We always strive to exceed each and every industry standard, in order to become the very best at what we do. Your 100% satisfaction is our main focus on every single project that we take on. Our ultimate goal is to provide the highest quality service to all of our customers, in their time of need, or any crisis they encounter.\u003C/p\u003E\n\n\u003Cp\u003EWith the most advanced - cutting-edge - technology, and certified technicians, Water Damage Greenacres can provide water damage restoration and mold control services. This protects your home and property, but perhaps more importantly, you and your family’s health; for many years to come.\u003C/p\u003E\n\n\u003Cp\u003EWater damage can trigger a plethora of serious problems, which can affect the entire structure of a building, destroy valuable personal property, and even generate serious health risks to all occupants (also household pets). To effectively and efficiently restore your property, and protect your health - a seasoned, professional restoration expert should be called in to manage your restoration project.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Greenacres knows how to handle a variety of important tasks, such as:\u003C/p\u003E\n\n\u003Cp\u003E• Preventing bacteria from spreading\n• Suppressing mold growth\n• Stopping secondary damage occurring\n• Rescuing your structure and its valuable contents\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Greenacres\nwaterdamagegreenacres.com\nGreenacres, FL 33463\n(561) 952-2434\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[148,
       150],
      "assets/images/resized/0022/7250/227250v2-max-150x150.png"],
     [[247,
       250],
      "assets/images/resized/0022/7250/227250v2-max-250x250.png"],
     [[419,
       424],
      "assets/images/resized/0022/7250/227250v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}