{"name": "Water Damage Aventura",
 "permalink": "water-damage-aventura",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-aventura",
 "homepage_url": "http://waterdamageaventura.org",
 "blog_url": "http://waterdamageaventura.weebly.com",
 "blog_feed_url": "http://waterdamageaventura.tumblr.com/",
 "twitter_username": "FloodAventura",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-damage-aventura, water-damage-company-aventura, water-damage-restoration-aventura, water-leak-aventura, water-extraction-aventura, water-damage-repair-aventura, water-removal-aventura, mold-aventura, mold-removal-aventura, mold-remediation-aventura,",
 "alias_list": null,
 "email_address": "WendyParis897@gmail.com",
 "phone_number": "(305) 501-4648",
 "description": "Water damage repair/restoration ",
 "created_at": "Thu Jan 03 21:29:30 UTC 2013",
 "updated_at": "Sat Jan 05 06:30:41 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage Restoration Company Aventura\u003C/p\u003E\n\n\u003Cp\u003EAre you searching for expert, professional, water damage restoration services? Whether you are looking for simple office cleaning, or a more personal home cleaning, Water Damage Aventura can get anything done, straightaway. \u003C/p\u003E\n\n\u003Cp\u003EWater Damage Aventura has had but one driving purpose in this line of work – to become an industry leader within the competitive property damage restoration field. We specialize in reversing all of the effects of water damage, fire and smoke damage, mold damage and weather based disaster recovery services.\u003C/p\u003E\n\n\u003Cp\u003EWe are happy to provide a thorough one-time cleaning service, which many people desire upon moving into or moving out of a home or office, yet we are equally happy (and able) to provide weekly or bi-weekly cleaning services as well. \u003C/p\u003E\n\n\u003Cp\u003EAs one of the nation\u0026#8217;s most highly-experienced and reputable water damage restoration contractors, you can rest assured that your loss will be expertly managed in the most expeditious, efficient and professional manner possible.\u003C/p\u003E\n\n\u003Cp\u003EWhen you call the Water Damage Aventura 24/7 call center, our friendly and experienced staff will immediately begin working; to protect both your interests and the structural integrity and cleanliness of your property. \u003C/p\u003E\n\n\u003Cp\u003EWe serve home owners, management companies, businesses and insurance companies alike. Anything from water extraction, to complex dehumidification, we will handle all of your water damage extraction and restoration needs, at an affordable rate.\u003C/p\u003E\n\n\u003Cp\u003EWe pride ourselves on being able to act immediately. This will ensure that all necessary steps are taken, and that your interests are properly protected, in terms of you AND your property. \u003C/p\u003E\n\n\u003Cp\u003EWe understand that clients will very often differ in tastes - some people demand entirely Eco-friendly cleaning, whereas others prefer to use what they trust will eradicate the germs and problems completely. We are happy to accommodate your wishes, whatever they may be.\u003C/p\u003E\n\n\u003Cp\u003ECall Us: (305) 501-4648\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Aventura\nwaterdamageaventura.org\nAventura, FL 33180\n(305) 501-4648\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[146,
       150],
      "assets/images/resized/0022/7963/227963v2-max-150x150.png"],
     [[244,
       250],
      "assets/images/resized/0022/7963/227963v2-max-250x250.png"],
     [[410,
       420],
      "assets/images/resized/0022/7963/227963v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}