{"name": "Waterfry",
 "permalink": "waterfry",
 "crunchbase_url": "http://www.crunchbase.com/company/waterfry",
 "homepage_url": "http://www.waterfry.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "indian-business-directory, free-classfied, free-product-promotion, free-services-promotion",
 "alias_list": null,
 "email_address": "info@waterfry.com",
 "phone_number": "",
 "description": "Free Indian Business Directory",
 "created_at": "Sun Sep 19 09:10:21 UTC 2010",
 "updated_at": "Sat Oct 02 05:43:58 UTC 2010",
 "overview": "\u003Cp\u003EAbout Us\u003C/p\u003E\n\n\u003Cp\u003EThis is a free business directory based on two simple principles; complete exposure for the advertisers and a fascinating online experience for the visitors. According to us these two are very important for ensuring the optimum performance of an online business directory. \u003C/p\u003E\n\n\u003Cp\u003EComplete Exposure\u003C/p\u003E\n\n\u003Cp\u003EThe advertisers are promised with a complete exposure for their products and services. We offer advertising placements that provide an unmatched access to the target audience. The way we present the advertisements makes sure that the audience gets to understand all about the products and services that our advertisers want them to. \u003C/p\u003E\n\n\u003Cp\u003EWe use an impressive combination of visuals and texts that attracts the visitors towards their desired products and services. The visuals are designed to be eye catching and explanatory at the same time. The visuals are combined with the text in a way that they immediately attract the attention and offer the desired information in a comprehensive manner. \u003C/p\u003E\n\n\u003Cp\u003EThe Visitor Experience\u003C/p\u003E\n\n\u003Cp\u003EWe tend to add more and more categories with unique images and visual aids. This helps the visitors to access a lot of options for the desired products and services. Our aim is to help the visitors enjoy an easy access to the products and services catalogue. This is why we chose the best visuals to represent each product and service. \u003C/p\u003E\n\n\u003Cp\u003EThis helps to easily identify all the products and services and also helps to differentiate between the similar offerings. It allows easy browsing through the categories and helps the visitors to make an informed decision in an easy manner. \u003C/p\u003E\n\n\u003Cp\u003EFeedback\u003C/p\u003E\n\n\u003Cp\u003EOur aim is to continuously provide our visitors with a fantastic online experience. This is why we specially ask you to provide us with feedback. We use your feedback to make changes and improvements, in order to help us offer you with an even better service in the future. You can send us your feedback through our contact page.  \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       48],
      "assets/images/resized/0010/2258/102258v2-max-150x150.jpg"],
     [[224,
       72],
      "assets/images/resized/0010/2258/102258v2-max-250x250.jpg"],
     [[224,
       72],
      "assets/images/resized/0010/2258/102258v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}