{"name": "Water Damage Jupiter",
 "permalink": "water-damage-jupiter",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-jupiter",
 "homepage_url": "http://waterdamagejupiter.org",
 "blog_url": "http://waterdamagejupiter.weebly.com",
 "blog_feed_url": "http://www.classifiedads.com/construction_remodeling-ad24892590.htm",
 "twitter_username": "FloodJupiter",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-damage-jupiter, water-damage-company-jupiter, water-damage-restoration-jupiter, water-leak-jupiter, water-extraction-jupiter, water-damage-repair-jupiter, water-removal-jupiter, mold-jupiter, mold-removal-jupiter, mold-remediation-jupiter, flood-jup",
 "alias_list": null,
 "email_address": "XochitlTapia675@gmail.com",
 "phone_number": "(561) 354-0622",
 "description": "Water Damage Repair/Restoration Servic",
 "created_at": "Fri Jan 11 20:47:28 UTC 2013",
 "updated_at": "Tue Jan 15 04:07:41 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage Extraction Company Jupiter, FL\nWhat would you do if you encountered a fire or flood in your home or office complex? Would you know what company to call for all of your water damage restoration or fire damage needs? Would everyone be in a panic, not knowing what to do in the situation? Many people find this to be the case when they experience a crisis.\u003C/p\u003E\n\n\u003Cp\u003EConsequently, improper handling of these situations could potentially cause injuries or additional damages and expensive repairs. The majority of property owners are not prepared for such disasters until it is too late; the damage will already be done by then. Properly organizing a plan of action for when a disaster strikes is necessary to prevent injuries and minimizing the damages your structure experiences.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Jupiter is a respected and renowned name in the water damage, flood damage, mold damage or Fire and Smoke restoration services. We provide highly competent, detailed, and unparalleled restoration services for both residential and commercial customers alike; within the Jupiter area and other, nearby areas. Our team of highly trained, uniformed professionals provide an unmatched service, making them the very best people to conveniently get your life and space back to its normal, pre-damage condition. \u003C/p\u003E\n\n\u003Cp\u003EA few reasons why you should prefer Water Damage Jupiter over any other restoration companies:\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003EEmergency Services are available 24 hours a day, 7 days a week and 365 days a year\u003C/li\u003E\n\u003Cli\u003EIICRC Certified in Water Damage Restoration.\u003C/li\u003E\n\u003Cli\u003EExpertise in water damage best practices.\u003C/li\u003E\n\u003Cli\u003ELarge inventory of state-of-the-art extraction and drying equipment.\u003C/li\u003E\n\u003Cli\u003E“Hassle free - One-Stop-Shop\u0026#8221; service, for all your remediation and reconstruction needs.\u003C/li\u003E\n\u003Cli\u003EWe work for your insurance claims directly with your insurance companies.\u003C/li\u003E\n\u003Cli\u003EPeople you can TRUST who will treat you and your property with RESPECT\u003C/li\u003E\n\u003Cli\u003EWe have trained professionals handling your needs, not temps on work.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EWater Damage Jupiter\nwaterdamagejupiter.org\nJupiter, FL 33458\n(561) 354-0622\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[142,
       150],
      "assets/images/resized/0022/9333/229333v2-max-150x150.png"],
     [[237,
       250],
      "assets/images/resized/0022/9333/229333v2-max-250x250.png"],
     [[347,
       365],
      "assets/images/resized/0022/9333/229333v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}