{"name": "Water Damage South Miami",
 "permalink": "water-damage-south-miami",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-south-miami",
 "homepage_url": "http://waterdamagesouthmiami.com",
 "blog_url": "http://waterdamagesouthmiami.weebly.com/index.html",
 "blog_feed_url": "http://waterdamagesouthmiami.tumblr.com/",
 "twitter_username": "WaterSouthMiami",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-extraction-south-miami-fl, water-damage-cleanup-company-south-miami, water-damage-repair-company-south-miami, water-damage-restoration-south-miami, water-damage-clean-up-south-miami-fl, water-damage-company-south-miami, mold-remediation-south-miami-",
 "alias_list": null,
 "email_address": "StephanieHoffman675@gmail.com",
 "phone_number": "(305) 501-4649",
 "description": "Water Damage Restoration Company",
 "created_at": "Fri Jan 04 21:24:55 UTC 2013",
 "updated_at": "Sat Jan 05 06:51:18 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage Restoration Company South Miami\u003C/p\u003E\n\n\u003Cp\u003EWater Damage South Miami is one of the number one leaders in the insurance restoration industry, providing repairs and services needed in the Florida area. We invite our customers to take a look at our exceedingly high levels of competence and knowledge for themselves; and see why we are the right choice when choosing a restoration company.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage South Miami provides restoration services to institutions, commercial and residential property clients alike. The services available to our customers include fire, flood, mold and water emergency services, full scale restoration and even trauma scene cleanup.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage South Miami is available 24/7/365. Our trained professionals are committed to:\u003C/p\u003E\n\n\u003Cp\u003E• Award Winning Service\n• Swift 45 Minute Response, to all emergencies of any size\n• Being Top Solution Finding Experts\u003C/p\u003E\n\n\u003Cp\u003EAs a licensed, insured, and bonded company, (who practise an internal quality assurance program) we can guarantee 100% satisfaction to each and every customer we deal with. We work with all insurance companies, offering direct billing and the data/document package which adjusters expect from a professional restoration company. \u003C/p\u003E\n\n\u003Cp\u003EAt Water Damage South Miami, we not only represent the ultimate resource for a variety of restoration solutions, but we also believe that it is the customer who sets the high standards for our success. This is why we offer services that demonstrate our strong dedication to you. \u003C/p\u003E\n\n\u003Cp\u003EWater Damage South Miami also offers complete mold inspection and remediation services. We hold all the proper certifications, training, and insurance to complete all mold work, and you will find that our technicians and inspectors have the knowledge and reliability to help come up with a game plan; one which will solve all of your mold issues. \u003C/p\u003E\n\n\u003Cp\u003EThe first step in our expert process is a phone consultation, followed by on-site inspection, testing, and remediation where necessary. Call us anytime, our advice is completely free!\u003C/p\u003E\n\n\u003Cp\u003EWater Damage South Miami\nwaterdamagesouthmiami.com\nSouth Miami, FL 33143\n(305) 501-4649\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[141,
       150],
      "assets/images/resized/0022/8150/228150v2-max-150x150.png"],
     [[235,
       250],
      "assets/images/resized/0022/8150/228150v2-max-250x250.png"],
     [[352,
       373],
      "assets/images/resized/0022/8150/228150v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}