{"name": "Water Damage Palm Beach Gardens",
 "permalink": "water-damage-palm-beach-gardens",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-palm-beach-gardens",
 "homepage_url": "http://waterdamagepalmbeachgardens.org",
 "blog_url": "http://waterdamagepalmbeachgardens.weebly.com",
 "blog_feed_url": "http://waterdamagepalmbeachgarden.xanga.com",
 "twitter_username": "H2OPalmBeachFL",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "palm-beach-gardens, water-damage-palm-beach-gardens, water-restoration-palm-beach-gardens, water-extraction-palm-beach-gardens, water-removal-palm-beach-gardens, water-damage-company-palm-beach-gardens, water-leak-palm-beach-gardens, water-extraction-comp",
 "alias_list": null,
 "email_address": "BessieJones786@gmail.com",
 "phone_number": "(561) 829-2339",
 "description": "Water Damage Repair/Restoration Company",
 "created_at": "Wed Jan 16 00:31:58 UTC 2013",
 "updated_at": "Thu Jan 17 08:05:40 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage Repair \u0026amp; Restoration Palm Beach Gardens\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Palm Beach Gardens is one of the leading restoration contractors; with over two decades of experience in disaster restoration, we know exactly how to handle all situations. Water Damage Palm Beach Gardens can provide restoration services to institutions, commercial and residential property clients. Our expert services, available to customers, include; fire damage and water damage emergency services, full scale restoration, and even trauma scene clean up.\u003C/p\u003E\n\n\u003Cp\u003EIn the event of your property being exposed to any type of fire, water, flood, storm or mold damage, simply contact us immediately, today! Our IICRC professionals can arrive onsite within just 1 hour; to cleanup all water damage, fire damage, and mold damage. We are here to help you when you need any type of fire or water cleanup or repair, no matter how large or small it may be.\u003C/p\u003E\n\n\u003Cp\u003EWe completely understand the seriousness of disasters, and also the utter devastation that they can cause; by disrupting your home or business. Our company has a professional, working relationship, with over a hundred insurance companies. So we can help the speedy processing of all insurance claims, for all Fire and water damage losses you experience. \u003C/p\u003E\n\n\u003Cp\u003EOur dispatchers (and certified disaster recovery specialists) are on-call 24 hours a day, 7 days a week. They will always be ready to respond within a mere 60 minutes of you calling. \u003C/p\u003E\n\n\u003Cp\u003EOur highly trained technicians are ready, and able, to restore Residential as well as Commercial business structures, totally reversing damage and restoring them back to their pre-loss condition; both quickly, and efficiently. We strive for 100% customer satisfaction on each and every project that we undertake.\u003C/p\u003E\n\n\u003Cp\u003EFor a Free Estimate Call Us at: (561) 829-2339\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       145],
      "assets/images/resized/0022/9897/229897v2-max-150x150.jpg"],
     [[250,
       243],
      "assets/images/resized/0022/9897/229897v2-max-250x250.jpg"],
     [[450,
       437],
      "assets/images/resized/0022/9897/229897v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}