{"name": "Water Damage Oakland",
 "permalink": "water-damage-oakland",
 "crunchbase_url": "http://www.crunchbase.com/company/water-damage-oakland",
 "homepage_url": "http://waterdamageoakland.co",
 "blog_url": "http://waterdamageoakland.weebly.com",
 "blog_feed_url": "http://waterdamageoakland.xanga.com/",
 "twitter_username": "WaterOakland",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "water-damage-company-oakland, water-damage-services-oakland-ca, water-restoration-services-oakland, water-leaks-oakland, water-damage-repair-oakland, flood-damage-repair-oakland-ca, flood-cleanup-services-oakland, mold-removal-oakland, mold-remediation-se",
 "alias_list": null,
 "email_address": "CaseySanchez786@gmail.com",
 "phone_number": "(510) 495-1636",
 "description": "Water Damage Repair Company",
 "created_at": "Thu Jan 31 19:39:06 UTC 2013",
 "updated_at": "Sun Feb 03 06:33:40 UTC 2013",
 "overview": "\u003Cp\u003EWater Damage and Restoration Company Oakland\nWater Damage Oakland is a premier damage restoration company located in California, providing the following services: water damage repair, food damage repair, flood cleanup, mold removal, mold remediation, damage repair, smoke damage repair and many other services. We have been serving residential as well as commercial clients for many years, for all their damage restoring needs. Our professionals can restore any damage whether the damage is occurred by flooding, water overflow, mold, fire or smoke incident. They have perfected all the restoration solutions for any damage and will make sure that your property gets restored to its prime condition. Our damage restoration experts are committed and dedicated to provide you with the finest and most efficient damage restoring services in Oakland.\u003C/p\u003E\n\n\u003Cp\u003EAccidents and natural disasters occur at spontaneous times and can damage your property to a dreadful state. Water, flood, and overflow damages should be taken care of as soon as possible so they don\u0026#8217;t lead to further damages like mold and mildew. Water Damage Oakland is aware that fire can destroy your home or office to ashes and debris, which can seem almost impossible to renovate. Our water damage company specialists have mastered the methods and techniques to restore and renovate your property to its fullest potential from any type of damage. We have invested in the latest equipment in order to provide services to your property in a prompt manner.\u003C/p\u003E\n\n\u003Cp\u003EWater Damage Oakland is the answer to your unexpected water damage that occurred to your home or office. We are available 24/7 and ready to assist you at any time on any day. Call us immediately for prompt and efficient assistance and we’ll help you out in your devastating disaster. We will take every safety measures that can be taken to prevent future property damages.\u003C/p\u003E\n\n\u003Cp\u003EAn overview of our generally offered and recommended damage restoration services in California:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003EWater Removal\u003C/li\u003E\n\u003Cli\u003EStructural Drying\u003C/li\u003E\n\u003Cli\u003EDamage Cleanup and Debris Removal\u003C/li\u003E\n\u003Cli\u003ESanitation and Odor Control\u003C/li\u003E\n\u003Cli\u003EDecontamination and Rechecking\u003C/li\u003E\n\u003Cli\u003EInsurance Claims and Billing\u003C/li\u003E\n\u003C/ol\u003E",
 "image":
  {"available_sizes":
    [[[150,
       52],
      "assets/images/resized/0023/2833/232833v2-max-150x150.png"],
     [[250,
       87],
      "assets/images/resized/0023/2833/232833v2-max-250x250.png"],
     [[274,
       96],
      "assets/images/resized/0023/2833/232833v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}