{"name": "Weather Decision Technologies",
 "permalink": "weather-decision-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/weather-decision-technologies",
 "homepage_url": "http://www.wdtinc.com",
 "blog_url": "http://www.wdtinc.com/wdtinc/blogs/blogospherehtml.html",
 "blog_feed_url": "",
 "twitter_username": "imap",
 "category_code": "other",
 "number_of_employees": 75,
 "founded_year": 1999,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "weather, web, mobile, broadcast, enterpise, business-continuity",
 "alias_list": null,
 "email_address": "support@wdtinc.com",
 "phone_number": "(405) 579-7675 ",
 "description": "Innovative. Accurate. Global.",
 "created_at": "Fri May 11 19:33:33 UTC 2012",
 "updated_at": "Fri May 18 18:45:19 UTC 2012",
 "overview": "\u003Cp\u003EWDT is the world\u0026#8217;s most advanced value-added weather content provider, counting as clients most of the United States\u0026#8217; leading weather services and interactive media outlets, as well as governmental, industrial and military weather customers from all over the world. Founded in 2000, WDT has been awarded Inc. 500 and Inc. 5000 status after experiencing 80 percent annual growth during its first four years and continued rapid growth in the past few years. The company has become a global leader in providing state-of-the-science weather detection, geo-mapping, and forecasting systems and services to its global partners and customers.\u003C/p\u003E\n\n\u003Cp\u003EWDT utilizes its global expertise to provide unique content, applications, services and systems to our partners and customers. We work with and license state-of-the-science technologies from the world\u0026#8217;s leading weather research organizations to provide superior weather prediction capabilities to companies with weather sensitive end consumers.\u003C/p\u003E\n\n\u003Cp\u003EWDT provides iMap(R) new media solutions for Internet and mobile companies, servicing over 600 media website weather pages across the United States. In the mobile space, WDT was awarded the prestigious \u0026#8220;Top 50\u0026#8221; Google Android Developer Award for its revolutionary iMapMobile location-based handheld weather application, and is supplying a growing number of TV and radio company with best-in-class iPhone and mobile web applications.\u003C/p\u003E\n\n\u003Cp\u003EWDT has built \u0026#8220;state-of-the-science\u0026#8221; custom systems and services for utilities, international airports and other large-scale enterprises, and provides sophisticated \u0026#8220;weather forensics\u0026#8221; information to a variety of insurance and other industries.\u003C/p\u003E\n\n\u003Cp\u003EWDT currently employs 70 employees in its U.S. and global offices. The technology experts at WDT are all leading scientists from world renowned weather research organizations, including the National Severe Storms Laboratory (NSSL), the University of Oklahoma\u0026#8217;s Center for Analysis and Prediction of Storms (CAPS) and the Oklahoma Climatological Survey. WDT headquarters are in Norman, Oklahoma and we maintain an international, development and marketing offices in metropolitan Washington D.C., Atlanta, Georgia, and Austin Texas.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       56],
      "assets/images/resized/0018/9316/189316v2-max-150x150.png"],
     [[250,
       93],
      "assets/images/resized/0018/9316/189316v2-max-250x250.png"],
     [[450,
       168],
      "assets/images/resized/0018/9316/189316v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "201 David L Boren Blvd.",
    "address2": "Suite 270",
    "zip_code": "73072",
    "city": "Norman",
    "state_code": "OK",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}