{"name": "Web Arts - Bangalore",
 "permalink": "web-arts-bangalore",
 "crunchbase_url": "http://www.crunchbase.com/company/web-arts-bangalore",
 "homepage_url": "http://www.webarts.in",
 "blog_url": "http://www.webarts.in/blog/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 6,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design, web-hosting, e-commerce-web-development, reseller-web-hosting, domain-registration",
 "alias_list": null,
 "email_address": "info@webarts.in",
 "phone_number": "",
 "description": "Web Development Company",
 "created_at": "Wed Jul 07 09:39:32 UTC 2010",
 "updated_at": "Mon Jul 12 17:30:06 UTC 2010",
 "overview": "\u003Cp\u003EWeb Arts is a web design company in Bangalore (India) providing a wide variety of web services like Web Designing, Website Development, E-commerce Web Development, Domain Registration and Web Hosting. Since its inception, Web Arts has provided a wide array of innovative website design solutions.\u003C/p\u003E\n\n\u003Cp\u003EWe provide full featured web design and web development services, which including e-commerce solutions. We provide high quality services for web design, web development, customized e-commerce solution and web hosting with latest technologies.\u003C/p\u003E\n\n\u003Cp\u003EWe can develop or design any website and our efforts also improve the appearance of your website which encourage your visitors to visit again and again. We are also expertise in putting all your ideas together into the website in very professional manners that will become an asset of your business. We will guide you from the very first step of web designing to deployment of your website on Internet.\u003C/p\u003E\n\n\u003Cp\u003EWe also offers e-commerce web site design and development, custom website templates, website re-designing, dynamic web pages, database-driven web pages along with content management solution. We maintain a professional look, keeping in mind search engine optimization and search engine positioning in our development of E-commerce website and website designs. Quality is always the key factor and we always aim to maintain long term relationships based on trust and hard work. Our talented team of website designers helps you to launch cost effective websites for businesses and individuals worldwide. From website development to the e-commerce solutions or graphic design needs, we are here to provide you quality services at economical price.\nWeb Arts aim to maintain long term and reliable relationships based on our trust and hard work. We offer quality web services with cost effective, flexible and scalable web solutions to our customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       102],
      "assets/images/resized/0009/2622/92622v2-max-150x150.jpg"],
     [[250,
       171],
      "assets/images/resized/0009/2622/92622v2-max-250x250.jpg"],
     [[263,
       180],
      "assets/images/resized/0009/2622/92622v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "560001",
    "city": "Bangalore",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}