{"name": "Web Wonks",
 "permalink": "web-wonks",
 "crunchbase_url": "http://www.crunchbase.com/company/web-wonks",
 "homepage_url": "http://www.webwonks.co.nz",
 "blog_url": "http://www.webwonks.co.nz/blog",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 5,
 "founded_year": 2009,
 "founded_month": 9,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "adwords, seo, new-zealand",
 "alias_list": null,
 "email_address": "info@webwonks.co.nz",
 "phone_number": "0800 932 9665",
 "description": "Google, Facebook, Love",
 "created_at": "Mon Jun 03 03:23:30 UTC 2013",
 "updated_at": "Mon Jun 03 14:56:27 UTC 2013",
 "overview": "\u003Cp\u003EThe main aim of Web Wonks is to make websites work.  Around 90% of kiwi-based websites have no developmental plan in place to help their online presence grow. We are committed to highlighting that lead generation is a very serious aspect of website development in today’s maturing online market.\u003C/p\u003E\n\n\u003Cp\u003EWeb Wonks is committed to developing a Google Compliant market place for New Zealand businesses. Based upon the foundations of our Basic Online WOF product, we strive to replicate Google’s decree of ‘Do No Evil’ in the New Zealand economy.  \u003C/p\u003E\n\n\u003Cp\u003ETo achieve this, our product line incorporates key Google products that make selling your products and services online simple and easy. \u003C/p\u003E\n\n\u003Cp\u003EThe Web Wonks are committed to maintaining online brand infrastructure for kiwi websites. To help us achieve the goal of building the best lead generating tools for our client, we have chosen to work with only the best partners. \u003C/p\u003E\n\n\u003Cp\u003EWe are a Google AdWords Partner, and were invited by Facebook to be a foundation member of their flagship agency portal in April 2013. \u003C/p\u003E\n\n\u003Cp\u003EWeb Wonks also have a strategic partnership with breadcrumbs.co.nz and 3webfeet (Web Design), as well as successwithgrace.com \u0026amp; outbox.co.nz (marketing).   \u003C/p\u003E\n\n\u003Cp\u003EThese local NZ companies are integral to the continual development of New Zealand’s Online Economy. \u003C/p\u003E\n\n\u003Cp\u003EOur Online WOF products are designed to be used by first time website owners, right through to massive brands that work across multiple networks. The Online WOF is a universal concept and it all comes down to making your website Google compliant. \u003C/p\u003E\n\n\u003Cp\u003EOur job is to drill down on the information your companies online infrastructure produces. From this data we can develop a roadmap for your company that will increase your conversion rate and offer a real return on your investment.\u003C/p\u003E\n\n\u003Cp\u003EMake sure you sign up for our free Campus to learn more about Google, SEO, Facebook and other key lead generation products. \u003C/p\u003E\n\n\u003Cp\u003EThe Campus, our online lead generation resource base, is filled with over 150 tutorials reviewing Online Advertising, Social Media,SEO, and the Internet in New Zealand. It is free to everyone, but is designed to build upon the Online WOF. Web Wonks is committed to maintaining well preforming online brand infrastructure for kiwi websites.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       61],
      "assets/images/resized/0027/0386/270386v2-max-150x150.png"],
     [[250,
       102],
      "assets/images/resized/0027/0386/270386v2-max-250x250.png"],
     [[272,
       112],
      "assets/images/resized/0027/0386/270386v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$75k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 75000.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 4,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "12a Vega Place",
    "address2": "Mairangi Bay",
    "zip_code": "0632",
    "city": "Auckland",
    "state_code": null,
    "country_code": "NZL",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}