{"name": "web marketing Vancouver",
 "permalink": "web-marketing-vancouver",
 "crunchbase_url": "http://www.crunchbase.com/company/web-marketing-vancouver",
 "homepage_url": "http://webmarketingvancouver.ca",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 10,
 "founded_year": 2007,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "sales@wbamarketingvancouver.ca",
 "phone_number": "6043476510",
 "description": "Internet marketing Vancouver",
 "created_at": "Tue Jun 11 03:01:16 UTC 2013",
 "updated_at": "Tue Jun 11 17:56:28 UTC 2013",
 "overview": "\u003Cp\u003EWe are the leading web design and internet marketing company in Vancouver. We understand that growing your small business takes a sustainable, comprehensive web marketing approach like any successful corporation which has highly specialized marketing staff running their daily marketing operations. However most of the small business owners can\u0026#8217;t afford such an expensive overhead and heavy salary costs. They are on their own. With the right focus, we can be the specialized marketing department helping you to achieve your Internet marketing goals. You can get leads flowing through the door all by itself…with just a little bit of smart work up front. Invest some of your marketing budget with a web marketing company. We believe that online media has the potential to bring your business to greater heights. With the right mix of the latest online marketing tools, expertise and a well-drafted internet marketing plan, we can turn the internet into a cost-efficient promotional tool for your business.\u003C/p\u003E\n\n\u003Cp\u003EWith 100+ years of combined experience in Internet marketing and more than hundred satisfied clients worldwide, we are different than any web marketing companies based in Vancouver. We offer affordable, flexible, results-driven marketing strategies with month to month contract. Our Marketing Consultants are always available to address your business and its changing needs.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       49],
      "assets/images/resized/0027/3757/273757v2-max-150x150.png"],
     [[250,
       82],
      "assets/images/resized/0027/3757/273757v2-max-250x250.png"],
     [[450,
       148],
      "assets/images/resized/0027/3757/273757v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}