{"name": "Web2Carz",
 "permalink": "web2carz",
 "crunchbase_url": "http://www.crunchbase.com/company/web2carz",
 "homepage_url": "http://www.web2carz.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "web2carz",
 "category_code": "other",
 "number_of_employees": 10,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "autos, lifestyle, news, humor, wtf, science, technology",
 "alias_list": null,
 "email_address": "brian@web2carz.com",
 "phone_number": "",
 "description": "Lifestyle, Autos, Trends, News",
 "created_at": "Thu Jun 07 21:03:55 UTC 2012",
 "updated_at": "Sun Jun 24 04:08:48 UTC 2012",
 "overview": "\u003Cp\u003EWe’re an online lifestyle magazine with a very strong auto component.\u003C/p\u003E\n\n\u003Cp\u003EWeb2Carz is a car shopping website. There are several million used and new vehicles for sale listed on the site, a robust research section, and unique editorial content on all subjects automotive. Around 20,000 unique users a day come to the site to browse vehicles, do research or read articles.\u003C/p\u003E\n\n\u003Cp\u003EAlex Bravy and Ben founded the company during the summer of 2006. We both had successful careers at other Internet companies including Orbitz.com, Monster.com and Cars.com. We decided to join forces and utilize our strong technology backgrounds and auto industry knowledge to build Web2Carz. Web2Carz started attracting a fair share of the car shopping public fairly quickly and today is listed on the Inc. 5000 list as one of the fastest-growing private companies in the country.\u003C/p\u003E\n\n\u003Cp\u003EThe advancement and availability of open source software are a big reason for our success. What we are doing today was unheard of 10-to-15 years ago. We would have had to spend a small fortune and hire a much larger team with much overhead. Today we can build world-class, highly scalable technology on open platforms. We have significant automation in place which keeps us small and nimble. This has been absolutely crucial for us as a startup. Being versatile and having low overhead also enabled us to survive during uncertain times. The auto industry and economy as a whole took a big hit in 2008. It took a lot of hard work and strategy to survive as a start-up during that time.\u003C/p\u003E\n\n\u003Cp\u003ESo what makes us different from some of the competition? Well, for starters, our goal has always been to create a simple online car shopping experience. The focus has been on simplicity, value, and informative content. We get a lot of positive feedback from our customer base on how easy our site is to navigate and use, and how clean and simple it is without too many bells and whistles. Our daily articles are increasingly attracting more and more eye balls and gaining popularity as they help consumers become more knowledgeable and informed. In that respect we have moved away from the traditional car search engine model and have become a destination site that consumers can frequent regularly.\u003C/p\u003E\n\n\u003Cp\u003EThe Web2Carz revenue model is advertising and marketing driven. However, unlike some of the competition out there that relies on direct subscription relationships with dealerships, we took a different approach. While we still cater to dealers, sellers, lenders, and vendors indirectly, our focus has been consumer-driven with an emphasis on good user experience. So at a high level, we are a customer acquisition platform, but the customer always comes first.\u003C/p\u003E\n\n\u003Cp\u003ELooking ahead, Web2Carz is currently growing its writing and content team. We have had really exciting success and increased interest in our editorial content, so we will continue to grow the team and expand the subject coverage. People like to read our articles and we want to continue to provide interesting and informative content in that regard. An example of this would be our articles on ‘green’ cars. A lot of the public just does not understand the current state of hybrid and electric cars. We try and provide facts and information on the models out there. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Social Media Specialist",
    "person":
     {"first_name": "Brian",
      "last_name": "Pineyro",
      "permalink": "brian-pineyro",
      "image": null}}],
 "competitions":
  [{"competitor":
     {"name": "www.cars.com",
      "permalink": "www-cars-com",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Highland Park",
    "state_code": "IL",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        84],
       "assets/images/resized/0019/4390/194390v2-max-150x150.png"],
      [[250,
        140],
       "assets/images/resized/0019/4390/194390v2-max-250x250.png"],
      [[450,
        253],
       "assets/images/resized/0019/4390/194390v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.web2carz.com/autos/news/967/man-builds-motorcycle-from-car-parts",
    "title": "Relevant to our readers"},
   {"external_url": "http://www.web2carz.com/people/who-you-know/868/mitt-romneys-wife-wears-1000-shirt",
    "title": "Highly Commented"},
   {"external_url": "http://www.web2carz.com/autos/everything-else/995/5-coolest-shelby-cars",
    "title": "Neat Infographic, good content"}]}