{"name": "Webelinx",
 "permalink": "webelinx",
 "crunchbase_url": "http://www.crunchbase.com/company/webelinx",
 "homepage_url": "http://www.webelinx.com/",
 "blog_url": "http://www.webelinx.com/category/blog/",
 "blog_feed_url": "",
 "twitter_username": "webelinx",
 "category_code": "games_video",
 "number_of_employees": 50,
 "founded_year": 2011,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "webelinx, marketing, mobile, app, game, gaming, entertainment, graphic, application",
 "alias_list": null,
 "email_address": "admin@webelinx.com",
 "phone_number": "(+381)63 407 221 ",
 "description": "Marketing and Advertising",
 "created_at": "Fri Jun 14 13:29:43 UTC 2013",
 "updated_at": "Fri Jun 14 18:56:35 UTC 2013",
 "overview": "\u003Cp\u003EWebelinx team is build of energetic people proficient in successfully completing each stage of games and apps development, from creating an original idea through development of story, sketching and animating characters and backgrounds designs to programming and producing the whole game or app. In addition to people skillful at creating games and apps, the team also consists of people who are highly qualified to perform market research, offering you the best solution for meeting the demands of games and apps users, and manage the whole process of game or application marketing and promotion. But above all professional skills the team possess, Webelinx team is built of young people who enjoy playing games, especially the high quality ones, and that is the feature that is of the utter importance for creating the top-notch product.\nIf you decide to assign the company to create a game or an application, the team will deliver the final product that will be of the highest quality when it comes to all the aspects of a game (innovative scenario, top-notch graphic design, outstanding music…) or an application (attractive design, answers the trends and demands, use value…).\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Nis Office",
    "address1": "Majora Tepica 10",
    "address2": "",
    "zip_code": "18000",
    "city": "Nis",
    "state_code": null,
    "country_code": "CSS",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}