{"name": "Webmoghuls",
 "permalink": "webmoghuls",
 "crunchbase_url": "http://www.crunchbase.com/company/webmoghuls",
 "homepage_url": "http://www.webmoghuls.com",
 "blog_url": "http://www.webmoghuls.com/blog/",
 "blog_feed_url": "http://www.webmoghuls.com/blog/feed/",
 "twitter_username": "webmoghuls",
 "category_code": "advertising",
 "number_of_employees": 6,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "web-design-company, user-experience-design, web-marketing, interactive-marketing, digital-agency, internet-marketing-company, internet-website-marketing, business-web-design, digital-marketing-agency, marketing-with-social-media, marketing-on-linkedin",
 "alias_list": null,
 "email_address": "info@webmoghuls.com",
 "phone_number": "91. 98316 04081",
 "description": "Digital Marketing Agency",
 "created_at": "Sat Dec 22 14:41:55 UTC 2012",
 "updated_at": "Sun Dec 23 06:24:21 UTC 2012",
 "overview": "\u003Cp\u003EWebmoghuls is a digital marketing agency that consists of a team of innovative and driven members, who focus on bringing an organisation’s goals and objectives to the fore, using the internet as a marketing medium. The ultimate motto is to build a complete brand, making it a known face on the internet. Creating a strong and unique position in the target market is the ultimate goal that is set for a brand. We believe in fulfilling our brand promise by ensuring satisfactory customer experience. Our marketing services include social media marketing, SEO marketing, video marketing, mobile marketing, PR etc. Our motto is to offer quality work to clients and further consolidate our position as a provider of the best possible services as in a one-stop digital marketing agency.\nWe also specialise in User Experience Design focusing on interactive design, visual appeal and usability testing techniques that determine how closely the system addresses the user’s needs. The field of user experience is vast, and our objective is to focus primarily on the interaction between the human user, the machine, and the contextual environment in which the system is designed to address the user’s experience. Our key services also include development and maintenance of e-commerce portals as per client requirements. We provide competitive e-commerce solutions that meet your “virtual storefront” needs. \nWe undertake the measurement, collection, analysis and reporting of internet data for understanding and optimising web usage. This enables us to not only measure web traffic but also assess the effectiveness of a website and means to improve it.\nOur take on competition is that we challenge our own strengths and try to surpass every single milestone as a precedent for the next and aim to take digital marketing to the next level by capturing hitherto unexplored areas of the promotional market\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/6698/226698v2-max-150x150.png"],
     [[200,
       200],
      "assets/images/resized/0022/6698/226698v2-max-250x250.png"],
     [[200,
       200],
      "assets/images/resized/0022/6698/226698v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}