{"name": "WebNath",
 "permalink": "webnath",
 "crunchbase_url": "http://www.crunchbase.com/company/webnath",
 "homepage_url": "http://www.webnath.com/",
 "blog_url": "http://www.blogs.indiaonapage.com/",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 8,
 "founded_year": 2009,
 "founded_month": 7,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "website, web, development, design, logo",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Website development company",
 "created_at": "Sat Dec 12 05:50:42 UTC 2009",
 "updated_at": "Mon Dec 14 06:54:17 UTC 2009",
 "overview": "\u003Cp\u003EWebNath is a global website design \u0026amp; development solutions and services partner, incorporated in Bangalore, India, delivering high quality, cost effective, reliable result-oriented web and e-commerce solutions on time for a global clientele. In WebNath, we develop and manage custom web design solutions for small to medium sized businesses.\u003C/p\u003E\n\n\u003Cp\u003EWebNath custom website design solutions focus on the business vision of The Client, so that the design translates Your Vision into measurable value addition and creation. We engage with You in a long term partnership to position Your Business for success. We have a highly capable team of web consultants, creative designers, content writers, programmers and web marketing professionals who know how to deliver results.\u003C/p\u003E\n\n\u003Cp\u003EWe specialize in web design \u0026amp; development, search engine optimization and web marketing, eCommerce, multimedia solutions, content writing, graphic and logo design. We build web solutions, which evolve with the changing needs of your business.\u003C/p\u003E\n\n\u003Cp\u003ESome of the advantage of being with us:\u003C/p\u003E\n\n\u003Cp\u003ECommunication : We follow six steps communication process where WebNath business analysts work with you to understand every minute detail of your requirement. The same is communicated to developers, so that you get the best service in the world. \u003C/p\u003E\n\n\u003Cp\u003ECost: We are located in India and work for both local and international clients. \nWith advanced communication technologies and availability of highly skilled IT professionals in India, it\u0026#8217;s a definite cost advantage for you to outsource your web development work to us.\u003C/p\u003E\n\n\u003Cp\u003EFocus :  WebNath Team doesn\u0026#8217;t take up each and everything in the domain of IT and ITES. We don\u0026#8217;t promise to deliver on some IT requirement if we don\u0026#8217;t have enough skills and expertise in that area. We specialize in web design \u0026amp; development, search engine optimization and web marketing, eCommerce, multimedia solutions, content writing, graphic and logo design \u003C/p\u003E\n\n\u003Cp\u003EQuality : Our tools are professionalism, skills and expertise that translate into delivering quality work at every step for any project we undertake. Our storng QA team assures that no bug passes to the client. We also protect intellectual for the source codes developed specifically for your business. \u003C/p\u003E\n\n\u003Cp\u003EWebNath will Design your Unique Custom Web Site, Manage and Maintain it, Host it and Consult with you on Promoting it.\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to provide the best service to our customers and to satisfy our customers needs.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       14],
      "assets/images/resized/0006/9418/69418v2-max-150x150.jpg"],
     [[241,
       24],
      "assets/images/resized/0006/9418/69418v2-max-250x250.jpg"],
     [[241,
       24],
      "assets/images/resized/0006/9418/69418v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}