{"name": "Webtomap",
 "permalink": "webtomap",
 "crunchbase_url": "http://www.crunchbase.com/company/webtomap",
 "homepage_url": "http://webtomap.com",
 "blog_url": "http://webtomap.com/forum/news/",
 "blog_feed_url": "http://webtomap.com/forum/news/feed/",
 "twitter_username": "webtomap",
 "category_code": "games_video",
 "number_of_employees": 1,
 "founded_year": 2012,
 "founded_month": 11,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "google-maps, map, maps, news",
 "alias_list": null,
 "email_address": "niels@webtomap.com",
 "phone_number": "+31640655683",
 "description": "The interactive map.",
 "created_at": "Tue Dec 18 15:27:48 UTC 2012",
 "updated_at": "Thu Dec 20 08:30:30 UTC 2012",
 "overview": "\u003Cp\u003EWebtomap lets users post their photos, videos and\narticles on a public Google map. \u003C/p\u003E\n\n\u003Cp\u003EUsers can view all content posted by\nthemselves and others. Users are also able to rate posts and comment on\ncontent posted on the map. To search for specific subjects, the category\nstructure and search function can be used. Large amounts of posts can be\nplaced on the map because the posts are clustered . Signing up is easy\nbecause you can create an account with Facebook, Twitter and Google.\nWebtomap is a Mashup that uses among others: Twitter and Facebook connect ,\nWordpress and Google maps. The website is still in beta, but new users are\nwelcome to sign up and use the service. The maximum number of post a user\ncan post is three a day to preserve the quality of posts.\u003C/p\u003E\n\n\u003Cp\u003EHow users are going to use the service still has to be seen. It may be that\nusers are going to use it as a local discussion forum or as a local news\nservice. It is also possible to create maps with certain tags to start an\ninteractive map around specific topics. Articles videos and photo’s can be\nplaced on the map given they are related to the location where they are\nposted. Users can suggest third party services like video sites and other\nwidgets to be integrated within Webtomap. If users find spam or other low\nquality content, they can report it with a mouse click and the post will be\nreviewed.  All maps and articles on the website are easy to share on all\nmajor social networks.\u003C/p\u003E\n\n\u003Cp\u003EWebtomap is different from Google maps, because people can post about\nvirtually anything and can discuss it with other users. Other location\nservices like Foursquare build their product around a specific niche. Since\nthe site has just launched, the number of posts and tags in use is still\nvery small, but when more people start using the service, this experiment\nmight turn into a comprehensive database of geographically ragged content.\nWith Bing using geo RSS data in its search engine and the growing use of GPS\nenabled devices, Webtomap may be in the right spot\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       32],
      "assets/images/resized/0022/5993/225993v2-max-150x150.jpg"],
     [[205,
       45],
      "assets/images/resized/0022/5993/225993v2-max-250x250.jpg"],
     [[205,
       45],
      "assets/images/resized/0022/5993/225993v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}