{"name": "WebTek Labs",
 "permalink": "webtek-labs",
 "crunchbase_url": "http://www.crunchbase.com/company/webtek-labs",
 "homepage_url": "http://www.webteklabs.com",
 "blog_url": "http://webteklabs.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "WebtekLabs",
 "category_code": "software",
 "number_of_employees": 40,
 "founded_year": 1987,
 "founded_month": 2,
 "founded_day": 18,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "webtek-labs, it-company, development-services",
 "alias_list": null,
 "email_address": "venus.suntech@gmail.com",
 "phone_number": "+91-11-45001200",
 "description": "Webtek Labs is an IT company",
 "created_at": "Thu Oct 11 09:34:22 UTC 2012",
 "updated_at": "Mon Oct 22 19:12:19 UTC 2012",
 "overview": "\u003Cp\u003EWebTek Labs is a leading independent Software Services and Solution Provider company to the growing needs of the cyber world. WebTek Labs is headquartered in the capital city, Delhi. As the technology is growing, the demand for such services has increased at a rapid rate due to which the need of services has grown widely. WebTek Labs wide spectrum of services satiates to this as well as the future demands of the customers across wide-ranging industry verticals like Information Technology, Network, Pharma, Healthcare, Life Sciences, Media \u0026amp; Communication, Banking and Financial, Security , Telecom, Manufacturing, Retail, Event Management, Automobile, Logistics, Power and Energy.\u003C/p\u003E\n\n\u003Cp\u003EWe at WebTek Labs focus on delivering benchmark quality of services to the clients while using expert resources. WebTek Labs utilizes the strength of the expertise employee support in providing services that are unparallel with the rest of the market.\u003C/p\u003E\n\n\u003Cp\u003EWebTek Labs specializes in providing services associated with Website Design and Development, custom-built Application Development, Mobile Applications, Testing Services, net Marketing/ internet Promotions, HR Services, Trainings and products Sales. WebTek Labs provides services that result in considerable profit to the clients by making their operation automated and effectual.\u003C/p\u003E\n\n\u003Cp\u003EWebTek Labs has incorporated integrated applications, business method, infrastructure solutions and services that are specifically designed to assist the customer’s purchasers to induce performance businesses.\u003C/p\u003E\n\n\u003Cp\u003EWebTek Labs provides avant-garde solutions to several different trade leaders and Fortune five hundred organizations by leveraging our applications.\u003C/p\u003E\n\n\u003Cp\u003EWebTek Labs is fruited with a panel of senior professionals, assistants and executives that are hard working and consistent in their performance at all the levels. Our panel of experts is well equipped with skills and knowledge and is well versed with effective productivity.\u003C/p\u003E\n\n\u003Cp\u003EOur innovations and custom-centered solutions facilitate wire line, wireless, broadband and cable service suppliers redefine their markets.\u003C/p\u003E\n\n\u003Cp\u003EWebtek Labs craves for the satisfaction of the clients and duly works to achieve the appreciation. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       83],
      "assets/images/resized/0021/5149/215149v2-max-150x150.jpg"],
     [[250,
       138],
      "assets/images/resized/0021/5149/215149v2-max-250x250.jpg"],
     [[369,
       205],
      "assets/images/resized/0021/5149/215149v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://twitter.com/webteklabs",
    "title": ""}]}