{"name": "Wedding Parfait",
 "permalink": "wedding-parfait",
 "crunchbase_url": "http://www.crunchbase.com/company/wedding-parfait",
 "homepage_url": "http://www.weddingparfait.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "Wedding_Parfai",
 "category_code": "search",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "wedding-directory, wedding, directory, wedding-cake, wedding-dresses, wedding-photgraphy",
 "alias_list": null,
 "email_address": "supergirl@weddingparfait.com",
 "phone_number": "",
 "description": "Visual Wedding Directory Portfolio",
 "created_at": "Sun Mar 25 02:02:18 UTC 2012",
 "updated_at": "Mon Mar 26 02:12:04 UTC 2012",
 "overview": "\u003Cp\u003EWeddingParfait.com is where brides and grooms meet their ideal wedding specialized service vendors to orchestrate their “parfait” wedding.\u003C/p\u003E\n\n\u003Cp\u003EWhy “Wedding Parfait”? Read on\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EThe Wedding Parfait Story\u003C/p\u003E\n\n\u003Cp\u003EOnce upon a time, there was a girl\u0026#8230; who had no dreams of being a princess, let alone a bride! She was a rug-rat and tomboy through and through.  Many years later, coming into womanhood, she meets her knight in shining armour who turns her world upside down, and they live happily ever after\u0026#8230; right?\u003C/p\u003E\n\n\u003Cp\u003ENot so fast.  \u003C/p\u003E\n\n\u003Cp\u003EAs they prepared for their special day that loomed over the horizon, the bride-to-be became increasingly irritated with the pre-matrimonial process, and the rise of the Bridezilla within her was quickly surfacing.  \u003C/p\u003E\n\n\u003Cp\u003EAll she wanted was to be able to find the services and vendors she needed in one place, and in a simple and easy manner.  She enjoyed looking at portfolios online, and despised seeing distracting ads and pop-up windows.  Also, she did not want to have to sign up to another website for the umpteenth time.\u003C/p\u003E\n\n\u003Cp\u003ESo\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EPutting her entrepreneurial top hat on, she thought to herself, “What would make my life (and every other woman’s life who goes through this process) easier? How about a wedding service directory? Not like the directories that have been around forever, it has to be different, it has to be perfect\u0026#8230; or as they say in French, ‘parfait’.”\u003C/p\u003E\n\n\u003Cp\u003ESince being different was what Wedding Parfait had to be, it also had to be better. \u003C/p\u003E\n\n\u003Cp\u003EBeyond an old-fashioned, hard to read, text-based classified, Wedding Parfait would provide all wedding specialized service vendors who participate with mini portfolios to showcase their work!  It would be a free and open portfolio wedding service directory.\u003C/p\u003E\n\n\u003Cp\u003EVendors could even have the option to upgrade to a Pro account at a fair, monthly subscription price.  The idea behind this is to assist vendors in getting more exposure by having priority placement above free account vendors, provide them with larger listing space with more and larger  images to showcase in their mini-portfolio, and assist brides-to-be with their matrimonial preparations (and keep the Bridezilla at bay).\u003C/p\u003E\n\n\u003Cp\u003EPassing these ordeals, the answer had finally become clear.  If simply described, Wedding Parfait is a directory of wedding service vendors in a given city, and focuses on visually catching portfolio pieces.\u003C/p\u003E\n\n\u003Cp\u003EThus, with the union of these two promises, WeddingParfait.com was born\u0026#8230;\u003C/p\u003E\n\n\u003Cp\u003EHowever, the story is not over yet, is it?\u003C/p\u003E\n\n\u003Cp\u003EAllow Wedding Parfait to guide you to your happy ending, to aid the Princess and her Knight in slaying the beast known as Bridezilla, and to be the sanctuary where you and your partner make your wedding, “parfait”.\u003C/p\u003E\n\n\u003Cp\u003EHugs!\u003C/p\u003E\n\n\u003Cp\u003ETammy and Team @ WeddingParfait.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0018/0896/180896v2-max-150x150.jpg"],
     [[250,
       250],
      "assets/images/resized/0018/0896/180896v2-max-250x250.jpg"],
     [[450,
       450],
      "assets/images/resized/0018/0896/180896v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Head Office",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Vancouver",
    "state_code": null,
    "country_code": "CAN",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}