{"name": "Wedding Stub",
 "permalink": "wedding-stub",
 "crunchbase_url": "http://www.crunchbase.com/company/wedding-stub",
 "homepage_url": "http://www.weddingstub.com",
 "blog_url": "http://www.weddingstub.com/blog",
 "blog_feed_url": "",
 "twitter_username": "weddingstubcom",
 "category_code": "ecommerce",
 "number_of_employees": 5,
 "founded_year": 2010,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "weddings, daily-deals, couples-things-to-do",
 "alias_list": null,
 "email_address": "info@weddingstub.com",
 "phone_number": "8777415995",
 "description": "Daily Deals Site For Weddings",
 "created_at": "Fri Mar 09 20:52:19 UTC 2012",
 "updated_at": "Wed Apr 25 09:02:31 UTC 2012",
 "overview": "\u003Cp\u003EThe wedding-planning circuit has exploded onto the scene through blogs, deals, and online reviews. But when we started comparing notes from one website to the next, we found the endless possibilities challenging instead of helpful. So we started thinking, why should brides have to open multiple browsers when one website could provide a quick and easy shopping and planning experience all in one? Let’s face it; in this economy we could all use a break. That’s why we created Wedding Stub. \nThis is a great opportunity for brides, grooms, and vendors alike to find exactly what it is they are looking for. \nWedding Stub is a premier website that displays daily deals from hundreds of New York City vendors who cater to the wedding industry and couples things to do. Offering one-stop shopping on bridal gowns, tuxedos, restaurants, catering halls, florists, centerpieces, spa treatments, and so much more, www.weddingstub.com is sure to become the nation’s fastest growing wedding website for the newly engaged and recently betrothed.\u003C/p\u003E\n\n\u003Cp\u003ECatering exclusively to the wedding industry and couples things to do, we provide our clients the products, services, and special offers they have come to expect from other leading discount websites.\u003C/p\u003E\n\n\u003Cp\u003EBrides can build their own website, read articles on wedding related tips, search for vendors, and save 50-60% off on their wedding day needs. Vendors can upload photos, create their own deals using the state of the art vendor dashboard and track all deals that are sold using the Quick Response Code tracking system on their mobile device. With this technology, they can also instantly track customers who used the deal they purchased.  In addition, Wedding Stub will soon launch the Vendor Spotlight feature to post interviews of makeup artists, photographers, caterers and others whose services are a must have in the wedding industry.\u003C/p\u003E\n\n\u003Cp\u003EIn a short period of time, Wedding Stub has enjoyed significant success and received glowing reviews. Our team would like to thank Tech Crunch as we continue to make headway in wedding circles throughout the country. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       100],
      "assets/images/resized/0017/7498/177498v2-max-150x150.jpg"],
     [[250,
       166],
      "assets/images/resized/0017/7498/177498v2-max-250x250.jpg"],
     [[450,
       300],
      "assets/images/resized/0017/7498/177498v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "\u003Ciframe width=\"420\" height=\"236.25\" src=\"http://www.youtube.com/embed/HmTlKS0rejI\" frameborder=\"0\" allowfullscreen\u003E\u003C/iframe\u003E ",
    "description": ""}],
 "screenshots":
  [{"available_sizes":
     [[[150,
        84],
       "assets/images/resized/0018/0001/180001v2-max-150x150.jpg"],
      [[250,
        140],
       "assets/images/resized/0018/0001/180001v2-max-250x250.jpg"],
      [[450,
        253],
       "assets/images/resized/0018/0001/180001v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}