{"name": "Wedding Photographs",
 "permalink": "wedding-photographs",
 "crunchbase_url": "http://www.crunchbase.com/company/wedding-photographs",
 "homepage_url": "http://www.sheonabeachweddings.com.au/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 1981,
 "founded_month": 5,
 "founded_day": 10,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "wedding-photography-images, packages",
 "alias_list": null,
 "email_address": "sheonabeachweddings100@gmail.com",
 "phone_number": "",
 "description": "Looking for Wedding Photography Packages",
 "created_at": "Wed Mar 20 09:36:57 UTC 2013",
 "updated_at": "Wed Mar 20 09:37:03 UTC 2013",
 "overview": "\u003Cp\u003ECongratulations if your wedding is planned! Just one more important thing, as a part of an arrangement of a special day, would be to hire professional wedding photographer in Melbourne. Isn’t it? Yes, getting the best wedding photography images by professional and experts will ultimately result into the beautiful wedding album. Actually, your wedding photos are not something you can overlook. \u003C/p\u003E\n\n\u003Cp\u003EAnd, and it’s not necessary you have to spend a lot of money after wedding photographer in Melbourne. You can hire professionals for inexpensive wedding photography too and get excellent photography you\u0026#8217;ve dreamt of all the time.\nExperts help you treasure and share your memories by turning photographs into impressive wedding album and photo slide show. You can even get professional wedding album with romantic tunes in background. The album of your wedding days is going to be one of the most cherished elements because it reminds you of the best and incredible day of your life. You are going to recall each and every instant of your wedding for as long as you have your album. \u003C/p\u003E\n\n\u003Cp\u003EFor this reason you have to be so smart when you are hiring wedding photographer in Melbourne because it is important to find the one with the best impressing recognition. You may also let one of your buddies capture all the wedding photographs and deliver it to a company that can help you develop a wedding album later on. This is often a good option too knowing somebody among your mates who is great at photo shoot.\u003C/p\u003E\n\n\u003Cp\u003EAnd…your special needs something better! Go and dig up the Internet to find company that can provide you inexpensive wedding photography. With beautiful wedding album, you are definitely going to reminisce your special day as long as you live. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       87],
      "assets/images/resized/0024/3907/243907v2-max-150x150.jpg"],
     [[250,
       145],
      "assets/images/resized/0024/3907/243907v2-max-250x250.jpg"],
     [[450,
       261],
      "assets/images/resized/0024/3907/243907v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}