{"name": "Weeb",
 "permalink": "weeb",
 "crunchbase_url": "http://www.crunchbase.com/company/weeb",
 "homepage_url": "http://www.weeb.com.au",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 5,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "seo, search-engine-optimisation, ppc, online-advertising, internet-marketing, gold-coast, brisbane, ranking, search-results",
 "alias_list": null,
 "email_address": "info@weeb.com.au",
 "phone_number": "0756411313",
 "description": "SEO and PPC expert in the Gold Coast",
 "created_at": "Fri Aug 10 03:00:20 UTC 2012",
 "updated_at": "Fri Aug 10 08:54:53 UTC 2012",
 "overview": "\u003Cp\u003EWeeb is a Queensland based business creating websites all throughout Australia specializing in Web Development, Internet Marketing for both small and big businesses. Our team understands that online marketing is one of the most effective ways for a business to get in touch with their target market. Weeb has been trained to successfully increase your online profitability through a professional and unique website. Our Web team is committed to each individual project and push the boundaries of creativity to make the most innovative and visually appealing website for you.\u003C/p\u003E\n\n\u003Cp\u003EThe services that are provided at Weeb are all offered to the highest quality with quick project turnaround ensuring that every project gets completed on time.With each new web developement job we provide a free domain name and web hosting for 12 months \u0026gt; as well as many other features for your website to pop from the crowd. With every SEO package a free website is also offered for those who do not have a website yet. Here at Weeb we create innovative and unique websites and ecommerce with an effective marketing strategy for you. All websites are built with an efficient code structure for better search results. All websites created with Weebconform to the W3C (World Wide Web Consortium) standards. For more information and a clear breakdown of the vast range of services provided at Weeb, simply fill out the quick contact form and one of our friendly staff will get in touch with you. Or you can also visit the Internet Marketing, Web Development or Graphics Design Service page where a description for each unique service is outlined.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0020/5388/205388v2-max-150x150.png"],
     [[250,
       62],
      "assets/images/resized/0020/5388/205388v2-max-250x250.png"],
     [[354,
       89],
      "assets/images/resized/0020/5388/205388v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[90,
        150],
       "assets/images/resized/0020/5387/205387v2-max-150x150.png"],
      [[150,
        250],
       "assets/images/resized/0020/5387/205387v2-max-250x250.png"],
      [[270,
        450],
       "assets/images/resized/0020/5387/205387v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}