{"name": "Welcome to Hygo Limited",
 "permalink": "welcome-to-hygo-limited",
 "crunchbase_url": "http://www.crunchbase.com/company/welcome-to-hygo-limited",
 "homepage_url": "http://www.hygo.co.uk/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "hygo0124@gmail.com",
 "phone_number": "01753 550654",
 "description": "Hygo are suppliers of Washroom, Hygiene,",
 "created_at": "Sun Jan 06 16:17:17 UTC 2013",
 "updated_at": "Mon Jan 07 21:51:03 UTC 2013",
 "overview": "\u003Cp\u003EHygo are suppliers of Washroom, Hygiene, Cleaning \u0026amp; Janitorial products.  We primarily aim   to provide extensive range of environment friendly quality products and facilitate our customers to enjoy the advantage of noteworthy saving, combined with great fitting service. All our customers have reaped the huge benefit of significant savings this year only.  So without a second thought open an Account with us today!! It is quite probable that you are wandering what are the cutting edge differences/ advantages with Hygo?  Well, to help  you to make the  correct decision, let’s  list the reasons:\u003C/p\u003E\n\n\u003Cp\u003E• Vast/Diverse  range of  Environment Friendly Quality Products\n• Competitive Pricing \n• 24/7 Online Shopping * Option\n• Safe \u0026amp; Secure Credit Card Facility\n• ORDER: Online, By Phone, Fax or Email\n• Dedicated Account Manager\n• Excellent Customer Care Service\u003C/p\u003E\n\n\u003Cp\u003EOur exclusive online shopping service/ facility provide trade account holders to purchase goods   with a different advantage i.e. a   30 day credit agreement.   \u003C/p\u003E\n\n\u003Cp\u003EHygo significantly holds distribution rights for Kimberley Clark, Lotus Professional, Deb, Johnson Diversey, Evans Vanodine and many more. We simultaneously and effectively cater   to major commercial, industrial and public sectors ranging from Hospitals, Nursing Homes, Doctor Clinics, Dentists, Schools, Offices, Hotels, Pubs, Restaurants, Health \u0026amp; Leisure Clubs, Pubs, housing complex and local authorities.  Just call us today to provide the opportunity to our specialized and expert account team to assess your needs and after free consultation offer   a comprehensive and personalized service package, thereby allowing   you to enjoy much needed peace of mind and concentrate on your core business.\u003C/p\u003E\n\n\u003Cp\u003EVisit: - http://www.hygo.co.uk/\nEmail-ID: - Sales@hygo.co.uk \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}