{"name": "wellpharmarx",
 "permalink": "wellpharmarx",
 "crunchbase_url": "http://www.crunchbase.com/company/wellpharmarx",
 "homepage_url": "http://www.wellpharmarx.com",
 "blog_url": "http://www.wellpharmarx.com/blog",
 "blog_feed_url": "",
 "twitter_username": "wellpharmarx",
 "category_code": "other",
 "number_of_employees": 30,
 "founded_year": 2011,
 "founded_month": 12,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online-pharmacy, medication-provider",
 "alias_list": null,
 "email_address": "wellpharmarx@gmail.com",
 "phone_number": "",
 "description": "Quality Medication Provider",
 "created_at": "Mon Dec 19 11:33:49 UTC 2011",
 "updated_at": "Tue Dec 20 11:06:22 UTC 2011",
 "overview": "\u003Cp\u003EWellPharMarx.com is the quality virtual online pharmacy. This Pharmacy offers variety of generic medication at cheapest cost to all over the world. It is one of the places where one could get high quality medication at lowest cost. It is rare amalgamation of quality and cost at one place. All kinds of medication from Men’s health to Health Skin offers by this pharmacy are FDA approved. \u003C/p\u003E\n\n\u003Cp\u003ECustomer could opt for any medicine from this pharmacy with great confidence only because of its fourcharacteristics such as quality, cost, delivery on time and secure\ntransaction. Any medicine offers by them are of high quality. They are very particular about their delivery on time it is applicable to all orders from smallest to bulk order. Now a day’s security become a very important factor if you are going to purchase anything on internet   considering this wellpharmarx.com implement GeoTrust SSL on their site so that customer could purchase all product without any hesitation. \u003C/p\u003E\n\n\u003Cp\u003EAfter deep observation this pharmacy came to know that many times person buy medication without knowing its doses, side effect and precaution for particular medication. To avoid this situation wellpharmarx.com hire special customer supports who are fully trained and aware about all medicine offers by this pharmacy and also given all the details about the medicine on website also.  Customer would found two types of shipping option on this pharmacy one is post registered shipping and another one is express shipping so that they can choose which is suited for them.  They normally shipped medicine all over the world with minimum charges and perfectly on time. Customer support is always up 24X7 so you may ask any queries related to medicine and shipping.\u003C/p\u003E\n\n\u003Cp\u003EWhatever information provided by customer to them is very much secured and does not shared with any other third party.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       30],
      "assets/images/resized/0016/6832/166832v2-max-150x150.jpg"],
     [[250,
       50],
      "assets/images/resized/0016/6832/166832v2-max-250x250.jpg"],
     [[268,
       54],
      "assets/images/resized/0016/6832/166832v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}