{"name": "WeShare Network",
 "permalink": "weshare-network",
 "crunchbase_url": "http://www.crunchbase.com/company/weshare-network",
 "homepage_url": "http://www.wesharenetwork.net",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "WeShare_Network",
 "category_code": "web",
 "number_of_employees": 1,
 "founded_year": 2011,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business, articles, blog, social, forums, group, network",
 "alias_list": null,
 "email_address": "info@wesharenetwork.net",
 "phone_number": "",
 "description": "Social/Group Network",
 "created_at": "Mon Jan 02 12:29:06 UTC 2012",
 "updated_at": "Mon Apr 02 07:14:19 UTC 2012",
 "overview": "\u003Cp\u003EWeShare Network is a place for friends family and businesses. You can create groups of any size, blogs, articles, job postings, classifieds, events, chat, forums and stores.\u003C/p\u003E\n\n\u003Cp\u003EWeShare Network was created because of some of the missing key features in many of the largest networks online. Many of the current social or group networks have made navigation a bit complicated.\u003C/p\u003E\n\n\u003Cp\u003EThere have been issues with privacy changes among other privacy conflicts. Many people have been searching for a better more simple way to control their privacy settings.\nWe wanted an environment where people could search within categories to find products, information from stores, forums and blogs. Employers have a section for job postings and advertisement for their businesses.\u003C/p\u003E\n\n\u003Cp\u003EAs WeShare Network grows the benefits within will continue to always bring more interesting and useful features. We wanted to create an environment where everyone could come and have the ability to socialize with family and friends or promote themselves or their business. \nWeShare Network was created with easy navigation and usability in mind. WeShare Network does not track, rent or sell any personal information. \u003C/p\u003E\n\n\u003Cp\u003EWith WeShare Network you can create groups for friends, family, special interests, and more. You can separate family from business by creating or joining groups with different interests. \u003C/p\u003E\n\n\u003Cp\u003EYou also have the ability to create blogs, articles, events, group chat, forums, job postings, advertise, and create classifieds. Weshare Network has the ability to e-mail or IM internally.\nAs WeShare will grow there will be added features that are very useful in the personal and business environments.\u003C/p\u003E\n\n\u003Cp\u003EYou also have the ability to create a store front and shop the stores within WeShare Network with your personal shopping cart.\n All of these features and many more were created to be easy to use with simple navigation.\u003C/p\u003E\n\n\u003Cp\u003EAt WeShare we will continue to better the WeShare experience for the people that join the Weshare Network.\u003C/p\u003E\n\n\u003Cp\u003EJoin and invite the planet\u0026#8230;\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       34],
      "assets/images/resized/0016/8431/168431v12-max-150x150.png"],
     [[250,
       57],
      "assets/images/resized/0016/8431/168431v12-max-250x250.png"],
     [[400,
       92],
      "assets/images/resized/0016/8431/168431v12-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Darron",
      "last_name": "Fior",
      "permalink": "darron-fior",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}