{"name": "Whereyoudey",
 "permalink": "whereyoudey",
 "crunchbase_url": "http://www.crunchbase.com/company/whereyoudey",
 "homepage_url": "http://www.whereyoudey.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "whereyoudey",
 "category_code": "advertising",
 "number_of_employees": 15,
 "founded_year": 2010,
 "founded_month": 8,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "business-listings-nigeria, nigeria-local-search-engine, business-directories-nigeria, nigerian-yellowpages, nigerian-business-listings, events-in-nigeria, port-harcourt-businesses, lagos-businesses",
 "alias_list": null,
 "email_address": "info@whereyoudey.com",
 "phone_number": "+234 8071592114",
 "description": "Nigerian Local Business Directories",
 "created_at": "Tue Sep 20 04:45:05 UTC 2011",
 "updated_at": "Thu Nov 17 19:13:26 UTC 2011",
 "overview": "\u003Cp\u003Ewww.whereyoudey.com is an innovative business listings product  in Nigeria that provides business listings and information to end user and has a mature mobile platform which includesSMS to web classifieds, SMS Search and Mobile Apps for various devices. \nview www.youtube.com/whereyoudey\u003C/p\u003E\n\n\u003Cp\u003EWhereyoudey is a subsidiary of Naijapages Ltd Nigeria and was founded in 2009 by Akin Olaoye \u0026amp; Ovie Oghenejobo. The company owned by a team of young Nigerians who studied in the U.S with successful careers in business \u0026amp; technology. As a young start whereyoudey utilizes innovation and implement proven strategies to help grow the brand with the support of highly skilled employees to support their ground operations while delivering quality service. \u003C/p\u003E\n\n\u003Cp\u003EWhereyoudey is a trademarked product and fully registered with the corporate affairs board in Nigeria. The company headquarters is located at no. 12 Bori Road Port Harcourt, Nigeria.\nWhereyoudey demonstrates innovation as the product incorporates several value added features that provides an end user with a unique experience while using the website, Mobile app or the Mobile SMS search platform. Alot of its product features are quite impressive which includes Facebook \u0026amp; twitter share of a business listing, google maps with exact business location, coupon ads, email option, reviews and ability for users to view media files (Video ads, pictures)\u003C/p\u003E\n\n\u003Cp\u003EWhereyoudey has developed mobile apps to support highly utilized mobile devices in Nigeria and this includes a Blackberry app, Nokia app, Samsung app, sony app and an android app to be launched in coming weeks.\u003C/p\u003E\n\n\u003Cp\u003EAlso to cater to a portion of our users who experience limited internet access, these individuals can access their services using an SMS search function with a designated short code \u0026#8220;33812\u0026#8221;, this allows a user to search for any business listing using a keyword from his/her mobile device on any of the Nigerian cellular networks. A mobile user searching for a tailoring service would simply text \u0026#8220;tailor\u0026#8221; and area of town or street address and city to \u0026#8220;33812\u0026#8221;. This would deduct a standard SMS surcharge and provide a result to the user instantly depending on the network connectivity.\u003C/p\u003E\n\n\u003Cp\u003EWhereyoudey has positioned itself among as an Innovative product in the Nigerian Technology space and has recieved an overwhelming response from end users and positive reviews from its business clients. Whereyoudey currently operates in Port Harcourt, Calabar,Enugu, Nsukka, Yenegoa, Warri, Benin City, Abuja and Asaba. \u003C/p\u003E\n\n\u003Cp\u003EWhereyoudey has been expanding rapidly with entry into new cities every two to three months. The business strategy is to cater to the underserved markets as most technology startups and business listings are focused primarily on Lagos as their entry-markets. Whereyoudey has chosen to expose other cities in Nigeria and highlight the potential they have to offer with short term plans to enter Lagos as a major player. \nThe whereyoudey mobile apps can be found on the respective app stores for the handsets supported and mobile users in Nigerian can download it by simply texting \u0026#8220;bb app\u0026#8221;, \u0026#8220;nokiaapp\u0026#8221;, \u0026#8220;sonyapp\u0026#8221; and \u0026#8220;samsungapp\u0026#8221; from the GSM handset within Nigeria to SMSshortcode \u0026#8220;33812\u0026#8221;, this would provide download links and instructions.\nWhereyoudey\u0026#8217;s mobile app placed 3rd at Mobile App West Africa Contest held February 2011 in Lagos Nigeria.\u003C/p\u003E\n\n\u003Cp\u003EAlso to create advocacy among blackberry users, they have blackberry themes available for free download in the blackberry app store or using the link below.\u003C/p\u003E\n\n\u003Cp\u003Ehttp://appworld.blackberry.com/webstore/content/reviews/44242?lang=en\u003C/p\u003E\n\n\u003Cp\u003EWhereyoudey currently has over 45,000 physical business listings, with a very mature service model to meet high customer satisfaction. The company operates using a cost effective model and customized product offerings to meet their customer needs at alow cost. \u003C/p\u003E\n\n\u003Cp\u003ECurrently, whereyoudey has seen its web traffic grow significantly as it demonstrates the originality and genuinity most african businesses enjoy while providing services that improves the quality of life in the markets they serve.\u003C/p\u003E\n\n\u003Cp\u003EFollow whereyoudey on facebook.com/whereyoudey.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       72],
      "assets/images/resized/0015/4870/154870v2-max-150x150.png"],
     [[250,
       121],
      "assets/images/resized/0015/4870/154870v2-max-250x250.png"],
     [[388,
       188],
      "assets/images/resized/0015/4870/154870v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [{"embed_code": "http://youtu.be/5_005wOysXU",
    "description": "\u003Cp\u003EWhereyoudey Video Ad\u003C/p\u003E"}],
 "screenshots":
  [],
 "external_links":
  []}