{"name": "wikalps.com",
 "permalink": "wikalps-com",
 "crunchbase_url": "http://www.crunchbase.com/company/wikalps-com",
 "homepage_url": "http://wikalps.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "teamwikalps",
 "category_code": "web",
 "number_of_employees": 6,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "adminteam@wikalps.com",
 "phone_number": "",
 "description": "Explore your options",
 "created_at": "Sun Jan 06 17:09:25 UTC 2013",
 "updated_at": "Thu Jan 10 19:12:08 UTC 2013",
 "overview": "\u003Cp\u003EWikalps.com is a website designed to cater to businesses based in India and the people looking for services from these businesses. It aims to create an exhaustive database of Doctors, Schools, Restaurants and other professional services that make up a part of our everyday lives.\u003C/p\u003E\n\n\u003Cp\u003EEach business listings aims to provide the user with name, contact numbers, website, and map location. A user must login to explore the functionalities, such as, forwarding information about a listing through email, facebook, or their twitter account to their friends. To keep it dynamic, the user can also contact the business owner about any complaints they may have about their establishment. Every registered user can review and rate an establishment and provide feedback about their experience. We also give priority to the highest rated establishment in our homepage. Our search algorithm brings in the perfect match with the provided keywords.\u003C/p\u003E\n\n\u003Cp\u003EIn an attempt to make Wikalps an exhaustive repository, we encourage users to register and add as many listings as they can. Our leader board module tracks each activity of the users and gives them points and ranks them accordingly. The top 10 leaders will be shown in our homepage with their points and ranks.\u003C/p\u003E\n\n\u003Cp\u003EWikalps.com does have listings for doctors, schools and restaurants. Initially, we have covered more than 15 cities across India and we will be soon expanding to more locations and categories. We believe in advertising but not at the expense of information. For any support you can reach us at adminteam@wikalps.com.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       47],
      "assets/images/resized/0022/8340/228340v2-max-150x150.png"],
     [[220,
       70],
      "assets/images/resized/0022/8340/228340v2-max-250x250.png"],
     [[220,
       70],
      "assets/images/resized/0022/8340/228340v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}