{"name": "Windham Systems Group",
 "permalink": "windham-systems-group",
 "crunchbase_url": "http://www.crunchbase.com/company/windham-systems-group",
 "homepage_url": "http://www.windhamsystemsgroup.com",
 "blog_url": "http://windhamsystemsgroup.blogspot.com/search?updated-min=2012-01-01T00:00:00-08:00\u0026updated-max=2013-01-01T00:00:00-08:00\u0026max-results=1",
 "blog_feed_url": "",
 "twitter_username": "windhamsystems",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2002,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "channel-partner-consulting, windham-nh-sales, marketing, building-new-business-revenue-rapidly--contract-negotiation--consensus-building--strategic-planning--operationsguidelinesprocedures--team-leadership--sales-and-marketing-mentoring, executive-communi",
 "alias_list": null,
 "email_address": "d.mccutcheon@windhamsystemsgroup.com",
 "phone_number": "603-434-2022",
 "description": "Management Consultant",
 "created_at": "Fri Aug 17 18:06:48 UTC 2012",
 "updated_at": "Thu Aug 23 07:17:03 UTC 2012",
 "overview": "\u003Cp\u003EWindham Systems Group was founded by David McCutcheon and is an experienced and successful Channel Consulting company with many years of experience in creating, developing and growing Channel Partner Programs for hardware and software vendors throughout North America.\u003C/p\u003E\n\n\u003Cp\u003EDistinctive Executive Success and Qualifications:\u003C/p\u003E\n\n\u003Cp\u003EExtensive and adaptable experience in identifying, creating and developing reseller relationships for both Fortune 500 and pre-IPO hardware and software vendors.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group has broad market experience with end-user and channel sales. Proven success in rolling out successful sales programs appropriately customized and targeted for various regions, including evangelizing and championing company mission, purpose and needs internally.\u003C/p\u003E\n\n\u003Cp\u003ESuccessful track record of leading and working effectively with cross-functional teams, including marketing, sales operations, and finance.\u003C/p\u003E\n\n\u003Cp\u003EServices provided for both Fortune 500 and start-up hardware and software vendors.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group has Broad Market experience with end-user and channel sales. Proven success in rolling out successful sales programs appropriately customized and targeted for various regions, including evangelizing and championing company mission, purpose and needs internally.\u003C/p\u003E\n\n\u003Cp\u003ESuccessful track record of leading and working effectively with cross-functional teams, including marketing, sales operations, and finance.\u003C/p\u003E\n\n\u003Cp\u003EExcellent Business Acumen: Building new business revenue rapidly • Contract Negotiation  • Consensus Building • Strategic Planning • Operations/Guidelines/Procedures • Team Leadership \u0026amp; Sales and marketing Mentoring • Executive Communications.\u003C/p\u003E\n\n\u003Cp\u003EWe have Deep knowledge base of hardware and software storage, networking infrastructure, security, communications and client / server technologies\u003C/p\u003E\n\n\u003Cp\u003EChannel Partner Marketing\u003C/p\u003E\n\n\u003Cp\u003EOptimize your Channel\u0026#8217;s Revenue Potential\u003C/p\u003E\n\n\u003Cp\u003EOur experienced consulting teams will assist you in ensuring your channel partners are driving significant revenue.\u003C/p\u003E\n\n\u003Cp\u003EWe have experience in:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EConsulting\nTraining/Support\nAccount Management\nCreative Support\nJoint Marketing Collateral\nOnline Ordering Portal\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ETo discuss how we can help you increase your channel\u0026#8217;s performance, contact us today at 1-603-434-2022 or send email to d.mccutcheon@windhamsystemsgroup.com\u003C/p\u003E\n\n\u003Cp\u003EBranding Strategy\u003C/p\u003E\n\n\u003Cp\u003EFinding the Right Identity\u003C/p\u003E\n\n\u003Cp\u003EEstablishing and planning effective branding strategies is vital to your company\u0026#8217;s positioning. A strong brand equity is fundamental to building a customer base, creating customer loyalty and developing credibility.  Your brand identity determines the success of your business.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group can assist you with developing a strong and powerful brand identity.  We will analyze your business objectives and review your unique selling proposition to formulate a branding strategy that will emphasize your competitive advantage.\u003C/p\u003E\n\n\u003Cp\u003EDemand Generation\u003C/p\u003E\n\n\u003Cp\u003EDemand Generation is the focus of targeted marketing programs to drive awareness and interest in a company\u0026#8217;s products and/or services.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group has the techniques, insight and creativity to help you generate demand and grow your business. With our six step module, we can help you to create an awareness plan as well as getting qualified leads.\u003C/p\u003E\n\n\u003Cp\u003ECustomer Retention\u003C/p\u003E\n\n\u003Cp\u003EOften time business owners forget that it isn’t just about building new clients, but it is also about maintaining current ones. A properly planned customer retention program will not only establish long term business relationships but will also provide incentives for current clients to refer business as well.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group has the techniques, insight and creativity to help you plan and execute the proper and most effective customer retention campaigns. We’ll help you build long term relationships and establish solid credibility with your current clients.\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003EPersonalized and triggered coupons\nImplement reward programs that promote genuine loyalty\nLoyalty campaigns designed to improve frequency and profitability\nExecute exclusive previews of products and perks designed to increase traffic\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003ETo learn more about our customer retention programs, contact us at 1-603-434-2022\u003C/p\u003E\n\n\u003Cp\u003EProduct Launches\u003C/p\u003E\n\n\u003Cp\u003EAccelerate Growth\u003C/p\u003E\n\n\u003Cp\u003EDo you have a new product that you want to introduce to the world but don’t know where to start? Do you gradually slip the product in and hope it will catch on or do you penetrate the market aggressively?\u003C/p\u003E\n\n\u003Cp\u003EThese questions amongst many others need to be analyzed to ensure a successful product launch. An effective product launch can make a huge impact on whether a product succeeds or fails in the marketplace.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group has the techniques, insight and creativity to help you plan and execute the proper and most effective product launch. We’ll help you analyze the current market and customer base to create a strategy for a high-impact product launch that will ensure market penetration and profitability.\u003C/p\u003E\n\n\u003Cp\u003ECollateral Development\u003C/p\u003E\n\n\u003Cp\u003EConvey the Right Message\u003C/p\u003E\n\n\u003Cp\u003EMarketing collateral is the collection of marketing pieces to support and reinforce the impact of your sales initiatives while visually presenting your business as trustworthy and professional. It is imperative that your advertising materials convey the right message in a fresh and relevant way to your target audience.\u003C/p\u003E\n\n\u003Cp\u003ECollateral development with a focus on maintaining brand consistency is critical. A well-defined marketing collateral development system that reflects your brand and supports your ongoing growth is critical.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group\u0026#8217;s team of professionals can proficiently align your collateral with your external communications and sales strategy.  We have the expertise and insight to help you plan and execute the proper and most effective collateral options. We will help you with your partnering strategy and which options to use to gain maximum return on your investment.\u003C/p\u003E\n\n\u003Cp\u003EWindham Systems Group LLC.\n32 Beacon Hill Rd\nWindham, New Hampshire 03087-1103\u003C/p\u003E\n\n\u003Cp\u003EPhone: 603-434-2022\nEmail: d.mccutcheon@windhamsystemsgroup.com\u003C/p\u003E\n\n\u003Cp\u003EFirst Name: David\u003Cbr/\u003E\nLast Name: McCutcheon\u003Cbr/\u003E\nAddress 1:  32 Beacon Hill Rd\u003Cbr/\u003E\nAddress 2:\u003Cbr/\u003E\nCity:            Windham\u003Cbr/\u003E\nZip Code:     03087\nState:          New Hampshire\nPhone: 603-434-2022\u003Cbr/\u003E\nEmail:   d.mccutcheon@windhamsystemsgroup.com\nwww.windhamsystemsgroup.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       61],
      "assets/images/resized/0020/6625/206625v2-max-150x150.jpg"],
     [[250,
       102],
      "assets/images/resized/0020/6625/206625v2-max-250x250.jpg"],
     [[390,
       160],
      "assets/images/resized/0020/6625/206625v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "",
    "address2": "",
    "zip_code": "03087",
    "city": "Windham",
    "state_code": "NH",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[147,
        150],
       "assets/images/resized/0020/6624/206624v2-max-150x150.jpg"],
      [[245,
        249],
       "assets/images/resized/0020/6624/206624v2-max-250x250.jpg"],
      [[245,
        249],
       "assets/images/resized/0020/6624/206624v2-max-450x450.jpg"]],
    "attribution": null},
   {"available_sizes":
     [[[150,
        61],
       "assets/images/resized/0020/7539/207539v2-max-150x150.jpg"],
      [[250,
        102],
       "assets/images/resized/0020/7539/207539v2-max-250x250.jpg"],
      [[390,
        160],
       "assets/images/resized/0020/7539/207539v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://channelpartnerconsulting.com",
    "title": ""},
   {"external_url": "http://channelprogramconsulting.com",
    "title": ""}]}