{"name": "Winncom Technologies Corp.",
 "permalink": "winncom-technologies-corp",
 "crunchbase_url": "http://www.crunchbase.com/company/winncom-technologies-corp",
 "homepage_url": "http://www.winncom.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "public_relations",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "wireless-broadband, wireless-lan, point-to-point-wireless, cable-assemblies, networking-solutions, wireless-backhaul, wireless-network-solutions, dual-pole-antennas, point-to-multipoint-solutions, directional-antennas, coaxial-cable, video-surveillance-pr",
 "alias_list": null,
 "email_address": "sales@winncom.com",
 "phone_number": "(440) 498-9510",
 "description": "Broadband Solutions",
 "created_at": "Fri Jan 07 09:36:48 UTC 2011",
 "updated_at": "Fri Jan 14 06:54:20 UTC 2011",
 "overview": "\u003Cp\u003EWinncom provides powerful solutions, integrating wireless broadband Wi-Fi products for networking applications. To achieve their optimal network solution, they offer carrier class base stations, CPE, USB, network controllers, and many more.\u003C/p\u003E\n\n\u003Cp\u003ECompany Overview: \u003C/p\u003E\n\n\u003Cp\u003EWinncom Technologies is a worldwide distributor and provider of complete networking solutions, wireless and wired. Their unmatched expertise in broadband wireless networking products and full range of network infrastructure and access products by the leading industry manufacturers allows us to sell the products and provide complete solutions for various markets and applications. Their product offerings include (but certainly not limited to) the following leading names in the industry: PROXIM, MOTOROLA, AXXCELERA, ALVARION, CISCO, Colubris, Multi-Tech, BridgeWave, RAD Communications, ALCATEL-LUCENT, AVAYA, MTI, SKYPILOT and many others. \u003C/p\u003E\n\n\u003Cp\u003EWinncom Technologies Corp. is a distributor of complete networking solutions. They offer wireless broadband, point to point, multipoint wireless network solutions, cable assemblies, dual pole antennas, directional antennas, bridges, access points for wireless and wired WLAN, LAN, and WAN.\u003C/p\u003E\n\n\u003Cp\u003EWith their world-wide presence, Winncom is able to provide the highest level of pre-sale consulting and post-sale engineering support to our customers. Since its beginnings in 1993, Winncom Technologies Corporation remains at the forefront of the global technology marketplace, bringing the latest products and services to the market and finding new ways to offer value to our customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       25],
      "assets/images/resized/0011/6460/116460v2-max-150x150.jpg"],
     [[248,
       42],
      "assets/images/resized/0011/6460/116460v2-max-250x250.jpg"],
     [[248,
       42],
      "assets/images/resized/0011/6460/116460v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.winncom.com",
    "title": "Broadband Solutions"}]}