{"name": "Witchcraft Studios",
 "permalink": "witchcraft-studios",
 "crunchbase_url": "http://www.crunchbase.com/company/witchcraft-studios",
 "homepage_url": "http://www.witchcraftstudios.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "mobile",
 "number_of_employees": 11,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile-applications, games, iphone, ipad, android, bada, galaxy, mobile-content-development, developer, applications, smartphone, mobile-marketing, m-marketing, marketing, m-commerce, mobile-phone, mobile-advertising, mobile-advertisement, appstore, andro",
 "alias_list": null,
 "email_address": "info@witchcraftstudios.com",
 "phone_number": "+48 22 350 64 28",
 "description": "Developer of mobile content",
 "created_at": "Tue Nov 08 19:05:02 UTC 2011",
 "updated_at": "Tue Nov 29 23:11:09 UTC 2011",
 "overview": "\u003Cp\u003EWitchcraft Studios is an international publisher and developer of mobile content. With a presence in over 80 countries on 6 continents, we have produced and published over 100 mobile phone applications for many different platforms, chief among them for the iPhone, Android, Java, and Bada. We provide all the services associated with the development of applications for mobile devices, including complete integration with WEB, WAP, CMS, and social networking sites. Thanks to a wide variety of technological resources as well as a solid distribution network, we are enabled to aggregate content and outsource the production of mobile applications.\u003C/p\u003E\n\n\u003Cp\u003EOur company has been thriving on the market since 2007 and we have created both, entertainment and marketing  applications, as well as ingenious business solutions. From scratch, we have established not only conception, but also marketing strategies on the strength of mobile channel, everything for our clients, among whom one finds Warner Brothers, Toshiba, Lancome or Merck. Witchcraft Studios holds the ISO 9001 Certificate (software production).\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       24],
      "assets/images/resized/0016/1404/161404v2-max-150x150.jpg"],
     [[250,
       40],
      "assets/images/resized/0016/1404/161404v2-max-250x250.jpg"],
     [[450,
       73],
      "assets/images/resized/0016/1404/161404v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}