{"name": "Wolf Technical Services, Inc.",
 "permalink": "wolf-technical-services-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/wolf-technical-services-inc",
 "homepage_url": "http://www.wolftechnical.com/",
 "blog_url": "http://wolftechnicalblog.blogspot.com/",
 "blog_feed_url": "",
 "twitter_username": "wolftechnical",
 "category_code": "hardware",
 "number_of_employees": 22,
 "founded_year": 1977,
 "founded_month": 4,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "awortman@wolftechnical.com",
 "phone_number": "317.842.6075",
 "description": "Forensic Engineering/Product Development",
 "created_at": "Thu Aug 09 14:22:07 UTC 2012",
 "updated_at": "Thu Aug 16 17:53:02 UTC 2012",
 "overview": "\u003Cp\u003EWolf Technical Services was founded by Dr. Jack Wolf in 1977. Dr. Wolf identified a need in the legal and insurance markets for scientifically based expert opinion to be provided in cases to determine cause and effect in accidents related to motor vehicle and property damage incidents. Wolf specializes in reconstruction of all types of vehicle collisions, analyzes product failures, fire and explosions, industrial and construction site accidents, commercial motor vehicle accidents, personal injury claims, , railroad crossing collisions, and visibility issues. Wolf graphics consultants provide a wide range of services for demonstrative evidence purposes such as animations, 3-D scale models and large-format courtroom exhibits.\u003C/p\u003E\n\n\u003Cp\u003ESpecifically, Wolf has developed a next-generation restraint system for mobile aircrew members of military helicopters. The restraint system addresses the need to intelligently and automatically adapt the restraint response to the level of aircraft dynamics, attenuates crash acceleration pulses, and allows crewmember freedom of movement when greater restraint is not necessary.\u003C/p\u003E\n\n\u003Cp\u003EAdditionally, Wolf has developed a Weigh-in-Motion System to detect anomalously loaded vehicles (such as those carrying vehicle-borne improvised explosive devices (VBIEDs).  The smart technology developed for WIMS accurately determines total vehicle weight as well as individual axle and wheel weights of passing vehicles.  But since many checkpoints have serpentine approach layouts that are designed for speed control, the WIMS must also measure the lateral weight shifts associated with turning vehicles, and compensate for those weight shifts analytically using vehicle dynamics calculations. \u003C/p\u003E\n\n\u003Cp\u003EOther DoD projects include a Smart Flight Glove, a modular ATD (aka Test Dummy) with frangible bones, a next generation Troop Seat featuring energy attentuation and a robotic arm used to clean eddy current condenser tubes.  \u003C/p\u003E\n\n\u003Cp\u003ECommercially, Wolf has designed items such as an LED beacon and a robotic end effector for medical device packaging.  Additionally, Wolf provides consultation in design engineering, development, innovation and commercialization. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[85,
       85],
      "assets/images/resized/0020/5307/205307v2-max-150x150.png"],
     [[85,
       85],
      "assets/images/resized/0020/5307/205307v2-max-250x250.png"],
     [[85,
       85],
      "assets/images/resized/0020/5307/205307v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.wolftechnical.com/pr_table/1%20Wolf%20Weigh%20in%20Motion%20Sensor_IEDCpr2010.pdf",
    "title": "Indianapolis Company to Test Sensor Device at Camp Atterbury"},
   {"external_url": "http://www.wolftechnical.com/pr_table/5%20Wolf%20Technical%20Navy%20CMARS%20press%20release%209.18.09.pdf",
    "title": "Indianapolis Company Awarded U.S. Navy Contract In Excess of $12 Million"}]}