{"name": "Woman in Leadership",
 "permalink": "woman-in-leadership",
 "crunchbase_url": "http://www.crunchbase.com/company/woman-in-leadership",
 "homepage_url": "http://www.WomanInLeadership.com/",
 "blog_url": "http://www.WomanInLeadership.com/blog_index.html",
 "blog_feed_url": "http://feeds.feedburner.com/WomanInLeadership",
 "twitter_username": "staciewalker",
 "category_code": "consulting",
 "number_of_employees": 2,
 "founded_year": 2006,
 "founded_month": 3,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "leadership-development, entrepreneurship, women, blog-for-business, business-blog, business-to-business-blog, women-on-the-internet, marketing, stacie-walker, san-antonio, texas, women-in-leadership, business-women, personal-development, financial-educati",
 "alias_list": null,
 "email_address": "Info@WomanInLeadership.com",
 "phone_number": "210-764-9289",
 "description": "Inspiration for Female Entrepreneurs",
 "created_at": "Tue Jun 12 23:52:37 UTC 2012",
 "updated_at": "Mon May 13 05:20:20 UTC 2013",
 "overview": "\u003Cp\u003EWe are a online community that is centered around five crucial elements for long term business success:\u003C/p\u003E\n\n\u003Cp\u003E1.) Business Advice\u003C/p\u003E\n\n\u003Cp\u003E2.) Leadership Development\u003C/p\u003E\n\n\u003Cp\u003E3.) Financial Advice\u003C/p\u003E\n\n\u003Cp\u003E4.) Personal Development\u003C/p\u003E\n\n\u003Cp\u003E5.) Marketing Advice\u003C/p\u003E\n\n\u003Cp\u003EAll five elements will help improve your skill set as a budding entrepreneur.\u003C/p\u003E\n\n\u003Cp\u003EIf you are on the fence about starting your own business venture or if you are stagnating with current business goals, we strongly believe in the importance of encouragement.\u003C/p\u003E\n\n\u003Cp\u003EThe Woman in Leadership blog community is a place to share your voice and to make it the go-to resource for female small business owners, work at home moms, and start-ups.\u003C/p\u003E\n\n\u003Cp\u003EWhat is the Mission and Purpose of Woman in Leadership?\u003C/p\u003E\n\n\u003Cp\u003EOur mission is to help you gain the priceless knowledge that is essential for becoming a successful entrepreneur and prominent leader in your industry.\u003C/p\u003E\n\n\u003Cp\u003EIs the Woman in Leadership Online Community Right for Me?\u003C/p\u003E\n\n\u003Cp\u003EThe Woman in Leadership name stands for every entrepreneurial woman who is not afraid to pursue her dreams, no matter the obstacle.\u003C/p\u003E\n\n\u003Cp\u003EIf this sounds like you, then this is the right place for you!  \u003C/p\u003E\n\n\u003Cp\u003EWhether you are just starting out or are currently established, we provide you with a wealth of inspiration, motivation, financial, and business building advice. \u003C/p\u003E\n\n\u003Cp\u003EWe also offer affordable professional services for you and your growing business.\u003C/p\u003E\n\n\u003Cp\u003EWhat Professional Services Does Woman in Leadership Offer?\u003C/p\u003E\n\n\u003Cp\u003EThe services offered by Woman in Leadership will change as the community continues to grow. \u003C/p\u003E\n\n\u003Cp\u003EAll services have been created to help you stay on the road to success with your home business, online business, startup, or established small business.\u003C/p\u003E\n\n\u003Cp\u003EOur professional services include the following:\u003C/p\u003E\n\n\u003Cp\u003EConsultation (2 Hours Free)\nFree Business Building Courses\nFree Marketing Courses\nWriting Requests (Blog content, ghostwriting, articles, etc.)\nSocial Media Management and Marketing\nAdvertising and Sponsorship Programs\u003C/p\u003E\n\n\u003Cp\u003EFor detailed information about each of the services we provide, just head on over to Our Services page. \u003C/p\u003E\n\n\u003Cp\u003EABOUT THE FOUNDER\u003C/p\u003E\n\n\u003Cp\u003EStacie Walker, the Editor-in-Chief and the company founder, is the the brainchild behind this fabulous community.\u003C/p\u003E\n\n\u003Cp\u003EShe officially said good-bye to her corporate job to build her own business from the comfort of her home in 2008.\u003C/p\u003E\n\n\u003Cp\u003EShe has NEVER looked back.\u003C/p\u003E\n\n\u003Cp\u003EStacie loves working with professional leaders and dedicated entrepreneurs in the small business, home business, and online business industries.\u003C/p\u003E\n\n\u003Cp\u003EKnown as a success-driven entrepreneur, it has been her mission and purpose to educate you on possessing the correct tools to establish a better business model and to assist you with improving the quality of your personal life.  \u003C/p\u003E\n\n\u003Cp\u003EA top priority of Stacie is to provide a comfortable place for the novice and the experienced entrepreneur to get a bit of inspiration, motivation, and business building strategies for long term success.\u003C/p\u003E\n\n\u003Cp\u003EShe believes all of the above elements are essential to improve your skill set as a budding entrepreneur in your industry.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[130,
       150],
      "assets/images/resized/0019/6354/196354v4-max-150x150.jpg"],
     [[209,
       241],
      "assets/images/resized/0019/6354/196354v4-max-250x250.jpg"],
     [[209,
       241],
      "assets/images/resized/0019/6354/196354v4-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Free Report: 3 Secrets to a Profitable Blog for Business",
    "permalink": "free-report-3-secrets-to-a-profitable-blog-for-business",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "Founder",
    "person":
     {"first_name": "Stacie",
      "last_name": "Walker",
      "permalink": "stacie-walker",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Woman in Leadership",
    "address1": "21303 Encino Commons Blvd. #812",
    "address2": "",
    "zip_code": "78259",
    "city": "San Antonio",
    "state_code": "TX",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://forms.aweber.com/form/35/452800335.htm",
    "title": "Woman in Leadership Weekly e-News - Sign Up Here"},
   {"external_url": "http://www.blogtalkradio.com/woman-in-leadership",
    "title": "Woman in Leadership Success Online Radio Show"},
   {"external_url": "http://www.scribd.com/doc/138025656/Free-Report-3-Secrets-to-a-Profitable-Blog-for-Business",
    "title": "Free Report: 3 Secrets to a Profitable Blog for Business"}]}