{"name": "Woodworking Machines",
 "permalink": "woodworking-machines",
 "crunchbase_url": "http://www.crunchbase.com/company/woodworking-machines",
 "homepage_url": "",
 "blog_url": "http://machines.made-from-india.com/woodworking-machines.php",
 "blog_feed_url": "",
 "twitter_username": "mayurdicosta",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "woodworking-machines, woodworking-machine, woodworking-machines-india, woodworking-machines-manufacturers, woodworking-machines-suppliers, woodworking-machines-exporters, woodworking-machine-providers, woodworking-machines-sellers",
 "alias_list": null,
 "email_address": "mayurdicosta@gmail.com",
 "phone_number": "",
 "description": "Woodworking Machines Manufacturers and S",
 "created_at": "Tue Nov 15 08:23:18 UTC 2011",
 "updated_at": "Wed Nov 30 00:58:07 UTC 2011",
 "overview": "\u003Cp\u003EYou are ready to move up in the ranks of woodworking project man to pro level and are going to need some professional woodworking machines. Lets face it, you can only do so much with hand tools and even the basic power tools. If you want to get a real pro job done on some intricate and detailed woodworking projects you are going to need some woodworking machines. These are going to cost you some money and are not real cheap. You can shop around but to get anything reasonable in quality you will have to pay big. Don\u0026#8217;t settle for a real cheap import as it will not do the job effectively and will just cause endless frustration. Another option is good secondhand stuff. Good quality woodworking machines that have been cared for will never grow old and will be as good as new. Maybe a blade sharpen and a service and they will give you years of service.\u003C/p\u003E\n\n\u003Cp\u003EThere are many retired old woodworking enthusiasts out there who are no longer able to operate their machinery safely and so will regrettably sell to you secondhand. They may want to be assured that you are going to care for their machines as well as they have before they will sell to you. If that is the case you know you have a good well cared for woodworking machine that will be as good as new.\u003C/p\u003E\n\n\u003Cp\u003EThe first machine that you should get is a drop table saw that will give you accurate cutting to length of most size lumber. You can cut to any angle too with these saws making them particularly handy for say an architrave miter cut at the top of your door. You can get a lovely fit every time with a precision saw such as this. After that a table saw bench is handy allowing you to rip lumber and sheeting accurately. If you have to rip a sheet of ply by hand you know how long it can take. With a table saw like this you can make all sorts of accurate cuts. It would pay to get this unit in a combination as then you have several machines in one all utilizing the same motor and making it cheaper than buying them all separately.\u003C/p\u003E\n\n\u003Cp\u003EA combination with a small planer will be very handy as you can dress your piece of lumber after you have ripped it. It is handy to for trimming lumber on an edge to get that perfect fit. You can even get this combination with a small thicknesser so you can run several pieces through to get them all an even size. Other attachments include routers where you can use a multitude of bits to produce an ornate range of patterns giving you some real class in your finished project.\u003C/p\u003E\n\n\u003Cp\u003EYou can see that a few woodworking machines will give you a lot of scope to produce some good stuff. Get into it and have fun but just watch those fingers. Keep them well clear of whirling blades.\u003C/p\u003E\n\n\u003Cp\u003EMore information at: http://machines.made-from-india.com/woodworking-machines.php\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       85],
      "assets/images/resized/0016/4532/164532v1-max-150x150.png"],
     [[237,
       135],
      "assets/images/resized/0016/4532/164532v1-max-250x250.png"],
     [[237,
       135],
      "assets/images/resized/0016/4532/164532v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}