{"name": "Work Excel",
 "permalink": "work-excel",
 "crunchbase_url": "http://www.crunchbase.com/company/work-excel",
 "homepage_url": "http://www.workexcel.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "eap, employee-wellness, human-resources-management, workplace-wellness, employee-newsletter",
 "alias_list": null,
 "email_address": "dfapublish@aol.com",
 "phone_number": "843-367-0920",
 "description": "hr eap management",
 "created_at": "Wed May 11 13:57:27 UTC 2011",
 "updated_at": "Fri May 13 14:33:33 UTC 2011",
 "overview": "\u003Cp\u003EWorkExcel.com is owned by DFA Publishing \u0026amp; Consulting, LLC. We are located near Charleston, South Carolina. WorkExcel.com was recently called EAPtools.com, but broaden the scope of our products, and therefore changed the name of the Website. We continue to broaden the scope of our product offerings to reach more human resource managers other allied workforce management professionals concerned about employee behavioral issues in the workplace, reducing related risk, and improving supervisor skills.\u003C/p\u003E\n\n\u003Cp\u003EWe started operations in 1994 with the publication of  the FrontLine Supervisor newsletter. It is still one of our most popular products. It is an editable, reproducible, and e-mailable publication that educates managers, supervisors, and team leaders in how to use the organization\u0026#8217;s employee assistance program as a resource to help employees improve job performance. It also offers skills education to help supervisors become better managers of themselves and those they supervise. We have written over 780 questions and answers on the supervisor\u0026#8217;s role to date.\u003C/p\u003E\n\n\u003Cp\u003EWe offer publications, training products, free informational tools, ideas, and tips to support employers, and those who serve employers with the mission of helping employees remain happy, healthy, and productive.  Our goal is to also help employers reduce behavioral risk exposures and loss of productivity that flow from employee behaviors influenced by behavioral health conditions, stress, addictive disease and substance abuse, conflict at work, personal troubles, inappropriate and risky behavior, and reactions to events like violence, trauma, and loss.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}