{"name": "Work For Favor",
 "permalink": "work-for-favor",
 "crunchbase_url": "http://www.crunchbase.com/company/work-for-favor",
 "homepage_url": "http://workforfavor.com/",
 "blog_url": "http://workforfavor.com/Blog/",
 "blog_feed_url": "",
 "twitter_username": "workforfavor",
 "category_code": "advertising",
 "number_of_employees": null,
 "founded_year": 2010,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "free-promotion-web-advertising",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Free Business Blog Promotion",
 "created_at": "Sun Jun 05 11:23:39 UTC 2011",
 "updated_at": "Fri Jun 17 18:19:09 UTC 2011",
 "overview": "\u003Cp\u003EWorkForFavor.com is a great resource for promoting your blog if you are a person on a tight budget. The truth is it can help you promote your blog without spending any money at all. With a unique twist to social networking, WorkForFavor.com has been created to help business owners and bloggers to promote their business or blog site with little or no out of pocket expenses. By creating an environment on the internet where people exchange favors for established credits instead of cash, WorkForFavor.com is bringing new meaning to the concept of one hand washing the other.\u003C/p\u003E\n\n\u003Cp\u003EAn example of how WorkForFavor can become a successful marketing tool for the blogger at little or no out of pocket cost at all, consider the following possibility. Member A performs a service for Member B by writing a press release for Member B\u0026#8217;s blog site and receives a number of \u0026#8220;credits\u0026#8221; from Member B for completing this work. Member A now wants to increase exposure for his own blog site by having people post links to his blog site on other peoples Facebook pages, so he offers some of his credits to other members to compensate them for their trouble in back linking Member A\u0026#8217;s blog site on their Facebook pages. Through free exchange, members of WorkForFavor have taken actions to further promote their blog sites with no out of pocket expenses.\u003C/p\u003E\n\n\u003Cp\u003EThe possibilities for fruitful exchanges are endless in this \u0026#8220;I\u0026#8217;ll scratch your back if you scratch mine\u0026#8221; environment especially if the \u0026#8220;value\u0026#8221; of the work performed is determined by negotiating the number of credits each service is worth. This is the brave new world being offered by the WorkForFavor website and their novel concept to add a little twist to social networking. Visibility is a key to success on the internet, and any effort that will boost a blog site\u0026#8217;s ranking in one of the major search engines will ultimately pay big dividends. With the potential of tapping into thousands of \u0026#8220;friends\u0026#8221; that will help you along the way, a closer look at becoming a member of WorkForFavor.com is definitely worth a closer look.\u003C/p\u003E\n\n\u003Cp\u003ENobody is good at absolutely everything, so why not join up with a group of like minded people that have different skill sets and strengths that may be able to help you in one of your weaker areas? You can use an area of your strengths to accomplish some task for someone else that will allow you to earn credits to offer for getting a stubborn task completed by someone who is perhaps an expert in that field. This is part of the beauty of this new venue - you can go with your strengths and others can go with their strengths as well.\u003C/p\u003E\n\n\u003Cp\u003EAll of this is possible by deciding to become a member of WorkForFavor.com. By registering your blog you will obtain access to the full breadth of networking that WorkForFavor offers. This includes access to projects that you can undertake to start earning credits, gaining access to specialized groups, launching marketing and networking activities, and creating targeted local area networks if beneficial. Simply by being active in a group (posting comments, inviting friends, creating new topics), you can potentially earn credits for future use.\u003C/p\u003E\n\n\u003Cp\u003EMore than a marketing and promotion tool, WorkForFavor is also a new connection to another budding social network. With access to comment boards and possible membership in a variety of groups, one can develop relationships, exchange ideas, learn, and share with a wide variety of other people. It has much more to offer than just finding ways to do work in kind with others; it is an opportunity for future growth. With free and open exchanges, people can use their strengths and talents to help others and be in the position to receive help as well.\u003C/p\u003E\n\n\u003Cp\u003EWorkForFavor is really a risk free option to both engage in what could be the next powerful marketing tool for your blog and a chance to make new friends, share ideas, and grow along with the internet. By taking the next step and visiting their site at WorkForFavor.com, you can review their terms and conditions, see how the site is constructed, review their blog, and ask questions. If you are looking for like-minded people that want to take their blog to the next level and that understand the true potential of social networking and its potential as a marketing tool, you owe it to yourself to at least take a look to see if WorkForFavor is right for you.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       75],
      "assets/images/resized/0013/7751/137751v11-max-150x150.png"],
     [[250,
       125],
      "assets/images/resized/0013/7751/137751v11-max-250x250.png"],
     [[450,
       225],
      "assets/images/resized/0013/7751/137751v11-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}