{"name": "Work SitebCenter",
 "permalink": "work-sitebcenter",
 "crunchbase_url": "http://www.crunchbase.com/company/work-sitebcenter",
 "homepage_url": "http://www.worksitecenter.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "advertising",
 "number_of_employees": 250,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "scam, telemarketing, contractors",
 "alias_list": null,
 "email_address": "leads@skilledtradesmenonline.com",
 "phone_number": "617) 606-7052",
 "description": "telemarketing Scam",
 "created_at": "Mon Mar 25 01:31:13 UTC 2013",
 "updated_at": "Mon Mar 25 01:31:19 UTC 2013",
 "overview": "\u003Cp\u003EWork Site Center connects the local contractor, handyman, or trade \nservice provider with the projects and materials needed to sustain a reasonable addition to there monthly project list. If your new to the construction industry or an old school trade worker we have the team and tools you need to compliment your work flow to encourage positive stimulation in your service business. Call us today, or sign up. Either way you will get the boost you need to put more projects on your plate that match your skill set and service level.\nYou need the work. We need to have it completed. What better relationship in the construction business is there. With your help we can get the commercial, residential and bank foreclosure jobs completed in your area that we have scheduled out.\u003C/p\u003E\n\n\u003Cp\u003EOur full service buildings operations are located across America, supporting the work of project sites across the continent. This network of construction professionals rises to the challenges associated with our diverse buildings portfolio, bringing added value to every commercial, institutional, educational and residential project. We are known for larger projects, such as offices, and we also excel at smaller unique projects, such as renovations, restorations and an increasing margin of bank foreclosure work across the US.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "244 5th Avenue",
    "address2": "",
    "zip_code": "10001",
    "city": "new York ",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}