{"name": "Writerscash",
 "permalink": "writerscash",
 "crunchbase_url": "http://www.crunchbase.com/company/writerscash",
 "homepage_url": "http://writerscash.com",
 "blog_url": "http://facebook.com/writerscash",
 "blog_feed_url": "",
 "twitter_username": "the_Writerscash",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": 2008,
 "founded_month": 11,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "writing, freelance-writing, online-freelance-writing-opportunity, writing-job, job-for-writer",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "We offer freelance online writing jobs",
 "created_at": "Tue Apr 30 13:58:07 UTC 2013",
 "updated_at": "Mon May 06 05:18:56 UTC 2013",
 "overview": "\u003Cp\u003EWe offer online writing jobs for those who are ready to create different types of academic papers on different levels and topics. We are not afraid of any challenges concerning difficulty levels, intricate requirements or shortest deadlines possible.\u003C/p\u003E\n\n\u003Cp\u003EMission: We aim at helping those specialists, who have always wanted to become writers. Although, writing novels and magazine articles is not a piece of cake for everyone but people who lack practice in writing those feel very comfortable in the business of custom academic papers. Only topical knowledge is all that matters here! And who knows, maybe soon you could become a journalist due to a great experience gained from us. There are many examples of such an astonishing transformation!\u003C/p\u003E\n\n\u003Cp\u003EDescription: We are the service which offers professional writers an astonishing possibility to earn money without leaving home! Our service helps specialists to raise additional funds and even double a total month income by accomplishing students’ orders and helping them to get excellent grades. Those individuals with good writing skills can find our proposition advantageous and it certainly is! Helping students is and honorable, and, what is most importantly, profitable sort of a professional writing activity. \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}