{"name": "wufoo",
 "permalink": "wufoo-3",
 "crunchbase_url": "http://www.crunchbase.com/company/wufoo-3",
 "homepage_url": "http://www.wufoo.com/",
 "blog_url": "http://wufoo.com/blog/",
 "blog_feed_url": "",
 "twitter_username": "Wufoo",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": null,
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Mon Jun 27 19:37:20 UTC 2011",
 "updated_at": "Tue Apr 09 14:33:02 UTC 2013",
 "overview": "\u003Cp\u003EThe Mythology\u003C/p\u003E\n\n\u003Cp\u003EChris Campbell, Kevin Hale and Ryan Campbell founded Wufoo in 2006 on the belief that forms were the starting point for building anything useful on the web. The problem they saw was that one of the most efficient and used interfaces for collecting data, wasn’t very efficient to create.\u003C/p\u003E\n\n\u003Cp\u003EAfter presenting their solution to Y Combinator, a venture firm that specializes in funding very early stage startups, they received the initial seed funding needed to work on their idea full time and get their project off the ground.\u003C/p\u003E\n\n\u003Cp\u003EAfter 6 months of development, the three founders built Wufoo, a web application that removed the inefficiency and tediousness out of the form building process. Wufoo reduced what used to take days (if not weeks) by trained professionals into something that could be done by anyone in minutes.\u003C/p\u003E\n\n\u003Cp\u003EIn 2011, Wufoo was acquired by SurveyMonkey, the leader in web-based survey solutions, to help complement their growing suite of services to offer amazing data collections tools to their customers. We figured WITH OUR POWERS COMBINED\u0026#8230;you know the rest.\u003C/p\u003E\n\n\u003Cp\u003EThe Founders\u003C/p\u003E\n\n\u003Cp\u003EChris Campbell is obsessed with buzz marketing and customer evangelism. He’s not afraid to get out there in a gorilla suit and respond to every one of his emails as if it were from his mom. When he’s not resolving disputes between Kevin and Ryan, he’s our favorite PHP developer—having created the billing and payment systems to help us and our users get paid every time and on time. Chris’s favorite weapon is the broad sword.\u003C/p\u003E\n\n\u003Cp\u003EKevin Hale is responsible for safe guarding the user experience of our application and designing every pixel of Wufoo’s interface. As much as Kevin likes keeping things clean and reliable, he loves innovation. More than that, he loves asking for innovation in the middle of the night from his favorite two people, The Brothers Campbell. As a child, Kevin was the kid in class who ate a box of crayons for a dollar.\u003C/p\u003E\n\n\u003Cp\u003ERyan Campbell loves danger—and by danger, we mean databases. Ryan’s list of likes include Javascript, dragons, technical support and bug squashing. Dislikes include large insects, large food portions and large jelly beans. Ryan once dreamed he was a form for a day. People kept coming up to him and filling him out and clicking on his buttons. We’re not sure what Freud would have thought about that—we’re just glad he can’t get enough of this stuff during the day.\u003C/p\u003E\n\n\u003Cp\u003EThe Development Team\u003C/p\u003E\n\n\u003Cp\u003ETim Sabat serves as Wufoo’s Minister of Power. He’s addicted to code optimization, unit testing and all things object oriented. Tim fell in love with tech while doing desktop programming in the .NET framework. He also knows how to write in the \u0026#8216;M\u0026#8217; programming language\u0026#8211;an arcane environment you can look up, but should never ever use. Tim is also quite clever. One weekend, through a patented scientific formula, he used an Easy-Bake™ oven to make Easy-Mac™ and Easy-Cheese™ even easier.\u003C/p\u003E\n\n\u003Cp\u003EAlex Vazquez is Wufoo’s Chief Rainmaker and is responsible for coding miracles. He’s a certified configuration king steeped in the art of the dreaded Java class loader. Alex likes to sip lattes and theorize on the value of the array. Having recently broken free from his J2EE shackles, he faces the worst that PHP and JavaScript has to throw at him with a stone-faced calm and a steely-eyed glare. Alex is a man who’s been here, but hopes to get there.\u003C/p\u003E\n\n\u003Cp\u003EChris Coyier is Wufoo’s Lead Hucklebucker and second designer. He enjoys banjos, fiddles, and finding people who have never heard of Wufoo so he can tell them all about it. He is thinking about starting a horse and wagon medicine show and taking it on the road. Only instead of medicine it will be Wufoo and instead of a wagon and the road it will probably just be a blog. Chris learned everything he knows from The Andy Griffith Show.\u003C/p\u003E\n\n\u003Cp\u003EThe Support Team\u003C/p\u003E\n\n\u003Cp\u003EAndrew Gosnell remains first and foremost a gentleman, but he also serves as Wufoo\u0026#8217;s First Line of Defense. He\u0026#8217;s our support super master and odds are that if you ever run into an issue, problem or question about our services, you\u0026#8217;re going to have it resolved quickly and efficiently by this man. Andrew is a true secret agent and believes heavily in the transformative power of logic to overcome matters of the heart.\u003C/p\u003E\n\n\u003Cp\u003EJen Bjers is regarded as Wufoo\u0026#8217;s Ambassador of Infoomation. Away from the Support queue, Jen can be found challenging social norms and disrupting the \u0026#8220;natural order\u0026#8221; of things. Shamefully, Jen spends much time indulging in her guilty pleasure of reality television. As a product of the internet generation, she\u0026#8217;s developed a mild paranoia and rarely believes anything people say unless it can be validated by a Google search. On a human level, one of Jen\u0026#8217;s missions in life is to help end cancer forever and is an active advocate in the field.\u003C/p\u003E\n\n\u003Cp\u003EMike Wong is Wufoo\u0026#8217;s Go-To Guy, resident smile maker, voice actor, victim of an online fan club, and friend to babies and cats alike. Often accused of having the entire internet in his brain, Mike enjoys injecting bits of RSS-parsed knowledge into any situation. Mike is the buoy of integrity in a sea of cynical sycophants. If you\u0026#8217;ve got a problem, yo, he\u0026#8217;ll solve it.\u003C/p\u003E\n\n\u003Cp\u003EElaine Campbell is our company\u0026#8217;s Number Crusher. She\u0026#8217;s in charge of all of our finances and making the most out of our budgets and projections. You could say she plays both the gatekeeper and the keymaster and that means with her, there are no shortcuts and there are no safe havens. She\u0026#8217;s also deceptively strong as an ox. This means if you\u0026#8217;re looking for an evening of embarrassment, challenge her to a friendly arm wrestling match.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       52],
      "assets/images/resized/0024/9879/249879v1-max-150x150.png"],
     [[215,
       75],
      "assets/images/resized/0024/9879/249879v1-max-250x250.png"],
     [[215,
       75],
      "assets/images/resized/0024/9879/249879v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "SeamlessDocs (bizodo)",
      "permalink": "bizodo",
      "image":
       {"available_sizes":
         [[[150,
            39],
           "assets/images/resized/0022/2614/222614v1-max-150x150.png"],
          [[250,
            65],
           "assets/images/resized/0022/2614/222614v1-max-250x250.png"],
          [[250,
            65],
           "assets/images/resized/0022/2614/222614v1-max-450x450.png"]],
        "attribution": null}}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}