{"name": "Wuhan Bandao",
 "permalink": "wuhan-bandao",
 "crunchbase_url": "http://www.crunchbase.com/company/wuhan-bandao",
 "homepage_url": "http://www.indiamart.com/wuhanbandaobrickmachineequipment/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "wuhanbandaobrickmachineequipment@tradepassport.org",
 "phone_number": "+(86)-(27)-81715038",
 "description": "",
 "created_at": "Thu Apr 04 09:30:45 UTC 2013",
 "updated_at": "Thu Apr 04 09:30:48 UTC 2013",
 "overview": "\u003Cp\u003EYear of Establishment 2000, All our products are manufactured by using a combination of quality materials and innovative technology. Used in various construction applications, our products receive appreciation for its durability, high performance output and long service life. We can offer the products in specific configurations, according to the definite needs of our clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nOur company has a vast pool of talent in form of a comprehensive workforce. It has been developed by strategic workforce planning that assist us in placing right people in the right places.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nOur company has a spacious infrastructure unit spread over large area where these equipment are manufactured under the supervision of our experts. We have a team of skilled professionals supervising the entire manufacturing process of the products. These machines are delivered safely and timely in a specific time frame. Furthermore, customized solutions are offered as per the specifications of our clients.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nThe main intent of our company is to provide high-quality machines to our esteemed clients. Expert professionals of our team ensure that the products are in accordance with the industrial quality norms and standards. We carry out various quality tests on required parameters to provide high quality products. Furthermore, we fabricate these machines using high grade materials, such as aluminum copper, mild steel, core iron, hard steel and carbon steel.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nOwing to our rich industry experience, we offer complete customer satisfaction to our clients. The products offered by us are in accordance with the industrial quality standards. We conduct various quality tests on required parameters and offer them in a stipulated time frame. The machines are manufactured under the supervision of our well-versed professionals.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       88],
      "assets/images/resized/0024/7756/247756v2-max-150x150.jpg"],
     [[250,
       146],
      "assets/images/resized/0024/7756/247756v2-max-250x250.jpg"],
     [[450,
       264],
      "assets/images/resized/0024/7756/247756v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}