{"name": "www.helloecho.com",
 "permalink": "www-helloecho-com",
 "crunchbase_url": "http://www.crunchbase.com/company/www-helloecho-com",
 "homepage_url": "http://www.helloecho.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Wed Mar 02 19:07:16 UTC 2011",
 "updated_at": "Mon Mar 28 21:47:21 UTC 2011",
 "overview": "\u003Cp\u003EFans of up to 200 mid-level artists and lower tier musicians hosted by Echomusic who went to check out touring schedules on their websites in the last few days may have found a darkened site or just a note that the site was under reconstruction. What happened?  In a move that is under-reported in comparison to the recent MySpace Layoff of 400 employees, Ticketmaster-owned Echomusic, Nashville, dumped a whole bunch of artists with 30 days notice, took their content, and in effect cast them into the netherworld of cached pages and lost content. When Ticketmaster exercises this much control over an already-stressed and collapsing music industry without giving artists the ability to move their content seamlessly, well it is just bad behavior. The lawyers will have to sort out whether it is more.\u003C/p\u003E\n\n\u003Cp\u003EIn entertainment \u0026#8220;big news\u0026#8221; this week, Rupert Murdoch\u0026#8217;s News Corporation, which owns the social networking site MySpace, laid off 30 percent of its workforce in order to reestablish a \u0026#8220;start up\u0026#8221; culture, according to the New York Times. A little poking around this interesting story did not require the skills of an investigative reporter, but did reveal the so-far underreported and more important story about the hapless musicians left in the lurch by Echomusic. Some aren\u0026#8217;t so mid-level. Travis Tritt and Janet Jackson are two  of the casualties.\u003C/p\u003E\n\n\u003Cp\u003EKudos should go to the String Theory Media blog for breaking the Echo Music story. It appears that a full fledged investigation should take place, given this analysis:\u003C/p\u003E\n\n\u003Cp\u003EIndirectly, it\u0026#8217;s Irving Azoff\u0026#8217;s doing. Briefly, Azoff, one of the most powerful and wealthy managers in the history of rock (the Eagles are among his clients), recently presided over the merger of his company Front Line Management Group with Ticketmaster. Simultaneously, Ticketmaster has announced plans to merge with Live Nation, the concert promoter formerly known as Clear Channel\u0026#8217;s market-dominating SFX. In other words, Azoff is about to assume corporate control over the management of most of the biggest-grossing musicians in pop music, most of the venues in the U.S, and the titan of ticketing, the much loathed Ticketmaster. And for those who haven\u0026#8217;t been following Nashville music business news at all, echo was bought out by Ticketmaster in 2007 for a reported $25 million.\u003C/p\u003E\n\n\u003Cp\u003EThe little guys will be hurt big by this. I know. I do web design (don\u0026#8217;t contact me for help\u0026#8211;it is a labor of love) and maintenance for some friends in the biz as a hobby. Even if you volunteer, it is expensive and time-consuming. The artists caught in this mess (no one I know) have lost not only their start-up costs of up to $10,000, but also content and contacts\u0026#8211;and we all know the email contacts and personal information garnered by websites are priceless. But, it gets worse, according to String Theory: \u003C/p\u003E\n\n\u003Cp\u003EFurthermore, it was hard not to notice that while echo the local start-up of the late 1990s was a refuge and service provider for many independent, non-star-trajectory artists, the echo of recent years (especially post Ticketmaster) focused on big-time clients like Rascal Flatts, Kanye West and Alicia Keys. In a triumph of inequity, some 20-30 of Echo\u0026#8217;s largest clients are slated to remain in the echo system, managed from Los Angeles. Insiders say that it goes even deeper than that; when recent mega-clients signed on to echo, at least some had the  $20-30,000 fees for their web design and setup waived in exchange for an ongoing share of revenue generated through ticket and merchandise sales. This arrangement, according to sources, was not afforded to mid-level clients, who paid cash up front.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[76,
       35],
      "assets/images/resized/0012/4633/124633v1-max-150x150.png"],
     [[76,
       35],
      "assets/images/resized/0012/4633/124633v1-max-250x250.png"],
     [[76,
       35],
      "assets/images/resized/0012/4633/124633v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}