{"name": "www.Pressrate.com",
 "permalink": "www-pressrate-com",
 "crunchbase_url": "http://www.crunchbase.com/company/www-pressrate-com",
 "homepage_url": "http://www.Pressrate.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "web",
 "number_of_employees": null,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": 17,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Crowd Sourced News Aggregator",
 "created_at": "Fri Sep 07 02:19:42 UTC 2012",
 "updated_at": "Thu Sep 27 21:29:29 UTC 2012",
 "overview": "\u003Cp\u003EBefore the advent of journalism, those in power wrote the books about history. Their opinions of events have become what we came to accept as fact. These days we have famous syndicated journalists to provide us with their unique views about world happenings. This now is how history is written. If we step out of the proverbial “box” for a moment, we can see that history is repeating itself. Owners of these large media companies push their agendas through mediums they own, newspapers, television news programs, said journalists and the like. This way, they are forming public opinion and until now they have never been policed. Pressrate is a collaborative work in progress that allows the masses to categorize articles, vote up stories that they feel are noteworthy, effectively tailoring a newspapers front page. It allows users to save articles for future reference, rate the journalistic integrity of well known syndicated journalists and citizen journalists alike.\u003C/p\u003E\n\n\u003Cp\u003EOne game changing feature is our citizen journalism section where everyday people can anonymously submit newsworthy content and have it voted on, be it a blog post, image, youtube video etc. In these times, everyday citizens record newsworthy material using their point and shoot cameras or even cell phones to shoot video. Pressrate is an outlet or medium for the release of this information to the world. This allows a lone blogger or Pressrate user who submitted something the internet community feels is important or newsworthy (and voted up) to reach the front page with his/her post/content positioned right beside a story from a large news source. This provides a medium and opinion forming power to an average Joe who possesses facts or insight on any given event. For example, things that large media companies may not want you to see. One blatant example was the media blackout we saw in the first few weeks of the Occupy Wall Street movement.\u003C/p\u003E\n\n\u003Cp\u003EAlso, often times, comments left on news article pages that are critical of the author or source are immediately deleted. We hope to be a centralized location for user comments, opinions or insights written about news stories.  We vow and pledge to NEVER delete anything (regardless of how much we may disagree with it).\u003C/p\u003E\n\n\u003Cp\u003ESo many opinions, objectives and motives behind many article sources today necessitated a crowd sourced method of rating news articles, journalists and news sources to best assist the public when trying to decipher which of these to take seriously\u003C/p\u003E\n\n\u003Cp\u003E(Coming soon) We at Pressrate are currently developing an intuitive news aggregater. We learn which news topics and stories you like to read and use this data to present you with a section where you will find headlines that are sure to interest you.\u003C/p\u003E\n\n\u003Cp\u003EBy The Founder-\nAn anonymous soul - yearning to cut out the BS and get fed information in a proper manner minus the techno babble, personal opinions and agendas of those (currently) in charge.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": "Chief contributor",
    "person":
     {"first_name": "Gil",
      "last_name": "Rozenblatt",
      "permalink": "gil-rozenblatt",
      "image":
       {"available_sizes":
         [[[100,
            123],
           "assets/images/resized/0012/9942/129942v2-max-150x150.jpg"],
          [[100,
            123],
           "assets/images/resized/0012/9942/129942v2-max-250x250.jpg"],
          [[100,
            123],
           "assets/images/resized/0012/9942/129942v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "7 west 45th St NY NY 10036",
    "address2": "",
    "zip_code": "10036",
    "city": "NYC",
    "state_code": "NY",
    "country_code": "USA",
    "latitude": null,
    "longitude": null},
   {"description": "Programming",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "Rajkot",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null},
   {"description": "Main Contributors",
    "address1": "15 Tsabei Hanachal Street ",
    "address2": "Industrial Zone",
    "zip_code": "38800",
    "city": "Emek Hefer",
    "state_code": null,
    "country_code": "ISR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}