{"name": "X - Power Equipments",
 "permalink": "x-power-equipments",
 "crunchbase_url": "http://www.crunchbase.com/company/x-power-equipments",
 "homepage_url": "http://www.xpowerindia.net/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": null,
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "fabric-strength-tester, garment-machinery, hardness-testing-machines, x---power-equipments, indiamar",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "",
 "created_at": "Tue May 29 09:55:05 UTC 2012",
 "updated_at": "Tue Jun 05 05:26:16 UTC 2012",
 "overview": "\u003Cp\u003EX - Power Equipments\u003C/p\u003E\n\n\u003Cp\u003EEstablished in the year 2003, X Power Equipment has grown strength-by-strength to carve a niche for itself in the calibration equipment industry. We are manufacturing and exporting a range of textile testing instrument, garment machinery, calibration equipments and other quality control instruments for our customers. The wide assortment of our products encompasses garment machinery, hardness testing machines, fabric strength tester, light fastness tester, grey scales, laundro-meter, electric meter, visual colour matching cabinet, yarn tension meter, yarn tension meter with box, automatic wrap reel, gsm sample cutter package, lea strength tester, micro-processor color viewing booth, moisture analyser and wrap block.\u003C/p\u003E\n\n\u003Cp\u003EAs providers of advanced quality measuring equipment, we completely understand the value of technology in the manufacturing process. Spread over 1500 sq ft. area, our advanced machinery such as CNC sheet metal cutting machines and CAD/CAM facility form the technology backbone of our organization. With such infrastructure, we have the manufacturing flexibility and capacity to provide for all the machinery needs of our customers, from medium to large textile mills. \u003C/p\u003E\n\n\u003Cp\u003EEvery component and product manufactured by us goes through a stringent quality process backed by the sophisticated testing equipment. From the selection of raw materials, rigid metallurgical inspections to various stages of precision controlled machining operations; every product we manufacture is designed to meet up-to all relevant international standards.\u003C/p\u003E\n\n\u003Cp\u003ETelephone:  +(91)-(422)-6583448/ 6458526 \u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}