{"name": "Xamun",
 "permalink": "xamun",
 "crunchbase_url": "http://www.crunchbase.com/company/xamun",
 "homepage_url": "http://www.xamun.com",
 "blog_url": "http://blog.xamun.com",
 "blog_feed_url": "",
 "twitter_username": "xamun_team",
 "category_code": "software",
 "number_of_employees": 20,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "consulting, freelance, crm, pm, task-board, talent-management, marketplace, tool, productivity, timesheet, agile, scrum",
 "alias_list": null,
 "email_address": "team@xamun.com",
 "phone_number": "+6329144456",
 "description": "Virtual Business Enabler",
 "created_at": "Fri Jun 22 02:14:21 UTC 2012",
 "updated_at": "Mon Oct 08 13:27:09 UTC 2012",
 "overview": "\u003Cp\u003EXAMUN IS A VIRTUAL BUSINESS ENABLER ON THE CLOUD\nXamun makes setting up your virtual business a reality. Xamun is built for geographically-distributed teams in various companies from the creative and professional services industries. These include consulting, multimedia, and software development. A growing number of companies in these industries and type of team distribution are shifting to a virtual business setup, and they will most benefit from Xamun.\u003C/p\u003E\n\n\u003Cp\u003EXamun covers the management of projects, people and clients with its integrated online apps, it gives you access to freelance talent, new projects, and suppliers to grow your business globally and it enables intra- and inter-organization knowledge exchange and collaboration.\u003C/p\u003E\n\n\u003Cp\u003EWE BELIEVE:\n• That everyone deserves equal access to job opportunities and value to the services they offer - no matter where they are in the world.\u003C/p\u003E\n\n\u003Cp\u003E• That everyone deserves the freedom to choose the kind of work to do, the place to work at, the people to work with, and the way to carry out work – without necessarily compromising efficiency and quality.\u003C/p\u003E\n\n\u003Cp\u003E• That everyone deserves a seamless integration of life and work – that they should be able to deliver as professionals without sacrificing what matters most in their personal lives.\u003C/p\u003E\n\n\u003Cp\u003EWE ENVISION:\nA future where people are no longer bound by the constraints of the physical world. In this world, virtual businesses can have access to talents and clients from all over, and thrive because of web technologies. In this world, individuals from any location have the equal work opportunities and the same value attached to the services they provide.\u003C/p\u003E\n\n\u003Cp\u003EWE WORK:\nTo provide a complete virtual work environment where people \u0026amp; companies can come together , learn from each other,  produce world-class output, and succeed - while still having the ability to enjoy life as they wish.\u003C/p\u003E\n\n\u003Cp\u003EWHAT IS A VIRTUAL BUSINESS, ANYWAY?\nA virtual business uses electronic means to transact business, as opposed to a traditional brick and mortar business that relies on face-to-face transactions with physical documents and physical currency or credit. An example of such business is a website development company that has graphic artists, programmers, and writers from different places. They collaborate online to produce the output required by a client who can be from same country or from an offshore location.  Either a one-man-show or a small business, you can use Xamun expanding your offerings serving clients without the fixed costs typically associated with starting up a business or growing organically.\u003C/p\u003E\n\n\u003Cp\u003EXAMUN FOR SOFTWARE DEVELOPMENT\nThe Xamun Team has created  a comprehensive Kanban Board and Scrum Board specifically for distributed software development teams so they can implement agile methods. Team leaders can now better manage and groom product and sprint backlogs, as well as mitigate risks through constant coordination and collaboration with team members and clients. \u003C/p\u003E\n\n\u003Cp\u003EKey components of Xamun:\nXAMUN PRODUCTIVITY is a set of apps to help you manage your virtual business. It covers three core areas: project management, customer relationship management (CRM), and human resource management. From monitoring tasks, to scheduling time-offs, to profiling clients, Xamun Productivity is an integrated solution for virtual businesses that have teammates and clients from all over the world. \u003C/p\u003E\n\n\u003Cp\u003EXAMUN MARKETPLACE (free) is a platform which connects virtual businesses to freelancers, their clients, and their suppliers from all over the world. Xamun Marketplace enables freelancers to apply for short gigs posted by virtual businesses and collaborate on a project. It also allows virtual businesses to bid for new projects posted by clients, helping open new markets and develop innovative business models.\u003C/p\u003E\n\n\u003Cp\u003EXAMUN COMMUNITY (free) is a professional social network that brings together virtual businesses. With Xamun Groups, individuals  can come together and share ideas. Virtual businesses can build their internal groups to foster a collaborative work environment. It also serves as a channel for virtual businesses and individuals to build thought leadership in their own field.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       65],
      "assets/images/resized/0019/6714/196714v4-max-150x150.png"],
     [[250,
       109],
      "assets/images/resized/0019/6714/196714v4-max-250x250.png"],
     [[450,
       196],
      "assets/images/resized/0019/6714/196714v4-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Arup",
      "last_name": "Maity",
      "permalink": "arup-maity",
      "image":
       {"available_sizes":
         [[[138,
            150],
           "assets/images/resized/0026/2193/262193v2-max-150x150.jpg"],
          [[230,
            250],
           "assets/images/resized/0026/2193/262193v2-max-250x250.jpg"],
          [[392,
            426],
           "assets/images/resized/0026/2193/262193v2-max-450x450.jpg"]],
        "attribution": ""}}},
   {"is_past": false,
    "title": "Growth \u0026 Acqusition Manager",
    "person":
     {"first_name": "Benjamin",
      "last_name": "Puzon",
      "permalink": "benjamin-puzon",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [{"title": "Hosting ",
    "is_past": false,
    "provider":
     {"name": "Microsoft Azure",
      "permalink": "microsoft-azure",
      "image": null}}],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "35th Floor, The Orient Square",
    "address2": "Emerald Ave. Ortigas Center",
    "zip_code": "1605",
    "city": "Pasig",
    "state_code": null,
    "country_code": "PHL",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        74],
       "assets/images/resized/0021/2903/212903v2-max-150x150.jpg"],
      [[250,
        124],
       "assets/images/resized/0021/2903/212903v2-max-250x250.jpg"],
      [[450,
        224],
       "assets/images/resized/0021/2903/212903v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}