{"name": "XLhub",
 "permalink": "xlhub",
 "crunchbase_url": "http://www.crunchbase.com/company/xlhub",
 "homepage_url": "http://www.xlhub.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": null,
 "email_address": "",
 "phone_number": "",
 "description": "Excel Add-in  ",
 "created_at": "Tue May 01 17:51:19 UTC 2012",
 "updated_at": "Wed May 09 05:35:57 UTC 2012",
 "overview": "\u003Cp\u003EXLhub is a robust platform for developing multi-user applications that use Microsoft Excel at the front-end and SQL Server at the back-end. Our product roadmap continues the wizard-driven interface for delivering features for enhanced security, reporting and extensibility.\u003C/p\u003E\n\n\u003Cp\u003EThe need for XLhub became apparent during our many consulting engagements. As Business Intelligence consultants, we saw how extensively our clients were using Microsoft Excel. We helped our clients develop data warehouses and ETL solutions and we built custom solutions for forecasting, planning and consolidation. And in all of these, Microsoft Excel played an important role.\u003C/p\u003E\n\n\u003Cp\u003EHowever, the story of XLhub can’t be told without telling the story of Microsoft Performance Point Server.\u003C/p\u003E\n\n\u003Cp\u003EPerformance Point Server\nAround 2008, we got introduced to Microsoft Performance Point Server. Microsoft was bringing this product to market, and we decided to build a consulting practice based on Performance Point’s Planning Server (PPS). This product contained extensive extensions to Microsoft Excel, and we immersed ourselves in it. We got trained, created an in-house lab, did practice projects, and were soon working on our first implementation of PPS for a client. The product proved to be very cumbersome, and we encountered many challenges. Other consulting companies at the leading edge probably also experienced similar challenges, and soon thereafter, Microsoft discontinued the product.\u003C/p\u003E\n\n\u003Cp\u003EOut of this setback was born the idea for XLhub. Since we saw the value and potential of PPS, we decided to build a leaner, simpler solution that provided one of the most useful features of PPS: two-way integration to a database.\u003C/p\u003E\n\n\u003Cp\u003ERoadmap\nCurrently on Version 2, we have made XLhub a robust platform for developing multi-user applications that use Microsoft Excel at the front-end and SQL Server at the back-end. Our product roadmap continues the wizard-driven interface for delivering features for enhanced security, reporting and extensibility.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}