{"name": "Xtrer",
 "permalink": "xtrer",
 "crunchbase_url": "http://www.crunchbase.com/company/xtrer",
 "homepage_url": "http://www.xtrer.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "xtrer",
 "category_code": "mobile",
 "number_of_employees": 2,
 "founded_year": 1999,
 "founded_month": 9,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "mobile, charity, sms, premium-sms, mobile-content",
 "alias_list": null,
 "email_address": "simon@luttrell.asia",
 "phone_number": "+66822168662",
 "description": "Philanthropic mobile monetization",
 "created_at": "Thu Mar 11 14:46:02 UTC 2010",
 "updated_at": "Thu Mar 11 17:53:16 UTC 2010",
 "overview": "\u003Cp\u003EXTRER.com is a philanthropic, mobile applications platform for monetizing subscription text content, creating revenues for content owners and charitable causes. \u003C/p\u003E\n\n\u003Cp\u003EThe company is the brainchild of Simon Luttrell, a former rocket scientist who has been innovating in the mobile sector since 1999.  His previous ventures include Fonedata, (sold to Psion plc), Link77 (who developed the Artificial Intelligence SMS chat service called Natachata), and Mobile Crazy TV (an SMS-to-TV channel on the Sky satellite bouquet).\u003C/p\u003E\n\n\u003Cp\u003ESimon retired to live in rural Thailand several years ago, but his experiences in south-east Asia has prompted him to use his skills to develop a user-friendly solution for monetizing mobile content.  The XTRER platform offers \u0026#8216;channels\u0026#8217; of daily content to subscribers, at a rate chosen by the channel owner of between 10-34 cents per day.\u003C/p\u003E\n\n\u003Cp\u003EThe content channels could be a horoscope, weather report, share price, recipe tips, health advice - in short, any type of legal content that has a value to another person.  A new channel can be created within a few minutes using the online tool, with no technical knowledge required.\u003C/p\u003E\n\n\u003Cp\u003ESubscribers can join their chosen channel by simply texting the channel name to XTRER\u0026#8217;s short-code number.  Currently, the XTRER platform is live on 10 of the major mobile networks in the U.S., and is being rolled out in Australia, India and the UK within the next few weeks.\u003C/p\u003E\n\n\u003Cp\u003EChannel owners can donate a specified % of the revenue earned from their subscribers to a nominated charity, or for general charitable distribution.  The amount that they donate could be anything between 0% and 100% - it\u0026#8217;s totally up to them.  XTRER then adds a bonus by donating to these charities a figure between 10 and 100% of the profit that they earn from each channel subscriber.\u003C/p\u003E\n\n\u003Cp\u003EWhen a subscriber joins any content channel, in the first month of their subscription, Xtrer will donate 10% of the profits earned from the subscriber.  For every month that they stay subscribed, Xtrer will increase the donation by 10%.  After 10 months, Xtrer will be donating 100% of the profit that the company earns\u003C/p\u003E\n\n\u003Cp\u003EChannel owners submit their daily content messages to the XTRER platform by a variety of methods.  Some choose to log into their accounts from their desktop PCs, others choose to originate their content by text message, whilst others can automatically submit their content using the XTRER API.  In all cases, these content messages are carefully checked for inappropriate wording before being sent to the mobile phones of channel subscribers.  \u0026#8216;Spamming\u0026#8217; subscribers with multiple messages is not possible, since the XTRER platform restricts sending to a single message per day.\u003C/p\u003E\n\n\u003Cp\u003ESocial networks such as Twitter are an ideal source of authors for new channel content, so XTRER also offers the facility to \u0026#8216;pair\u0026#8217; an XTRER channel with a Twitter account.  One can then send out the daily content messages directly from the Twitter account. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0007/9976/79976v2-max-150x150.jpg"],
     [[248,
       248],
      "assets/images/resized/0007/9976/79976v2-max-250x250.jpg"],
     [[248,
       248],
      "assets/images/resized/0007/9976/79976v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Simon",
      "last_name": "Luttrell",
      "permalink": "simon-luttrell",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        91],
       "assets/images/resized/0007/9975/79975v2-max-150x150.jpg"],
      [[250,
        153],
       "assets/images/resized/0007/9975/79975v2-max-250x250.jpg"],
      [[450,
        275],
       "assets/images/resized/0007/9975/79975v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  []}