{"name": "Yabbedoo.com",
 "permalink": "yabbedoo-com",
 "crunchbase_url": "http://www.crunchbase.com/company/yabbedoo-com",
 "homepage_url": "http://yabbedoo.com/",
 "blog_url": "http://yabbedoo.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "yabbedoo",
 "category_code": "public_relations",
 "number_of_employees": null,
 "founded_year": 2011,
 "founded_month": 7,
 "founded_day": 11,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "travel, blog, deals, hotel, packages, concierge, offers, b2b, b2c, tourism",
 "alias_list": null,
 "email_address": "anatepsanu@gmail.com",
 "phone_number": "+41 (0)79 869 50 76",
 "description": "platform offering special deals",
 "created_at": "Tue Sep 11 12:29:00 UTC 2012",
 "updated_at": "Thu Dec 13 03:23:53 UTC 2012",
 "overview": "\u003Cp\u003EYabbedoo.com, which is a platform offering special deals, information and news dedicated to HoReCa companies in search of valuable advantages for their customers.\u003C/p\u003E\n\n\u003Cp\u003EYabbedoo aims higher and wants to disrupt the travel industry, which is indeed a big challenge, trying to build a different infrastructure by combining the best features of daily deal websites, geo location and traditional publicity. \u003C/p\u003E\n\n\u003Cp\u003EWe bring Places, Deals and Bookings together  \u003C/p\u003E\n\n\u003Cp\u003EUnlike the other travel platforms with similar concepts - some of which you already talked about, Trippy or TravelAvenue -  Yabbedoo comes to the travellers\u0026#8217; help by offering both information and deals available wherever they want to travel. \u003C/p\u003E\n\n\u003Cp\u003EWe do not focus only on the customers, as B2C, but mostly on the businesses - hotels, restaurants, spas, etc - which have the opportunity to become more visible and reachable. \u003C/p\u003E\n\n\u003Cp\u003EYabbedoo works directly with owners of the information and there’s no middle man for the travellers. Nowadays, we see that user’s information is the most trustworthy, but hotels and restaurants don\u0026#8217;t have the time to follow up or understand what users are doing. So, we give them a way to communicate. We are a tool that can equally help the business and the traveller. \u003C/p\u003E\n\n\u003Cp\u003EThis platform was started because small companies like small family owned hotels and restaurants asked us to find a way to be promoted without spending incredible amounts of money and time on advertising and follow ups. (It was started in Belgium, now based in Switzerland).\u003C/p\u003E\n\n\u003Cp\u003EMeanwhile we have grown seriously in the last year with a traveller database of 300.000+ subscribers and a blog with 30.000 readers a month. (You can see our real time statistics here: http://yabbedoo.com/statistics.aspx )\u003C/p\u003E\n\n\u003Cp\u003EWe Build Communication\u003C/p\u003E\n\n\u003Cp\u003EWe strive for continued improvement as we want to create, on our platform, a conversation between the users and the business.\u003C/p\u003E\n\n\u003Cp\u003EWhile other websites choose a sort of a one-way channel, Yabbedoo goes back to the basis of the business: communication. We give the companies the opportunity to reply to the reviews offered by the travellers or the locals on our website.\u003C/p\u003E\n\n\u003Cp\u003EAny comment, review or feedback added on the website will send immediately an automated notification to the business owner, so that they will have the chance to find out how people perceive them, what they’ve done well or what they can improve. We build an honest relation between the traveller and the business, which, lastly, will drive to a Win-Win situation.\u003C/p\u003E\n\n\u003Cp\u003EMain difference between other daily deal websites and our platform\u003C/p\u003E\n\n\u003Cul\u003E\n\u003Cli\u003E\u003Cp\u003EOn our platform you - the business - can manage your offers and information at any time. For instance, if tomorrow you want to organise a special event, special reduction, you only have to post it on our platform and travellers, hotels and Travel Agencies will be notified about it.  Our professional members prepare guides for the travellers, so you can get promotions in places you’ve never thought of.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EThe members of our website can choose their reduction (or no reduction).  We do not ask for a minimum reduction.  Sometimes it is enough to announce an event instead of giving reduction to attract clients or to become visible.\u003C/p\u003E\u003C/li\u003E\n\u003Cli\u003E\u003Cp\u003EInstead of promoting your venue alone, on our platform you promote your venue as well as packages, events, deals etc. e.g.  You will see various hotels with different packages\u003C/p\u003E\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EPayment\u003C/p\u003E\n\n\u003Cp\u003EThe Yabbedoo platform gives the companies a serious advantage - in terms of sales and marketing - against their competitors and we expect it to be very profitable for them as we take 0% commission and a membership is only €95 / year.\u003C/p\u003E\n\n\u003Cp\u003EYou probably ask yourself why the payment? Well, that 95 was a calculation of the distance of the moon over the average numbers of beers travellers drink between 14.05 and +6.01 J\u003C/p\u003E\n\n\u003Cp\u003EActually, we believe this small amount is acceptable for any tourist related business, and by asking it from our members, they will be obliged to follow up. Once the businesses decide to pay their membership, there\u0026#8217;s a better guarantee they will continue to use the platform as a paid service. Additionally, Yabbedoo is already making profit.\u003C/p\u003E\n\n\u003Cp\u003EE.g.  Many of our direct competitors show only the address and the picture of their venue, while we give the companies the feature to add their deals, specials, information (like special events, days, or special announcements) as they like.\u003C/p\u003E\n\n\u003Cp\u003EAt Yabbedoo we believe that visual elements are very important to our clients, but the address ONLY is not enough to catch the traveller or the local\u0026#8217;s eye, as our platform is dedicated to travelers and locals at the same time. What will trigger best the attention will be the special offers the companies have and share on our platform.  \u003C/p\u003E\n\n\u003Cp\u003EExtra Features of Yabbedoo\u003C/p\u003E\n\n\u003Cp\u003EOur members can use this data in a Concierge App, which represents a new way for businesses to guide their guests. For a small extra price of €150 / year, they can offer this for free as a customized mobile app to their guests. In this way, they’d be able to see when and by whom the application is being used. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       150],
      "assets/images/resized/0022/4896/224896v2-max-150x150.jpg"],
     [[180,
       180],
      "assets/images/resized/0022/4896/224896v2-max-250x250.jpg"],
     [[180,
       180],
      "assets/images/resized/0022/4896/224896v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [{"name": "Yabbedoo Mobile Concierge App",
    "permalink": "yabbedoo-mobile-concierge-app",
    "image": null},
   {"name": "Yabbedoo Premium",
    "permalink": "yabbedoo-premium",
    "image": null}],
 "relationships":
  [{"is_past": false,
    "title": "CEO / Founder",
    "person":
     {"first_name": "Frederik",
      "last_name": "Van Lierde",
      "permalink": "frederik-van-lierde",
      "image":
       {"available_sizes":
         [[[110,
            150],
           "assets/images/resized/0016/3501/163501v2-max-150x150.jpg"],
          [[183,
            250],
           "assets/images/resized/0016/3501/163501v2-max-250x250.jpg"],
          [[200,
            272],
           "assets/images/resized/0016/3501/163501v2-max-450x450.jpg"]],
        "attribution": ""}}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Yabbedoo HQ",
    "address1": "rue pont neuf 10",
    "address2": "",
    "zip_code": "1227",
    "city": "Geneva",
    "state_code": null,
    "country_code": "CHE",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.startupticker.ch/news/september-2012/swiss-start-up-challenges-booking-portals.aspx?tagid=",
    "title": "Swiss start-up challenges booking portals"},
   {"external_url": "http://www.tnooz.com/2012/08/29/tlabs/yabbedoo-seeks-to-disrupt-with-local-deals-and-travel-news-service/",
    "title": "Yabbedoo seeks to disrupt with local deals and travel news service Read more at http://www.tnooz.com/2012/08/29/tlabs/yabbedoo-seeks-to-disrupt-with-local-deals-and-travel-news-service/#52bflxtfskzwo8q6.99"}]}