{"name": "Yaqsh Diamond Pvt Ltd",
 "permalink": "yaqsh-diamond-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/yaqsh-diamond-pvt-ltd",
 "homepage_url": "https://www.yaqsh.com/",
 "blog_url": "http://blog.yaqsh.com/",
 "blog_feed_url": "",
 "twitter_username": "YaqshDiamond",
 "category_code": "ecommerce",
 "number_of_employees": 50,
 "founded_year": 2013,
 "founded_month": 1,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "diamond-rings, diamond-pendant, loose-diamonds, diamond-bracelets, diamond-earrings, buy-diamond-jewellery-in-india, online-diamond-jewellery, buy-diamond-jewellery-online-in-india, best-diamond-jewellery-in-india, buy-loose-diamonds-in-india, certified-l",
 "alias_list": null,
 "email_address": "diamondonline46@gmail.com",
 "phone_number": "9990935100",
 "description": "The #1 online diamond shopping store in ",
 "created_at": "Tue Feb 19 07:19:20 UTC 2013",
 "updated_at": "Mon Jun 03 10:31:14 UTC 2013",
 "overview": "\u003Cp\u003EDon’t Wait For A Diamond Jewellery Exclusive Collection – Get It From Yaqsh.Com\u003C/p\u003E\n\n\u003Cp\u003EIt is a well known fact that buying a diamond jewel from a diamond jewellery exclusive collection is very much similar to investing. But the question in the minds of many people is that, whether we should go and buy the diamond jewel now or shall we wait for some more time. If you go and ask this question to any one of the experts who have more experience with respect to diamonds, he or she will definitely ask you to go for the diamond purchase from a diamond jewellery exclusive collection now itself. Even though there are a lot of reasons for this, the most important reason is as follows. It is an obvious fact that the cost of living is increasing day by day and the cost of all the articles, especially jewels are increasing gradually. So, the jewel that is costing 10000 rupees today will surely cost more in future and there is no possibility for the cost of the jewels to be reduced. So we should make use of the opportunity that is available for you. If you want to buy any diamond jewel, then check for any diamond jewellery exclusive collection present in the famous web sites like Yaqsh.com and other similar web sites like that. Once you find a great jewellery shop that has an exclusive collection of diamond jewels, you can go ahead and make your shopping not waiting for the cost to come down. But before making your purchase, prepare an estimate of how much you can spend for the diamond jewel and then make your purchase. You should also consider the shape, and clarity of the jewel that you are going to buy. The color of the diamond is also very important in determining the cost of that jewel that you are going to buy.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "YAQSH DIAMOND PVT LTD ",
    "address1": "S-29/20, DLF Phase 3",
    "address2": "Nr St. Stephans Hospital, Gurgaon",
    "zip_code": "122002 ",
    "city": "Gurgaon ",
    "state_code": null,
    "country_code": "IND",
    "latitude": 28.4934896,
    "longitude": 77.1039288}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "https://www.yaqsh.com/why-yaqsh.aspx",
    "title": "About yaqsh"}]}