{"name": "YardWorkerz",
 "permalink": "yardworkerz",
 "crunchbase_url": "http://www.crunchbase.com/company/yardworkerz",
 "homepage_url": "http://www.yardworkerz.com",
 "blog_url": "http://www.yardworkerz.com",
 "blog_feed_url": "http://www.yardworkerz.com",
 "twitter_username": null,
 "category_code": "ecommerce",
 "number_of_employees": 1,
 "founded_year": 2009,
 "founded_month": 2,
 "founded_day": 15,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "landscaping-yards, lawn-maintenance, lawn-and-garden-services, landscape-jobs, lawn-services, housekeeping-services, lawn-care-services, part-time-jobs-for-teens, manual-labor-help, manual-labor, yard-work-help, yard-working-social-network, landscaping",
 "alias_list": null,
 "email_address": "chadhrapmann15@hotmail.com",
 "phone_number": "9857051434",
 "description": "Landscaping social network",
 "created_at": "Tue Feb 24 22:58:09 UTC 2009",
 "updated_at": "Tue Mar 31 19:28:24 UTC 2009",
 "overview": "\u003Cp\u003EYardWorkerz is a job portal for young adults trying to find weekend or after-school job.\u003C/p\u003E\n\n\u003Cp\u003ESo many young men and women look for house/yard work to do in their free time to make some extra money but have trouble finding people in their community to do jobs for. On the other hand, adults or home owners sometimes need help around the house doing a variety of services and have a hard time trying to find someone in their neighborhood or community to help them get the job done so the job is usually put off for some time. They see the difficulty that homeowners have trying to find affordable help for a variety of household/yard services such as renovations, cleaning, yard work, painting, lifting materials, etc. Yardworkerz was created to bring these two groups of people from the community together more easily. We hope to provide affordable well-paying jobs while providing quality labor and services to anyone in need of a little bit of extra help.\u003C/p\u003E\n\n\u003Cp\u003EAt Yardworkerz.com, they give adults/teenagers the opportunity to make money and provide services to those in need or without help. Profiles of each member will be detailed with the type of work they are looking for, the payable wage, flexible hours, references of the workers, contact information, etc. In one case, a homeowner can look on the website and find an eligible candidate in their area to work for the requirements they are looking for. Vice versa, a member looking for a job can search for different homeowners in their area needing help in their valid area and can contact them to set up a meeting. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       46],
      "assets/images/resized/0003/6869/36869v2-max-150x150.png"],
     [[207,
       64],
      "assets/images/resized/0003/6869/36869v2-max-250x250.png"],
     [[207,
       64],
      "assets/images/resized/0003/6869/36869v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}