{"name": "YashIndustrie",
 "permalink": "yashindustrie",
 "crunchbase_url": "http://www.crunchbase.com/company/yashindustrie",
 "homepage_url": "http://www.indiamart.com/yashindustries-nashik/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "electric-sheet-metal-part, textile-machinery-press-component, brass-sheet-metal-component, fabricated-sheet-metal-component",
 "alias_list": null,
 "email_address": "yashindustries-nashik@tradepassport.org",
 "phone_number": "9422248563",
 "description": "Manufacturing and supplying a wide range",
 "created_at": "Thu Apr 04 13:30:47 UTC 2013",
 "updated_at": "Thu Apr 04 13:30:51 UTC 2013",
 "overview": "\u003Cp\u003EEstablished in the year 2005, we, “Yash Industries”, are a prominent industry engaged in manufacturing and supplying a comprehensive range of Sheet Metal Press Parts, Rubberised Cork Gasket, Industrial Gasket, Machined Parts and Cork Sheet. Offered products in this range are Electric Sheet Metal Part, Textile Machinery Press Component, Brass Sheet Metal Component, Fabricated Sheet Metal Component and many more. \u003C/p\u003E\n\n\u003Cp\u003EOur Team:\nWe are bolstered by exceptionally talented and qualified professionals. Owing to their support, we have been able to bring forth the best-in-class range of Sheet Metal Press Parts, Rubberised Cork Gasket, Industrial Gasket, Machined Parts and Cork Sheet.\u003C/p\u003E\n\n\u003Cp\u003EOur Quality Assurance:\nWe are an ISO 9001:2008 certified company. Being a quality driven organization, we make sure to deliver a quality-assured range of Sheet Metal Press Parts, Rubberised Cork Gasket, Industrial Gasket, Machined Parts and Cork Sheet to our clients. Offered products are manufactured using optimum quality raw material, procured from some of the worthy vendors of the industry.  \u003C/p\u003E\n\n\u003Cp\u003EResearch \u0026amp; Development:\nOur company has developed a sophisticated research and development unit, which is handled by our specialized professionals. Presently, these professionals are working on Alternative Renewable Source of Energy. Apart from this, our organization sees a mounting perspective in this domain as well as for further studies about the concerned field, we sent our representatives to Germany.\u003C/p\u003E\n\n\u003Cp\u003EOur Infrastructure:\nWe have a state-of-the-art infrastructure, spreading across a vast area. Well-equipped with the latest technology and advanced machinery, this infrastructure has been segregated properly into a number of departments in order to accelerate and carry out the production process in a smooth and streamlined manner. \u003C/p\u003E\n\n\u003Cp\u003EOur Products:\nSheet Metal Press Parts, Rubberised Cork Gasket, Industrial Gasket, Machined Parts and Cork Sheet. Offered products in this range are Electric Sheet Metal Part, Textile Machinery Press Component, Brass Sheet Metal Component, Fabricated Sheet Metal Component and many more. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       128],
      "assets/images/resized/0024/7928/247928v2-max-150x150.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7928/247928v2-max-250x250.jpg"],
     [[205,
       175],
      "assets/images/resized/0024/7928/247928v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}