{"name": "YatriCab",
 "permalink": "yatricab",
 "crunchbase_url": "http://www.crunchbase.com/company/yatricab",
 "homepage_url": "http://www.yatricab.com",
 "blog_url": "http://yatricab.blogspot.com",
 "blog_feed_url": "",
 "twitter_username": "yatricab",
 "category_code": "ecommerce",
 "number_of_employees": 5,
 "founded_year": 2011,
 "founded_month": 10,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "book-online-cabs, book-online-radio-taxi, airport-pick-n-drop, delhi-sight-seeing-cabs, outstation-cabs, book-auto-rickshaw-online, lowest-price-cabs-in-delhi-ncr, online-cab-booking, instant-cabs",
 "alias_list": null,
 "email_address": "care@yatricab.com",
 "phone_number": "9555322273",
 "description": "One Stop online portal for cab requiremn",
 "created_at": "Mon Apr 16 15:13:34 UTC 2012",
 "updated_at": "Thu Apr 19 01:46:53 UTC 2012",
 "overview": "\u003Cp\u003EYatriCab- is a One-Stop online portal for all your cab requirements.\nwhether it be a radio taxi, waana have fun with family in weekend? book delhi soght seeing cabs at the lowest prices with YatriCab.com, airport tranfers, Outstation cabs etc..\u003C/p\u003E\n\n\u003Cp\u003EYatriCab.com is a business unit of Krishna Bharti Group (KB Group); Delhi’s first online travel company, whose mission is to provide reliable Cabs, timely Cabs, safe Radio Taxis and Auto Rickshaw services. YatriCab also provides Taxis for outstation Bookings at the lowest \u0026amp; the cheapest prices. YatriCab.com provides complete information, pricing, availability and booking facility for local Radio Taxi, as well as Outstation Cabs \u0026amp; Auto Rickshaw services using the advanced technology to facilitate the travel of individuals in and around the Delhi and NCR area.YatriCab.com is the first company in Delhi \u0026amp; NCR who took initiative to bring all the Unorganized Auto-Rickshaw under one organized roof.\u003C/p\u003E\n\n\u003Cp\u003ENow Travelling in Delhi is hassle free \u0026amp; much safer as a passenger can book a Radio Taxi \u0026amp; an Auto Rickshaw in 4 simple ways i.e.\u003C/p\u003E\n\n\u003Cp\u003EBy Login to our website where a customer can book a cab by comparing the rates \u0026amp; vehicle type from our fleet of cabs by his own choice.\nBy dialing our customer care executive number - 011 64647779/ (+91) 9555322273, our trained customer care executive will help the customer to book his/her desired cabs/Auto Rickshaw at the cheapest rate \u0026amp; in very short span of time.\nBy sending an SMS \u0026lt;CAB\u0026gt; to book a Radio Taxi for Delhi \u0026amp; NCR,or \u0026lt;Out station CAB\u0026gt; to travel outside the Delhi Region, and \u0026lt;AUTO\u0026gt; to book an Auto Rickshaw for travelling in Delhi \u0026amp; NCR to +919555322273.\nBy hailing the Auto Rickshaw or Cab. If you are struggling on the road to get an Auto Rickshaw or a Cab simply book it on the Spot by hailing if you find the YatriCab Auto Rickshaw/ YatriCab vehicles empty.\nThe company\u0026#8217;s services show that we are an innovative, forward thinking company that recognizes the need to move with ever-changing customer needs. The Company’s emphasis is on providing the right cab \u0026amp; Auto Rickshaw to the right customers at the right time.\u003C/p\u003E\n\n\u003Cp\u003EOur service policy towards the customers makes us think that we can only grow if our customers will be satisfied. Explore our services and give us a chance to delight you.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       57],
      "assets/images/resized/0018/4419/184419v2-max-150x150.jpg"],
     [[250,
       96],
      "assets/images/resized/0018/4419/184419v2-max-250x250.jpg"],
     [[450,
       172],
      "assets/images/resized/0018/4419/184419v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "YatriCab",
    "address1": "Sant Nagar",
    "address2": "Burari",
    "zip_code": "110084",
    "city": "New Delhi",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}