{"name": "YEKTA Design \u0026 Drafting",
 "permalink": "yekta-design-drafting",
 "crunchbase_url": "http://www.crunchbase.com/company/yekta-design-drafting",
 "homepage_url": "http://www.yekta.ca",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "consulting",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": 1,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "autocad-and-drafting",
 "alias_list": null,
 "email_address": "emad@yekta.ca",
 "phone_number": "",
 "description": "Architectural Design and Drafting",
 "created_at": "Thu May 21 04:16:41 UTC 2009",
 "updated_at": "Fri Aug 06 20:34:50 UTC 2010",
 "overview": "\u003Cp\u003Eabout us\u003C/p\u003E\n\n\u003Cp\u003EFor over twenty years the business owner has been assisting a wide variety of customers with their design \u0026amp; drafting needs. We offer outstanding quality, assistance and pricing. All projects/drawings have always been accurately, efficiently and timely completed.Our company provides CAD drafting services in Lower Mainland area in British Columbia for the following firms:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Architectural Firms\n* Structural  Firms\n* Contracting Firms\n* Decorators\n* Interior Designers\n* Renovators\n* Real Estate agents\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003Eservices\u003C/p\u003E\n\n\u003Cp\u003E(outsourcing - a new strategy)\nFor today\u0026#8217;s technical firms, running effective and cost efficient CAD departments can be a real challenge.\nOutsourcing is the ideal way to meet that challenge. We are a complete CAD services company, staffed by experienced professionals with a strong background in engineering, architecture and CAD.  We reduce your administrative load, while increasing your control over drawing management. We have skills that meet your most demanding CAD challenges at a very affordable price.  Our firm provides the following services:\u003C/p\u003E\n\n\u003Cpre\u003E\u003Ccode\u003E* Architectural (CAD) Drafting\n* Structural (CAD) Drafting\n* Conversion of Hand Drawings to (CAD) Files\n* Shop drawings\n* Presentation drawings\n* Working drawings\n\u003C/code\u003E\u003C/pre\u003E\n\n\u003Cp\u003Eprofile\u003C/p\u003E\n\n\u003Cp\u003EEmad Yekta is the owner /operator of the business. He is an architectural technologist with twenty years work experience both locally and internationally. He has solid experience in computerized and manual drafting plus organizational skills acquired from handling  intensive workload on large-scale projects. He demonstrated high technical ability, precision and excellent teamwork developed through coordination  with multilevel personnel from various disciplines. His knowledge of BC building codes, standards and bylaws, space requirement,  site requirements, technical documents and reports ensure the highest standard of work.\u003C/p\u003E\n\n\u003Cp\u003Eprojects\u003C/p\u003E\n\n\u003Cp\u003EThe company has the design and drafting experience in Commercial, Residential, Industrial and Institutional Buildings.\nOur drafting expertise is ready to assist you. Your information is safe; we will enter into a confidentiality agreement at your request. Describe your project in detail. Once we receive all of the information for your project we will send you a fixed quote with a time frame. Approve the quote and time frame and make any deposit payments (typically 25% of the total) and we begin your project immediately. Once preliminary drawings are completed we will submit them for approval and make any changes if needed before preparing the final drawings. Make any final payments due. We will do (minor) corrections at no additional cost to you. Please contact us if you have any further questions. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       17],
      "assets/images/resized/0004/5238/45238v1-max-150x150.png"],
     [[250,
       28],
      "assets/images/resized/0004/5238/45238v1-max-250x250.png"],
     [[408,
       47],
      "assets/images/resized/0004/5238/45238v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        100],
       "assets/images/resized/0009/6364/96364v2-max-150x150.jpg"],
      [[250,
        166],
       "assets/images/resized/0009/6364/96364v2-max-250x250.jpg"],
      [[450,
        300],
       "assets/images/resized/0009/6364/96364v2-max-450x450.jpg"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.yekta.ca",
    "title": ""}]}