{"name": "YogaBlue",
 "permalink": "yogablue",
 "crunchbase_url": "http://www.crunchbase.com/company/yogablue",
 "homepage_url": "http://www.yogablue.com/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "other",
 "number_of_employees": 100,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "yoga-class, yoga-classes-at-pasadena, yoga-training, learn-yoga-in-pasadena",
 "alias_list": null,
 "email_address": "webmaster@yogablue.com",
 "phone_number": "626-243-1814",
 "description": "YogaBlue - Yoga Classes at Pasadena, CA.",
 "created_at": "Thu Nov 03 07:52:33 UTC 2011",
 "updated_at": "Tue Nov 29 20:53:04 UTC 2011",
 "overview": "\u003Cp\u003EAt YogaBlue we believe in focusing on our local community, making people feel connected and giving them a sense of purpose and belonging. We strive to provide excellent service and a memorable experience by focusing on the individual, communicating on a first name basis and making a lifelong connection. Promoting the philosophies of yoga, we believe in developing trust and focusing on one\u0026#8217;s overall sense of wellbeing. This includes balancing one\u0026#8217;s physical health, mental awareness and spiritual guidance.\u003C/p\u003E\n\n\u003Cp\u003EOur studios are a safe haven and refuge from the outside world. We have a genuine compassion for each student\u0026#8217;s welfare and focus on being a consistent variable in a very inconsistent world. We provide an escape from these outside influences and focus on creating a grounded sanctuary where people can interact with one another freely.\u003C/p\u003E\n\n\u003Cp\u003EThe name YogaBlue is derived from the fifth chakra, which is considered a force center in the body. This chakra focuses on speech, communication and truth. Known as a relaxing color, blue has a soothing effect on the central nervous system and thyroid. Balancing the chakra helps increase wisdom and clarity, allowing enhanced communication and self-expression.\u003C/p\u003E\n\n\u003Cp\u003EYogaBlue is committed to teaching yoga to everyone, regardless of age or gender. We focus on individual growth, exploration and seek to allow students to become more at ease and \u0026#8220;one\u0026#8221; with their bodies.\u003C/p\u003E\n\n\u003Cp\u003EAll our instructors are unique in their teaching principles and we provide a diverse schedule of classes ranging from Yoga Basics, Restorative, Yang/Yin, Therapy with Breath Work, Prenatal, Postnatal, Heat Flow and Detox. Our studios maintain a temperature between 75 to 90 degrees, at the discretion of each teacher and class, allowing students to relax in the warmth and comfort of this restorative discipline.\u003C/p\u003E\n\n\u003Cp\u003EYogaBlue focuses on balancing strength, awareness, peace and health. This comforting atmosphere helps celebrate and honor inner strength through the practice of yoga, which helps restore the body and calm the mind.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       39],
      "assets/images/resized/0016/4467/164467v1-max-150x150.png"],
     [[250,
       66],
      "assets/images/resized/0016/4467/164467v1-max-250x250.png"],
     [[287,
       76],
      "assets/images/resized/0016/4467/164467v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "YogaBlue",
    "address1": "202 S. Lake Avenue",
    "address2": "Unit 250",
    "zip_code": "91101",
    "city": "Pasadena",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        87],
       "assets/images/resized/0016/4468/164468v1-max-150x150.png"],
      [[250,
        145],
       "assets/images/resized/0016/4468/164468v1-max-250x250.png"],
      [[450,
        261],
       "assets/images/resized/0016/4468/164468v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}