{"name": "York Print Company",
 "permalink": "york-print-company",
 "crunchbase_url": "http://www.crunchbase.com/company/york-print-company",
 "homepage_url": "http://www.yorkprintcompany.co.uk",
 "blog_url": "http://yorkprintcompany.co.uk/Blog/",
 "blog_feed_url": "",
 "twitter_username": "yorkprint",
 "category_code": "other",
 "number_of_employees": 3,
 "founded_year": 2004,
 "founded_month": 4,
 "founded_day": 5,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "printing-york, graphic-design-york, york-graphic-design, digital-print-york, same-day-print-york",
 "alias_list": null,
 "email_address": "info@yorkprintcompany.co.uk",
 "phone_number": "01904 623399",
 "description": "Design \u0026 Print in York",
 "created_at": "Thu Dec 20 10:10:09 UTC 2012",
 "updated_at": "Fri Dec 21 06:50:27 UTC 2012",
 "overview": "\u003Cp\u003EYork Print Company - We aim to provide you with the lowest priced, fastest turn around printing experience in York\u003C/p\u003E\n\n\u003Cp\u003EOur digital setup offers the option of print while you wait service, whilst for high-volume orders our online service is economical and delivered free of charge.\u003C/p\u003E\n\n\u003Cp\u003EHere at York Print Company we are not just a faceless company offering low print prices. Call in or get in touch to see the high quality service we are offering you, not to mention some of the best pricing on the internet. We are always happy to talk about your print and design needs.\nCall from 9am-5pm Monday to Friday and talk to us in person – we love to engage with our customers so pick the phone up and chat to us.\u003C/p\u003E\n\n\u003Cp\u003EWe can help with that awkward print ready file  dilemma, or our set design costs can be added to your print order so you can budget for your whole print job (if you have your artwork but need your file making print ready just ask.\nWe do get a lot of weird, wacky and genuinely wonderful requests and we can honestly say we will do our best to serve your needs. For example, we had an order for 2500 letterheads; this takes 3-5 working days depending on how busy our press is running. However, the customer was down to the last handful of letterheads and was more than willing to pay a lot more to a rival company who could get there letterheads to them within 2 working days. We told the customer we could do 50 letterheads and they would be ready that very day, and when the main order was ready they would receive the rest.  The outcome of this situation… One overwhelmed customer with a big box of letterheads at a great price. \nWe offer all this at online prices. We are all in favor of the customer being our top priority.\nWe don’t charge for that extra bit of service that you need and expect.\nContact:\nWe are always happy to talk about your print and design needs.\nCall from 9am-5pm Monday to Friday and talk to us in person – we love to engage with our customers so pick the phone up and chat to us.\nWe are a very hard working local company that is trying to give the very best to our customers so it wouldn’t be unusual to see one of us in the shop on a weekend answering calls, printing jobs or even giving email advice from an iPhone while we are watching the football.\nSo there’s always a chance you can catch us when everyone else is finished for the day.\nContact number: 01904 623399\u003Cbr/\u003E\nFor design or artwork issues Email: design@yorkprintcompany.co.uk\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        109],
       "assets/images/resized/0022/6295/226295v2-max-150x150.png"],
      [[250,
        182],
       "assets/images/resized/0022/6295/226295v2-max-250x250.png"],
      [[450,
        329],
       "assets/images/resized/0022/6295/226295v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "http://www.freeindex.co.uk/york-printing.htm",
    "title": "testimonials"}]}