{"name": "Young Hollywood",
 "permalink": "young-hollywood",
 "crunchbase_url": "http://www.crunchbase.com/company/young-hollywood",
 "homepage_url": "http://www.younghollywood.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "YoungHollywood",
 "category_code": "other",
 "number_of_employees": null,
 "founded_year": 2007,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "entertainment, celebrity, sport, music, film",
 "alias_list": null,
 "email_address": "info@younghollywood.com",
 "phone_number": "",
 "description": "It's Not About Age--It's About Attitude!",
 "created_at": "Sun May 23 03:10:04 UTC 2010",
 "updated_at": "Tue Oct 09 04:35:57 UTC 2012",
 "overview": "\u003Cp\u003EFounded in 2007 by R.J. Williams, Young Hollywood is a next generation multimedia entertainment company that creates and distributes celebrity and lifestyle programming globally; owns and operates several leading entertainment websites, including its flagship site, YoungHollywood.com; licenses the Young Hollywood trademark internationally for a range of consumer products and services; and works closely with some of the most well respected brands in the advertising world to help find innovative ways to touch consumers through one-of-a-kind brand integrations and viral marketing campaigns.\u003C/p\u003E\n\n\u003Cp\u003EWith key industry relationships and insider knowledge, Young Hollywood receives exclusive access into the world of Celebrity through a unique approach unlike any other media outlet.  Young Hollywood has become one of the most distinct and recognizable brand names, as celebrities and the entertainment community trust and embrace Young Hollywood as the first anti-tabloid voice in the digital world that offers a safe, celebrity-friendly environment.  The company’s innovative reputation is also evident in its creation of a first-of-its-kind custom broadcast studio located permanently inside the Four Seasons Hotel Los Angeles at Beverly Hills.  Young Hollywood has hosted thousands of celebrity interviews in their studio since launching the space in April 2010.\u003C/p\u003E\n\n\u003Cp\u003EIn addition to its flagship site, www.younghollywood.com, Young Hollywood distributes and licenses its content to several high-profile media partners including Yahoo, Google, Aol and Hulu.  Young Hollywood owns a library of over 2,000 hours of evergreen content updated daily, garnering over 2 billion views to date via its growing distribution network.  Young Hollywood works closely with many Fortune 500 brands in the advertising world by serving as a one-stop-shop marketing vehicle – offering innovative opportunities including customized content integrations, product seeding, experiential marketing, social media and viral campaigns.  Recent clients include Subway, Unilever, Electronic Arts, Intuit, Samsung, AT\u0026amp;T and Coca-Cola. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       116],
      "assets/images/resized/0008/8195/88195v2-max-150x150.jpg"],
     [[250,
       194],
      "assets/images/resized/0008/8195/88195v2-max-250x250.jpg"],
     [[450,
       350],
      "assets/images/resized/0008/8195/88195v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}