{"name": "YouPage Ltd",
 "permalink": "youpage-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/youpage-ltd",
 "homepage_url": "http://youpage.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "search",
 "number_of_employees": 1,
 "founded_year": 2008,
 "founded_month": 2,
 "founded_day": 28,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "semantic-web, iyp, local-search, search-engine, open-directory, online-yellow-pages, internet-yellow-pages, hyperlocal, microblog, microblogging, lifestream, micro-blog, micro-blogging, lifestreaming, microupdate, micro-updates, real-time-search, social-m",
 "alias_list": "",
 "email_address": "info@youpage.com",
 "phone_number": "",
 "description": "Search and Share Opinion Online",
 "created_at": "Thu May 15 09:29:39 UTC 2008",
 "updated_at": "Tue Aug 21 11:42:28 UTC 2012",
 "overview": "\u003Cp\u003EYouPage (http://www.youpage.com) is a Search service to help people Find, Engage and Express Opinion online. We aim to be the YouTube of online expression. To achieve this we have integrated three core services, Search, Blogging and Opinion.\u003C/p\u003E\n\n\u003Cp\u003EWhenever a Search is carried out the YouPage community is free to respond by selecting one of several options in order to feedback their opinion. A simple search for say \u0026#8220;weddings\u0026#8221; will return wedding related questions posted by the YouPage community such as \u0026#8220;Which of the following is most important to you on your engagement ring? A) Carat B) Cut D) Clarity D) Colour\u0026#8221; along with the YouPage community\u0026#8217;s collective opinion.  The benefits to YouPage users is that they can easily see general opinion for any topic they may be interested in or have submitted.  Anyone is free to post questions, statements, jokes or anything they wish to the YouPage community. From people looking for general views on current news, sports and political events to businesses looking to get valuable customer feedback, YouPage is quick and easy.\u003C/p\u003E\n\n\u003Cp\u003EYouPage also benefits businesses and event organizers by making their events, listings and products public and providing a personal channel of publication to consumers. YouPage brings the marketplace concept closer to business owners and creates the opportunity for them to enter into dialogue, through blogging with the YouPage community. This fosters a new way of lead generation, loyalty, and promotional channel for the business owner. Small businesses often avoid the big e-marketplaces because their message does not reach the parties they are interested in. YouPage addresses this by offering microblog and listing publishing services alongside related topic opinion to re-enforce personalization and build a true community spirit.\u003C/p\u003E\n\n\u003Cp\u003EGo to http://www.youpage.com/ActivityTimeline.aspx to see what the YouPage community is posting today?\u003C/p\u003E\n\n\u003Cp\u003EOne of the key aims for a businesses online is to attract customers. It is therefore important to know what people are searching for and where relevant optimise marketing efforts to answer their questions. Combining Search and blogging enables YouPage to offer a unique Search Timeline feature. With YouPage Search Timeline, we are one of the first search engines to allow people to see what others are searching for in real time, Offering a great opportunity to respond to people searching for products and services right away and by doing so kick-starting a sales process.\u003C/p\u003E\n\n\u003Cp\u003EGo to http://www.youpage.com/SearchTimeline.aspx to see what the YouPage community is looking for today?\u003C/p\u003E\n\n\u003Cp\u003EWhy not give YouPage a try today and let us know what you think.\u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.youpage.com\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       33],
      "assets/images/resized/0001/8646/18646v2-max-150x150.png"],
     [[229,
       51],
      "assets/images/resized/0001/8646/18646v2-max-250x250.png"],
     [[229,
       51],
      "assets/images/resized/0001/8646/18646v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Search|Share|Comment",
    "address1": "2 St Georges Mews",
    "address2": "Westminster Bridge Road",
    "zip_code": "SE1 7JB",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": 51.498319,
    "longitude": -0.107143}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}