{"name": "Yourownstore",
 "permalink": "yourownstore",
 "crunchbase_url": "http://www.crunchbase.com/company/yourownstore",
 "homepage_url": "http://www.yourownstore.co.uk/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "yourownstore",
 "category_code": "ecommerce",
 "number_of_employees": 16,
 "founded_year": 2001,
 "founded_month": 1,
 "founded_day": 3,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "home-business, affiliate-marketing, internet-building-services",
 "alias_list": null,
 "email_address": "yourownstore_uk@yahoo.com",
 "phone_number": "",
 "description": "Affiliate Internet Building Services",
 "created_at": "Tue Jun 05 10:33:54 UTC 2012",
 "updated_at": "Sat Jun 09 17:06:49 UTC 2012",
 "overview": "\u003Cp\u003EYourOwnStore was launched towards the end of 2010 by Bright Light Media Ltd.  It allows people throughout the world, the opportunity to invest in an online business and then earn a passive income through earnings generated through a proven business model.  The business owner then manages and operates his own online store.  \u003C/p\u003E\n\n\u003Cp\u003EThe company builds complete online stores which represent well-known UK companies.  These are then sold to individuals worldwide who then make a commission every time the product is viewed, clicked on and purchased. This is known as affiliate marketing and can be paid up to twice a month directly into the individual’s bank account. With complete and comprehensive training and all the necessary software, YourOwnStore teaches the new “store owners” to manage and operate their own Internet store. Every one of the online stores for sale is unique and is represented with a professionally designed website and catchy brand name. As there are over 5 million products to choose from, it is impossible to have the same store as someone else.  As the business is promoted and grows, the income can turn into a full time job or can be retained as extra income. As there is no limit to the number of stores an individual can buy from YourOwnStore, it is possible to buy multiple businesses.\u003C/p\u003E\n\n\u003Cp\u003EWhen purchasing an online store from YourOwnStore, the buyer receives everything that is needed to set up shop and begin earning commissions through the affiliate marketing scheme. The most important item begins with the domain name and the title of the site, which portrays what type of products or services are marketed on the site. It will also have a complete line of products that the purchaser can begin setting up for sale. By following the instructions, watching tutorials and consulting with the after-sale staff at YourOwnStore, the new store owner can set up the affiliate links and begin promoting the site. \u003C/p\u003E\n\n\u003Cp\u003EA complete software program is provided with the online purchase so that the YourOwnStore customer can optimise the titles, tags and text on the site so it appears at the top of search engine rankings and generates customer activity. If the client who buys the site does not want to do the optimising, the staff at YourOwnStore will provide that additional service. The client provides the key words that are important to the business and YourOwnStore will set a time limit as to how long it will take until the site is listed in the top ten businesses that appear in a Google search. If the site does not appear in the top ten within that time frame, YourOwnStore staff will continue to provide the SEO services without charge until the promised results are obtained.   Over time these websites increase in value, provided there is traffic, and can sometimes be sold for up-to four times the net profit that they generate annually.   People are willing to buy successful businesses that generate income with very little work and time.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       123],
      "assets/images/resized/0019/3975/193975v2-max-150x150.jpg"],
     [[180,
       148],
      "assets/images/resized/0019/3975/193975v2-max-250x250.jpg"],
     [[180,
       148],
      "assets/images/resized/0019/3975/193975v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [{"competitor":
     {"name": "Ybis",
      "permalink": "ybis",
      "image": null}}],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Dalton House",
    "address1": "60 Windsor Avenue",
    "address2": "",
    "zip_code": "SW19 2RR",
    "city": "London",
    "state_code": null,
    "country_code": "GBR",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  [{"external_url": "http://www.your-own-store.co.uk/",
    "title": "Yourownstore Lookup Page"},
   {"external_url": "http://www.your-own-store.com/",
    "title": "Yourownstore Wiki Page"},
   {"external_url": "http://yourownstore.magnt.com/",
    "title": "Yourownstore Magnt Page"}]}