{"name": "YourStory.in",
 "permalink": "yourstory-media-pvt-ltd",
 "crunchbase_url": "http://www.crunchbase.com/company/yourstory-media-pvt-ltd",
 "homepage_url": "http://yourstory.in/",
 "blog_url": "http://yourstory.in/",
 "blog_feed_url": "http://feeds.feedburner.com/yourstory/news",
 "twitter_username": "YourStorydotin",
 "category_code": "public_relations",
 "number_of_employees": 10,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "india, indian, indian-startups, indian-entrepreneurs, tech-startups, mobile-startups, cloud-startups, social-ventures",
 "alias_list": null,
 "email_address": "chandan@yourstory.in",
 "phone_number": "+91-9986198806",
 "description": "Indian Startups \u0026 Entrepreneurship News",
 "created_at": "Sat Jun 23 17:19:09 UTC 2012",
 "updated_at": "Tue Jun 26 16:42:15 UTC 2012",
 "overview": "\u003Cp\u003EIndia\u0026#8217;s Biggest Platform for Startups, Entreprenuers, Business Ideas, Product Reviews, Small Business, News and Resources.\u003C/p\u003E\n\n\u003Cp\u003EFounded in 2008, YourStory.in has grown into India’s biggest and comprehensive media platform for entrepreneurs and startups having a strong readership of over 300,000 unique visitors per month. YourStory.in in a short span of time has featured over 4000 entrepreneurs and startups across sector and continues to provide 360 degree online visibility through extensive profile coverage, news coverage, social media, blogs, forum, access to investors and business opportunities. YourStory.in’s audience includes entrepreneurs, startup enthusiasts, investors, developers, students, corporates, influencers, PR and advertising agencies, bloggers and journalists. Research reports published by YourStory.in are regularly picked up by leading print media houses.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EYourStory.in Flagship Offline Events\u003C/strong\u003E\n\u003Ca href=\"http://techsparks.in\" title=\"TechSparks\" rel=\"nofollow\"\u003ETechSparks\u003C/a\u003E – India’s biggest tech startup discovery and showcase event. Successfully carried out for two consecutive years in partnership with \u003Cem\u003ESequoia Capital, Microsoft, Canaan Partners, Intel, Google, Amazon, IBM, National Instruments and CNBC-TV18\u003C/em\u003E. Engaging with over 2,000 entrepreneurs and organized city-wise events in 5 major Indian metros.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003ESociopreneurship\u003C/em\u003E – India’s first social and green tech startup showcase event supported by \u003Cem\u003EHarvard Business Review, Unitus Capital and Madhura Microfinance\u003C/em\u003E.\u003C/p\u003E\n\n\u003Cp\u003E\u003Ca href=\"http://esparks.in\" title=\"E-Sparks\" rel=\"nofollow\"\u003EE-Sparks\u003C/a\u003E – India’s first E-commerce startup showcase event, supported by \u003Cem\u003EMicrosoft Azure, Sequoia Capital, One97, MartJack and Intuit - txtWeb\u003C/em\u003E. Worked with over 250 early stage e-commerce entrepreneurs in a span of 3 months.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003ECloud Conclave\u003C/em\u003E – India’s first platform showcasing innovative cloud startups, supported by \u003Cem\u003EAmazon Web Services\u003C/em\u003E and keynote delivered by \u003Cem\u003EDr. Werner Vogels, CTO, Amazon\u003C/em\u003E. Engaging over 120 cloud ventures in a span of 2 months.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003EStartup Pitch Session with Vinod Khosla\u003C/em\u003E – As part of NASSCOM Product Conclave 2011, YourStory.in hosted a closed door startup pitch session with \u003Cem\u003EVinod Khosla\u003C/em\u003E and few clean-tech entrepreneurs selected from across India.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003EApp On Cloud Conferences\u003C/em\u003E – Two city cloud conference showcasing the potential of cloud computing to early stage startups for scenarios that target end consumers using - Mobile, Social or Consumer Web Apps, in partnership with \u003Cem\u003EWindows Azure, Nexus Venture Partners and Mumbai Angels\u003C/em\u003E.\u003C/p\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EYourStory.in Flagship Online Campaigns\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cp\u003E\u003Cem\u003EMPEC\u003C/em\u003E - India’s first online entrepreneur popular poll contest supported by \u003Cem\u003ESun Microsystems\u003C/em\u003E.\u003C/p\u003E\n\n\u003Cp\u003E\u003Ca href=\"http://edustars.yourstory.in/\" title=\"EduStars\" rel=\"nofollow\"\u003EEduStars\u003C/a\u003E - India’s first online platform to support emerging education startups in India, supported by \u003Cem\u003EAccel Partners and Intel AppUp\u003C/em\u003E.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       53],
      "assets/images/resized/0019/6934/196934v2-max-150x150.jpg"],
     [[250,
       89],
      "assets/images/resized/0019/6934/196934v2-max-250x250.jpg"],
     [[278,
       99],
      "assets/images/resized/0019/6934/196934v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Headquarters",
    "address1": "229, 7th Cross, Indiranagar 1st Stage",
    "address2": "CMH Road",
    "zip_code": "560038",
    "city": "BANGALORE",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        87],
       "assets/images/resized/0019/6984/196984v2-max-150x150.png"],
      [[250,
        145],
       "assets/images/resized/0019/6984/196984v2-max-250x250.png"],
      [[450,
        262],
       "assets/images/resized/0019/6984/196984v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}