{"name": "Yumber",
 "permalink": "yumber",
 "crunchbase_url": "http://www.crunchbase.com/company/yumber",
 "homepage_url": "http://yumber.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "yumber",
 "category_code": "advertising",
 "number_of_employees": 5,
 "founded_year": 2012,
 "founded_month": 1,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "sharing, social-networking, business, linking, redirection",
 "alias_list": null,
 "email_address": "shane@yumber.com",
 "phone_number": "909.810.0307",
 "description": "Word of Mouth Marries Technology",
 "created_at": "Thu Jan 31 07:20:46 UTC 2013",
 "updated_at": "Sat Feb 02 22:32:16 UTC 2013",
 "overview": "\u003Cp\u003EImagine navigating the Internet the way you talk. Instead of long difficult to share URLs, what if you could navigate the web by simply inputting a word or phrase without the for https, .coms, or /\u0026#8217;s. What if you could verbally share URLs \u0026amp; more?\u003C/p\u003E\n\n\u003Cp\u003EYumber is empowering people to create their own VRLs (verbal resource locators) which serve as simple verbal pathways to information that is difficult to remember and share. Instead of having to share difficult information through email, social media, or print, with this new technology you can share complex information verbally with ease. These VRLs, or as they are called, Yumbers, allow you to share hard to remember information such as physical addresses, phone numbers, URLs, etc. by simply attaching the target ( to a word or phrase which can easily be spoken and remembered by someone else. \u003C/p\u003E\n\n\u003Cp\u003EWhether you are trying to share your new address with a long lost friend you met at the market, or a funny YouTube video with an audience of thousands, you can do so simply and verbally by telling them the Yumber. So what is a Yumber? A Yumber is a word or phrase that redirects the user to a specific target. A target can be a URL, phone number, physical address, email address, file, collection of files, photos, etc. virtually anything you want to share can be tied to a Yumber and then shared verbally face to face, over the radio, on the tv, or from a stage to thousands of people. \u003C/p\u003E\n\n\u003Cp\u003ETry it yourself, goto Yumber.com and enter the Yumber: \u003C/p\u003E\n\n\u003Cp\u003EOne man band \u003C/p\u003E\n\n\u003Cp\u003EYou will find yourself watching a YouTube video located at a complicated YouTube URL without requiring you to speak the computer language necessary to read that lengthy YouTube address: \u003C/p\u003E\n\n\u003Cp\u003Ehttp://www.youtube.com/watch?v=uXMuWi0dUBc \u003C/p\u003E\n\n\u003Cp\u003ESo what is a Yumber? It is natural, it is the marriage of word of mouth and technology, it is the way you learned to speak from birth, which technology, until now, has attempted to train out of you. With Yumber.com you can share anything with anyone anywhere using a simple word or phrase that you created for that purpose. \u003C/p\u003E\n\n\u003Cp\u003EWhy tell someone I will email you the link later, Or I will email you the file later, when you can simply tell them the associated Yumber to the target now and allow them to look it up at their convenience? The Internet was created by techies for techies. However, even these techies realized the need to evolve the Internet when the number of sites grew to the point at which it become difficult to remember all of the IP addresses of the new sites. \u003C/p\u003E\n\n\u003Cp\u003EIn its infancy the Internet was navigates by using IP addresses such as 192.168.0.1. To simplify navigation the a second layer was created, which is the domain name based system we still use today. This domain name system, complete with https, .coms, and /\u0026#8217;s alike, is still on the level with the old and unintuitive MS DOS command prompt. \u003C/p\u003E\n\n\u003Cp\u003EJust as Apple evolved the computer with its intuitive and human friendly operating system, Yumber is seeking to evolve the sharing of technology by adding another layer of simplicity that is more intuitive than the last. Instead of humans having to conform with the confines of computer language as defined by technology, Yumber adds a layer of humanity to technology allowing people to share themselves and their interests verbally in face to face settings. \u003C/p\u003E\n\n\u003Cp\u003EWhether one on one, or while presenting to large audiences, Yumber helps you to put the power back in word of mouth communication.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": false,
    "title": "CEO",
    "person":
     {"first_name": "Shane",
      "last_name": "Lathrom",
      "permalink": "shane-lathrom",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$160k",
 "funding_rounds":
  [{"round_code": "seed",
    "source_url": "",
    "source_description": "",
    "raised_amount": 160000.0,
    "raised_currency_code": "USD",
    "funded_year": 2012,
    "funded_month": 4,
    "funded_day": 1,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "San Diego",
    "address1": "",
    "address2": "",
    "zip_code": "",
    "city": "San Diego",
    "state_code": "CA",
    "country_code": "USA",
    "latitude": 32.7153292,
    "longitude": -117.1572551}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[135,
        150],
       "assets/images/resized/0023/2731/232731v2-max-150x150.png"],
      [[225,
        250],
       "assets/images/resized/0023/2731/232731v2-max-250x250.png"],
      [[405,
        450],
       "assets/images/resized/0023/2731/232731v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[135,
        150],
       "assets/images/resized/0023/2732/232732v2-max-150x150.png"],
      [[225,
        250],
       "assets/images/resized/0023/2732/232732v2-max-250x250.png"],
      [[405,
        450],
       "assets/images/resized/0023/2732/232732v2-max-450x450.png"]],
    "attribution": null},
   {"available_sizes":
     [[[135,
        150],
       "assets/images/resized/0023/2733/232733v2-max-150x150.png"],
      [[225,
        250],
       "assets/images/resized/0023/2733/232733v2-max-250x250.png"],
      [[405,
        450],
       "assets/images/resized/0023/2733/232733v2-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  [{"external_url": "https://yumber.com/investment-summary",
    "title": "Investment Summary"}]}