{"name": "Zalora Thailand",
 "permalink": "zalora-thailand",
 "crunchbase_url": "http://www.crunchbase.com/company/zalora-thailand",
 "homepage_url": "http://www.zalora.co.th",
 "blog_url": "http://zalorahub.wordpress.com/",
 "blog_feed_url": "",
 "twitter_username": "Zalorathailand",
 "category_code": "ecommerce",
 "number_of_employees": 150,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "online, shopping-online, fashion, trend, home-decor, sport",
 "alias_list": null,
 "email_address": "customer@zalora.co.th",
 "phone_number": "+66(0)2-204-7522",
 "description": "No.1 Online Fashion Store in Thailand",
 "created_at": "Tue Oct 02 08:48:30 UTC 2012",
 "updated_at": "Wed Dec 12 06:57:31 UTC 2012",
 "overview": "\u003Cp\u003Ewww.zalora.co.th is the No.1 Online Fashion Store in Thailand. We have more than 400 brands and over 40,000 items on our website from local and international designers. Visit www.zalora.co.th to make sure you stay up to date with what\u0026#8217;s hot this season for apparels, accessories, shoes, beauty, sportswear available for Men, Women and Kids. Zalora is also available in 7 other countries in Asia like Malaysia, Singapore, Indonesia, Hong Kong, Taiwan, Vietnam and Philippines. \u003C/p\u003E\n\n\u003Cp\u003EShop safely from your home\nwww.zalora.co.th lets you shop conveniently from the comfort of your home. Just browse for your favourite item, add it to the basket, and complete the payment. You can easily pay by using your credit card, Paypal, bank transfer or enjoy our most popular, risk-free payment option; cash-on-delivery service. Our delivery is free of charge nation-wide, so put your feet up and wait for your package to arrive at your door.\u003C/p\u003E\n\n\u003Cp\u003ENot happy?\nIf for any reason at all, you are unhappy with the products you ordered, you can return them within 30 days for free. With one exception that the product needs to be in the same condition and undamaged.\u003C/p\u003E\n\n\u003Cp\u003EWant to get in touch with us?\nYou can log into our website and start an online chat with our fashion experts or call us at +662 204 7522 daily from 9am to 11pm. \u003C/p\u003E\n\n\u003Cp\u003EFollow us\nStay tuned to our activities and fashion updates on our Facebook page at www.facebook.com/ZaloraThailand or our Twitter at www.twitter.com/ZaloraThailand or our Instagram at ZaloraThailand.\u003C/p\u003E\n\n\u003Cp\u003Ewww.zalora.co.th เป็นศูนย์รวมแฟชั่นอย่างครบครันที่นำแบรนด์เสื้อผ้าแฟชั่นทั้งแบรนด์ไทย และต่างประเทศกว่า 400 แบรนด์ ให้ลูกค้าได้เลือกสรรกันอย่างจุใจ Zalora มีสาขาอยู่ในอีก 8 ประเทศทั่วทวีปเอเชียตะวันออกเฉียงใต้ และเป็นผู้นำทางด้านแฟชั่นออนไลน์ ด้วยสิ้นค้ามากกว่า 40,000 รายการบนเว็บไซต์ให้สาวๆ และหนุ่มๆ ได้เลือกช็อปกันอย่างไม่อั้น อาทิเช่น รองเท้า เครื่องประดับ เสื้อผ้าแฟชั่นที่อัพเดทความอินเทรนด์อยู่เสมอ พร้อมกูรูแฟชั่นที่นำเสนอคำแนะนำ และเคล็ดลับเทรนด์ใหม่ๆ อยู่เสมอ \u003C/p\u003E\n\n\u003Cp\u003Eช็อปปิ้งง่ายๆ อย่างปลอดภัย\nwww.zalora.co.th สามารถให้คุณช็อปอย่างง่ายๆ ด้วยดีไซน์เว็บไซต์ที่ออกแบบมาเพื่อความสะดวกสบายของลูกค้า เพียงเลือกสิ้นค้าที่ต้องการลงในตระกร้า และชำระเงินได้ทันทีผ่านหลายช่องทางตามแต่ความสะดวกของลูกค้า ไม่ว่าจะเป็นการชำระเงินเมื่อได้รับสิ้นค้า ชำระผ่านบัตรเครดิต ผ่าน PayPal หรือชำระด้วยการโอนเงินแค่ได้รับอีเมลยืนยันจาก www.zalora.co.th หลังจากการสั่งซื้อ ก็รอรับสิ้นค้าได้เลยภายใน 5 วันทำการ และไม่ต้องกังวลกับค่าส่ง เพราะ Zalora มีบริการจัดส่งสิ้นค้าทั่วประเทศฟรีอีกด้วย\u003C/p\u003E\n\n\u003Cp\u003Eการบริการที่ครอบคลุม\nหากท่านไม่พอใจในสิ้นค้า สามารถคืนสิ้นค้าได้ฟรีภายใน 30 วัน*รวมทั้งลูกค้ายังสามารถสนทาออนไลน์ผ่านการแชทบนหน้าเว็บไซต์กับฝ่ายบริการลูกค้าตั้งแต่ 9:00น. – 23:00น. หรือติดต่อได้ที่เบอร์โทรศัพท์ 02 643 5354 \u003C/p\u003E\n\n\u003Cp\u003Eกิจกรรมและโปรโมชั่นต่างๆ\nติดตามกิจกรรม และโปรโมชั่นบนsocial media ต่างๆ ได้ที่\nFacebook: www.facebook.com/ZaloraThailand\nTwitter: www.twitter.com/ZaloraThailand\nInstagram: ZaloraThailand\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "Zalora Thailand",
    "address1": "361/3 Sri Ayutthaya Rd.",
    "address2": "Phayathai Ratchathewi",
    "zip_code": "10400",
    "city": "Bangkok",
    "state_code": null,
    "country_code": "THA",
    "latitude": 13.7739818,
    "longitude": 100.546488}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}