{"name": "Zane Benefits Inc",
 "permalink": "zane-benefits-inc",
 "crunchbase_url": "http://www.crunchbase.com/company/zane-benefits-inc",
 "homepage_url": "http://www.zanebenefits.com",
 "blog_url": "http://www.zanebenefits.com/blog",
 "blog_feed_url": "http://feeds.feedburner.com/ClarifyingHealth",
 "twitter_username": "zanebenefits",
 "category_code": "software",
 "number_of_employees": null,
 "founded_year": 2006,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "insurance, health-benefits, technology, health-care, healthcare, employee-health-benefits, health-insurance, employer-health-benefits, medical-plans",
 "alias_list": null,
 "email_address": "info@zanebenefits.com",
 "phone_number": "800-391-9209",
 "description": "Healthcare Software Insurance Benefits ",
 "created_at": "Fri Dec 30 18:25:37 UTC 2011",
 "updated_at": "Fri Dec 30 23:38:45 UTC 2011",
 "overview": "\u003Cp\u003ESoftware is #1 at Zane Benefits. The company’s primary product – “ZaneHRA” – is a robust web-based administrative tool for managing health insurance premium and medical expense reimbursement. Zane Benefits is based in downtown Park City, Utah, one of the world’s most desirable locations year-round.\u003C/p\u003E\n\n\u003Cp\u003EZane Benefits is a national leader helping solve one of our nation’s major problems—getting employees better health benefits at lower cost. Zane Benefits accomplishes this by providing employers an online SAAS platform that allows employees to make all their own spending decisions. The company is particularly poised to benefit from Health Care Reform and was recently featured on the front page of The Wall Street Journal. \u003C/p\u003E\n\n\u003Cp\u003EZane Benefits does not sell health insurance. Its products and services are distributed in all 50 states by independent licensed agents and other distributors of health insurance who receive direct online and telephone access to help employees choose the best insurance policy.\u003C/p\u003E\n\n\u003Cp\u003EEconomist Paul Zane Pilzer is the founder of Zane Benefits, a former Vice President of Citibank and the founder of five companies. He is a former commentator on CNN and NPR and was an Adjunct Professor at New York University from 1979-2000. He holds a BA from Lehigh University and an MBA from The Wharton School, University of Pennsylvania.\u003C/p\u003E",
 "image": null,
 "products":
  [],
 "relationships":
  [{"is_past": true,
    "title": " CEO and President ",
    "person":
     {"first_name": "Scott",
      "last_name": "Halstead",
      "permalink": "scott-halstead",
      "image": null}}],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}