{"name": "Zee Learn",
 "permalink": "zee-learn",
 "crunchbase_url": "http://www.crunchbase.com/company/zee-learn",
 "homepage_url": "http://zeelearn.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "education",
 "number_of_employees": null,
 "founded_year": null,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "",
 "alias_list": "",
 "email_address": "",
 "phone_number": "022 – 6697 1234",
 "description": "",
 "created_at": "Wed May 22 05:58:36 UTC 2013",
 "updated_at": "Wed May 22 05:58:35 UTC 2013",
 "overview": "\u003Cp\u003EZee Learn is one of the leading companies in Education in India with the fastest growing chain of K-12 schools and India’s No 1 chain of pre-schools in its portfolio.\u003C/p\u003E\n\n\u003Cp\u003EZee Learn acts as a consultant to local entrepreneurs who wish to setup K-12 schools, under its brand name Mount Litera Zee Schools and provides end to end Education management and Advisory services.  Mount Litera Zee Schools is now the second largest chain of schools in the private-unaided category with 65 schools in 48 cities. Launched in December 2008, 60 schools signed up in one year make Mount Litera Zee School the fastest growing school chain in India.\u003C/p\u003E\n\n\u003Cp\u003EZee Learn also runs India\u0026#8217;s No. 1 chain of pre-schools, Kidzee with more than 900+ pre-schools in more than 330+ cities. Kidzee is a pioneer in organized and standardized pre-schooling in the country. Kidzee has touched the lives of more than 200,000 children since its inception in 2003. During the current FY 2010-11 Kidzee has seen enrolment of more than 36,000 students.\u003C/p\u003E\n\n\u003Cp\u003EEnabled by its extensive experience in understanding of education and learning, Zee Learn is extending its services to other schools. Zee Learn School Innovations works with existing schools to improve their student outcomes and efficiency through a School Audit that identifies improvement areas.\u003C/p\u003E\n\n\u003Cp\u003EZee Learn has also tied up with Gakken Education Co. with an aim to bring the best of Japanese education in the field of science to schools in India. The Brain Café intends to improve conceptual understanding and develop scientific temper amongst students by providing hands on experiment tools.\u003C/p\u003E\n\n\u003Cp\u003EIn the wake of the recent increase in disposable incomes in the country and rising awareness of global standards of education amongst parents, there is a demand for international standard pre-schools. To meet this requirement, Zee Learn plans to launch a chain of Premium preschools called Mount Litera World Preschools. These pre-schools would be company owned or joint ventures with progressive individuals or entities.  \u003C/p\u003E\n\n\u003Cp\u003EYouth today is looking for vocational education outside the ambit or traditional higher education.  Zee Institute of Media Arts (ZIMA) is a TV and Film training institute in Mumbai that offers diploma courses in Direction, Acting, Sound, Editing, Production and Cinematography. Zee Institute of Creative Art (ZICA) is the nation\u0026#8217;s first full-fledged Classical and Digital Animation Training Academy that trains youth in classical 2D and modern 3D animation in 15 cities across the country. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[60,
       89],
      "assets/images/resized/0026/5300/265300v1-max-150x150.png"],
     [[60,
       89],
      "assets/images/resized/0026/5300/265300v1-max-250x250.png"],
     [[60,
       89],
      "assets/images/resized/0026/5300/265300v1-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$20M",
 "funding_rounds":
  [{"round_code": "unattributed",
    "source_url": "http://www.vccircle.com/news/education/2013/05/21/zee-learn-raises-20m-through-gdr",
    "source_description": "Zee Learn raises $20M through GDR",
    "raised_amount": 20000000.0,
    "raised_currency_code": "USD",
    "funded_year": 2013,
    "funded_month": 5,
    "funded_day": 21,
    "investments":
     []}],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [{"description": "",
    "address1": "Continental Building, 135 Dr. Annie Besant Road",
    "address2": "Worli",
    "zip_code": "400018  ",
    "city": "Mumbai",
    "state_code": null,
    "country_code": "IND",
    "latitude": null,
    "longitude": null}],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [{"available_sizes":
     [[[150,
        90],
       "assets/images/resized/0026/5299/265299v1-max-150x150.png"],
      [[250,
        150],
       "assets/images/resized/0026/5299/265299v1-max-250x250.png"],
      [[450,
        271],
       "assets/images/resized/0026/5299/265299v1-max-450x450.png"]],
    "attribution": null}],
 "external_links":
  []}