{"name": "Zignage",
 "permalink": "zignage",
 "crunchbase_url": "http://www.crunchbase.com/company/zignage",
 "homepage_url": "http://www.zignage.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "software",
 "number_of_employees": 18,
 "founded_year": 2009,
 "founded_month": 1,
 "founded_day": 6,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "digital-signage-saas",
 "alias_list": null,
 "email_address": "info@zignage.com",
 "phone_number": "718.422.7907",
 "description": "Digital Signage Management",
 "created_at": "Wed Dec 28 14:42:55 UTC 2011",
 "updated_at": "Thu Dec 29 06:31:23 UTC 2011",
 "overview": "\u003Cp\u003EDigital Signage represents the next generation of advertising and communication. The rapid growth of the Digital-Out-Of-Home (DOOH) market has been spurred by plunging industrial LCD screen prices, wide area network reliability, and the vast potential of this new marketing medium. For the first time, marketers can reach customers at the point of purchase, create dynamic and captivating ads, tailor ads to individual characteristics, and receive immediate feedback.\u003C/p\u003E\n\n\u003Cp\u003EZignage focuses on developing customized digital signage software and an unparalleled total cost of ownership for businesses in distinct market segments. We develop rich interactive experiences that capture the attention of customers during their daily activities. Zignage accomplishes this by building partnership with our clients while providing innovative solutions powered by state-of-the-art and cost effective technology.\u003C/p\u003E\n\n\u003Cp\u003EWe build superior real-world customer experiences that allow our partners to effectively display, distribute, control and measure digital media on networked digital displays from anywhere in the world. Whether it is a complete turnkey solution, an interactive marketing experience, or custom data integration—we work with our partners to provide innovative and mission critical digital signage solutions.\u003C/p\u003E\n\n\u003Cp\u003ETechnology Advantage\u003C/p\u003E\n\n\u003Cp\u003EZignage solutions are built on a very robust and secure Linux foundation, allowing our software to leverage mission-critical control and remote real-time monitoring over digital signage networks. This allows our clients, partners and networks to benefit from cost-effective software designed to leverage less expensive hardware, creating an unparalleled cost advantage.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       37],
      "assets/images/resized/0016/7903/167903v2-max-150x150.png"],
     [[175,
       44],
      "assets/images/resized/0016/7903/167903v2-max-250x250.png"],
     [[175,
       44],
      "assets/images/resized/0016/7903/167903v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}