{"name": "Zion Technologies",
 "permalink": "zion-technologies",
 "crunchbase_url": "http://www.crunchbase.com/company/zion-technologies",
 "homepage_url": "http://www.ziontechnologies.co.in",
 "blog_url": "http://ziontechapple.wordpress.com/",
 "blog_feed_url": "http://ziontechnologies.tradeindia.com/",
 "twitter_username": "ziontechnologis",
 "category_code": "hardware",
 "number_of_employees": 25,
 "founded_year": 1997,
 "founded_month": 10,
 "founded_day": 2,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "apple-iphone-repair-ipad-repair-delhi, iphone-repair-delhi, htc-repair-delhi, blackberry-repair-delhi, macbook-repair-dlhi, apple-laptop-repair-delhi, ipad-2-reair, iphone-service-centre-delhi",
 "alias_list": null,
 "email_address": "ziontechnologies.co.in@gmail.com",
 "phone_number": "9971115336",
 "description": "Repair Service Centre",
 "created_at": "Sat Aug 18 10:19:54 UTC 2012",
 "updated_at": "Mon Aug 20 13:49:42 UTC 2012",
 "overview": "\u003Cp\u003EWelcome!\nZION TECHNOLOGIES \u0026#8211; A PREMIUM SERVICE PROVIDER COMPANY OFFERING SALES AND SERVICE OF HIGH END PDAs SUCH AS IPHONE, BLACKBERRY, IPOD AND HTC. A ONE STOP SHOP WHERE TECHNOLOGY MEETS AFFORDABILITY FOR CUSTOMERS. GENUINE SPARES ARE USED FOR ALL REPAIRS.\u003C/p\u003E\n\n\u003Cp\u003EZION TECHNOLOGIES HAS MADE IT INCREDIBLY EASY FOR YOU TO GET QUALITY  IPHONE, BLACKBERRY, IPOD AND HTC REPAIRS WITHIN  THE SHORTEST TURNAROUND TIMESPAN. QUALIFIED TECHNICIANS PROVIDING ACCURATE DIAGNOSTICS AND CONSECUTIVELY PERFORMING DEPENDABLE REPAIRS .\u003C/p\u003E\n\n\u003Cp\u003EWE MAINTAIN THE LARGEST INVENTORY OF GENUINE SPARE PARTS FOR ALL  THE ABOVE HIGH END PDAs. EASY REPAIR AND DIAGNOSTICS ON YOUR FAVORITE PRODUCTS\u003C/p\u003E\n\n\u003Cp\u003EWALK IN AND GET YOUR IPODS,IPHONES SERVICED IN FRONT OF YOU OR YOU COULD ALSO MAIL IN YOUR  FAVORITE GADGETS AND WE GIVE AN INSTANT DIAGNOSTIC REPORT WHICH DOES NOT COST YOU A SINGLE PENNY !!!!!!!!!AND THEN THE CHOICE IS YOURS OF COURSE WE KNOW YOU WILL CHOOSE ZION !!CHOOSE DEPENDABILITY!!\u003C/p\u003E\n\n\u003Cp\u003EAbout Us\u003C/p\u003E\n\n\u003Cp\u003ERiding on the back of technology and innovation, many gadgets have entered our lives. These blend perfectly with our fast paced and contemporary lifestyle. Any sort of problem with the functions and features of our gadgets is a source of great inconvenience to us. Engaged in offering excellent solutions for any type of such problems, Zion Technologies, is a leading Service Provider in its domain. Established in the year 1997, the company possess rich expertise in sorting out any sort of problem related to iPod, iPhones, Electronic Notebooks and many such gadgets.\u003C/p\u003E\n\n\u003Cp\u003EUnder the inspiring direction of Mr. Julian John, we have successfully established ourselves as a prominent player in the market. We provide other services also like VOIP Solutions, Audio \u0026amp; Video Conferencing Solutions and many more. We offer repair service for the entire line of iPhone, iPod, Mac Mini, Portable Mac and Apple TV systems. This comprises the entire PowerBook G4 family, the iBook family and the MacBook and MacBook Pro systems. We have recently added support for Apple TVs and Mac Mini\u0026#8217;s, that is as per the demands and requirements of our customers.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       61],
      "assets/images/resized/0020/6735/206735v2-max-150x150.png"],
     [[250,
       103],
      "assets/images/resized/0020/6735/206735v2-max-250x250.png"],
     [[250,
       103],
      "assets/images/resized/0020/6735/206735v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}