{"name": "ZippyTune",
 "permalink": "zippytune",
 "crunchbase_url": "http://www.crunchbase.com/company/zippytune",
 "homepage_url": "https://www.zippytune.com",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "zippytune",
 "category_code": "games_video",
 "number_of_employees": 3,
 "founded_year": 2012,
 "founded_month": 3,
 "founded_day": 13,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "music, share, audio, mixtape, sell-audio",
 "alias_list": null,
 "email_address": "contact@zippytune.com",
 "phone_number": "",
 "description": "audio sharing platform",
 "created_at": "Sun Aug 12 11:43:03 UTC 2012",
 "updated_at": "Tue Jan 22 05:14:03 UTC 2013",
 "overview": "\u003Cp\u003EZippyTune is the fastest growing music network website in the world.\u003C/p\u003E\n\n\u003Cp\u003EZippyTune is a service that provides users with a secure and safe way to share their music over the internet. ZippyTune has provided users with the fastest downloading, uploading and sharing speeds since the opening of the website. If you want to earn money, share and promote your music, ZippyTune is the answer. \u003C/p\u003E\n\n\u003Cp\u003EZippyTune was founded in March 2012 by an Australian website enthusiast that started ZippyTune to originally allow his friends to share their personal music remixes to one another through a public website forum. The demands for an extension of the service from its users then lead to ZippyTune being opened up to the rest of the world. The first version of ZippyTune was released on the 22nd of March 2012. \u003C/p\u003E\n\n\u003Cp\u003EWe pride ourselves on being one of the only music network websites in the world that offers unlimited space, unlimited bandwidth, no waiting times, minimal advertising distractions, all for free! With the website being constantly updated and with the amount of traffic consistently increasing, ZippyTune is the fastest emerging music network website. \u003C/p\u003E\n\n\u003Cp\u003EOur business head office is based in Brisbane, Australia but we have many employees working around the world including people from the USA, Asia and Europe. We are a group of highly dedicated website designers and engineers and we hope that we can provide you with the best user experience of any other website on the Internet. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[40,
       24],
      "assets/images/resized/0020/5662/205662v2-max-150x150.png"],
     [[40,
       24],
      "assets/images/resized/0020/5662/205662v2-max-250x250.png"],
     [[40,
       24],
      "assets/images/resized/0020/5662/205662v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}