{"name": "Zoey Creation",
 "permalink": "zoey-creation",
 "crunchbase_url": "http://www.crunchbase.com/company/zoey-creation",
 "homepage_url": "http://www.indiamart.com/zoeycreations/",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "",
 "category_code": "enterprise",
 "number_of_employees": 24,
 "founded_year": 2008,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "airlines, schools, colleges-and-allied-industrial-uniforms",
 "alias_list": null,
 "email_address": "zoeycreations@tradepassport.org",
 "phone_number": "9167395213",
 "description": "supplier of Airlines, Schools, Colleges",
 "created_at": "Thu Apr 04 06:48:32 UTC 2013",
 "updated_at": "Thu Apr 04 06:48:34 UTC 2013",
 "overview": "\u003Cp\u003EIntroduction:\nEstablished in the year 2008, we, “Zoey Creation Pvt. Ltd.”, are one of the reputed names of the industry that are engaged in manufacturing and supplying a comprehensive array of high quality Airlines, Schools, Colleges and Allied Industrial Uniforms and Garments.\u003C/p\u003E\n\n\u003Cp\u003EOur Team;\nWe treasure a team of highly diligent \u0026amp; skilled professionals, which plays an important role behind our success journey. These professionals support us to design \u0026amp; manufacture excellent quality Airlines, Schools, Colleges and Allied Industrial Uniforms. Further, our experts possess impeccable knowledge of this domain and they are master of their fields. Our professionals also understand the fashion sense and design offered uniforms accordingly.\u003C/p\u003E\n\n\u003Cp\u003EInfrastructure:\nWe are bestowed by a sophisticated infrastructure facility, which forms a strong base for us to carry out all business operations smoothly. Aiding us in designing \u0026amp; manufacturing a wide array of Airlines, Schools, Colleges and Allied Industrial Uniforms, our facility is well-equipped with the ultra-modern machines, tools and latest technology. Further, for the smooth execution of all business activities, we have divided our facility into various sections.\u003C/p\u003E\n\n\u003Cp\u003EQuality Assurance:\nOur organization is highly accredited in the domestic market for manufacturing \u0026amp; supplying an alluring array of excellent quality industrial uniforms. We make use of high grade fabrics, yarns and imported threads for manufacturing high grade Airlines, Schools, Colleges and Allied Industrial Uniforms. Further, our highly skilled designers manufacture the offered range of industrial uniforms as per the current market styles \u0026amp; trends.\u003C/p\u003E\n\n\u003Cp\u003EClient Satisfaction:\nSince the inception of our firm, we are working with the prime goal of acquiring maximum level of customers satisfaction. For the same, we are offering our customers high quality Airlines, Schools, Colleges and Allied Industrial Uniforms.\u003C/p\u003E\n\n\u003Cp\u003EWhy Us?\nWith years of experience in this industry, we know what our clients are looking for. There are a lot of factors that gives us a competitive edge over the other companies.\u003C/p\u003E\n\n\u003Cp\u003EWe have been able to please them with the following leading factors:\u003C/p\u003E\n\n\u003Cp\u003ELatest fashioned garments\nCost effective\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[125,
       125],
      "assets/images/resized/0024/7597/247597v2-max-150x150.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7597/247597v2-max-250x250.jpg"],
     [[125,
       125],
      "assets/images/resized/0024/7597/247597v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}