{"name": "zoozz",
 "permalink": "zoozz",
 "crunchbase_url": "http://www.crunchbase.com/company/zoozz",
 "homepage_url": "http://www.zoozz.com.au",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "zoozzworkforce",
 "category_code": "mobile",
 "number_of_employees": 2,
 "founded_year": 2011,
 "founded_month": 9,
 "founded_day": 1,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "crowdsource, crowd-worker, crowd-force, crowd-help, cloud-worker, cloud-crew, outsource-work, outsource-tasks, flexible-workforce, on-demand-scalable-workforce-solutions, iphone-jobs, small-job, spot-job, quick-work, paid-task, paid-errand, earn-money, ea",
 "alias_list": null,
 "email_address": "info@zoozz.com.au",
 "phone_number": "+61390057033",
 "description": "get paid for doing quick tasks",
 "created_at": "Wed Mar 28 06:54:55 UTC 2012",
 "updated_at": "Fri Mar 30 15:36:13 UTC 2012",
 "overview": "\u003Cp\u003EWith zoozz it is easy to earn extra cash by completing quick tasks right on your phone!\u003C/p\u003E\n\n\u003Cp\u003EJoin the ever-evolving global workforce and start earning money straight away. Simply by using your iPhone you can now employ yourself to perform tasks and earn in accordance. That’s right! You will be part of our revolutionary workforce with constantly expanding opportunities, so you have greater variety of tasks to choose from every day.\u003C/p\u003E\n\n\u003Cp\u003EThe quick tasks can be as simple as taking a photo, answering questions or acting as a mystery shopper and GET PAID for it upon successful completion.\u003C/p\u003E\n\n\u003Cp\u003Ezoozz is perfect for anyone with an iPhone. It has never been easier to get extra paycheck by completing simple actions straight on your phone. You don’t even need to go far, new tasks are constantly added and there may be few to choose from right where you are! Why not convert your phone into money making tool, plus you possess the control and freedom to work on what you like.\u003C/p\u003E\n\n\u003Cp\u003EHere’s how it works:\u003C/p\u003E\n\n\u003Col\u003E\n\u003Cli\u003ESimply download the app and sign up. It\u0026#8217;s FREE!\u003C/li\u003E\n\u003Cli\u003EExplore the tasks around you and find the one you wish to do.\u003C/li\u003E\n\u003Cli\u003EComplete and submit the task.\u003C/li\u003E\n\u003Cli\u003EUpon successful completion of the task you get paid.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003EWhy wait? Download one of the only applications for your iPhone that allows you to earn real money. You can now make hundreds of dollars while you are in the proximity of your neighbourhood, at work or even on holiday.\u003C/p\u003E\n\n\u003Cp\u003ENo cubicles or managers bothering you. Don\u0026#8217;t worry about commuting to work, zoozz brings work to you, regardless of where you are.\u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       89],
      "assets/images/resized/0018/1475/181475v2-max-150x150.jpg"],
     [[250,
       149],
      "assets/images/resized/0018/1475/181475v2-max-250x250.jpg"],
     [[352,
       210],
      "assets/images/resized/0018/1475/181475v2-max-450x450.jpg"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}