{"name": "ZyXEL",
 "permalink": "zyxel",
 "crunchbase_url": "http://www.crunchbase.com/company/zyxel",
 "homepage_url": "http://www.zyxel.in",
 "blog_url": "",
 "blog_feed_url": "",
 "twitter_username": "zyxelindia",
 "category_code": "mobile",
 "number_of_employees": 3200,
 "founded_year": 1989,
 "founded_month": null,
 "founded_day": null,
 "deadpooled_year": null,
 "deadpooled_month": null,
 "deadpooled_day": null,
 "deadpooled_url": null,
 "tag_list": "zyxel",
 "alias_list": null,
 "email_address": "webmaster@zyxel.in",
 "phone_number": "+91-11-47608800",
 "description": "Broadband Solutions Manufacturer ",
 "created_at": "Wed Sep 16 08:10:20 UTC 2009",
 "updated_at": "Mon Mar 18 21:54:18 UTC 2013",
 "overview": "\u003Cp\u003EZyXEL Technology India Pvt. Ltd. was established in India in 2006. Growing fast, we have gained loyal support amongst our reseller partners, service providers and end users in India .Our aim is to become a leading force in India within two years.We have established a number specialist distributors in India to supply our range of solutions to Value Added Resellers (VARs), computer equipment dealers and Service Providers. ZyXEL India closely works with leading Telecom and Service providers offering unparalleled support and cutting edge technologies. Our growing presence in India through our direct offices and representations in leading cities such as New Delhi, Mumbai, Bangalore, Chennai and Hyderabad further boosts the confidence of our customers. We have been building constructive partnerships with VARs, Systems Integrators and computer dealers, via our ZyDisti, and ZyXEL Certified ZyPartner programs for VARs and Resellers. This scheme delivers real benefits to resellers, asking for few commitments in return. Our customer service is second to none - for example all of our technical and product support is done internally with ZyXEL trained and employed engineers. We have the capability to deliver customisable, tailor-made solutions for service providers and resellers. ZyXEL India is going from strength to strength through partnership, through technical innovation and though our partners. \u003C/p\u003E",
 "image":
  {"available_sizes":
    [[[150,
       62],
      "assets/images/resized/0024/3365/243365v2-max-150x150.png"],
     [[168,
       70],
      "assets/images/resized/0024/3365/243365v2-max-250x250.png"],
     [[168,
       70],
      "assets/images/resized/0024/3365/243365v2-max-450x450.png"]],
   "attribution": null},
 "products":
  [],
 "relationships":
  [],
 "competitions":
  [],
 "providerships":
  [],
 "total_money_raised": "$0",
 "funding_rounds":
  [],
 "investments":
  [],
 "acquisition": null,
 "acquisitions":
  [],
 "offices":
  [],
 "milestones":
  [],
 "ipo": null,
 "video_embeds":
  [],
 "screenshots":
  [],
 "external_links":
  []}